{
  "CVE-2024-42007": {
    "url": "https://github.com/noisebynorthwest/php-spx/issues/251",
    "cvss": 5.8,
    "description": "SPX (aka php-spx) through 0.4.15 allows SPX_UI_URI Directory Traversal to read arbitrary files.",
    "published": "2024-07-26T19:15:10.917"
  },
  "CVE-2024-41112": {
    "cvss": 9.8,
    "description": "streamlit-geospatial is a streamlit multipage app for geospatial applications. Prior to commit c4f81d9616d40c60584e36abb15300853a66e489, the palette variable in `pages/1_?_Timelapse.py` takes user input, which is later used in the `eval()` function on line 380, leading to remote code execution. Commit c4f81d9616d40c60584e36abb15300853a66e489 fixes this issue.",
    "published": "2024-07-26T20:15:05.237",
    "keywords": "remote,execution"
  },
  "CVE-2024-41113": {
    "cvss": 9.8,
    "description": "streamlit-geospatial is a streamlit multipage app for geospatial applications. Prior to commit c4f81d9616d40c60584e36abb15300853a66e489, the `vis_params` variable on line 383 or line 390 in `pages/1_?_Timelapse.py` takes user input, which is later used in the `eval()` function on line 395, leading to remote code execution. Commit c4f81d9616d40c60584e36abb15300853a66e489 fixes this issue.",
    "published": "2024-07-26T20:15:05.560",
    "keywords": "remote,execution"
  },
  "CVE-2024-41114": {
    "cvss": 9.8,
    "description": "streamlit-geospatial is a streamlit multipage app for geospatial applications. Prior to commit c4f81d9616d40c60584e36abb15300853a66e489, the `palette` variable on line 430 in `pages/1_?_Timelapse.py` takes user input, which is later used in the `eval()` function on line 435, leading to remote code execution. Commit c4f81d9616d40c60584e36abb15300853a66e489 fixes this issue.",
    "published": "2024-07-26T21:15:12.813",
    "keywords": "remote,execution"
  },
  "CVE-2024-41115": {
    "cvss": 9.8,
    "description": "streamlit-geospatial is a streamlit multipage app for geospatial applications. Prior to commit c4f81d9616d40c60584e36abb15300853a66e489, the `palette` variable on line 488 in `pages/1_?_Timelapse.py` takes user input, which is later used in the `eval()` function on line 493, leading to remote code execution. Commit c4f81d9616d40c60584e36abb15300853a66e489 fixes this issue.",
    "published": "2024-07-26T21:15:13.023",
    "keywords": "remote,execution"
  },
  "CVE-2024-41116": {
    "cvss": 9.8,
    "description": "streamlit-geospatial is a streamlit multipage app for geospatial applications. Prior to commit c4f81d9616d40c60584e36abb15300853a66e489, the `vis_params` variable on line 1254 in `pages/1_?_Timelapse.py` takes user input, which is later used in the `eval()` function on line 1345, leading to remote code execution. Commit c4f81d9616d40c60584e36abb15300853a66e489 fixes this issue.",
    "published": "2024-07-26T21:15:13.237",
    "keywords": "remote,execution"
  },
  "CVE-2024-41117": {
    "cvss": 9.8,
    "description": "streamlit-geospatial is a streamlit multipage app for geospatial applications. Prior to commit c4f81d9616d40c60584e36abb15300853a66e489, the `vis_params` variable on line 115 in `pages/10_?_Earth_Engine_Datasets.py` takes user input, which is later used in the `eval()` function on line 126, leading to remote code execution. Commit c4f81d9616d40c60584e36abb15300853a66e489 fixes this issue.",
    "published": "2024-07-26T21:15:13.443",
    "keywords": "remote,execution"
  },
  "CVE-2024-41118": {
    "url": "https://github.com/opengeos/streamlit-geospatial/commit/c4f81d9616d40c60584e36abb15300853a66e489",
    "cvss": 7.5,
    "description": "streamlit-geospatial is a streamlit multipage app for geospatial applications. Prior to commit c4f81d9616d40c60584e36abb15300853a66e489, the `url` variable on line 47 of `pages/7_?_Web_Map_Service.py` takes user input, which is passed to `get_layers` function, in which `url` is used with `get_wms_layer` method. `get_wms_layer` method creates a request to arbitrary destinations, leading to blind server-side request forgery. Commit c4f81d9616d40c60584e36abb15300853a66e489 fixes this issue.",
    "published": "2024-07-26T21:15:13.653"
  },
  "CVE-2024-41119": {
    "cvss": 9.8,
    "description": "streamlit-geospatial is a streamlit multipage app for geospatial applications. Prior to commit c4f81d9616d40c60584e36abb15300853a66e489, the `vis_params` variable on line 80 in `8_??_Raster_Data_Visualization.py` takes user input, which is later used in the `eval()` function on line 86, leading to remote code execution. Commit c4f81d9616d40c60584e36abb15300853a66e489 fixes this issue.",
    "published": "2024-07-26T21:15:13.867",
    "keywords": "remote,execution"
  },
  "CVE-2024-41120": {
    "url": "https://github.com/opengeos/streamlit-geospatial/commit/c4f81d9616d40c60584e36abb15300853a66e489",
    "cvss": 9.8,
    "description": "streamlit-geospatial is a streamlit multipage app for geospatial applications. Prior to commit c4f81d9616d40c60584e36abb15300853a66e489, the `url` variable on line 63 of `pages/9_?_Vector_Data_Visualization.py` takes user input, which is later passed to the `gpd.read_file` method. `gpd.read_file` method creates a request to arbitrary destinations, leading to blind server-side request forgery. Commit c4f81d9616d40c60584e36abb15300853a66e489 fixes this issue.",
    "published": "2024-07-26T21:15:14.070"
  },
  "CVE-2024-6431": {
    "cvss": 8.8,
    "description": "The Media.net Ads Manager plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation and missing capability check in the 'sendMail' function in all versions up to, and including, 2.10.13. This makes it possible for authenticated attackers, with subscriber-level and above permissions, to upload arbitrary files on the affected site's server which may make remote code execution possible. The vulnerability is only exploitable if anyone has ever logged in through the API.",
    "published": "2024-07-27T02:15:10.677",
    "keywords": "remote,execution"
  },
  "CVE-2024-42029": {
    "cvss": "-",
    "description": "xdg-desktop-portal-hyprland (aka an XDG Desktop Portal backend for Hyprland) before 1.3.3 allows OS command execution, e.g., because single quotes are not used when sending a list of app IDs and titles via the environment.",
    "published": "2024-07-27T04:15:02.760",
    "keywords": "execution,command"
  },
  "CVE-2024-5614": {
    "cvss": 5.3,
    "description": "The Piotnet Addons For Elementor plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 2.4.29 via the 'pafe_posts_list' function. This makes it possible for unauthenticated attackers to extract sensitive data including titles and excerpts of future, draft, and pending blog posts.",
    "published": "2024-07-27T12:15:09.663",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-42054": {
    "url": "https://github.com/cervantessec/cervantes/commit/78631a034d0fb3323a53fb7428b2022b29a0d2cd",
    "cvss": "-",
    "description": "Cervantes through 0.5-alpha accepts insecure file uploads.",
    "published": "2024-07-28T04:15:01.893"
  },
  "CVE-2024-42055": {
    "url": "https://github.com/cervantessec/cervantes/commit/78631a034d0fb3323a53fb7428b2022b29a0d2cd",
    "cvss": "-",
    "description": "Cervantes through 0.5-alpha allows stored XSS.",
    "published": "2024-07-28T04:15:01.980"
  },
  "CVE-2024-7158": {
    "cvss": 6.3,
    "description": "A vulnerability was found in TOTOLINK A3100R 4.1.2cu.5050_B20200504. It has been declared as critical. This vulnerability affects the function setTelnetCfg of the file /cgi-bin/cstecgi.cgi of the component HTTP POST Request Handler. The manipulation of the argument telnet_enabled leads to command injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-272572. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-07-28T14:15:11.303",
    "keywords": "remote,command"
  },
  "CVE-2024-7160": {
    "cvss": 6.3,
    "description": "A vulnerability classified as critical has been found in TOTOLINK A3700R 9.1.2u.5822_B20200513. Affected is the function setWanCfg of the file /cgi-bin/cstecgi.cgi. The manipulation of the argument hostName leads to command injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. VDB-272574 is the identifier assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-07-28T15:15:10.163",
    "keywords": "remote,command"
  },
  "CVE-2024-7161": {
    "url": "https://github.com/huaqipro/seacms/issues/30",
    "cvss": 4.3,
    "description": "A vulnerability classified as problematic was found in SeaCMS 13.0. Affected by this vulnerability is an unknown functionality of the file /member.php?action=chgpwdsubmit of the component Password Change Handler. The manipulation of the argument newpwd/newpwd2 leads to cross-site request forgery. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-272575.",
    "published": "2024-07-28T16:15:02.047"
  },
  "CVE-2024-7162": {
    "url": "https://github.com/huaqipro/seacms/issues/29",
    "cvss": 3.5,
    "description": "A vulnerability, which was classified as problematic, has been found in SeaCMS 12.9/13.0. Affected by this issue is some unknown functionality of the file js/player/dmplayer/admin/post.php?act=setting. The manipulation of the argument yzm leads to cross site scripting. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-272576.",
    "published": "2024-07-28T16:15:02.347"
  },
  "CVE-2024-7163": {
    "url": "https://github.com/huaqipro/seacms/issues/28",
    "cvss": 3.5,
    "description": "A vulnerability, which was classified as problematic, was found in SeaCMS 12.9. This affects an unknown part of the file /js/player/dmplayer/player/index.php. The manipulation of the argument color/vid/url leads to cross site scripting. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-272577 was assigned to this vulnerability.",
    "published": "2024-07-28T17:15:09.797"
  },
  "CVE-2024-7171": {
    "cvss": 6.3,
    "description": "A vulnerability classified as critical has been found in TOTOLINK A3600R 4.1.2cu.5182_B20201102. Affected is the function NTPSyncWithHost of the file /cgi-bin/cstecgi.cgi. The manipulation of the argument hostTime leads to os command injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-272592. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-07-28T23:15:09.837",
    "keywords": "remote,command"
  },
  "CVE-2024-7175": {
    "cvss": 6.3,
    "description": "A vulnerability has been found in TOTOLINK A3600R 4.1.2cu.5182_B20201102 and classified as critical. This vulnerability affects the function setDiagnosisCfg of the file /cgi-bin/cstecgi.cgi. The manipulation of the argument ipDoamin leads to os command injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-272596. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-07-29T01:15:09.830",
    "keywords": "remote,command"
  },
  "CVE-2024-32671": {
    "url": "https://github.com/samsung/escargot/pull/1359",
    "cvss": "-",
    "description": "Heap-based Buffer Overflow vulnerability in Samsung Open Source Escargot JavaScript engine allows Overflow Buffers.This issue affects Escargot: 4.0.0.",
    "published": "2024-07-29T03:15:02.017"
  },
  "CVE-2024-5670": {
    "cvss": 9.8,
    "description": "The web services of Softnext's products, Mail SQR Expert and Mail Archiving Expert do not properly validate user input, allowing unauthenticated remote attackers to inject arbitrary OS commands and execute them on the remote server.",
    "published": "2024-07-29T03:15:02.167",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-7201": {
    "cvss": 9.8,
    "description": "The login functionality of WinMatrix3 Web package from Simopro Technology lacks proper validation of user input, allowing unauthenticated remote attackers to inject SQL commands to read, modify, and delete database contents.",
    "published": "2024-07-29T03:15:03.267",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-7181": {
    "cvss": 6.3,
    "description": "A vulnerability classified as critical was found in TOTOLINK A3600R 4.1.2cu.5182_B20201102. This vulnerability affects the function setTelnetCfg of the file /cgi-bin/cstecgi.cgi. The manipulation of the argument telnet_enabled leads to command injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. VDB-272602 is the identifier assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-07-29T04:15:02.087",
    "keywords": "remote,command"
  },
  "CVE-2024-7202": {
    "cvss": 9.8,
    "description": "The query functionality of WinMatrix3 Web package from Simopro Technology lacks proper validation of user input, allowing unauthenticated remote attackers to inject SQL commands to read, modify, and delete database contents.",
    "published": "2024-07-29T04:15:02.807",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-6984": {
    "cvss": 8.8,
    "description": "An issue was discovered in Juju that resulted in the leak of the sensitive context ID, which allows a local unprivileged attacker to access other sensitive data or relation accessible to the local charm.",
    "published": "2024-07-29T14:15:04.477",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-38529": {
    "cvss": 9.0,
    "description": "Admidio is a free, open source user management system for websites of organizations and groups. In Admidio before version 4.3.10, there is a Remote Code Execution Vulnerability in the Message module of the Admidio Application, where it is possible to upload a PHP file in the attachment. The uploaded file can be accessed publicly through the URL `{admidio_base_url}/adm_my_files/messages_attachments/{file_name}`. The vulnerability is caused due to the lack of file extension verification, allowing malicious files to be uploaded to the server and public availability of the uploaded file. This vulnerability is fixed in 4.3.10.",
    "published": "2024-07-29T15:15:10.990",
    "keywords": "remote,execution"
  },
  "CVE-2024-41023": {
    "cvss": "-",
    "description": "In the Linux kernel, the following vulnerability has been resolved:\n\nsched/deadline: Fix task_struct reference leak\n\nDuring the execution of the following stress test with linux-rt:\n\nstress-ng --cyclic 30 --timeout 30 --minimize --quiet\n\nkmemleak frequently reported a memory leak concerning the task_struct:\n\nunreferenced object 0xffff8881305b8000 (size 16136):\n  comm \"stress-ng\", pid 614, jiffies 4294883961 (age 286.412s)\n  object hex dump (first 32 bytes):\n    02 40 00 00 00 00 00 00 00 00 00 00 00 00 00 00  .@..............\n    00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  ................\n  debug hex dump (first 16 bytes):\n    53 09 00 00 00 00 00 00 00 00 00 00 00 00 00 00  S...............\n  backtrace:\n    [<00000000046b6790>] dup_task_struct+0x30/0x540\n    [<00000000c5ca0f0b>] copy_process+0x3d9/0x50e0\n    [<00000000ced59777>] kernel_clone+0xb0/0x770\n    [<00000000a50befdc>] __do_sys_clone+0xb6/0xf0\n    [<000000001dbf2008>] do_syscall_64+0x5d/0xf0\n    [<00000000552900ff>] entry_SYSCALL_64_after_hwframe+0x6e/0x76\n\nThe issue occurs in start_dl_timer(), which increments the task_struct\nreference count and sets a timer. The timer callback, dl_task_timer,\nis supposed to decrement the reference count upon expiration. However,\nif enqueue_task_dl() is called before the timer expires and cancels it,\nthe reference count is not decremented, leading to the leak.\n\nThis patch fixes the reference leak by ensuring the task_struct\nreference count is properly decremented when the timer is canceled.",
    "published": "2024-07-29T15:15:11.200",
    "keywords": "execution,leak"
  },
  "CVE-2024-41079": {
    "cvss": "-",
    "description": "In the Linux kernel, the following vulnerability has been resolved:\n\nnvmet: always initialize cqe.result\n\nThe spec doesn't mandate that the first two double words (aka results)\nfor the command queue entry need to be set to 0 when they are not\nused (not specified). Though, the target implemention returns 0 for TCP\nand FC but not for RDMA.\n\nLet's make RDMA behave the same and thus explicitly initializing the\nresult field. This prevents leaking any data from the stack.",
    "published": "2024-07-29T15:15:15.457",
    "keywords": "command,leak"
  },
  "CVE-2024-41799": {
    "cvss": 8.4,
    "description": "tgstation-server is a production scale tool for BYOND server management. Prior to 6.8.0, low permission users using the \"Set .dme Path\" privilege could potentially set malicious .dme files existing on the host machine to be compiled and executed. These .dme files could be uploaded via tgstation-server (requiring a separate, isolated privilege) or some other means. A server configured to execute in BYOND's trusted security level (requiring a third separate, isolated privilege OR being set by another user) could lead to this escalating into remote code execution via BYOND's shell() proc. The ability to execute this kind of attack is a known side effect of having privileged TGS users, but normally requires multiple privileges with known weaknesses. This vector is not intentional as it does not require control over the where deployment code is sourced from and _may_ not require remote write access to an instance's `Configuration` directory. This problem is fixed in versions 6.8.0 and above.",
    "published": "2024-07-29T15:15:16.267",
    "keywords": "remote,execution"
  },
  "CVE-2024-6726": {
    "cvss": 8.8,
    "description": "Versions of Delphix Engine prior to Release 25.0.0.0 contain a flaw which results in Remote Code Execution (RCE).",
    "published": "2024-07-29T18:15:12.433",
    "keywords": "remote,execution"
  }
}