{
  "CVE-2025-41234": {
    "cvss": 6.5,
    "description": "Description\n\nIn Spring Framework, versions 6.0.x as of 6.0.5, versions 6.1.x and 6.2.x, an application is vulnerable to a reflected file download (RFD) attack when it sets a “Content-Disposition” header with a non-ASCII charset, where the filename attribute is derived from user-supplied input.\n\nSpecifically, an application is vulnerable when all the following are true:\n\n  *  The header is prepared with org.springframework.http.ContentDisposition.\n  *  The filename is set via ContentDisposition.Builder#filename(String, Charset).\n  *  The value for the filename is derived from user-supplied input.\n  *  The application does not sanitize the user-supplied input.\n  *  The downloaded content of the response is injected with malicious commands by the attacker (see RFD paper reference for details).\n\n\nAn application is not vulnerable if any of the following is true:\n\n  *  The application does not set a “Content-Disposition” response header.\n  *  The header is not prepared with org.springframework.http.ContentDisposition.\n  *  The filename is set via one of:  *  ContentDisposition.Builder#filename(String), or\n  *  ContentDisposition.Builder#filename(String, ASCII)\n\n\n\n  *  The filename is not derived from user-supplied input.\n  *  The filename is derived from user-supplied input but sanitized by the application.\n  *  The attacker cannot inject malicious content in the downloaded content of the response.\n\n\nAffected Spring Products and VersionsSpring Framework:\n\n  *  6.2.0 - 6.2.7\n  *  6.1.0 - 6.1.20\n  *  6.0.5 - 6.0.28\n  *  Older, unsupported versions are not affected\n\n\nMitigationUsers of affected versions should upgrade to the corresponding fixed version.\n\nAffected version(s)Fix versionAvailability6.2.x6.2.8OSS6.1.x6.1.21OSS6.0.x6.0.29 Commercial https://enterprise.spring.io/ No further mitigation steps are necessary.\n\n\nCWE-113 in `Content-Disposition` handling in VMware Spring Framework versions 6.0.5 to 6.2.7 allows remote attackers to launch Reflected File Download (RFD) attacks via unsanitized user input in `ContentDisposition.Builder#filename(String, Charset)` with non-ASCII charsets.",
    "published": "2025-06-12T22:15:21.090",
    "keywords": "remote,command"
  },
  "CVE-2025-4230": {
    "cvss": "-",
    "description": "A command injection vulnerability in Palo Alto Networks PAN-OS® software enables an authenticated administrator to bypass system restrictions and run arbitrary commands as a root user. To be able to exploit this issue, the user must have access to the PAN-OS CLI.\n\nThe security risk posed by this issue is significantly minimized when CLI access is restricted to a limited group of administrators. \n\nCloud NGFW and Prisma® Access are not affected by this vulnerability.",
    "published": "2025-06-13T00:15:23.380",
    "keywords": "command,bypass"
  },
  "CVE-2025-5491": {
    "cvss": 8.8,
    "description": "Acer ControlCenter contains Remote Code Execution vulnerability. The program exposes a Windows Named Pipe that uses a custom protocol to invoke internal functions. However, this Named Pipe is misconfigured, allowing remote users with low privileges to interact with it and access its features. One such feature enables the execution of arbitrary programs as NT AUTHORITY/SYSTEM. By leveraging this, remote attackers can execute arbitrary code on the target system with elevated privileges.",
    "published": "2025-06-13T03:15:52.300",
    "keywords": "remote,execution"
  },
  "CVE-2025-39240": {
    "cvss": 7.2,
    "description": "Some Hikvision Wireless Access Point are vulnerable to authenticated remote command execution due to insufficient input validation. Attackers with valid credentials can exploit this flaw by sending crafted packets containing malicious commands to affected devices, leading to arbitrary command execution.",
    "published": "2025-06-13T08:15:19.377",
    "keywords": "remote,execution,command"
  },
  "CVE-2025-29902": {
    "cvss": 10.0,
    "description": "Remote code execution that allows unauthorized users to execute arbitrary code on the server machine.",
    "published": "2025-06-13T10:15:20.693",
    "keywords": "remote,execution"
  },
  "CVE-2025-49468": {
    "cvss": "-",
    "description": "A SQL injection vulnerability in No Boss Calendar component before 5.0.7 for Joomla was discovered. The vulnerability allows remote authenticated users to execute arbitrary SQL commands via the id_module parameter.",
    "published": "2025-06-13T10:15:21.073",
    "keywords": "remote,command"
  },
  "CVE-2025-46096": {
    "url": "https://github.com/opensolon/solon/issues/357",
    "cvss": 6.1,
    "description": "Directory Traversal vulnerability in solon v.3.1.2 allows a remote attacker to conduct XSS attacks via the solon-faas-luffy component",
    "published": "2025-06-13T13:15:21.710"
  },
  "CVE-2025-28386": {
    "cvss": "-",
    "description": "A remote code execution (RCE) vulnerability in the Plugin Management component of OpenC3 COSMOS v6.0.0 allows attackers to execute arbitrary code via uploading a crafted .txt file.",
    "published": "2025-06-13T14:15:20.713",
    "keywords": "remote,execution"
  },
  "CVE-2025-28389": {
    "cvss": 9.8,
    "description": "Weak password requirements in OpenC3 COSMOS v6.0.0 allow attackers to bypass authentication via a brute force attack.",
    "published": "2025-06-13T14:15:21.010",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-49582": {
    "cvss": "-",
    "description": "XWiki is a generic wiki platform. When editing content that contains \"dangerous\" macros like malicious script macros that were authored by a user with fewer rights, XWiki warns about the execution of these macros since XWiki 15.9RC1. These required rights analyzers that trigger these warnings are incomplete, allowing an attacker to hide malicious content. For most macros, the existing analyzers don't consider non-lowercase parameters. Further, most macro parameters that can contain XWiki syntax like titles of information boxes weren't analyzed at all. Similarly, the \"source\" parameters of the content and context macro weren't anylzed even though they could contain arbitrary XWiki syntax. In the worst case, this could allow a malicious to add malicious script macros including Groovy or Python macros to a page that are then executed after another user with programming righs edits the page, thus allowing remote code execution. The required rights analyzers have been made more robust and extended to cover those cases in XWiki 16.4.7, 16.10.3 and 17.0.0.",
    "published": "2025-06-13T17:15:23.180",
    "keywords": "remote,execution"
  },
  "CVE-2025-49586": {
    "cvss": "-",
    "description": "XWiki is an open-source wiki software platform. Any XWiki user with edit right on at least one App Within Minutes application (the default for all users XWiki) can obtain programming right/perform remote code execution by editing the application. This vulnerability has been fixed in XWiki 17.0.0, 16.4.7, and 16.10.3.",
    "published": "2025-06-13T18:15:22.737",
    "keywords": "remote,execution"
  },
  "CVE-2025-49596": {
    "cvss": "-",
    "description": "The MCP inspector is a developer tool for testing and debugging MCP servers. Versions of MCP Inspector below 0.14.1 are vulnerable to remote code execution due to lack of authentication between the Inspector client and proxy, allowing unauthenticated requests to launch MCP commands over stdio. Users should immediately upgrade to version 0.14.1 or later to address these vulnerabilities.",
    "published": "2025-06-13T20:15:23.133",
    "keywords": "remote,execution,unauthenticated,authentication,command"
  },
  "CVE-2025-24919": {
    "cvss": 8.1,
    "description": "A deserialization of untrusted input vulnerability exists in the cvhDecapsulateCmd functionality of Dell ControlVault3 prior to 5.15.10.14 and ControlVault3 Plus prior to 6.2.26.36. A specially crafted ControlVault response to a command can lead to arbitrary code execution. An attacker can compromise a ControlVault firmware and have it craft a malicious response to trigger this vulnerability.",
    "published": "2025-06-13T22:15:18.320",
    "keywords": "execution,command"
  },
  "CVE-2025-3234": {
    "cvss": 7.2,
    "description": "The File Manager Pro – Filester plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in all versions up to, and including, 1.8.8. This makes it possible for authenticated attackers, with Administrator-level access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible. Administrators have the ability to extend file manager usage privileges to lower-level users including subscribers, which would make this vulnerability more severe on such sites.",
    "published": "2025-06-14T06:15:18.117",
    "keywords": "remote,execution"
  },
  "CVE-2025-4187": {
    "cvss": 5.9,
    "description": "The UserPro - Community and User Profile WordPress Plugin plugin for WordPress is vulnerable to Directory Traversal in all versions up to, and including, 5.1.10 via the userpro_fbconnect() function. This makes it possible for unauthenticated attackers to read the contents of arbitrary files on the server, which can contain sensitive information.",
    "published": "2025-06-14T09:15:22.050",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-4200": {
    "cvss": 8.1,
    "description": "The Zagg - Electronics & Accessories WooCommerce WordPress Theme theme for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 1.4.1 via the load_view() function that is called via at least three AJAX actions: 'load_more_post', 'load_shop', and 'load_more_product. This makes it possible for unauthenticated attackers to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2025-06-14T09:15:22.990",
    "keywords": "execution,unauthenticated,sensitive,bypass"
  },
  "CVE-2025-6065": {
    "cvss": 9.1,
    "description": "The Image Resizer On The Fly plugin for WordPress is vulnerable to arbitrary file deletion due to insufficient file path validation in the 'delete' task in all versions up to, and including, 1.1. This makes it possible for unauthenticated attackers to delete arbitrary files on the server, which can easily lead to remote code execution when the right file is deleted (such as wp-config.php).",
    "published": "2025-06-14T09:15:25.020",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2025-1411": {
    "cvss": 7.8,
    "description": "IBM Security Verify Directory Container 10.0.0.0 through 10.0.3.1 could allow a local user to execute commands as root due to execution with unnecessary privileges.",
    "published": "2025-06-15T13:15:32.027",
    "keywords": "execution,command"
  }
}