{
  "CVE-2025-4434": {
    "cvss": 6.1,
    "description": "The Remote Images Grabber plugin for WordPress is vulnerable to Reflected Cross-Site Scripting in all versions up to, and including, 0.6 due to insufficient input sanitization and output escaping. This makes it possible for unauthenticated attackers to inject arbitrary web scripts in pages that execute if they can successfully trick a user into performing an action such as clicking on a link.",
    "published": "2025-05-09T03:15:24.453",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-4453": {
    "cvss": 6.3,
    "description": "A vulnerability was found in D-Link DIR-619L 2.04B04. It has been classified as critical. This affects the function formSysCmd. The manipulation of the argument sysCmd leads to command injection. It is possible to initiate the attack remotely. The vendor was contacted early about this disclosure. This vulnerability only affects products that are no longer supported by the maintainer.",
    "published": "2025-05-09T03:15:24.600",
    "keywords": "remote,command"
  },
  "CVE-2025-4454": {
    "cvss": 6.3,
    "description": "A vulnerability was found in D-Link DIR-619L 2.04B04. It has been declared as critical. This vulnerability affects the function wake_on_lan. The manipulation of the argument mac leads to command injection. The attack can be initiated remotely. The vendor was contacted early about this disclosure. This vulnerability only affects products that are no longer supported by the maintainer.",
    "published": "2025-05-09T03:15:24.787",
    "keywords": "remote,command"
  },
  "CVE-2025-3710": {
    "cvss": 9.8,
    "description": "The LCD KVM over IP Switch CL5708IM has a Stack-based Buffer Overflow vulnerability, allowing unauthenticated remote attackers to exploit this vulnerability to execute arbitrary code on the device.",
    "published": "2025-05-09T04:16:10.820",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-3711": {
    "cvss": 9.8,
    "description": "The LCD KVM over IP Switch CL5708IM has a Stack-based Buffer Overflow vulnerability, allowing unauthenticated remote attackers to exploit this vulnerability to execute arbitrary code on the device.",
    "published": "2025-05-09T04:16:11.110",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-3712": {
    "cvss": 7.5,
    "description": "The LCD KVM over IP Switch CL5708IM has a Heap-based Buffer Overflow vulnerability, allowing unauthenticated remote attackers to exploit this vulnerability to perform a denial-of-service attack.",
    "published": "2025-05-09T04:16:12.170",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-3713": {
    "cvss": 7.5,
    "description": "The LCD KVM over IP Switch CL5708IM has a Heap-based Buffer Overflow vulnerability, allowing unauthenticated remote attackers to exploit this vulnerability to perform a denial-of-service attack.",
    "published": "2025-05-09T04:16:12.327",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-3714": {
    "cvss": 9.8,
    "description": "The LCD KVM over IP Switch CL5708IM has a Stack-based Buffer Overflow vulnerability, allowing unauthenticated remote attackers to exploit this vulnerability to execute arbitrary code on the device.",
    "published": "2025-05-09T04:16:12.483",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-47736": {
    "url": "https://github.com/gwenn/lemon-rs/pull/8",
    "cvss": 2.9,
    "description": "dialect/mod.rs in the libsql-sqlite3-parser crate through 0.13.0 before 14f422a for Rust can crash if the input is not valid UTF-8.",
    "published": "2025-05-09T05:15:51.647"
  },
  "CVE-2025-37864": {
    "cvss": "-",
    "description": "In the Linux kernel, the following vulnerability has been resolved:\n\nnet: dsa: clean up FDB, MDB, VLAN entries on unbind\n\nAs explained in many places such as commit b117e1e8a86d (\"net: dsa:\ndelete dsa_legacy_fdb_add and dsa_legacy_fdb_del\"), DSA is written given\nthe assumption that higher layers have balanced additions/deletions.\nAs such, it only makes sense to be extremely vocal when those\nassumptions are violated and the driver unbinds with entries still\npresent.\n\nBut Ido Schimmel points out a very simple situation where that is wrong:\nhttps://lore.kernel.org/netdev/ZDazSM5UsPPjQuKr@shredder/\n(also briefly discussed by me in the aforementioned commit).\n\nBasically, while the bridge bypass operations are not something that DSA\nexplicitly documents, and for the majority of DSA drivers this API\nsimply causes them to go to promiscuous mode, that isn't the case for\nall drivers. Some have the necessary requirements for bridge bypass\noperations to do something useful - see dsa_switch_supports_uc_filtering().\n\nAlthough in tools/testing/selftests/net/forwarding/local_termination.sh,\nwe made an effort to popularize better mechanisms to manage address\nfilters on DSA interfaces from user space - namely macvlan for unicast,\nand setsockopt(IP_ADD_MEMBERSHIP) - through mtools - for multicast, the\nfact is that 'bridge fdb add ... self static local' also exists as\nkernel UAPI, and might be useful to someone, even if only for a quick\nhack.\n\nIt seems counter-productive to block that path by implementing shim\n.ndo_fdb_add and .ndo_fdb_del operations which just return -EOPNOTSUPP\nin order to prevent the ndo_dflt_fdb_add() and ndo_dflt_fdb_del() from\nrunning, although we could do that.\n\nAccepting that cleanup is necessary seems to be the only option.\nEspecially since we appear to be coming back at this from a different\nangle as well. Russell King is noticing that the WARN_ON() triggers even\nfor VLANs:\nhttps://lore.kernel.org/netdev/Z_li8Bj8bD4-BYKQ@shell.armlinux.org.uk/\n\nWhat happens in the bug report above is that dsa_port_do_vlan_del() fails,\nthen the VLAN entry lingers on, and then we warn on unbind and leak it.\n\nThis is not a straight revert of the blamed commit, but we now add an\ninformational print to the kernel log (to still have a way to see\nthat bugs exist), and some extra comments gathered from past years'\nexperience, to justify the logic.",
    "published": "2025-05-09T07:16:07.410",
    "keywords": "bypass,leak"
  },
  "CVE-2025-37872": {
    "cvss": "-",
    "description": "In the Linux kernel, the following vulnerability has been resolved:\n\nnet: txgbe: fix memory leak in txgbe_probe() error path\n\nWhen txgbe_sw_init() is called, memory is allocated for wx->rss_key\nin wx_init_rss_key(). However, in txgbe_probe() function, the subsequent\nerror paths after txgbe_sw_init() don't free the rss_key. Fix that by\nfreeing it in error path along with wx->mac_table.\n\nAlso change the label to which execution jumps when txgbe_sw_init()\nfails, because otherwise, it could lead to a double free for rss_key,\nwhen the mac_table allocation fails in wx_sw_init().",
    "published": "2025-05-09T07:16:08.323",
    "keywords": "execution,leak"
  },
  "CVE-2025-37874": {
    "cvss": "-",
    "description": "In the Linux kernel, the following vulnerability has been resolved:\n\nnet: ngbe: fix memory leak in ngbe_probe() error path\n\nWhen ngbe_sw_init() is called, memory is allocated for wx->rss_key\nin wx_init_rss_key(). However, in ngbe_probe() function, the subsequent\nerror paths after ngbe_sw_init() don't free the rss_key. Fix that by\nfreeing it in error path along with wx->mac_table.\n\nAlso change the label to which execution jumps when ngbe_sw_init()\nfails, because otherwise, it could lead to a double free for rss_key,\nwhen the mac_table allocation fails in wx_sw_init().",
    "published": "2025-05-09T07:16:08.553",
    "keywords": "execution,leak"
  },
  "CVE-2025-3455": {
    "cvss": 8.8,
    "description": "The 1 Click WordPress Migration Plugin – 100% FREE for a limited time plugin for WordPress is vulnerable to unauthorized modification of data due to a missing capability check on the 'start_restore' function in all versions up to, and including, 2.2. This makes it possible for authenticated attackers, with Subscriber-level access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2025-05-09T07:16:10.410",
    "keywords": "remote,execution"
  },
  "CVE-2025-4403": {
    "cvss": 9.8,
    "description": "The Drag and Drop Multiple File Upload for WooCommerce plugin for WordPress is vulnerable to arbitrary file uploads in all versions up to, and including, 1.1.6 due to accepting a user‐supplied supported_type string and the uploaded filename without enforcing real extension or MIME checks within the upload() function. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2025-05-09T09:15:19.610",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2025-3897": {
    "cvss": 5.9,
    "description": "The EUCookieLaw plugin for WordPress is vulnerable to Arbitrary File Read in all versions up to, and including, 2.7.2 via the 'file_get_contents' function. This makes it possible for unauthenticated attackers to read the contents of arbitrary files on the server, which can contain sensitive information. The vulnerability can only be exploited if a caching plugin such as W3 Total Cache is installed and activated.",
    "published": "2025-05-09T12:15:33.370",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-4206": {
    "cvss": 7.2,
    "description": "The WordPress CRM, Email & Marketing Automation for WordPress | Award Winner — Groundhogg plugin for WordPress is vulnerable to arbitrary file deletion due to insufficient file path validation in the 'process_export_delete' and 'process_import_delete' functions in all versions up to, and including, 4.1.1.2. This makes it possible for authenticated attackers, with Administrator-level access and above, to delete arbitrary files on the server, which can easily lead to remote code execution when the right file is deleted (such as wp-config.php).",
    "published": "2025-05-09T12:15:33.513",
    "keywords": "remote,execution"
  },
  "CVE-2025-46193": {
    "cvss": "-",
    "description": "SourceCodester Client Database Management System 1.0 is vulnerable to Remote code execution via Arbitrary file upload in user_proposal_update_order.php.",
    "published": "2025-05-09T16:15:25.070",
    "keywords": "remote,execution"
  },
  "CVE-2025-4432": {
    "url": "https://github.com/briansmith/ring/pull/2447",
    "cvss": 5.3,
    "description": "A flaw was found in Rust's Ring package. A panic may be triggered when overflow checking is enabled. In the QUIC protocol, this flaw allows an attacker to induce this panic by sending a specially crafted packet. It will likely occur unintentionally in 1 out of every 2**32 packets sent or received.",
    "published": "2025-05-09T16:15:25.467"
  },
  "CVE-2025-1278": {
    "cvss": 5.3,
    "description": "An issue has been discovered in GitLab CE/EE affecting all versions from 12.0 before 17.9.8, 17.10 before 17.10.6, and 17.11 before 17.11.2. Under certain conditions users could bypass IP access restrictions and view sensitive information.",
    "published": "2025-05-09T17:15:50.790",
    "keywords": "sensitive,bypass"
  },
  "CVE-2025-29509": {
    "cvss": 9.8,
    "description": "Jan v0.5.14 and before is vulnerable to remote code execution (RCE) when the user clicks on a rendered link in the conversation, due to opening external website in the app and the exposure of electronAPI, with a lack of filtering of URL when calling shell.openExternal().",
    "published": "2025-05-09T17:15:50.947",
    "keywords": "remote,execution"
  },
  "CVE-2025-46191": {
    "cvss": 9.8,
    "description": "Arbitrary File Upload in user_payment_update.php in SourceCodester Client Database Management System 1.0 allows unauthenticated users to upload arbitrary files via the uploaded_file_cancelled field. Due to the absence of proper file extension checks, MIME type validation, and authentication, attackers can upload executable PHP files to a web-accessible directory (/files/). This allows them to execute arbitrary commands remotely by accessing the uploaded script, resulting in full Remote Code Execution (RCE) without authentication.",
    "published": "2025-05-09T17:15:51.480",
    "keywords": "remote,execution,unauthenticated,authentication,command"
  },
  "CVE-2025-2158": {
    "cvss": 8.8,
    "description": "The WordPress Review Plugin: The Ultimate Solution for Building a Review Website plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 5.3.5 via the Post custom fields. This makes it possible for authenticated attackers, with Contributor-level access and above, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where PHP file types can be uploaded and included, or pearcmd is enabled on a server with register_argc_argv also enabled.",
    "published": "2025-05-10T10:15:20.227",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2025-4513": {
    "cvss": 4.3,
    "description": "A vulnerability classified as problematic was found in Catalyst User Key Authentication Plugin 20220819 on Moodle. Affected by this vulnerability is an unknown functionality of the file /auth/userkey/logout.php of the component Logout. The manipulation of the argument return leads to open redirect. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2025-05-10T20:15:20.353",
    "keywords": "remote,authentication"
  },
  "CVE-2025-47817": {
    "url": "https://github.com/bluewave-labs/checkmate/pull/2161",
    "cvss": 8.8,
    "description": "In BlueWave Checkmate through 2.0.2 before b387eba, a profile edit request can include a role parameter.",
    "published": "2025-05-10T22:15:20.657"
  },
  "CVE-2025-4533": {
    "url": "https://github.com/jeecgboot/jeecgboot/issues/8199#issuecomment-2834691016",
    "cvss": 2.7,
    "description": "A vulnerability classified as problematic was found in JeecgBoot up to 3.8.0. This vulnerability affects the function unzipFile of the file /jeecg-boot/airag/knowledge/doc/import/zip of the component Document Library Upload. The manipulation of the argument File leads to resource consumption. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2025-05-11T07:15:15.430"
  },
  "CVE-2025-4537": {
    "cvss": 3.1,
    "description": "A vulnerability was found in yangzongzhuan RuoYi-Vue up to 3.8.9 and classified as problematic. Affected by this issue is some unknown functionality of the file ruoyi-ui/jsencrypt.js and ruoyi-ui/login.vue of the component Password Handler. The manipulation leads to cleartext storage of sensitive information in a cookie. The attack may be launched remotely. The complexity of an attack is rather high. The exploitation is known to be difficult. The exploit has been disclosed to the public and may be used.",
    "published": "2025-05-11T10:15:16.207",
    "keywords": "remote,sensitive"
  }
}