{
  "CVE-2024-29027": {
    "cvss": 9.0,
    "description": "Parse Server is an open source backend that can be deployed to any infrastructure that can run Node.js. Prior to versions 6.5.5 and 7.0.0-alpha.29, calling an invalid Parse Server Cloud Function name or Cloud Job name crashes the server and may allow for code injection, internal store manipulation or remote code execution. The patch in versions 6.5.5 and 7.0.0-alpha.29 added string sanitation for Cloud Function name and Cloud Job name. As a workaround, sanitize the Cloud Function name and Cloud Job name before it reaches Parse Server.",
    "published": "2024-03-19T19:15:06.980",
    "keywords": "remote,execution"
  },
  "CVE-2024-28283": {
    "cvss": "-",
    "description": "There is stack-based buffer overflow vulnerability in pc_change_act function in Linksys E1000 router firmware version v.2.1.03 and before, leading to remote code execution.",
    "published": "2024-03-19T21:15:07.770",
    "keywords": "remote,execution"
  },
  "CVE-2024-28389": {
    "cvss": "-",
    "description": "SQL injection vulnerability in KnowBand spinwheel v.3.0.3 and before allows a remote attacker to gain escalated privileges and obtain sensitive information via the SpinWheelFrameSpinWheelModuleFrontController::sendEmail() method.",
    "published": "2024-03-19T21:15:07.820",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-2642": {
    "cvss": 7.3,
    "description": "A vulnerability was found in Ruijie RG-NBS2009G-P up to 20240305. It has been declared as critical. Affected by this vulnerability is an unknown functionality of the file /EXCU_SHELL. The manipulation of the argument Command1 leads to command injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-257281 was assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-03-19T22:15:06.897",
    "keywords": "remote,command"
  },
  "CVE-2024-2645": {
    "cvss": 4.3,
    "description": "A vulnerability classified as problematic has been found in Netentsec NS-ASG Application Security Gateway 6.3. This affects an unknown part of the file /vpnweb/resetpwd/resetpwd.php. The manipulation of the argument UserId leads to improper neutralization of data within xpath expressions. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-257283. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-03-19T23:15:09.560",
    "keywords": "remote,vpn"
  },
  "CVE-2024-2646": {
    "cvss": 6.3,
    "description": "A vulnerability classified as critical was found in Netentsec NS-ASG Application Security Gateway 6.3. This vulnerability affects unknown code of the file /vpnweb/index.php?para=index. The manipulation of the argument check_VirtualSiteId leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-257284. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-03-19T23:15:09.883",
    "keywords": "remote,vpn"
  },
  "CVE-2024-2384": {
    "cvss": 4.3,
    "description": "The WooCommerce POS plugin for WordPress is vulnerable to information disclosure in all versions up to, and including, 1.4.11. This is due to the plugin not properly verifying the authentication and authorization of the current user This makes it possible for authenticated attackers, with customer-level access and above, to view potentially sensitive information about other users by leveraging their order id",
    "published": "2024-03-20T03:15:08.327",
    "keywords": "authentication,sensitive"
  },
  "CVE-2024-1181": {
    "cvss": 5.3,
    "description": "The Coming Soon, Under Construction & Maintenance Mode By Dazzler plugin for WordPress is vulnerable to maintenance mode bypass in all versions up to, and including, 2.1.2. This is due to the plugin relying on the REQUEST_URI to determine if the page being accesses is an admin area.  This makes it possible for unauthenticated attackers to bypass maintenance mode and access the site which may be considered confidential when in maintenance mode.",
    "published": "2024-03-20T07:15:09.167",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2024-1205": {
    "cvss": 8.8,
    "description": "The Management App for WooCommerce – Order notifications, Order management, Lead management, Uptime Monitoring plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the nouvello_upload_csv_file function in all versions up to, and including, 1.2.0. This makes it possible for authenticated attackers, with subscriber-level access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-03-20T07:15:09.467",
    "keywords": "remote,execution"
  },
  "CVE-2024-1473": {
    "cvss": 5.3,
    "description": "The Coming Soon & Maintenance Mode by Colorlib plugin for WordPress is vulnerable to Information Exposure in all versions up to, and including, 1.0.99 via the REST API. This makes it possible for unauthenticated attackers to obtain post and page contents via REST API thus bypassing maintenance mode protection provided by the plugin.",
    "published": "2024-03-20T07:15:10.133",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2024-1477": {
    "cvss": 5.3,
    "description": "The Easy Maintenance Mode plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 1.4.2 via the REST API. This makes it possible for authenticated attackers to obtain post and page content via REST API thus bypassign the protection provided by the plugin.",
    "published": "2024-03-20T07:15:10.330",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-1711": {
    "cvss": 9.8,
    "description": "The Create by Mediavine plugin for WordPress is vulnerable to SQL Injection via the 'id' parameter in all versions up to, and including, 1.9.4 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-03-20T07:15:10.550",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-1800": {
    "cvss": 9.9,
    "description": "\nIn Progress® Telerik® Report Server versions prior to 2024 Q1 (10.0.24.130), a remote code execution attack is possible through an insecure deserialization vulnerability.",
    "published": "2024-03-20T13:15:11.980",
    "keywords": "remote,execution"
  },
  "CVE-2024-1856": {
    "cvss": 8.5,
    "description": "\nIn Progress® Telerik® Reporting versions prior to 2024 Q1 (18.0.24.130), a code execution attack is possible by a remote threat actor through an insecure deserialization vulnerability.",
    "published": "2024-03-20T13:15:15.563",
    "keywords": "remote,execution"
  },
  "CVE-2024-2630": {
    "cvss": "-",
    "description": "Inappropriate implementation in iOS in Google Chrome prior to 123.0.6312.58 allowed a remote attacker to leak cross-origin data via a crafted HTML page. (Chromium security severity: Medium)",
    "published": "2024-03-20T17:15:07.660",
    "keywords": "remote,leak"
  },
  "CVE-2024-2707": {
    "cvss": 6.3,
    "description": "A vulnerability has been found in Tenda AC10U 15.03.06.49 and classified as critical. This vulnerability affects the function formWriteFacMac of the file /goform/WriteFacMac. The manipulation of the argument mac leads to os command injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. VDB-257458 is the identifier assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-03-20T17:15:08.243",
    "keywords": "remote,command"
  },
  "CVE-2024-2708": {
    "cvss": 8.8,
    "description": "A vulnerability was found in Tenda AC10U 15.03.06.49 and classified as critical. This issue affects the function formexeCommand of the file /goform/execCommand. The manipulation of the argument cmdinput leads to stack-based buffer overflow. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-257459. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-03-20T18:15:10.843",
    "keywords": "remote,command"
  },
  "CVE-2024-28179": {
    "cvss": 9.0,
    "description": "Jupyter Server Proxy allows users to run arbitrary external processes alongside their Jupyter notebook servers and provides authenticated web access. Prior to versions 3.2.3 and 4.1.1, Jupyter Server Proxy did not check user authentication appropriately when proxying websockets, allowing unauthenticated access to anyone who had network access to the Jupyter server endpoint. This vulnerability can allow unauthenticated remote access to any websocket endpoint set up to be accessible via Jupyter Server Proxy. In many cases, this leads to remote unauthenticated arbitrary code execution, due to how affected instances use websockets. The websocket endpoints exposed by `jupyter_server` itself is not affected. Projects that do not rely on websockets are also not affected. Versions 3.2.3 and 4.1.1 contain a fix for this issue.",
    "published": "2024-03-20T20:15:08.680",
    "keywords": "remote,execution,unauthenticated,authentication"
  },
  "CVE-2024-25294": {
    "cvss": "-",
    "description": "An SSRF issue in REBUILD v.3.5 allows a remote attacker to obtain sensitive information and execute arbitrary code via the FileDownloader.java, proxyDownload,URL parameters.",
    "published": "2024-03-20T21:15:30.877",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-29018": {
    "url": "https://github.com/moby/moby/pull/46609",
    "cvss": 5.9,
    "description": "Moby is an open source container framework that is a key component of Docker Engine, Docker Desktop, and other distributions of container tooling or runtimes. Moby's networking implementation allows for many networks, each with their own IP address range and gateway, to be defined. This feature is frequently referred to as custom networks, as each network can have a different driver, set of parameters and thus behaviors. When creating a network, the `--internal` flag is used to designate a network as _internal_. The `internal` attribute in a docker-compose.yml file may also be used to mark a network _internal_, and other API clients may specify the `internal` parameter as well.\n\nWhen containers with networking are created, they are assigned unique network interfaces and IP addresses. The host serves as a router for non-internal networks, with a gateway IP that provides SNAT/DNAT to/from container IPs.\n\nContainers on an internal network may communicate between each other, but are precluded from communicating with any networks the host has access to (LAN or WAN) as no default route is configured, and firewall rules are set up to drop all outgoing traffic. Communication with the gateway IP address (and thus appropriately configured host services) is possible, and the host may communicate with any container IP directly.\n\nIn addition to configuring the Linux kernel's various networking features to enable container networking, `dockerd` directly provides some services to container networks. Principal among these is serving as a resolver, enabling service discovery, and resolution of names from an upstream resolver.\n\nWhen a DNS request for a name that does not correspond to a container is received, the request is forwarded to the configured upstream resolver. This request is made from the container's network namespace: the level of access and routing of traffic is the same as if the request was made by the container itself.\n\nAs a consequence of this design, containers solely attached to an internal network will be unable to resolve names using the upstream resolver, as the container itself is unable to communicate with that nameserver. Only the names of containers also attached to the internal network are able to be resolved.\n\nMany systems run a local forwarding DNS resolver. As the host and any containers have separate loopback devices, a consequence of the design described above is that containers are unable to resolve names from the host's configured resolver, as they cannot reach these addresses on the host loopback device. To bridge this gap, and to allow containers to properly resolve names even when a local forwarding resolver is used on a loopback address, `dockerd` detects this scenario and instead forward DNS requests from the host namework namespace. The loopback resolver then forwards the requests to its configured upstream resolvers, as expected.\n\nBecause `dockerd` forwards DNS requests to the host loopback device, bypassing the container network namespace's normal routing semantics entirely, internal networks can unexpectedly forward DNS requests to an external nameserver. By registering a domain for which they control the authoritative nameservers, an attacker could arrange for a compromised container to exfiltrate data by encoding it in DNS queries that will eventually be answered by their nameservers.\n\nDocker Desktop is not affected, as Docker Desktop always runs an internal resolver on a RFC 1918 address.\n\nMoby releases 26.0.0, 25.0.4, and 23.0.11 are patched to prevent forwarding any DNS requests from internal networks. As a workaround, run containers intended to be solely attached to internal networks with a custom upstream address, which will force all upstream DNS queries to be resolved from the container's network namespace.",
    "published": "2024-03-20T21:15:31.113"
  },
  "CVE-2024-29036": {
    "cvss": 4.3,
    "description": "Saleor Storefront is software for building e-commerce experiences. Prior to commit 579241e75a5eb332ccf26e0bcdd54befa33f4783, when any user authenticates in the storefront, anonymous users are able to access their data. The session is leaked through cache and can be accessed by anyone. Users should upgrade to a version that incorporates commit 579241e75a5eb332ccf26e0bcdd54befa33f4783 or later to receive a patch. A possible workaround is to temporarily disable authentication by changing the usage of `createSaleorAuthClient()`.",
    "published": "2024-03-20T21:15:31.817",
    "keywords": "authentication,leak"
  },
  "CVE-2024-29026": {
    "url": "https://github.com/owncast/owncast/commit/9215d9ba0f29d62201d3feea9e77dcd274581624",
    "cvss": 8.2,
    "description": "Owncast is an open source, self-hosted, decentralized, single user live video streaming and chat server. In versions 0.1.2 and prior, a lenient CORS policy allows attackers to make a cross origin request, reading privileged information. This can be used to leak the admin password. Commit 9215d9ba0f29d62201d3feea9e77dcd274581624 fixes this issue.",
    "published": "2024-03-20T22:15:08.557"
  },
  "CVE-2024-2469": {
    "cvss": 8.0,
    "description": "An attacker with an Administrator role in GitHub Enterprise Server could gain SSH root access via remote code execution. This vulnerability affected GitHub Enterprise Server version 3.8.0 and above and was fixed in version 3.8.17, 3.9.12, 3.10.9, 3.11.7 and 3.12.1. This vulnerability was reported via the GitHub Bug Bounty program.",
    "published": "2024-03-20T23:15:07.430",
    "keywords": "remote,execution"
  },
  "CVE-2024-1202": {
    "cvss": 9.8,
    "description": "Authentication Bypass by Primary Weakness vulnerability in XPodas Octopod allows Authentication Bypass.This issue affects Octopod: before v1. \n\nNOTE: The vendor was contacted and it was learned that the product is not supported.\n\n",
    "published": "2024-03-21T02:51:38.000",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-24110": {
    "url": "https://github.com/crmeb/crmeb_java/issues/13",
    "cvss": "-",
    "description": "SQL Injection vulnerability in crmeb_java before v1.3.4 allows attackers to run arbitrary SQL commands via crafted GET request to the component /api/front/spread/people.",
    "published": "2024-03-21T02:52:09.993"
  },
  "CVE-2024-25811": {
    "cvss": "-",
    "description": "An access control issue in Dreamer CMS v4.0.1 allows attackers to download backup files and leak sensitive information.",
    "published": "2024-03-21T02:52:15.060",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-27094": {
    "url": "https://github.com/openzeppelin/openzeppelin-contracts/commit/a6286d0fded8771b3a645e5813e51993c490399c",
    "cvss": 6.5,
    "description": "OpenZeppelin Contracts is a library for secure smart contract development. The `Base64.encode` function encodes a `bytes` input by iterating over it in chunks of 3 bytes. When this input is not a multiple of 3, the last iteration may read parts of the memory that are beyond the input buffer. The vulnerability is fixed in 5.0.2 and 4.9.6.",
    "published": "2024-03-21T02:52:18.063"
  },
  "CVE-2024-27918": {
    "cvss": 8.2,
    "description": "Coder allows oragnizations to provision remote development environments via Terraform. Prior to versions 2.6.1, 2.7.3, and 2.8.4, a vulnerability in Coder's OIDC authentication could allow an attacker to bypass the `CODER_OIDC_EMAIL_DOMAIN` verification and create an account with an email not in the allowlist. Deployments are only affected if the OIDC provider allows users to create accounts on the provider. During OIDC registration, the user's email was improperly validated against the allowed `CODER_OIDC_EMAIL_DOMAIN`s. This could allow a user with a domain that only partially matched an allowed domain to successfully login or register. An attacker could register a domain name that exploited this vulnerability and register on a Coder instance with a public OIDC provider.\n\nCoder instances with OIDC enabled and protected by the `CODER_OIDC_EMAIL_DOMAIN` configuration are affected. Coder instances using a private OIDC provider are not affected, as arbitrary users cannot register through a private OIDC provider without first having an account on the provider. Public OIDC providers are impacted. GitHub authentication and external authentication are not impacted. This vulnerability is remedied in versions 2.8.4, 2.7.3, and 2.6.1 All versions prior to these patches are affected by the vulnerability.*It is recommended that customers upgrade their deployments as soon as possible if they are utilizing OIDC authentication with the `CODER_OIDC_EMAIL_DOMAIN` setting.",
    "published": "2024-03-21T02:52:20.863",
    "keywords": "remote,authentication,bypass"
  },
  "CVE-2024-27923": {
    "cvss": 8.8,
    "description": "Grav is a content management system (CMS). Prior to version 1.7.43, users who may write a page may use the `frontmatter` feature due to insufficient permission validation and inadequate file name validation. This may lead to remote code execution. Version 1.7.43 fixes this issue.",
    "published": "2024-03-21T02:52:21.280",
    "keywords": "remote,execution"
  },
  "CVE-2024-27926": {
    "url": "https://github.com/diygod/rsshub/commit/4d3e5d79c1c17837e931b4cd253d2013b487aa87",
    "cvss": 6.1,
    "description": "RSSHub is an open source RSS feed generator. Starting in version 1.0.0-master.cbbd829 and prior to version 1.0.0-master.d8ca915, ahen the specially crafted image is supplied to the internal media proxy, it proxies the image without handling XSS vulnerabilities, allowing for the execution of arbitrary JavaScript code. Users who access the deliberately constructed URL are affected. This vulnerability was fixed in version 1.0.0-master.d8ca915. No known workarounds are available.",
    "published": "2024-03-21T02:52:21.500"
  },
  "CVE-2024-27927": {
    "cvss": 6.5,
    "description": "RSSHub is an open source RSS feed generator. Prior to version 1.0.0-master.a429472, RSSHub allows remote attackers to use the server as a proxy to send HTTP GET requests to arbitrary targets and retrieve information in the internal network or conduct Denial-of-Service (DoS) attacks. The attacker can send malicious requests to a RSSHub server, to make the server send HTTP GET requests to arbitrary destinations and see partial responses. This may lead to leak the server IP address, which could be hidden behind a CDN; retrieving information in the internal network, e.g. which addresses/ports are accessible, the titles and meta descriptions of HTML pages; and denial of service amplification. The attacker could request the server to download some large files, or chain several SSRF requests in a single attacker request.",
    "published": "2024-03-21T02:52:21.703",
    "keywords": "remote,leak"
  },
  "CVE-2024-27933": {
    "cvss": 8.2,
    "description": "Deno is a JavaScript, TypeScript, and WebAssembly runtime. In version 1.39.0, use of raw file descriptors in `op_node_ipc_pipe()` leads to premature close of arbitrary file descriptors, allowing standard input to be re-opened as a different resource resulting in permission prompt bypass. Node child_process IPC relies on the JS side to pass the raw IPC file descriptor to `op_node_ipc_pipe()`, which returns a `IpcJsonStreamResource` ID associated with the file descriptor. On closing the resource, the raw file descriptor is closed together.\n\nUse of raw file descriptors in `op_node_ipc_pipe()` leads to premature close of arbitrary file descriptors. This allow standard input (fd 0) to be closed and re-opened for a different resource, which allows a silent permission prompt bypass. This is exploitable by an attacker controlling the code executed inside a Deno runtime to obtain arbitrary code execution on the host machine regardless of permissions.\n\nThis bug is known to be exploitable. There is a working exploit that achieves arbitrary code execution by bypassing prompts from zero permissions, additionally abusing the fact that Cache API lacks filesystem permission checks. The attack can be conducted silently as stderr can also be closed, suppressing all prompt outputs.\n\nVersion 1.39.1 fixes the bug.\n",
    "published": "2024-03-21T02:52:22.197",
    "keywords": "execution,bypass"
  },
  "CVE-2024-28286": {
    "url": "https://github.com/mz-automation/libiec61850/issues/496",
    "cvss": "-",
    "description": "In mz-automation libiec61850 v1.4.0, a NULL Pointer Dereference was detected in the mmsServer_handleFileCloseRequest.c function of src/mms/iso_mms/server/mms_file_service.c. The vulnerability manifests as SEGV and causes the application to crash",
    "published": "2024-03-21T02:52:24.617"
  },
  "CVE-2024-2007": {
    "url": "https://github.com/openbmb/xagent/issues/386",
    "cvss": 5.3,
    "description": "A vulnerability was found in OpenBMB XAgent 1.0.0. It has been declared as critical. Affected by this vulnerability is an unknown functionality of the component Privileged Mode. The manipulation leads to sandbox issue. The attack needs to be approached locally. The exploit has been disclosed to the public and may be used. The identifier VDB-255265 was assigned to this vulnerability.",
    "published": "2024-03-21T02:52:25.977"
  },
  "CVE-2024-2053": {
    "cvss": "-",
    "description": "The Artica Proxy administrative web application will deserialize arbitrary PHP objects supplied by unauthenticated users and subsequently enable code execution as the \"www-data\" user. This issue was demonstrated on version 4.50 of the The Artica-Proxy administrative web application attempts to prevent local file inclusion. These protections can be bypassed and arbitrary file requests supplied by unauthenticated users will be returned according to the privileges of the \"www-data\" user.\n",
    "published": "2024-03-21T02:52:27.250",
    "keywords": "execution,unauthenticated,bypass"
  },
  "CVE-2024-2054": {
    "cvss": "-",
    "description": "The Artica-Proxy administrative web application will deserialize arbitrary PHP objects supplied by unauthenticated users and subsequently enable code execution as the \"www-data\" user.",
    "published": "2024-03-21T02:52:27.320",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-28635": {
    "url": "https://github.com/surveyjs/survey-creator/issues/5285",
    "cvss": "-",
    "description": "Cross Site Scripting (XSS) vulnerability in SurveyJS Survey Creator v.1.9.132 and before, allows attackers to execute arbitrary code and obtain sensitive information via the title parameter in form.",
    "published": "2024-03-21T04:15:09.373"
  },
  "CVE-2024-2161": {
    "cvss": 9.8,
    "description": "Use of Hard-coded Credentials in Kiloview NDI allows un-authenticated users to bypass authenticationThis issue affects Kiloview NDI N3, N3-s, N4, N20, N30, N40 and was fixed in Firmware version 2.02.0227 .\n\n",
    "published": "2024-03-21T06:15:46.690",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-2162": {
    "cvss": 8.8,
    "description": "An OS Command Injection vulnerability in Kiloview NDI allows a low-privileged user to execute arbitrary code remotely on the device with high privileges.\n\nThis issue affects Kiloview NDI N3, N3-s, N4, N20, N30, N40 and was fixed in Firmware version 2.02.0227 .\n\n",
    "published": "2024-03-21T06:15:47.073",
    "keywords": "remote,command"
  },
  "CVE-2024-1147": {
    "cvss": 9.8,
    "description": "Weak access control in OpenText PVCS Version Manager allows potential bypassing of authentication and download of files.",
    "published": "2024-03-21T08:15:07.423",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-1148": {
    "cvss": 9.8,
    "description": "Weak access control in OpenText PVCS Version Manager allows potential bypassing of authentication and uploading of files.",
    "published": "2024-03-21T08:15:07.620",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-27438": {
    "cvss": "-",
    "description": "Download of Code Without Integrity Check vulnerability in Apache Doris.\nThe jdbc driver files used for JDBC catalog is not checked and may resulting in remote command execution.\nOnce the attacker is authorized to create a JDBC catalog, he/she can use arbitrary driver jar file with unchecked code snippet. This code snippet will be run when catalog is initializing without any check.\nThis issue affects Apache Doris: from 1.2.0 through 2.0.4.\n\nUsers are recommended to upgrade to version 2.0.5 or 2.1.x, which fixes the issue.\n\n",
    "published": "2024-03-21T10:15:08.370",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-29866": {
    "url": "https://github.com/datalust/seq-tickets/issues/2127",
    "cvss": "-",
    "description": "Datalust Seq before 2023.4.11151 and 2024 before 2024.1.11146 has Incorrect Access Control because a Project Owner or Organization Owner can escalate to System privileges.",
    "published": "2024-03-21T14:15:07.810"
  },
  "CVE-2024-24272": {
    "cvss": "-",
    "description": "An issue in iTop DualSafe Password Manager & Digital Vault before 1.4.24 allows a local attacker to obtain sensitive information via leaked credentials as plaintext in a log file that can be accessed by the local user without knowledge of the master secret.",
    "published": "2024-03-21T22:15:10.850",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-28116": {
    "cvss": 8.8,
    "description": "Grav is an open-source, flat-file content management system. Grav CMS prior to version 1.7.45 is vulnerable to a Server-Side Template Injection (SSTI), which allows any authenticated user (editor permissions are sufficient) to execute arbitrary code on the remote server bypassing the existing security sandbox. Version 1.7.45 contains a patch for this issue.",
    "published": "2024-03-21T22:15:11.577",
    "keywords": "remote,bypass"
  },
  "CVE-2024-28117": {
    "cvss": 8.8,
    "description": "Grav is an open-source, flat-file content management system. Prior to version 1.7.45, Grav validates accessible functions through the Utils::isDangerousFunction function, but does not impose restrictions on twig functions like twig_array_map, allowing attackers to bypass the validation and execute arbitrary commands. Twig processing of static pages can be enabled in the front matter by any administrative user allowed to create or edit pages. As the Twig processor runs unsandboxed, this behavior can be used to gain arbitrary code execution and elevate privileges on the instance. Upgrading to patched version 1.7.45 can mitigate this issue.\n",
    "published": "2024-03-21T22:15:11.820",
    "keywords": "execution,command,bypass"
  },
  "CVE-2024-28118": {
    "cvss": 8.8,
    "description": "Grav is an open-source, flat-file content management system. Prior to version 1.7.45, due to the unrestricted access to twig extension class from Grav context, an attacker can redefine config variable. As a result, attacker can bypass a previous SSTI mitigation. Twig processing of static pages can be enabled in the front matter by any administrative user allowed to create or edit pages. As the Twig processor runs unsandboxed, this behavior can be used to gain arbitrary code execution and elevate privileges on the instance. Version 1.7.45 contains a fix for this issue.\n",
    "published": "2024-03-21T22:15:12.037",
    "keywords": "execution,bypass"
  },
  "CVE-2024-28119": {
    "cvss": 8.8,
    "description": "Grav is an open-source, flat-file content management system. Prior to version 1.7.45, due to the unrestricted access to twig extension class from grav context, an attacker can redefine the escape function and execute arbitrary commands. Twig processing of static pages can be enabled in the front matter by any administrative user allowed to create or edit pages. As the Twig processor runs unsandboxed, this behavior can be used to gain arbitrary code execution and elevate privileges on the instance. Version 1.7.45 contains a patch for this issue.",
    "published": "2024-03-21T22:15:12.233",
    "keywords": "execution,command"
  },
  "CVE-2024-29031": {
    "cvss": 7.5,
    "description": "Meshery is an open source, cloud native manager that enables the design and management of Kubernetes-based infrastructure and applications. A SQL injection vulnerability in Meshery prior to version 0.7.17 allows a remote attacker to obtain sensitive information via the `order` parameter of `GetMeshSyncResources`. Version 0.7.17 contains a patch for this issue.",
    "published": "2024-03-21T23:15:11.167",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-29271": {
    "cvss": "-",
    "description": "Reflected Cross-Site Scripting (XSS) vulnerability in VvvebJs before version 1.7.7, allows remote attackers to execute arbitrary code and obtain sensitive information via the action parameter in save.php.",
    "published": "2024-03-22T04:15:11.573",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-29272": {
    "cvss": "-",
    "description": "Arbitrary File Upload vulnerability in VvvebJs before version 1.7.5, allows unauthenticated remote attackers to execute arbitrary code and obtain sensitive information via the sanitizeFileName parameter in save.php.",
    "published": "2024-03-22T04:15:11.663",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-29273": {
    "url": "https://github.com/zyx0814/dzzoffice/issues/244",
    "cvss": "-",
    "description": "There is Stored Cross-Site Scripting (XSS) in dzzoffice 2.02.1 SC UTF8 in uploadfile to index.php, with the XSS payload in an SVG document.",
    "published": "2024-03-22T04:15:11.857"
  },
  "CVE-2024-29275": {
    "cvss": "-",
    "description": "SQL injection vulnerability in SeaCMS version 12.9, allows remote unauthenticated attackers to execute arbitrary code and obtain sensitive information via the id parameter in class.php.",
    "published": "2024-03-22T05:15:47.583",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-2812": {
    "cvss": 6.3,
    "description": "A vulnerability was found in Tenda AC15 15.03.05.18/15.03.20_multi. It has been classified as critical. This affects the function formWriteFacMac of the file /goform/WriteFacMac. The manipulation of the argument mac leads to os command injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-257667. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-03-22T07:15:46.283",
    "keywords": "remote,command"
  },
  "CVE-2024-2815": {
    "cvss": 8.8,
    "description": "A vulnerability classified as critical has been found in Tenda AC15 15.03.20_multi. Affected is the function R7WebsSecurityHandler of the file /goform/execCommand of the component Cookie Handler. The manipulation of the argument password leads to stack-based buffer overflow. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. VDB-257670 is the identifier assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-03-22T08:15:09.750",
    "keywords": "remote,command"
  },
  "CVE-2024-1742": {
    "cvss": 3.8,
    "description": "Invocation of the sqlplus command with sensitive information in the command line in the mk_oracle Checkmk agent plugin before Checkmk 2.3.0b4 (beta), 2.2.0p24, 2.1.0p41 and 2.0.0 (EOL) allows the extraction of this information from the process list.",
    "published": "2024-03-22T11:15:46.457",
    "keywords": "command,sensitive"
  },
  "CVE-2024-28861": {
    "cvss": 9.8,
    "description": "Symfony 1 is a community-driven fork of the 1.x branch of Symfony, a PHP framework for web projects. Starting in version 1.1.0 and prior to version 1.5.19, Symfony 1 has a gadget chain due to dangerous deserialization in `sfNamespacedParameterHolder` class that would enable an attacker to get remote code execution if a developer deserializes user input in their project. Version 1.5.19 contains a patch for the issue.",
    "published": "2024-03-22T17:15:07.770",
    "keywords": "remote,execution"
  },
  "CVE-2024-29184": {
    "cvss": 8.0,
    "description": "FreeScout is a self-hosted help desk and shared mailbox. A Stored Cross-Site Scripting (XSS) vulnerability has been identified within the Signature Input Field of the FreeScout Application prior to version 1.8.128. Stored XSS occurs when user input is not properly sanitized and is stored on the server, allowing an attacker to inject malicious scripts that will be executed when other users access the affected page. In this case, the Support Agent User can inject malicious scripts into their signature, which will then be executed when viewed by the Administrator.\n\nThe application protects users against XSS attacks by enforcing a CSP policy, the CSP Policy is:  `script-src 'self' 'nonce-abcd'  `. The CSP policy only allows the inclusion of JS files that are present on the application server and doesn't allow any inline script or script other than nonce-abcd. The CSP policy was bypassed by uploading a JS file to the server by a POST request to /conversation/upload endpoint. After this, a working XSS payload was crafted by including the uploaded JS file link as the src of the script. This bypassed the CSP policy and XSS attacks became possible.\n\nThe impact of this vulnerability is severe as it allows an attacker to compromise the FreeScout Application. By exploiting this vulnerability, the attacker can perform various malicious actions such as forcing the Administrator to execute actions without their knowledge or consent. For instance, the attacker can force the Administrator to add a new administrator controlled by the attacker, thereby giving the attacker full control over the application. Alternatively, the attacker can elevate the privileges of a low-privileged user to Administrator, further compromising the security of the application. Attackers can steal sensitive information such as login credentials, session tokens, personal identifiable information (PII), and financial data. The vulnerability can also lead to defacement of the Application.\n\nVersion 1.8.128 contains a patch for this issue.",
    "published": "2024-03-22T17:15:08.203",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-29385": {
    "cvss": "-",
    "description": "DIR-845L router <= v1.01KRb03 has an Unauthenticated remote code execution vulnerability in the cgibin binary via soapcgi_main function.",
    "published": "2024-03-22T17:15:08.943",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-2824": {
    "url": "https://github.com/matthias-wandel/jhead/issues/84",
    "cvss": 6.3,
    "description": "A vulnerability was found in Matthias-Wandel jhead 3.08 and classified as critical. This issue affects the function PrintFormatNumber of the file exif.c. The manipulation leads to heap-based buffer overflow. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-257711.",
    "published": "2024-03-22T18:15:08.063"
  }
}