{
  "CVE-2025-22395": {
    "cvss": 8.2,
    "description": "Dell Update Package Framework, versions prior to 22.01.02, contain(s) a Local Privilege Escalation Vulnerability. A local low privileged attacker could potentially exploit this vulnerability, leading to the execution of arbitrary remote scripts on the server. Exploitation may lead to a denial of service by an attacker.",
    "published": "2025-01-07T03:15:06.047",
    "keywords": "remote,execution"
  },
  "CVE-2025-0245": {
    "cvss": 3.3,
    "description": "Under certain circumstances, a user opt-in setting that Focus should require authentication before use could have been be bypassed. This vulnerability affects Firefox < 134.",
    "published": "2025-01-07T16:15:39.167",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-21622": {
    "url": "https://github.com/macwarrior/clipbucket-v5/commit/22329c4675e82c7c95e74024ba247f837ac9e00b",
    "cvss": 7.5,
    "description": "ClipBucket V5 provides open source video hosting with PHP. During the user avatar upload workflow, a user can choose to upload and change their avatar at any time. During deletion, ClipBucket checks for the avatar_url as a filepath within the avatars subdirectory. If the URL path exists within the avatars directory, ClipBucket will delete it. There is no check for path traversal sequences in the provided user input (stored in the DB as avatar_url) therefore the final $file variable could be tainted with path traversal sequences. This leads to file deletion outside of the intended scope of the avatars folder. This vulnerability is fixed in 5.5.1 - 237.",
    "published": "2025-01-07T16:15:40.510"
  },
  "CVE-2025-21623": {
    "url": "https://github.com/macwarrior/clipbucket-v5/commit/75d663f010cd8569eb9e278f030838174fb30188",
    "cvss": 7.5,
    "description": "ClipBucket V5 provides open source video hosting with PHP. Prior to 5.5.1 - 238, ClipBucket V5 allows unauthenticated attackers to change the template directory via a directory traversal, which results in a denial of service.",
    "published": "2025-01-07T16:15:40.690"
  },
  "CVE-2025-21624": {
    "url": "https://github.com/macwarrior/clipbucket-v5/commit/893bfb0f1236c4a59b5e2843ab8d27a1e491b12b",
    "cvss": 9.8,
    "description": "ClipBucket V5 provides open source video hosting with PHP. Prior to 5.5.1 - 239, a file upload vulnerability exists in the Manage Playlist functionality of the application, specifically surrounding the uploading of playlist cover images. Without proper checks, an attacker can upload a PHP script file instead of an image file, thus allowing a webshell or other malicious files to be stored and executed on the server. This attack vector exists in both the admin area and low-level user area. This vulnerability is fixed in 5.5.1 - 239.",
    "published": "2025-01-07T16:15:40.853"
  },
  "CVE-2025-20123": {
    "cvss": 4.8,
    "description": "Multiple vulnerabilities in the web-based management interface of Cisco Crosswork Network Controller could allow an authenticated, remote attacker to conduct cross-site scripting (XSS) attacks against users of the interface of an affected system.\r\n\r\nThese vulnerabilities exist because the web-based management interface does not properly validate user-supplied input. An attacker could exploit these vulnerabilities by inserting malicious data into specific data fields in the interface. A successful exploit could allow the attacker to execute arbitrary script code in the context of the affected interface or access sensitive, browser-based information. To exploit these vulnerabilities, the attacker must have valid administrative credentials.\r\nCisco has released software updates that address these vulnerabilities. There are no workarounds that address these vulnerabilities.",
    "published": "2025-01-08T16:15:38.150",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-20126": {
    "cvss": 4.8,
    "description": "A vulnerability in certification validation routines of Cisco ThousandEyes Endpoint Agent for macOS and RoomOS could allow an unauthenticated, remote attacker to intercept or manipulate metrics information.\r\n\r\nThis vulnerability exists because the affected software does not properly validate certificates for hosted metrics services. An on-path attacker could exploit this vulnerability by intercepting network traffic using a crafted certificate. A successful exploit could allow the attacker to masquerade as a trusted host and monitor or change communications between the remote metrics service and the vulnerable client.",
    "published": "2025-01-08T16:15:38.357",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-22137": {
    "cvss": 9.8,
    "description": "Pingvin Share is a self-hosted file sharing platform and an alternative for WeTransfer. This vulnerability allows an authenticated or unauthenticated (if anonymous shares are allowed) user to overwrite arbitrary files on the server, including sensitive system files, via HTTP POST requests. The issue has been patched in version 1.4.0.",
    "published": "2025-01-08T16:15:38.920",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-20166": {
    "cvss": 5.4,
    "description": "A vulnerability in the web-based management interface of Cisco Common Services Platform Collector (CSPC) could allow an authenticated, remote attacker to conduct cross-site scripting (XSS) attacks against a user of the interface.\r\n\r\nThis vulnerability is due to insufficient validation of user-supplied input by the web-based management interface of an affected system. An attacker could exploit this vulnerability by injecting malicious code into specific pages of the interface. A successful exploit could allow the attacker to execute arbitrary script code in the context of the affected interface or access sensitive, browser-based information. To exploit this vulnerability, the attacker must have at least a low-privileged account on an affected device.\r\nCisco has not released software updates that address this vulnerability. There are no workarounds that address this vulnerability.",
    "published": "2025-01-08T17:15:16.990",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-20167": {
    "cvss": 5.4,
    "description": "A vulnerability in the web-based management interface of Cisco Common Services Platform Collector (CSPC) could allow an authenticated, remote attacker to conduct cross-site scripting (XSS) attacks against a user of the interface.\r\n\r\nThis vulnerability is due to insufficient validation of user-supplied input by the web-based management interface of an affected system. An attacker could exploit this vulnerability by injecting malicious code into specific pages of the interface. A successful exploit could allow the attacker to execute arbitrary script code in the context of the affected interface or access sensitive, browser-based information. To exploit this vulnerability, the attacker must have at least a low-privileged account on an affected device.\r\nCisco has not released software updates that address this vulnerability. There are no workarounds that address this vulnerability.",
    "published": "2025-01-08T17:15:17.163",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-20168": {
    "cvss": 5.4,
    "description": "A vulnerability in the web-based management interface of Cisco Common Services Platform Collector (CSPC) could allow an authenticated, remote attacker to conduct cross-site scripting (XSS) attacks against a user of the interface.\r\n\r\nThis vulnerability is due to insufficient validation of user-supplied input by the web-based management interface of an affected system. An attacker could exploit this vulnerability by injecting malicious code into specific pages of the interface. A successful exploit could allow the attacker to execute arbitrary script code in the context of the affected interface or access sensitive, browser-based information. To exploit this vulnerability, the attacker must have at least a low-privileged account on an affected device.\r\nCisco has not released software updates that address this vulnerability. There are no workarounds that address this vulnerability.",
    "published": "2025-01-08T17:15:17.323",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-0282": {
    "cvss": 9.0,
    "description": "A stack-based buffer overflow in Ivanti Connect Secure before version 22.7R2.5, Ivanti Policy Secure before version 22.7R1.2, and Ivanti Neurons for ZTA gateways before version 22.7R2.3 allows a remote unauthenticated attacker to achieve remote code execution.",
    "published": "2025-01-08T23:15:09.763",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2025-0328": {
    "cvss": 7.3,
    "description": "A vulnerability, which was classified as critical, has been found in KaiYuanTong ECT Platform up to 2.0.0. Affected by this issue is some unknown functionality of the file /public/server/runCode.php of the component HTTP POST Request Handler. The manipulation of the argument code leads to command injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2025-01-09T05:15:07.997",
    "keywords": "remote,command"
  },
  "CVE-2025-21592": {
    "cvss": 5.5,
    "description": "An Exposure of Sensitive Information to an Unauthorized Actor vulnerability in the command-line interface (CLI) of Juniper Networks Junos OS on SRX Series devices allows a local, low-privileged user with access to the Junos CLI to view the contents of sensitive files on the file system.\n\nThrough the execution of either 'show services advanced-anti-malware' or 'show services security-intelligence' command, a user with limited permissions (e.g., a low privilege login class user) can access protected files that should not be accessible to the user. These files may contain sensitive information that can be used to cause further impact to the system.\n\n\nThis issue affects Junos OS SRX Series:\n\n\n\n  *  All versions before 21.4R3-S8,\n\n  *  from 22.2 before 22.2R3-S5,\n\n  *  from 22.3 before 22.3R3-S3,\n  *  from 22.4 before 22.4R3-S2,\n\n  *  from 23.2 before 23.2R2-S1,\n\n  *  from 23.4 before 23.4R2.",
    "published": "2025-01-09T17:15:18.203",
    "keywords": "execution,command,sensitive"
  },
  "CVE-2025-21596": {
    "cvss": 5.5,
    "description": "An Improper Handling of Exceptional Conditions vulnerability in the command-line processing of Juniper Networks Junos OS on SRX1500, SRX4100, and SRX4200 devices allows a local, low-privileged authenticated attacker executing the 'show chassis environment pem' command to cause the chassis daemon (chassisd) to crash and restart, resulting in a temporary Denial of Service (DoS). However, repeated execution of this command will eventually cause the chassisd process to fail to restart, impacting packet processing on the system.\n\nThis issue affects Junos OS on SRX1500, SRX4100, SRX4200: \n\n\n\n  *  All versions before 21.4R3-S9, \n  *  from 22.2 before 22.2R3-S5, \n  *  from 22.3 before 22.3R3-S4, \n  *  from 22.4 before 22.4R3-S4, \n  *  from 23.2 before 23.2R2-S3, \n  *  from 23.4 before 23.4R2-S1.",
    "published": "2025-01-09T17:15:18.593",
    "keywords": "execution,command"
  },
  "CVE-2025-21598": {
    "cvss": 7.5,
    "description": "An Out-of-bounds Read vulnerability in Juniper Networks Junos OS and Junos OS Evolved's routing protocol daemon (rpd) allows an unauthenticated, network-based attacker to send malformed BGP packets to a device configured with packet receive trace options enabled to crash rpd.\nThis issue affects:\n\nJunos OS: \n\n\n\n  *  from 21.2R3-S8 before 21.2R3-S9, \n  *  from 21.4R3-S7 before 21.4R3-S9, \n  *  from 22.2R3-S4 before 22.2R3-S5, \n  *  from 22.3R3-S2 before 22.3R3-S4, \n  *  from 22.4R3 before 22.4R3-S5, \n  *  from 23.2R2 before 23.2R2-S2, \n  *  from 23.4R1 before 23.4R2-S1, \n  *  from 24.2R1 before 24.2R1-S1, 24.2R2.\n\n\nJunos OS Evolved:\n  *  from 21.4R3-S7-EVO before 21.4R3-S9-EVO, \n  *  from 22.2R3-S4-EVO before 22.2R3-S5-EVO, \n  *  from 22.3R3-S2-EVO before 22.3R3-S4-EVO, \n  *  from 22.4R3-EVO before 22.4R3-S5-EVO, \n  *  from 23.2R2-EVO before 23.2R2-S2-EVO, \n  *  from 23.4R1-EVO before 23.4R2-S1-EVO, \n  *  from 24.2R1-EVO before 24.2R1-S2-EVO, 24.2R2-EVO.\n\n\nThis issue requires a BGP session to be established.\n\nThis issue can propagate and multiply through multiple ASes until reaching vulnerable devices.\n\nThis issue affects iBGP and eBGP.\n\nThis issue affects IPv4 and IPv6.\n\nAn indicator of compromise may be the presence of malformed update messages in a neighboring AS which is unaffected by this issue:\n\nFor example, by issuing the command on the neighboring device:\n show log messages\n\nReviewing for similar messages from devices within proximity to each other may indicate this malformed packet is propagating:\n  rpd[<pid>]: Received malformed update from <IP address> (External AS <AS#>)\nand\n  rpd[<pid>]: Malformed Attribute",
    "published": "2025-01-09T19:15:20.123",
    "keywords": "unauthenticated,command"
  }
}