{
  "CVE-2024-26333": {
    "url": "https://github.com/matthiaskramm/swftools/issues/219",
    "cvss": "-",
    "description": "swftools v0.9.2 was discovered to contain a segmentation violation via the function free_lines at swftools/lib/modules/swfshape.c.",
    "published": "2024-03-05T08:15:39.500"
  },
  "CVE-2024-26334": {
    "url": "https://github.com/matthiaskramm/swftools/issues/221",
    "cvss": "-",
    "description": "swftools v0.9.2 was discovered to contain a segmentation violation via the function compileSWFActionCode at swftools/lib/action/actioncompiler.c.",
    "published": "2024-03-05T09:15:45.040"
  },
  "CVE-2024-26335": {
    "url": "https://github.com/matthiaskramm/swftools/issues/222",
    "cvss": "-",
    "description": "swftools v0.9.2 was discovered to contain a segmentation violation via the function state_free at swftools/src/swfc-history.c.",
    "published": "2024-03-05T09:15:45.100"
  },
  "CVE-2024-26337": {
    "url": "https://github.com/matthiaskramm/swftools/issues/223",
    "cvss": "-",
    "description": "swftools v0.9.2 was discovered to contain a segmentation violation via the function s_font at swftools/src/swfc.c.",
    "published": "2024-03-05T09:15:45.143"
  },
  "CVE-2024-26339": {
    "url": "https://github.com/matthiaskramm/swftools/issues/225",
    "cvss": "-",
    "description": "swftools v0.9.2 was discovered to contain a strcpy parameter overlap via /home/swftools/src/swfc+0x48318a.",
    "published": "2024-03-05T09:15:45.190"
  },
  "CVE-2024-2188": {
    "cvss": 6.1,
    "description": "Cross-Site Scripting (XSS) vulnerability stored in TP-Link Archer AX50 affecting firmware version 1.0.11 build 2022052. This vulnerability could allow an unauthenticated attacker to create a port mapping rule via a SOAP request and store a malicious JavaScript payload within that rule, which could result in an execution of the JavaScript payload when the rule is loaded.",
    "published": "2024-03-05T13:15:07.203",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-27622": {
    "cvss": "-",
    "description": "A remote code execution vulnerability has been identified in the User Defined Tags module of CMS Made Simple version 2.2.19. This vulnerability arises from inadequate sanitization of user-supplied input in the 'Code' section of the module. As a result, authenticated users with administrative privileges can inject and execute arbitrary PHP code.",
    "published": "2024-03-05T14:15:49.030",
    "keywords": "remote,execution"
  },
  "CVE-2024-27564": {
    "url": "https://github.com/dirk1983/chatgpt/issues/114",
    "cvss": "-",
    "description": "A Server-Side Request Forgery (SSRF) in pictureproxy.php of ChatGPT commit f9f4bbc allows attackers to force the application to make arbitrary requests via injection of crafted URLs into the urlparameter.",
    "published": "2024-03-05T17:15:06.997"
  },
  "CVE-2024-27565": {
    "url": "https://github.com/dirk1983/chatgpt-wechat-personal/issues/4",
    "cvss": "-",
    "description": "A Server-Side Request Forgery (SSRF) in weixin.php of ChatGPT-wechat-personal commit a0857f6 allows attackers to force the application to make arbitrary requests.",
    "published": "2024-03-05T17:15:07.050"
  },
  "CVE-2024-25858": {
    "cvss": "-",
    "description": "In Foxit PDF Reader before 2024.1 and PDF Editor before 2024.1, code execution via JavaScript could occur because of an unoptimized prompt message for users to review parameters of commands.",
    "published": "2024-03-05T21:15:09.030",
    "keywords": "execution,command"
  },
  "CVE-2024-24275": {
    "cvss": "-",
    "description": "Cross Site Scripting vulnerability in Teamwire Windows desktop client v.2.0.1 through v.2.4.0 allows a remote attacker to obtain sensitive information via a crafted payload to the global search function.",
    "published": "2024-03-05T23:15:07.520",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-24276": {
    "cvss": "-",
    "description": "Cross Site Scripting (XSS) vulnerability in Teamwire Windows desktop client v.2.0.1 through v.2.4.0 allows a remote attacker to obtain sensitive information via a crafted payload to the chat name, message preview, username and group name components.",
    "published": "2024-03-05T23:15:07.583",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-24278": {
    "cvss": "-",
    "description": "An issue in Teamwire Windows desktop client v.2.0.1 through v.2.4.0 allows a remote attacker to obtain sensitive information via a crafted payload to the message function.",
    "published": "2024-03-05T23:15:07.633",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-27765": {
    "cvss": "-",
    "description": "Directory Traversal vulnerability in Jeewms v.3.7 and before allows a remote attacker to obtain sensitive information via the cgformTemplateController component.",
    "published": "2024-03-05T23:15:08.050",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-20292": {
    "cvss": 4.4,
    "description": "A vulnerability in the logging component of Cisco Duo Authentication for Windows Logon and RDP could allow an authenticated, local attacker to view sensitive information in clear text on an affected system. \r\n\r This vulnerability is due to improper storage of an unencrypted registry key in certain logs. An attacker could exploit this vulnerability by accessing the logs on an affected system. A successful exploit could allow the attacker to view sensitive information in clear text.",
    "published": "2024-03-06T17:15:08.797",
    "keywords": "authentication,sensitive"
  },
  "CVE-2024-20301": {
    "cvss": 6.2,
    "description": "A vulnerability in Cisco Duo Authentication for Windows Logon and RDP could allow an authenticated, physical attacker to bypass secondary authentication and access an affected Windows device. \r\n\r This vulnerability is due to a failure to invalidate locally created trusted sessions after a reboot of the affected device. An attacker with primary user credentials could exploit this vulnerability by attempting to authenticate to an affected device. A successful exploit could allow the attacker to access the affected device without valid permissions.",
    "published": "2024-03-06T17:15:08.987",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-20335": {
    "cvss": 6.5,
    "description": "A vulnerability in the web-based management interface of Cisco Small Business 100, 300, and 500 Series Wireless APs could allow an authenticated, remote attacker to perform command injection attacks against an affected device. In order to exploit this vulnerability, the attacker must have valid administrative credentials for the device. This vulnerability is due to insufficient validation of user-supplied input. An attacker could exploit this vulnerability by sending a crafted HTTP request to the web-based management interface of an affected device. A successful exploit could allow the attacker to execute arbitrary code as the root user on the underlying operating system.",
    "published": "2024-03-06T17:15:09.193",
    "keywords": "remote,command"
  },
  "CVE-2024-20337": {
    "cvss": 8.2,
    "description": "A vulnerability in the SAML authentication process of Cisco Secure Client could allow an unauthenticated, remote attacker to conduct a carriage return line feed (CRLF) injection attack against a user. \r\n\r This vulnerability is due to insufficient validation of user-supplied input. An attacker could exploit this vulnerability by persuading a user to click a crafted link while establishing a VPN session. A successful exploit could allow the attacker to execute arbitrary script code in the browser or access sensitive, browser-based information, including a valid SAML token. The attacker could then use the token to establish a remote access VPN session with the privileges of the affected user. Individual hosts and services behind the VPN headend would still need additional credentials for successful access.",
    "published": "2024-03-06T17:15:09.580",
    "keywords": "remote,unauthenticated,authentication,sensitive,vpn"
  },
  "CVE-2024-20345": {
    "cvss": 6.5,
    "description": "A vulnerability in the file upload functionality of Cisco AppDynamics Controller could allow an authenticated, remote attacker to conduct directory traversal attacks on an affected device. \r\n\r This vulnerability is due to insufficient validation of user-supplied input. An attacker could exploit this vulnerability by sending a crafted request to an affected device. A successful exploit could allow the attacker to access sensitive data on an affected device.",
    "published": "2024-03-06T17:15:09.973",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-20346": {
    "cvss": 5.4,
    "description": "A vulnerability in the web-based management interface of Cisco AppDynamics Controller could allow an authenticated, remote attacker to perform a reflected cross-site scripting (XSS) attack against a user of the interface of an affected device.\r\n\r This vulnerability is due to insufficient validation of user-supplied input by the web-based management interface. An attacker could exploit this vulnerability by persuading a user to click a malicious link. A successful exploit could allow the attacker to execute arbitrary script code in the context of the affected interface or access sensitive, browser-based information.",
    "published": "2024-03-06T17:15:10.173",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-27287": {
    "cvss": 6.5,
    "description": "ESPHome is a system to control your ESP8266/ESP32 for Home Automation systems. Starting in version 2023.12.9 and prior to version 2024.2.2, editing the configuration file API in dashboard component of ESPHome version 2023.12.9 (command line installation and Home Assistant add-on) serves unsanitized data with `Content-Type: text/html; charset=UTF-8`, allowing a remote authenticated user to inject arbitrary web script and exfiltrate session cookies via Cross-Site scripting. It is possible for a malicious authenticated user to inject arbitrary Javascript in configuration files using a POST request to the /edit endpoint, the configuration parameter allows to specify the file to write. To trigger the XSS vulnerability, the victim must visit the page` /edit?configuration=[xss file]`. Abusing this vulnerability a malicious actor could perform operations on the dashboard on the behalf of a logged user, access sensitive information, create, edit and delete configuration files and flash firmware on managed boards.\nIn addition to this, cookies are not correctly secured, allowing the exfiltration of session cookie values. Version 2024.2.2 contains a patch for this issue.\n",
    "published": "2024-03-06T19:15:07.723",
    "keywords": "remote,command,sensitive"
  },
  "CVE-2024-27307": {
    "cvss": 9.8,
    "description": "JSONata is a JSON query and transformation language. Starting in version 1.4.0 and prior to version 1.8.7 and 2.0.4, a malicious expression can use the transform operator to override properties on the `Object` constructor and prototype. This may lead to denial of service, remote code execution or other unexpected behavior in applications that evaluate user-provided JSONata expressions. This issue has been fixed in JSONata versions 1.8.7 and 2.0.4. Applications that evaluate user-provided expressions should update ASAP to prevent exploitation. As a workaround, one may apply the patch manually.",
    "published": "2024-03-06T20:15:47.537",
    "keywords": "remote,execution"
  },
  "CVE-2024-28111": {
    "url": "https://github.com/thinkst/canarytokens/commit/c595a1f884b986da2ca05aa5bff9ae5f93c6a4aa",
    "cvss": 6.5,
    "description": "Canarytokens helps track activity and actions on a network. Canarytokens.org supports exporting the history of a Canarytoken's incidents in CSV format. The generation of these CSV files is vulnerable to a CSV Injection vulnerability. This flaw can be used by an attacker who discovers an HTTP-based Canarytoken to target the Canarytoken's owner, if the owner exports the incident history to CSV and opens in a reader application such as Microsoft Excel. The impact is that this issue could lead to code execution on the machine on which the CSV file is opened. Version sha-c595a1f8 contains a fix for this issue.",
    "published": "2024-03-06T22:15:57.780"
  },
  "CVE-2024-24375": {
    "cvss": "-",
    "description": "SQL injection vulnerability in Jfinalcms v.5.0.0 allows a remote attacker to obtain sensitive information via /admin/admin name parameter.",
    "published": "2024-03-07T01:15:52.707",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-0815": {
    "cvss": 9.3,
    "description": "Command injection in paddle.utils.download._wget_download (bypass filter) in paddlepaddle/paddle 2.6.0",
    "published": "2024-03-07T04:15:07.143",
    "keywords": "command,bypass"
  },
  "CVE-2024-28213": {
    "cvss": "-",
    "description": "nGrinder before 3.5.9 allows to accept serialized Java objects from unauthenticated users, which could allow remote attacker to execute arbitrary code via unsafe Java objects deserialization.",
    "published": "2024-03-07T05:15:54.710",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-1720": {
    "cvss": 4.7,
    "description": "The User Registration – Custom Registration Form, Login Form, and User Profile WordPress Plugin plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the 'Display Name' parameter in all versions up to, and including, 3.1.4 due to insufficient input sanitization and output escaping. This makes it possible for unauthenticated attackers to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page. This vulnerability requires social engineering to successfully exploit, and the impact would be very limited due to the attacker requiring a user to login as the user with the injected payload for execution.",
    "published": "2024-03-07T06:15:50.630",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-0917": {
    "cvss": 9.4,
    "description": "remote code execution in paddlepaddle/paddle 2.6.0",
    "published": "2024-03-07T09:15:38.527",
    "keywords": "remote,execution"
  },
  "CVE-2024-1382": {
    "cvss": 8.8,
    "description": "The Restaurant Reservations plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 1.9 via the nd_rst_layout attribute of the nd_rst_search shortcode. This makes it possible for authenticated attackers, with contributor-level access and above, to include and execute arbitrary PHP files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where an uploaded PHP file may not be directly accessible.",
    "published": "2024-03-07T09:15:38.723",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-1986": {
    "cvss": 8.8,
    "description": "The Booster Elite for WooCommerce plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the wc_add_new_product() function in all versions up to, and including, 7.1.7. This makes it possible for customer-level attackers, and above, to upload arbitrary files on the affected site's server which may make remote code execution possible. This is only exploitable when the user product upload functionality is enabled.",
    "published": "2024-03-07T21:15:08.013",
    "keywords": "remote,execution"
  },
  "CVE-2024-2044": {
    "url": "https://github.com/pgadmin-org/pgadmin4/issues/7258",
    "cvss": 4.6,
    "description": "pgAdmin 4 uses a file-based session management approach. The session files are saved on disk as pickle objects. When a user performs a request, the value of the session cookie 'pga4_session' is used to retrieve the file, then its content is deserialised, and finally its signature verified.\nThe cookie value is split in 2 parts at the first '!' character. The first part is the session ID (sid), while the second is the session digest.\n The vulnerability lies in versions of pgAdmin prior to 8.4 where a method loads session files by concatenating the sessions folder - located inside the pgAdmin 4 DATA_DIR - with the session ID. Precisely, the two values are concatenated using the ['os.path.join'] function. It does not set a trusted base-path which should not be escaped\n",
    "published": "2024-03-07T21:15:08.767"
  },
  "CVE-2024-2265": {
    "cvss": 5.3,
    "description": "A vulnerability, which was classified as problematic, was found in keerti1924 PHP-MYSQL-User-Login-System 1.0. This affects an unknown part of the file login.sql. The manipulation leads to inclusion of sensitive information in source code. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-256035. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-03-07T22:15:58.220",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-23239": {
    "cvss": "-",
    "description": "A race condition was addressed with improved state handling. This issue is fixed in tvOS 17.4, iOS 17.4 and iPadOS 17.4, macOS Sonoma 14.4, watchOS 10.4. An app may be able to leak sensitive user information.",
    "published": "2024-03-08T02:15:48.063",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-23241": {
    "cvss": "-",
    "description": "This issue was addressed through improved state management. This issue is fixed in tvOS 17.4, iOS 17.4 and iPadOS 17.4, macOS Sonoma 14.4. An app may be able to leak sensitive user information.",
    "published": "2024-03-08T02:15:48.153",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-26309": {
    "cvss": 5.3,
    "description": "Archer Platform 6.x before 6.14 P2 HF2 (6.14.0.2.2) contains a sensitive information disclosure vulnerability. An unauthenticated attacker could potentially obtain access to sensitive information via an internal URL.",
    "published": "2024-03-08T02:15:50.640",
    "keywords": "unauthenticated,sensitive"
  }
}