{
  "CVE-2024-2413": {
    "cvss": 9.8,
    "description": "Intumit SmartRobot uses a fixed encryption key for authentication. Remote attackers can use this key to encrypt a string composed of the user's name and timestamp to generate an authentication code. With this authentication code, they can obtain administrator privileges and subsequently execute arbitrary code on the remote server using built-in system functionality.",
    "published": "2024-03-13T03:15:06.793",
    "keywords": "remote,authentication"
  },
  "CVE-2024-26529": {
    "url": "https://github.com/mz-automation/libiec61850/issues/495",
    "cvss": "-",
    "description": "An issue in mz-automation libiec61850 v.1.5.3 and before, allows a remote attacker to cause a denial of service (DoS) via the mmsServer_handleDeleteNamedVariableListRequest function of src/mms/iso_mms/server/mms_named_variable_list_service.c.",
    "published": "2024-03-13T08:15:43.410"
  },
  "CVE-2024-1979": {
    "url": "https://github.com/quarkusio/quarkus/issues/38055",
    "cvss": 3.5,
    "description": "A vulnerability was found in Quarkus. In certain conditions related to the CI process, git credentials could be inadvertently published, which could put the git repository at risk.",
    "published": "2024-03-13T10:15:08.153"
  },
  "CVE-2024-0368": {
    "cvss": 8.6,
    "description": "The Hustle – Email Marketing, Lead Generation, Optins, Popups plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 7.8.3 via hardcoded API Keys. This makes it possible for unauthenticated attackers to extract sensitive data including PII.",
    "published": "2024-03-13T16:15:10.623",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-0681": {
    "cvss": 5.3,
    "description": "The Page Restriction WordPress (WP) – Protect WP Pages/Post plugin for WordPress is vulnerable to information disclosure in all versions up to, and including, 1.3.4. This is due to the plugin not properly restricting access to pages via the REST API when a page has been made private. This makes it possible for unauthenticated attackers to view protected pages. The vendor has decided that they will not implement REST API protection on posts and pages and the restrictions will only apply to the front-end of the site. The vendors solution was to add notices throughout the dashboard and recommends installing the WordPress REST API Authentication plugin for REST API coverage.",
    "published": "2024-03-13T16:15:12.767",
    "keywords": "unauthenticated,authentication"
  },
  "CVE-2024-0839": {
    "cvss": 5.3,
    "description": "The FeedWordPress plugin for WordPress is vulnerable to Insecure Direct Object Reference in all versions up to, and including, 2022.0222 due to missing validation on the user controlled 'guid' key. This makes it possible for unauthenticated attackers to view draft posts that may contain sensitive information.",
    "published": "2024-03-13T16:15:14.537",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-1071": {
    "cvss": 9.8,
    "description": "The Ultimate Member – User Profile, Registration, Login, Member Directory, Content Restriction & Membership Plugin plugin for WordPress is vulnerable to SQL Injection via the 'sorting' parameter in versions 2.1.3 to 2.8.2 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-03-13T16:15:16.293",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-1083": {
    "cvss": 5.3,
    "description": "The Simple Restrict plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 1.2.6 via the REST API. This makes it possible for authenticated attackers to bypass the plugin's restrictions to extract post titles and content",
    "published": "2024-03-13T16:15:16.940",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-1311": {
    "cvss": 8.8,
    "description": "The Brizy – Page Builder plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the storeImages function in all versions up to, and including, 2.4.40. This makes it possible for authenticated attackers, with contributor access or above, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-03-13T16:15:19.450",
    "keywords": "remote,execution"
  },
  "CVE-2024-1321": {
    "cvss": 5.3,
    "description": "The EventPrime – Events Calendar, Bookings and Tickets plugin for WordPress is vulnerable to payment bypass in all versions up to, and including, 3.4.2. This is due to the plugin allowing unauthenticated users to update the status of order payments. This makes it possible for unauthenticated attackers to book events for free.",
    "published": "2024-03-13T16:15:19.663",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2024-1985": {
    "cvss": 4.7,
    "description": "The Simple Membership plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the 'Display Name' parameter in all versions up to, and including, 4.4.2 due to insufficient input sanitization and output escaping. This makes it possible for unauthenticated attackers to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page. This vulnerability requires social engineering to successfully exploit, and the impact would be very limited due to the attacker requiring a user to login as the user with the injected payload for execution.",
    "published": "2024-03-13T16:15:28.753",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-2106": {
    "cvss": 5.3,
    "description": "The MasterStudy LMS WordPress Plugin – for Online Courses and Education plugin for WordPress is vulnerable to Information Exposure in versions up to, and including, 3.2.10. This can allow unauthenticated attackers to extract sensitive data including all registered user's username and email addresses which can be used to help perform future attacks.",
    "published": "2024-03-13T16:15:31.703",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-20262": {
    "cvss": 6.5,
    "description": "A vulnerability in the Secure Copy Protocol (SCP) and SFTP feature of Cisco IOS XR Software could allow an authenticated, local attacker to create or overwrite files in a system directory, which could lead to a denial of service (DoS) condition. The attacker would require valid user credentials to perform this attack.\r\n\r This vulnerability is due to a lack of proper validation of SCP and SFTP CLI input parameters. An attacker could exploit this vulnerability by authenticating to the device and issuing SCP or SFTP CLI commands with specific parameters. A successful exploit could allow the attacker to impact the functionality of the device, which could lead to a DoS condition. The device may need to be manually rebooted to recover.\r\n\r Note: This vulnerability is exploitable only when a local user invokes SCP or SFTP commands at the Cisco IOS XR CLI. A local user with administrative privileges could exploit this vulnerability remotely.",
    "published": "2024-03-13T17:15:47.187",
    "keywords": "remote,command"
  },
  "CVE-2024-20266": {
    "cvss": 5.3,
    "description": "A vulnerability in the DHCP version 4 (DHCPv4) server feature of Cisco IOS XR Software could allow an unauthenticated, remote attacker to trigger a crash of the dhcpd process, resulting in a denial of service (DoS) condition.\r\n\r This vulnerability exists because certain DHCPv4 messages are improperly validated when they are processed by an affected device. An attacker could exploit this vulnerability by sending a malformed DHCPv4 message to an affected device. A successful exploit could allow the attacker to cause a crash of the dhcpd process. While the dhcpd process is restarting, which may take approximately two minutes, DHCPv4 server services are unavailable on the affected device. This could temporarily prevent network access to clients that join the network during that time period and rely on the DHCPv4 server of the affected device.\r\n\r Notes: \r\n\r \r Only the dhcpd process crashes and eventually restarts automatically. The router does not reload.\r This vulnerability only applies to DHCPv4. DHCP version 6 (DHCPv6) is not affected.",
    "published": "2024-03-13T17:15:47.407",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20315": {
    "cvss": 5.8,
    "description": "A vulnerability in the access control list (ACL) processing on MPLS interfaces in the ingress direction of Cisco IOS XR Software could allow an unauthenticated, remote attacker to bypass a configured ACL.\r\n\r This vulnerability is due to improper assignment of lookup keys to internal interface contexts. An attacker could exploit this vulnerability by attempting to send traffic through an affected device. A successful exploit could allow the attacker to access resources behind the affected device that were supposed to be protected by a configured ACL.",
    "published": "2024-03-13T17:15:47.607",
    "keywords": "remote,unauthenticated,bypass"
  },
  "CVE-2024-20319": {
    "cvss": 4.3,
    "description": "A vulnerability in the UDP forwarding code of Cisco IOS XR Software could allow an unauthenticated, adjacent attacker to bypass configured management plane protection policies and access the Simple Network Management Plane (SNMP) server of an affected device.\r\n\r This vulnerability is due to incorrect UDP forwarding programming when using SNMP with management plane protection. An attacker could exploit this vulnerability by attempting to perform an SNMP operation using broadcast as the destination address that could be processed by an affected device that is configured with an SNMP server. A successful exploit could allow the attacker to communicate to the device on the configured SNMP ports. Although an unauthenticated attacker could send UDP datagrams to the configured SNMP port, only an authenticated user can retrieve or modify data using SNMP requests.",
    "published": "2024-03-13T17:15:48.003",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2024-20322": {
    "cvss": 5.8,
    "description": "A vulnerability in the access control list (ACL) processing on Pseudowire interfaces in the ingress direction of Cisco IOS XR Software could allow an unauthenticated, remote attacker to bypass a configured ACL.\r\n\r This vulnerability is due to improper assignment of lookup keys to internal interface contexts. An attacker could exploit this vulnerability by attempting to send traffic through an affected device. A successful exploit could allow the attacker to access resources behind the affected device that were supposed to be protected by a configured ACL.",
    "published": "2024-03-13T17:15:48.407",
    "keywords": "remote,unauthenticated,bypass"
  },
  "CVE-2024-2403": {
    "cvss": "-",
    "description": "\nImproper cleanup in temporary file handling component in Devolutions Remote Desktop Manager 2024.1.12 and\nearlier on Windows allows an attacker that compromised a user endpoint, under specific circumstances, to access sensitive information via residual files in the temporary directory.\n\n",
    "published": "2024-03-13T18:15:07.917",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-0799": {
    "cvss": 9.8,
    "description": "An authentication bypass vulnerability exists in Arcserve Unified Data Protection 9.2 and 8.1 in the edge-app-base-webui.jar!com.ca.arcserve.edge.app.base.ui.server.EdgeLoginServiceImpl.doLogin() function within wizardLogin.",
    "published": "2024-03-13T19:15:46.510",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-28194": {
    "cvss": 9.1,
    "description": "your_spotify is an open source, self hosted Spotify tracking dashboard. YourSpotify versions < 1.8.0 use a hardcoded JSON Web Token (JWT) secret to sign authentication tokens. Attackers can use this well-known value to forge valid authentication tokens for arbitrary users. This vulnerability allows attackers to bypass authentication and authenticate as arbitrary YourSpotify users, including admin users. This issue has been addressed in version 1.8.0. Users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-03-13T19:15:47.110",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-27097": {
    "url": "https://github.com/ckan/ckan/commit/81b56c55e5e3651d7fcf9642cd5a489a9b62212c",
    "cvss": 4.3,
    "description": "A user endpoint didn't perform filtering on an incoming parameter, which was added directly to the application log. This could lead to an attacker injecting false log entries or corrupt the log file format. This has been fixed in the CKAN versions 2.9.11 and 2.10.4. Users are advised to upgrade. Users unable to upgrade should override the `/user/reset` endpoint to filter the `id` parameter in order to exclude newlines.\n\n",
    "published": "2024-03-13T21:15:58.993"
  },
  "CVE-2024-28192": {
    "cvss": 5.3,
    "description": "your_spotify is an open source, self hosted Spotify tracking dashboard. YourSpotify version <1.8.0 is vulnerable to NoSQL injection in the public access token processing logic. Attackers can fully bypass the public token authentication mechanism, regardless if a public token has been generated before or not, without any user interaction or prerequisite knowledge. This vulnerability allows an attacker to fully bypass the public token authentication mechanism, regardless if a public token has been generated before or not, without any user interaction or prerequisite knowledge. This issue has been addressed in version 1.8.0. Users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-03-13T21:16:00.823",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-25228": {
    "cvss": "-",
    "description": "Vinchin Backup and Recovery 7.2 and Earlier is vulnerable to Authenticated Remote Code Execution (RCE) via the getVerifydiyResult function in ManoeuvreHandler.class.php.",
    "published": "2024-03-14T02:15:50.613",
    "keywords": "remote,execution"
  },
  "CVE-2024-1654": {
    "cvss": 7.2,
    "description": "This vulnerability potentially allows unauthorized write operations which may lead to remote code execution. An attacker must already have authenticated admin access and knowledge of both an internal system identifier and details of another valid user to exploit this. ",
    "published": "2024-03-14T03:15:08.033",
    "keywords": "remote,execution"
  },
  "CVE-2024-25651": {
    "cvss": "-",
    "description": "User enumeration can occur in the Authentication REST API in Delinea PAM Secret Server 11.4. This allows a remote attacker to determine whether a user is valid because of a difference in responses from the /oauth2/token endpoint.",
    "published": "2024-03-14T03:15:08.727",
    "keywords": "remote,authentication"
  },
  "CVE-2024-28388": {
    "cvss": "-",
    "description": "SQL injection vulnerability in SunnyToo stproductcomments module for PrestaShop v.1.0.5 and before, allows a remote attacker to escalate privileges and obtain sensitive information via the StProductCommentClass::getListcomments method.",
    "published": "2024-03-14T03:15:09.173",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-1882": {
    "cvss": 7.2,
    "description": "This vulnerability allows an already authenticated admin user to create a malicious payload that could be leveraged for remote code execution on the server hosting the PaperCut NG/MF application server.\n",
    "published": "2024-03-14T04:15:08.003",
    "keywords": "remote,execution"
  },
  "CVE-2024-22397": {
    "cvss": "-",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') in the SonicOS SSLVPN portal allows a remote authenticated attacker as a firewall 'admin' user to store and execute arbitrary JavaScript code.",
    "published": "2024-03-14T04:15:09.297",
    "keywords": "remote,vpn"
  },
  "CVE-2024-28390": {
    "cvss": "-",
    "description": "An issue in Advanced Plugins ultimateimagetool module for PrestaShop before v.2.2.01, allows a remote attacker to escalate privileges and obtain sensitive information via Improper Access Control.",
    "published": "2024-03-14T04:15:09.640",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-0313": {
    "cvss": 5.5,
    "description": "A malicious insider exploiting this vulnerability can circumvent existing security controls put in place by the organization. On the contrary, if the victim is legitimately using the temporary bypass to reach out to the Internet for retrieving application and system updates, a remote device could target it and undo the bypass, thereby denying the victim access to the update service, causing it to fail. ",
    "published": "2024-03-14T09:15:47.153",
    "keywords": "remote,bypass"
  },
  "CVE-2024-28849": {
    "cvss": 6.5,
    "description": "follow-redirects is an open source, drop-in replacement for Node's `http` and `https` modules that automatically follows redirects. In affected versions follow-redirects only clears authorization header during cross-domain redirect, but keep the proxy-authentication header which contains credentials too. This vulnerability may lead to credentials leak, but has been addressed in version 1.15.6. Users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-03-14T17:15:52.097",
    "keywords": "authentication,leak"
  },
  "CVE-2024-28181": {
    "cvss": 8.1,
    "description": " turbo_boost-commands is a set of commands to help you build robust reactive applications with Rails & Hotwire. TurboBoost Commands has existing protections in place to guarantee that only public methods on Command classes can be invoked; however, the existing checks aren't as robust as they should be. It's possible for a sophisticated attacker to invoke more methods than should be permitted depending on the the strictness of authorization checks that individual applications enforce. Being able to call some of these methods can have security implications. Commands verify that the class must be a `Command` and that the method requested is defined as a public method; however, this isn't robust enough to guard against all unwanted code execution. The library should more strictly enforce which methods are considered safe before allowing them to be executed. This issue has been addressed in versions 0.1.3, and 0.2.2. Users are advised to upgrade. Users unable to upgrade should see the repository GHSA for workaround advice.",
    "published": "2024-03-14T18:15:07.107",
    "keywords": "execution,command"
  },
  "CVE-2024-27266": {
    "cvss": 8.2,
    "description": "IBM Maximo Application Suite 7.6.1.3 is vulnerable to an XML External Entity Injection (XXE) attack when processing XML data. A remote attacker could exploit this vulnerability to expose sensitive information or consume memory resources.  IBM X-Force ID:  284566.",
    "published": "2024-03-14T19:15:50.420",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-0802": {
    "cvss": 9.8,
    "description": "Incorrect Pointer Scaling vulnerability in Mitsubishi Electric Corporation MELSEC-Q Series and MELSEC-L Series CPU modules allows a remote unauthenticated attacker to read arbitrary information from a target product or execute malicious code on a target product by sending a specially crafted packet.",
    "published": "2024-03-15T01:15:57.703",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-0803": {
    "cvss": 9.8,
    "description": "Integer Overflow or Wraparound vulnerability in Mitsubishi Electric Corporation MELSEC-Q Series and MELSEC-L Series CPU modules allows a remote unauthenticated attacker to execute malicious code on a target product by sending a specially crafted packet.",
    "published": "2024-03-15T01:15:57.997",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-1915": {
    "cvss": 9.8,
    "description": "Incorrect Pointer Scaling vulnerability in Mitsubishi Electric Corporation MELSEC-Q Series and MELSEC-L Series CPU modules allows a remote unauthenticated attacker to execute malicious code on a target product by sending a specially crafted packet.",
    "published": "2024-03-15T01:15:58.197",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-1916": {
    "cvss": 9.8,
    "description": "Integer Overflow or Wraparound vulnerability in Mitsubishi Electric Corporation MELSEC-Q Series and MELSEC-L Series CPU modules allows a remote unauthenticated attacker to execute malicious code on a target product by sending a specially crafted packet.",
    "published": "2024-03-15T01:15:58.390",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-1917": {
    "cvss": 9.8,
    "description": "Integer Overflow or Wraparound vulnerability in Mitsubishi Electric Corporation MELSEC-Q Series and MELSEC-L Series CPU modules allows a remote unauthenticated attacker to execute malicious code on a target product by sending a specially crafted packet.",
    "published": "2024-03-15T01:15:58.590",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-26540": {
    "url": "https://github.com/greyclab/cimg/issues/403",
    "cvss": "-",
    "description": "A heap-based buffer overflow in Clmg before 3.3.3 can occur via a crafted file to cimg_library::CImg<unsigned char>::_load_analyze.",
    "published": "2024-03-15T01:15:58.833"
  },
  "CVE-2024-25227": {
    "cvss": "-",
    "description": "SQL Injection vulnerability in ABO.CMS version 5.8, allows remote attackers to execute arbitrary code, cause a denial of service (DoS), escalate privileges, and obtain sensitive information via the tb_login parameter in admin login page.",
    "published": "2024-03-15T06:15:08.603",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-27756": {
    "cvss": "-",
    "description": "An issue in GLPI v.10.0.12 and before allows a remote attacker to execute arbitrary code, escalate privileges, and obtain sensitive information via a crafted script to the title field.",
    "published": "2024-03-15T07:15:09.923",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-23944": {
    "cvss": "-",
    "description": "Information disclosure in persistent watchers handling in Apache ZooKeeper due to missing ACL check. It allows an attacker to monitor child znodes by attaching a persistent watcher (addWatch command) to a parent which the attacker has already access to. ZooKeeper server doesn't do ACL check when the persistent watcher is triggered and as a consequence, the full path of znodes that a watch event gets triggered upon is exposed to the owner of the watcher. It's important to note that only the path is exposed by this vulnerability, not the data of znode, but since znode path can contain sensitive information like user name or login ID, this issue is potentially critical.\n\nUsers are recommended to upgrade to version 3.9.2, 3.8.4 which fixes the issue.\n",
    "published": "2024-03-15T11:15:08.927",
    "keywords": "command,sensitive"
  },
  "CVE-2024-28318": {
    "url": "https://github.com/gpac/gpac/issues/2764",
    "cvss": "-",
    "description": "gpac 2.3-DEV-rev921-g422b78ecf-master was discovered to contain a out of boundary write vulnerability via swf_get_string at scene_manager/swf_parse.c:325",
    "published": "2024-03-15T15:15:08.977"
  },
  "CVE-2024-28319": {
    "url": "https://github.com/gpac/gpac/issues/2763",
    "cvss": "-",
    "description": "gpac 2.3-DEV-rev921-g422b78ecf-master was discovered to contain an out of boundary read vulnerability via gf_dash_setup_period media_tools/dash_client.c:6374",
    "published": "2024-03-15T15:15:09.020"
  },
  "CVE-2024-2193": {
    "cvss": "-",
    "description": "A Speculative Race Condition (SRC) vulnerability that impacts modern CPU architectures supporting speculative execution (related to Spectre V1) has been disclosed. An unauthenticated attacker can exploit this vulnerability to disclose arbitrary data from the CPU using race conditions to access the speculative executable code paths.",
    "published": "2024-03-15T18:15:08.530",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-28252": {
    "url": "https://github.com/corewcf/corewcf/issues/1345",
    "cvss": 7.5,
    "description": "CoreWCF is a port of the service side of Windows Communication Foundation (WCF) to .NET Core. If you have a NetFraming based CoreWCF service, extra system resources could be consumed by connections being left established instead of closing or aborting them. There are two scenarios when this can happen. When a client established a connection to the service and sends no data, the service will wait indefinitely for the client to initiate the NetFraming session handshake. Additionally, once a client has established a session, if the client doesn't send any requests for the period of time configured in the binding ReceiveTimeout, the connection is not properly closed as part of the session being aborted. The bindings affected by this behavior are NetTcpBinding, NetNamedPipeBinding, and UnixDomainSocketBinding. Only NetTcpBinding has the ability to accept non local connections. The currently supported versions of CoreWCF are v1.4.x and v1.5.x. The fix can be found in v1.4.2 and v1.5.3 of the CoreWCF packages. Users are advised to upgrade. There are no workarounds for this issue.\n",
    "published": "2024-03-15T19:15:07.210"
  },
  "CVE-2024-28253": {
    "cvss": 9.4,
    "description": "OpenMetadata is a unified platform for discovery, observability, and governance powered by a central metadata repository, in-depth lineage, and seamless team collaboration. `CompiledRule::validateExpression` is also called from `PolicyRepository.prepare`. `prepare()` is called from `EntityRepository.prepareInternal()` which, in turn, gets called from `EntityResource.createOrUpdate()`. Note that even though there is an authorization check (`authorizer.authorize()`), it gets called after `prepareInternal()` gets called and therefore after the SpEL expression has been evaluated. In order to reach this method, an attacker can send a PUT request to `/api/v1/policies` which gets handled by `PolicyResource.createOrUpdate()`. This vulnerability was discovered with the help of CodeQL's Expression language injection (Spring) query and is also tracked as `GHSL-2023-252`. This issue may lead to Remote Code Execution and has been addressed in version 1.3.1. Users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-03-15T20:15:09.807",
    "keywords": "remote,execution"
  },
  "CVE-2024-28254": {
    "cvss": 8.8,
    "description": "OpenMetadata is a unified platform for discovery, observability, and governance powered by a central metadata repository, in-depth lineage, and seamless team collaboration. The `‎AlertUtil::validateExpression` method evaluates an SpEL expression using `getValue` which by default uses the `StandardEvaluationContext`, allowing the expression to reach and interact with Java classes such as `java.lang.Runtime`, leading to Remote Code Execution. The `/api/v1/events/subscriptions/validation/condition/<expression>` endpoint passes user-controlled data `AlertUtil::validateExpession` allowing authenticated (non-admin) users to execute arbitrary system commands on the underlaying operating system. In addition, there is a missing authorization check since `Authorizer.authorize()` is never called in the affected path and, therefore, any authenticated non-admin user is able to trigger this endpoint and evaluate arbitrary SpEL expressions leading to arbitrary command execution. This vulnerability was discovered with the help of CodeQL's Expression language injection (Spring) query and is also tracked as `GHSL-2023-235`. This issue may lead to Remote Code Execution and has been addressed in version 1.2.4. Users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-03-15T20:15:10.057",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-28255": {
    "cvss": 9.8,
    "description": "OpenMetadata is a unified platform for discovery, observability, and governance powered by a central metadata repository, in-depth lineage, and seamless team collaboration. The `JwtFilter` handles the API authentication by requiring and verifying JWT tokens. When a new request comes in, the request's path is checked against this list. When the request's path contains any of the excluded endpoints the filter returns without validating the JWT. Unfortunately, an attacker may use Path Parameters to make any path contain any arbitrary strings. For example, a request to `GET /api/v1;v1%2fusers%2flogin/events/subscriptions/validation/condition/111` will match the excluded endpoint condition and therefore will be processed with no JWT validation allowing an attacker to bypass the authentication mechanism and reach any arbitrary endpoint, including the ones listed above that lead to arbitrary SpEL expression injection. This bypass will not work when the endpoint uses the `SecurityContext.getUserPrincipal()` since it will return `null` and will throw an NPE. This issue may lead to authentication bypass and has been addressed in version 1.2.4. Users are advised to upgrade. There are no known workarounds for this vulnerability. This issue is also tracked as `GHSL-2023-237`.",
    "published": "2024-03-15T20:15:10.270",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-28847": {
    "cvss": 8.8,
    "description": "OpenMetadata is a unified platform for discovery, observability, and governance powered by a central metadata repository, in-depth lineage, and seamless team collaboration. Similarly to the GHSL-2023-250 issue, `AlertUtil::validateExpression` is also called from `EventSubscriptionRepository.prepare()`, which can lead to Remote Code Execution. `prepare()` is called from `EntityRepository.prepareInternal()` which, in turn, gets called from `EntityResource.createOrUpdate()`. Note that, even though there is an authorization check (`authorizer.authorize()`), it gets called after `prepareInternal()` gets called and, therefore, after the SpEL expression has been evaluated. In order to reach this method, an attacker can send a PUT request to `/api/v1/events/subscriptions` which gets handled by `EventSubscriptionResource.createOrUpdateEventSubscription()`. This vulnerability was discovered with the help of CodeQL's Expression language injection (Spring) query. This issue may lead to Remote Code Execution and has been addressed in version 1.2.4. Users are advised to upgrade. There are no known workarounds for this vulnerability. This issue is also tracked as `GHSL-2023-251`.",
    "published": "2024-03-15T20:15:10.480",
    "keywords": "remote,execution"
  },
  "CVE-2024-28848": {
    "cvss": 8.8,
    "description": "OpenMetadata is a unified platform for discovery, observability, and governance powered by a central metadata repository, in-depth lineage, and seamless team collaboration. The `‎CompiledRule::validateExpression` method evaluates an SpEL expression using an `StandardEvaluationContext`, allowing the expression to reach and interact with Java classes such as `java.lang.Runtime`, leading to Remote Code Execution. The `/api/v1/policies/validation/condition/<expression>` endpoint passes user-controlled data `CompiledRule::validateExpession` allowing authenticated (non-admin) users to execute arbitrary system commands on the underlaying operating system. In addition, there is a missing authorization check since `Authorizer.authorize()` is never called in the affected path and therefore any authenticated non-admin user is able to trigger this endpoint and evaluate arbitrary SpEL expressions leading to arbitrary command execution. This vulnerability was discovered with the help of CodeQL's Expression language injection (Spring) query and is also tracked as `GHSL-2023-236`. This issue may lead to Remote Code Execution and has been resolved in version 1.2.4. Users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-03-15T20:15:10.710",
    "keywords": "remote,execution,command"
  }
}