{
  "CVE-2025-27795": {
    "url": "https://github.com/libjxl/libjxl/issues/3793#issuecomment-2334843280",
    "cvss": 4.3,
    "description": "ReadJXLImage in JXL in GraphicsMagick before 1.3.46 lacks image dimension resource limits.",
    "published": "2025-03-07T06:15:33.273"
  },
  "CVE-2025-1475": {
    "cvss": 9.8,
    "description": "The WPCOM Member plugin for WordPress is vulnerable to authentication bypass in all versions up to, and including, 1.7.5. This is due to insufficient verification on the 'user_phone' parameter when logging in. This makes it possible for unauthenticated attackers to log in as any existing user on the site, such as an administrator, if SMS login is enabled.",
    "published": "2025-03-07T07:15:23.343",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2025-26331": {
    "cvss": 7.8,
    "description": "Dell ThinOS 2411 and prior, contains an Improper Neutralization of Special Elements used in a Command ('Command Injection') vulnerability. A low privileged attacker with local access could potentially exploit this vulnerability, leading to arbitrary code execution.",
    "published": "2025-03-07T08:15:43.040",
    "keywords": "execution,command"
  },
  "CVE-2025-27152": {
    "url": "https://github.com/axios/axios/issues/6463",
    "cvss": "-",
    "description": "axios is a promise based HTTP client for the browser and node.js. The issue occurs when passing absolute URLs rather than protocol-relative URLs to axios. Even if ⁠baseURL is set, axios sends the request to the specified absolute URL, potentially causing SSRF and credential leakage. This issue impacts both server-side and client-side usage of axios. This issue is fixed in 1.8.2.",
    "published": "2025-03-07T16:15:38.773"
  },
  "CVE-2025-27518": {
    "url": "https://github.com/truefoundry/cognita/pull/424",
    "cvss": "-",
    "description": "Cognita is a RAG (Retrieval Augmented Generation) Framework for building modular, open source applications for production by TrueFoundry. An insecure CORS configuration in the Cognita backend server allows arbitrary websites to send cross site requests to the application. This vulnerability is fixed in commit 75079c3d3cf376381489b9a82ee46c69024e1a15.",
    "published": "2025-03-07T16:15:39.187"
  },
  "CVE-2025-27519": {
    "cvss": "-",
    "description": "Cognita is a RAG (Retrieval Augmented Generation) Framework for building modular, open source applications for production by TrueFoundry. A path traversal issue exists at /v1/internal/upload-to-local-directory which is enabled when the Local env variable is set to true, such as when Cognita is setup using Docker. Because the docker environment sets up the backend uvicorn server with auto reload enabled, when an attacker overwrites the /app/backend/__init__.py file, the file will automatically be reloaded and executed. This allows an attacker to get remote code execution in the context of the Docker container. This vulnerability is fixed in commit a78bd065e05a1b30a53a3386cc02e08c317d2243.",
    "published": "2025-03-07T16:15:39.623",
    "keywords": "remote,execution"
  },
  "CVE-2025-27597": {
    "cvss": "-",
    "description": "Vue I18n is the internationalization plugin for Vue.js. @intlify/message-resolver and @intlify/vue-i18n-core are vulnerable to Prototype Pollution through the entry function: handleFlatJson. An attacker can supply a payload with Object.prototype setter to introduce or modify properties within the global prototype chain, causing denial of service (DoS) a the minimum consequence. Moreover, the consequences of this vulnerability can escalate to other injection-based attacks, depending on how the library integrates within the application. For instance, if the polluted property propagates to sensitive Node.js APIs (e.g., exec, eval), it could enable an attacker to execute arbitrary commands within the application's context.",
    "published": "2025-03-07T16:15:39.893",
    "keywords": "command,sensitive"
  },
  "CVE-2025-0162": {
    "cvss": 7.1,
    "description": "IBM Aspera Shares 1.9.9 through 1.10.0 PL7 is vulnerable to an XML external entity injection (XXE) attack when processing XML data. A remote authenticated attacker could exploit this vulnerability to expose sensitive information or consume memory resources.",
    "published": "2025-03-07T17:15:21.110",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-2024": {
    "cvss": 7.8,
    "description": "Trimble SketchUp SKP File Parsing Uninitialized Variable Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Trimble SketchUp. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of SKP files. The issue results from the lack of proper initialization of memory prior to accessing it. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-25210.",
    "published": "2025-03-07T20:15:39.023",
    "keywords": "remote,execution"
  },
  "CVE-2025-2094": {
    "cvss": 6.3,
    "description": "A vulnerability was found in TOTOLINK EX1800T 9.1.0cu.2112_B20220316. It has been rated as critical. Affected by this issue is the function setWiFiExtenderConfig of the file /cgi-bin/cstecgi.cgi. The manipulation of the argument apcliKey/key leads to os command injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2025-03-07T22:15:38.850",
    "keywords": "remote,command"
  },
  "CVE-2025-2095": {
    "cvss": 6.3,
    "description": "A vulnerability classified as critical has been found in TOTOLINK EX1800T 9.1.0cu.2112_B20220316. This affects the function setDmzCfg of the file /cgi-bin/cstecgi.cgi. The manipulation of the argument ip leads to os command injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2025-03-07T22:15:39.023",
    "keywords": "remote,command"
  },
  "CVE-2025-2096": {
    "cvss": 6.3,
    "description": "A vulnerability classified as critical was found in TOTOLINK EX1800T 9.1.0cu.2112_B20220316. This vulnerability affects the function setRebootScheCfg of the file /cgi-bin/cstecgi.cgi. The manipulation of the argument mode/week/minute/recHour leads to os command injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2025-03-07T22:15:39.187",
    "keywords": "remote,command"
  },
  "CVE-2025-1323": {
    "cvss": 7.5,
    "description": "The WP-Recall – Registration, Profile, Commerce & More plugin for WordPress is vulnerable to SQL Injection via the 'databeat' parameter in all versions up to, and including, 16.26.10 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2025-03-08T10:15:11.003",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-2123": {
    "url": "https://github.com/geshi/geshi-1.0/issues/159#issue-2880408694",
    "cvss": 3.5,
    "description": "A vulnerability, which was classified as problematic, has been found in GeSHi up to 1.0.9.1. Affected by this issue is the function get_var of the file /contrib/cssgen.php of the component CSS Handler. The manipulation of the argument default-styles/keywords-1/keywords-2/keywords-3/keywords-4/comments leads to cross site scripting. The attack may be launched remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2025-03-09T15:15:36.413"
  }
}