{
  "CVE-2025-9196": {
    "cvss": 5.3,
    "description": "The Trinity Audio – Text to Speech AI audio player to convert content into audio plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 5.21.0 via the ~/admin/inc/phpinfo.php file that gets created on install. This makes it possible for unauthenticated attackers to extract sensitive data including configuration data.",
    "published": "2025-10-11T08:15:32.353",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-11254": {
    "cvss": 4.3,
    "description": "The Contest Gallery – Upload, Vote & Sell with PayPal and Stripe plugin for WordPress is vulnerable to CSV Injection in all versions up to, and including, 27.0.3 via gallery submissions. This makes it possible for unauthenticated attackers to embed untrusted input into exported CSV files, which can result in code execution when these files are downloaded and opened on a local system with a vulnerable configuration.",
    "published": "2025-10-11T09:15:32.453",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2025-6553": {
    "cvss": 9.8,
    "description": "The Ovatheme Events Manager plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the process_checkout() function in all versions up to, and including, 1.8.5. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2025-10-11T09:15:34.877",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2025-6439": {
    "cvss": 9.8,
    "description": "The WooCommerce Designer Pro plugin for WordPress, used by the Pricom - Printing Company & Design Services WordPress theme, is vulnerable to arbitrary file deletion due to insufficient file path validation in the 'wcdp_save_canvas_design_ajax' function in all versions up to, and including, 1.9.26. This makes it possible for unauthenticated attackers to delete all files in an arbitrary directory on the server, which can lead to remote code execution, data loss, or site unavailability.",
    "published": "2025-10-11T10:15:43.653",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2025-8484": {
    "cvss": 5.3,
    "description": "The Code Quality Control Tool plugin for WordPress is vulnerable to Sensitive Information Exposure in version 0.1 through publicly exposed log files. This makes it possible for unauthenticated attackers to view potentially sensitive information contained in the exposed log files.",
    "published": "2025-10-11T10:15:43.987",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-8593": {
    "cvss": 8.8,
    "description": "The GSheetConnector For Gravity Forms plugin for WordPress is vulnerable to authorization bypass in versions less than, or equal to, 1.3.27. This is due to a missing capability check on the 'install_plugin' function. This makes it possible for authenticated attackers, with subscriber-level access and above to install plugins on the target site and potentially achieve arbitrary code execution on the server under certain conditions.",
    "published": "2025-10-11T10:15:44.140",
    "keywords": "execution,bypass"
  },
  "CVE-2025-31998": {
    "cvss": 3.5,
    "description": "HCL Unica Centralized Offer Management is vulnerable to poor unhandled exceptions which exposes sensitive information.  An attacker can exploit use this information to exploit known vulnerabilities launch targeted attacks, such as remote code execution or denial of service.",
    "published": "2025-10-12T03:15:34.557",
    "keywords": "remote,execution,sensitive"
  },
  "CVE-2025-11645": {
    "cvss": 2.4,
    "description": "A security vulnerability has been detected in Tomofun Furbo Mobile App up to 7.57.0a on Android. This affects an unknown part of the component Authentication Token Handler. The manipulation leads to insecure storage of sensitive information. It is possible to launch the attack on the physical device. The exploit has been disclosed publicly and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2025-10-12T21:15:33.303",
    "keywords": "authentication,sensitive"
  },
  "CVE-2025-0636": {
    "cvss": 8.4,
    "description": "EMCLI contains a high severity vulnerability where improper neutralization of special elements used in an OS command could be exploited leading to Arbitrary Code Execution.",
    "published": "2025-10-13T07:15:48.883",
    "keywords": "execution,command"
  },
  "CVE-2025-11665": {
    "cvss": 4.7,
    "description": "A vulnerability was detected in D-Link DAP-2695 2.00RC131. This affects the function fwupdater_main of the file rgbin of the component Firmware Update Handler. Performing manipulation results in os command injection. The attack may be initiated remotely. This vulnerability only affects products that are no longer supported by the maintainer.",
    "published": "2025-10-13T07:15:52.023",
    "keywords": "remote,command"
  },
  "CVE-2025-9265": {
    "cvss": "-",
    "description": "A broken authorization vulnerability in Kiloview NDI N30 allows a remote unauthenticated attacker to deactivate user verification, giving them access to state changing actions that should only be initiated by administratorsThis issue affects \n\n Kiloview NDI N30\n\nand was fixed in Firmware version later than  2.02.0246",
    "published": "2025-10-13T07:15:56.677",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-11671": {
    "cvss": 5.3,
    "description": "Uniweb/SoliPACS WebServer developed by EBM Technologies has a Missing Authentication vulnerability, allowing unauthenticated remote attackers to access a specific page to obtain information such as account names and IP addresses.",
    "published": "2025-10-13T08:15:40.333",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2025-11672": {
    "cvss": 5.3,
    "description": "Uniweb/SoliPACS WebServer developed by EBM Technologies has a Missing Authentication vulnerability, allowing unauthenticated remote attackers to access a specific page to obtain user group names.",
    "published": "2025-10-13T08:15:40.550",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2025-11675": {
    "cvss": 7.2,
    "description": "Enterprise Cloud Database developed by Ragic has an Arbitrary File Upload vulnerability, allowing privileged remote attackers to upload and execute web shell backdoors, thereby enabling arbitrary code execution on the server.",
    "published": "2025-10-13T08:15:41.137",
    "keywords": "remote,execution"
  },
  "CVE-2025-10720": {
    "cvss": "-",
    "description": "The WP Private Content Plus through 3.6.2 provides a global content protection feature that requires a password. However, the access control check is based only on the presence of an unprotected client-side cookie. As a result, an unauthenticated attacker can completely bypass the password protection by manually setting the cookie value in their browser.",
    "published": "2025-10-13T10:15:45.590",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2025-37729": {
    "cvss": 9.1,
    "description": "Improper neutralization of special elements used in a template engine in Elastic Cloud Enterprise (ECE) can lead to a malicious actor with Admin access exfiltrating sensitive information and issuing commands via a specially crafted string where Jinjava variables are evaluated.",
    "published": "2025-10-13T14:15:34.533",
    "keywords": "command,sensitive"
  },
  "CVE-2025-62170": {
    "url": "https://github.com/rathena/rathena/commit/af2f3ba33fc03dc6dd510f8cfe84cd9185af748d",
    "cvss": 7.5,
    "description": "rAthena is an open-source cross-platform MMORPG server. A use-after-free vulnerability exists in the RODEX functionality of rAthena's map-server in versions prior to commit af2f3ba. An unauthenticated attacker can exploit this vulnerability via a specific attacking scenario to cause a denial of service by crashing the map-server. This issue has been patched in commit af2f3ba. There are no known workarounds aside from manually applying the patch.",
    "published": "2025-10-13T18:15:34.980"
  },
  "CVE-2025-59836": {
    "cvss": 5.3,
    "description": "Omni manages Kubernetes on bare metal, virtual machines, or in a cloud. Prior to 1.1.5 and 1.0.2, there is a nil pointer dereference vulnerability in the Omni Resource Service allows unauthenticated users to cause a server panic and denial of service by sending empty create/update resource requests through the API endpoints. The vulnerability exists in the isSensitiveSpec function which calls grpcomni.CreateResource without checking if the resource's metadata field is nil. When a resource is created with an empty Metadata field, the CreateResource function attempts to access resource.Metadata.Version causing a segmentation fault. This vulnerability is fixed in 1.1.5 and 1.0.2.",
    "published": "2025-10-13T21:15:34.457",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-61688": {
    "cvss": 8.6,
    "description": "Omni manages Kubernetes on bare metal, virtual machines, or in a cloud. Prior to 1.1.5 and 1.0.2, Omni might leak sensitive information via an API.",
    "published": "2025-10-13T21:15:34.613",
    "keywords": "sensitive,leak"
  },
  "CVE-2025-62364": {
    "cvss": 6.2,
    "description": "text-generation-webui is an open-source web interface for running Large Language Models. In versions through 3.13, a Local File Inclusion vulnerability exists in the character picture upload feature. An attacker can upload a text file containing a symbolic link to an arbitrary file path. When the application processes the upload, it follows the symbolic link and serves the contents of the targeted file through the web interface. This allows an unauthenticated attacker to read sensitive files on the server, potentially exposing system configurations, credentials, and other confidential information. This vulnerability is fixed in 3.14. No known workarounds exist.",
    "published": "2025-10-13T21:15:35.560",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-9713": {
    "cvss": 8.8,
    "description": "Path traversal in Ivanti Endpoint Manager allows a remote unauthenticated attacker to achieve remote code execution. User interaction is required.",
    "published": "2025-10-13T21:15:35.727",
    "keywords": "remote,execution,unauthenticated"
  }
}