{
  "CVE-2024-20260": {
    "cvss": 8.6,
    "description": "A vulnerability in the VPN and management web servers of the Cisco Adaptive Security Virtual Appliance (ASAv) and Cisco Secure Firewall Threat Defense Virtual (FTDv), formerly Cisco Firepower Threat Defense Virtual, platforms could allow an unauthenticated, remote attacker to cause the virtual devices to run out of system memory, which could cause SSL VPN connection processing to slow down and eventually cease all together.\r\n\r\nThis vulnerability is due to a lack of proper memory management for new incoming SSL/TLS connections on the virtual platforms. An attacker could exploit this vulnerability by sending a large number of new incoming SSL/TLS connections to the targeted virtual platform. A successful exploit could allow the attacker to deplete system memory,&nbsp;resulting in a denial of service (DoS) condition. The memory could be reclaimed slowly if the attack traffic is stopped, but a manual reload may be required to restore operations quickly.",
    "published": "2024-10-23T17:15:13.950",
    "keywords": "remote,unauthenticated,vpn"
  },
  "CVE-2024-20264": {
    "cvss": 4.8,
    "description": "A vulnerability in the web-based management interface of Cisco Firepower Management Center (FMC) Software could allow an authenticated, remote attacker to conduct a cross-site scripting (XSS) attack against a user of the interface of an affected device. This vulnerability is due to insufficient validation of user-supplied input by the web-based management interface. An attacker could exploit this vulnerability by inserting crafted input into various data fields in an affected interface. A successful exploit could allow the attacker to execute arbitrary script code in the context of the interface, or access sensitive, browser-based information.",
    "published": "2024-10-23T17:15:14.180",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-20269": {
    "cvss": 4.8,
    "description": "A vulnerability in the web-based management interface of Cisco Firepower Management Center (FMC) Software could allow an authenticated, remote attacker to conduct a cross-site scripting (XSS) attack against a user of the interface of an affected device. This vulnerability is due to insufficient validation of user-supplied input by the web-based management interface. An attacker could exploit this vulnerability by inserting crafted input into various data fields in an affected interface. A successful exploit could allow the attacker to execute arbitrary script code in the context of the interface, or access sensitive, browser-based information.",
    "published": "2024-10-23T17:15:14.610",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-20273": {
    "cvss": 6.1,
    "description": "A vulnerability in the web-based management interface of Cisco Firepower Management Center (FMC) Software could allow an unauthenticated, remote attacker to conduct a cross-site scripting (XSS) attack against a user of the interface of an affected device. This vulnerability is due to insufficient validation of user-supplied input by the web-based management interface. An attacker could exploit this vulnerability by inserting crafted input into various data fields in an affected interface. A successful exploit could allow the attacker to execute arbitrary script code in the context of the interface, or access sensitive, browser-based information.",
    "published": "2024-10-23T17:15:14.813",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-20274": {
    "cvss": 5.5,
    "description": "A vulnerability in the web-based management interface of Cisco Secure Firewall Management Center (FMC) Software, formerly Firepower Management Center Software, could allow an authenticated, remote attacker to inject arbitrary HTML content into a device-generated document.\r\n\r\nThis vulnerability is due to improper validation of user-supplied data. An attacker could exploit this vulnerability by submitting malicious content to an affected device and using the device to generate a document that contains sensitive information. A successful exploit could allow the attacker to alter the standard layout of the device-generated documents, access arbitrary files from the underlying operating system, and conduct server-side request forgery (SSRF) attacks. To successfully exploit this vulnerability, an attacker would need valid credentials for a user account with policy-editing permissions, such as Network Admin, Intrusion Admin, or any custom user role with the same capabilities.",
    "published": "2024-10-23T17:15:15.027",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-20275": {
    "cvss": 6.1,
    "description": "A vulnerability in the cluster backup feature of Cisco Secure Firewall Management Center (FMC) Software, formerly Firepower Management Center Software, could allow an authenticated, remote attacker to execute arbitrary commands on the underlying operating system.\r\n\r\nThis vulnerability is due to insufficient validation of user data that is supplied through the web-based management interface. An attacker could exploit this vulnerability by sending a crafted HTTP request to an affected device. A successful exploit could allow the attacker to execute arbitrary operating system commands on the affected device. To exploit this vulnerability, an attacker would need valid credentials for a user account with at least the role of Network Administrator. In addition, the attacker would need to persuade a legitimate user to initiate a cluster backup on the affected device.",
    "published": "2024-10-23T17:15:15.237",
    "keywords": "remote,command"
  },
  "CVE-2024-20297": {
    "cvss": 5.8,
    "description": "A vulnerability in the AnyConnect firewall for Cisco Adaptive Security Appliance (ASA) Software and Cisco Firepower Threat Defense (FTD) Software could allow an unauthenticated, remote attacker to bypass a configured access control list (ACL) and allow traffic that should have been denied to flow through an affected device. This vulnerability is due to a logic error in populating group ACLs when an AnyConnect client establishes a new session toward an affected device. An attacker could exploit this vulnerability by establishing an AnyConnect connection to the affected device. A successful exploit could allow the attacker to bypass configured ACL rules.",
    "published": "2024-10-23T17:15:15.437",
    "keywords": "remote,unauthenticated,bypass"
  },
  "CVE-2024-20298": {
    "cvss": 4.8,
    "description": "A vulnerability in the web-based management interface of Cisco Firepower Management Center (FMC) Software could allow an authenticated, remote attacker to conduct a cross-site scripting (XSS) attack against a user of the interface of an affected device. This vulnerability is due to insufficient validation of user-supplied input by the web-based management interface. An attacker could exploit this vulnerability by inserting crafted input into various data fields in an affected interface. A successful exploit could allow the attacker to execute arbitrary script code in the context of the interface, or access sensitive, browser-based information.",
    "published": "2024-10-23T17:15:15.710",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-20299": {
    "cvss": 5.8,
    "description": "A vulnerability in the AnyConnect firewall for Cisco Adaptive Security Appliance (ASA) Software and Cisco Firepower Threat Defense (FTD) Software could allow an unauthenticated, remote attacker to bypass a configured access control list (ACL) and allow traffic that should have been denied to flow through an affected device. This vulnerability is due to a logic error in populating group ACLs when an AnyConnect client establishes a new session toward an affected device. An attacker could exploit this vulnerability by establishing an AnyConnect connection to the affected device. A successful exploit could allow the attacker to bypass configured ACL rules.",
    "published": "2024-10-23T17:15:16.900",
    "keywords": "remote,unauthenticated,bypass"
  },
  "CVE-2024-20300": {
    "cvss": 4.8,
    "description": "A vulnerability in the web-based management interface of Cisco Firepower Management Center (FMC) Software could allow an authenticated, remote attacker to conduct a cross-site scripting (XSS) attack against a user of the interface of an affected device. This vulnerability is due to insufficient validation of user-supplied input by the web-based management interface. An attacker could exploit this vulnerability by inserting crafted input into various data fields in an affected interface. A successful exploit could allow the attacker to execute arbitrary script code in the context of the interface, or access sensitive, browser-based information.",
    "published": "2024-10-23T17:15:17.253",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-20329": {
    "cvss": 9.9,
    "description": "A vulnerability in the SSH subsystem of Cisco Adaptive Security Appliance (ASA) Software could allow an authenticated, remote attacker to execute operating system commands as root.\r\n\r\nThis vulnerability is due to insufficient validation of user input. An attacker could exploit this vulnerability by submitting crafted input when executing remote CLI commands over SSH. A successful exploit could allow the attacker to execute commands on the underlying operating system with root-level privileges. An attacker with limited user privileges could use this vulnerability to gain complete control over the system.",
    "published": "2024-10-23T17:15:17.457",
    "keywords": "remote,command"
  },
  "CVE-2024-20330": {
    "cvss": 8.6,
    "description": "A vulnerability in the Snort 2 and Snort 3 TCP and UDP detection engine of Cisco Firepower Threat Defense (FTD) Software for Cisco Firepower 2100 Series Appliances could allow an unauthenticated, remote attacker to cause memory corruption, which could cause the Snort detection engine to restart unexpectedly.\r\n\r\nThis vulnerability is due to improper memory management when the Snort detection engine processes specific TCP or UDP packets. An attacker could exploit this vulnerability by sending crafted TCP or UDP packets through a device that is inspecting traffic using the Snort detection engine. A successful exploit could allow the attacker to restart the Snort detection engine repeatedly, which could cause a denial of service (DoS) condition. The DoS condition impacts only the traffic through the device that is examined by the Snort detection engine. The device can still be managed over the network.\r\nNote: Once a memory block is corrupted, it cannot be cleared until the Cisco Firepower 2100 Series Appliance is manually reloaded. This means that the Snort detection engine could crash repeatedly, causing traffic that is processed by the Snort detection engine to be dropped until the device is manually reloaded.",
    "published": "2024-10-23T17:15:17.663",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20331": {
    "cvss": 6.8,
    "description": "A vulnerability in the session authentication functionality of the Remote Access SSL VPN feature of Cisco Adaptive Security Appliance (ASA) Software and Cisco Firepower Threat Defense (FTD) Software could allow an unauthenticated, remote attacker to prevent users from authenticating.\r\n\r\nThis vulnerability is due to insufficient entropy in the authentication process. An attacker could exploit this vulnerability by determining the handle of an authenticating user and using it to terminate their authentication session. A successful exploit could allow the attacker to force a user to restart the authentication process, preventing a legitimate user from establishing remote access VPN sessions.",
    "published": "2024-10-23T17:15:17.870",
    "keywords": "remote,unauthenticated,authentication,vpn"
  },
  "CVE-2024-20339": {
    "cvss": 8.6,
    "description": "A vulnerability in the TLS processing feature of Cisco Firepower Threat Defense (FTD) Software for Cisco Firepower 2100 Series could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition on an affected device.\r\n\r\nThis vulnerability is due to an issue that occurs when TLS traffic is processed. An attacker could exploit this vulnerability by sending certain TLS traffic over IPv4 through an affected device. A successful exploit could allow the attacker to cause the device to reload, resulting in a DoS condition and impacting traffic to and through the affected device.",
    "published": "2024-10-23T17:15:18.097",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20341": {
    "cvss": 6.1,
    "description": "A vulnerability in the VPN web client services feature of Cisco Adaptive Security Appliance (ASA) Software and Cisco Firepower Threat Defense (FTD) Software could allow an unauthenticated, remote attacker to conduct a cross-site scripting (XSS) attack against a browser that is accessing an affected device. This vulnerability is due to improper validation of user-supplied input to application endpoints. An attacker could exploit this vulnerability by persuading a user to follow a link designed to submit malicious input to the affected application. A successful exploit could allow the attacker to execute arbitrary HTML or script code in the browser in the context of the web services page.",
    "published": "2024-10-23T17:15:18.493",
    "keywords": "remote,unauthenticated,vpn"
  },
  "CVE-2024-20342": {
    "cvss": 5.8,
    "description": "Multiple Cisco products are affected by a vulnerability in the rate filtering feature of the Snort detection engine that could allow an unauthenticated, remote attacker to bypass a configured rate limiting filter.\r\n\r\nThis vulnerability is due to an incorrect connection count comparison. An attacker could exploit this vulnerability by sending traffic through an affected device at a rate that exceeds a configured rate filter. A successful exploit could allow the attacker to successfully bypass the rate filter. This could allow unintended traffic to enter the network protected by the affected device.",
    "published": "2024-10-23T17:15:18.703",
    "keywords": "remote,unauthenticated,bypass"
  },
  "CVE-2024-20351": {
    "cvss": 8.6,
    "description": "A vulnerability in the TCP/IP traffic handling function of the Snort Detection Engine of Cisco Firepower Threat Defense (FTD) Software and Cisco FirePOWER Services could allow an unauthenticated, remote attacker to cause legitimate network traffic to be dropped, resulting in a denial of service (DoS) condition.\r\n\r\nThis vulnerability is due to the improper handling of TCP/IP network traffic. An attacker could exploit this vulnerability by sending a large amount of TCP/IP network traffic through the affected device. A successful exploit could allow the attacker to cause the Cisco FTD device to drop network traffic, resulting in a DoS condition. The affected device must be rebooted to resolve the DoS condition.",
    "published": "2024-10-23T17:15:18.913",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20364": {
    "cvss": 4.8,
    "description": "A vulnerability in the web-based management interface of Cisco Firepower Management Center (FMC) Software could allow an authenticated, remote attacker to conduct a stored cross-site scripting (XSS) attack against a user of the interface of an affected device. This vulnerability is due to insufficient validation of user-supplied input by the web-based management interface. An attacker could exploit this vulnerability by inserting crafted input into various data fields in an affected interface. A successful exploit could allow the attacker to execute arbitrary script code in the context of the interface, or access sensitive, browser-based information.",
    "published": "2024-10-23T18:15:05.427",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-20372": {
    "cvss": 6.1,
    "description": "A vulnerability in the web-based management interface of Cisco Firepower Management Center (FMC) Software could allow an unauthenticated, remote attacker to conduct a stored cross-site scripting (XSS) attack against a user of the interface of an affected device. This vulnerability is due to insufficient validation of user-supplied input by the web-based management interface. An attacker could exploit this vulnerability by inserting crafted input into various data fields in an affected interface. A successful exploit could allow the attacker to execute arbitrary script code in the context of the interface, or access sensitive, browser-based information.",
    "published": "2024-10-23T18:15:05.863",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-20374": {
    "cvss": 6.5,
    "description": "A vulnerability in the web-based management interface of Cisco Secure Firewall Management Center (FMC) Software, formerly Firepower Management Center Software, could allow an authenticated, remote attacker with Administrator-level privileges to execute arbitrary commands on the underlying operating system.\r\n\r This vulnerability is due to insufficient input validation of certain HTTP request parameters that are sent to the web-based management interface. An attacker could exploit this vulnerability by authenticating to the Cisco FMC web-based management interface and sending a crafted HTTP request to an affected device. A successful exploit could allow the attacker to execute commands as the root user on the affected device. To exploit this vulnerability, an attacker would need Administrator-level credentials.",
    "published": "2024-10-23T18:15:06.100",
    "keywords": "remote,command"
  },
  "CVE-2024-20377": {
    "cvss": 5.4,
    "description": "A vulnerability in the web-based management interface of Cisco Firepower Management Center (FMC) could allow an authenticated, remote attacker to conduct a stored cross-site scripting (XSS) attack against a user of the interface.\r\n\r This vulnerability is due to the web-based management interface not properly validating user-supplied input. An attacker could exploit this vulnerability by by persuading a user of the interface to click a crafted link. A successful exploit could allow the attacker to execute arbitrary script code in the context of the affected interface or access sensitive, browser-based information.",
    "published": "2024-10-23T18:15:06.327",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-20382": {
    "cvss": 6.1,
    "description": "A vulnerability in the VPN web client services feature of Cisco Adaptive Security Appliance (ASA) Software and Cisco Firepower Threat Defense (FTD) Software could allow an unauthenticated, remote attacker to conduct a cross-site scripting (XSS) attack against a browser that is accessing an affected device. This vulnerability is due to improper validation of user-supplied input to application endpoints. An attacker could exploit this vulnerability by persuading a user to follow a link designed to submit malicious input to the affected application. A successful exploit could allow the attacker to execute arbitrary HTML or script code in the browser in the context of the web services page.",
    "published": "2024-10-23T18:15:06.780",
    "keywords": "remote,unauthenticated,vpn"
  },
  "CVE-2024-20384": {
    "cvss": 5.8,
    "description": "A vulnerability in the Network Service Group (NSG) feature of Cisco Adaptive Security Appliance (ASA) Software and Cisco Firepower Threat Defense (FTD) Software could allow an unauthenticated, remote attacker to bypass a configured access control list (ACL) and allow traffic that should be denied to flow through an affected device.\r\n\r This vulnerability is due to a logic error that occurs when NSG ACLs are populated on an affected device. An attacker could exploit this vulnerability by establishing a connection to the affected device. A successful exploit could allow the attacker to bypass configured ACL rules.",
    "published": "2024-10-23T18:15:07.030",
    "keywords": "remote,unauthenticated,bypass"
  },
  "CVE-2024-20386": {
    "cvss": 4.8,
    "description": "A vulnerability in the web-based management interface of Cisco Firepower Management Center (FMC) Software could allow an unauthenticated, remote attacker to conduct a stored cross-site scripting (XSS) attack against a user of the interface of an affected device. This vulnerability is due to insufficient validation of user-supplied input by the web-based management interface. An attacker could exploit this vulnerability by inserting crafted input into various data fields in an affected interface. A successful exploit could allow the attacker to execute arbitrary script code in the context of the interface, or access sensitive, browser-based information.",
    "published": "2024-10-23T18:15:07.257",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-20388": {
    "cvss": 5.3,
    "description": "A vulnerability in the password change feature of Cisco Firepower Management Center (FMC) software could allow an unauthenticated, remote attacker to determine valid user names on an affected device.\r\n\r This vulnerability is due to improper authentication of password update responses. An attacker could exploit this vulnerability by forcing a password reset on an affected device. A successful exploit could allow the attacker to determine valid user names in the unauthenticated response to a forced password reset.",
    "published": "2024-10-23T18:15:07.697",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2024-20402": {
    "cvss": 8.6,
    "description": "A vulnerability in the SSL VPN feature for Cisco Adaptive Security Appliance (ASA) Software and Cisco Firepower Threat Defense (FTD) Software could allow an unauthenticated, remote attacker to cause an affected device to reload unexpectedly, resulting in a denial of service (DoS) condition.\r\n\r This vulnerability is due to a logic error in memory management when the device is handling SSL VPN connections. An attacker could exploit this vulnerability by sending crafted SSL/TLS packets to the SSL VPN server of the affected device. A successful exploit could allow the attacker to cause the device to reload, resulting in a DoS condition.",
    "published": "2024-10-23T18:15:07.930",
    "keywords": "remote,unauthenticated,vpn"
  },
  "CVE-2024-20403": {
    "cvss": 4.8,
    "description": "A vulnerability in the web-based management interface of Cisco Firepower Management Center (FMC) Software could allow an authenticated, remote attacker to conduct a cross-site scripting (XSS) attack against a user of the interface of an affected device. This vulnerability is due to insufficient validation of user-supplied input by the web-based management interface. An attacker could exploit this vulnerability by inserting crafted input into various data fields in an affected interface. A successful exploit could allow the attacker to execute arbitrary script code in the context of the interface, or access sensitive, browser-based information.",
    "published": "2024-10-23T18:15:08.193",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-20407": {
    "cvss": 5.8,
    "description": "A vulnerability in the interaction between the TCP Intercept feature and the Snort 3 detection engine on Cisco Firepower Threat Defense (FTD) Software could allow an unauthenticated, remote attacker to bypass configured policies on an affected system. Devices that are configured with Snort 2 are not affected by this vulnerability. \r\n\r This vulnerability is due to a logic error when handling embryonic (half-open) TCP connections. An attacker could exploit this vulnerability by sending a crafted traffic pattern through an affected device. A successful exploit could allow unintended traffic to enter the network protected by the affected device.",
    "published": "2024-10-23T18:15:08.413",
    "keywords": "remote,unauthenticated,bypass"
  },
  "CVE-2024-20408": {
    "cvss": 7.7,
    "description": "A vulnerability in the Dynamic Access Policies (DAP) feature of Cisco Adaptive Security Appliance (ASA) Software and Cisco Firepower Threat Defense (FTD) Software could allow an authenticated, remote attacker to cause an affected device to reload unexpectedly. To exploit this vulnerability, an attacker would need valid remote access VPN user credentials on the affected device.\r\n\r This vulnerability is due to improper validation of data in HTTPS POST requests. An attacker could exploit this vulnerability by sending a crafted HTTPS POST request to an affected device. A successful exploit could allow the attacker to cause the device to reload, resulting in a denial of service (DoS) condition.",
    "published": "2024-10-23T18:15:08.697",
    "keywords": "remote,vpn"
  },
  "CVE-2024-20409": {
    "cvss": 4.8,
    "description": "A vulnerability in the web-based management interface of Cisco Firepower Management Center (FMC) Software could allow an unauthenticated, remote attacker to conduct a cross-site scripting (XSS) attack against a user of the interface of an affected device. This vulnerability is due to insufficient validation of user-supplied input by the web-based management interface. An attacker could exploit this vulnerability by inserting crafted input into various data fields in an affected interface. A successful exploit could allow the attacker to execute arbitrary script code in the context of the interface, or access sensitive, browser-based information.",
    "published": "2024-10-23T18:15:08.970",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-20410": {
    "cvss": 5.4,
    "description": "A vulnerability in the web-based management interface of Cisco Firepower Management Center (FMC) Software could allow an unauthenticated, remote attacker to conduct a cross-site scripting (XSS) attack against a user of the interface of an affected device. This vulnerability is due to insufficient validation of user-supplied input by the web-based management interface. An attacker could exploit this vulnerability by inserting crafted input into various data fields in an affected interface. A successful exploit could allow the attacker to execute arbitrary script code in the context of the interface, or access sensitive, browser-based information.",
    "published": "2024-10-23T18:15:09.197",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-20412": {
    "cvss": 9.3,
    "description": "A vulnerability in Cisco Firepower Threat Defense (FTD) Software for Cisco Firepower 1000, 2100, 3100, and 4200 Series could allow an unauthenticated, local attacker to access an affected system using static credentials.\r\n\r This vulnerability is due to the presence of static accounts with hard-coded passwords on an affected system. An attacker could exploit this vulnerability by logging in to the CLI of an affected device with these credentials. A successful exploit could allow the attacker to access the affected system and retrieve sensitive information, perform limited troubleshooting actions, modify some configuration options, or render the device unable to boot to the operating system, requiring a reimage of the device.",
    "published": "2024-10-23T18:15:09.430",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-20415": {
    "cvss": 4.8,
    "description": "A vulnerability in the web-based management interface of Cisco Firepower Management Center (FMC) Software could allow an unauthenticated, remote attacker to conduct a cross-site scripting (XSS) attack against a user of the interface of an affected device. This vulnerability is due to insufficient validation of user-supplied input by the web-based management interface. An attacker could exploit this vulnerability by inserting crafted input into various data fields in an affected interface. A successful exploit could allow the attacker to execute arbitrary script code in the context of the interface, or access sensitive, browser-based information.",
    "published": "2024-10-23T18:15:09.713",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-20424": {
    "cvss": 9.9,
    "description": "A vulnerability in the web-based management interface of Cisco Secure Firewall Management Center (FMC) Software, formerly Firepower Management Center Software, could allow an authenticated, remote attacker to execute arbitrary commands on the underlying operating system as root.\r\n\r This vulnerability is due to insufficient input validation of certain HTTP requests. An attacker could exploit this vulnerability by authenticating to the web-based management interface of an affected device and then sending a crafted HTTP request to the device. A successful exploit could allow the attacker to execute arbitrary commands with root permissions on the underlying operating system of the Cisco FMC device or to execute commands on managed Cisco Firepower Threat Defense (FTD) devices. To exploit this vulnerability, the attacker would need valid credentials for a user account with at least the role of Security Analyst (Read Only).",
    "published": "2024-10-23T18:15:09.930",
    "keywords": "remote,command"
  },
  "CVE-2024-20426": {
    "cvss": 8.6,
    "description": "A vulnerability in the Internet Key Exchange version 2 (IKEv2) protocol for VPN termination of Cisco Adaptive Security Appliance (ASA) Software and Cisco Firepower Threat Defense (FTD) Software could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition on an affected device.\r\n\r This vulnerability is due to insufficient input validation. An attacker could exploit this vulnerability by sending crafted IKEv2 traffic to an affected device. A successful exploit could allow the attacker to cause the device to reload, resulting in a DoS condition.",
    "published": "2024-10-23T18:15:10.147",
    "keywords": "remote,unauthenticated,vpn"
  },
  "CVE-2024-20431": {
    "cvss": 5.8,
    "description": "A vulnerability in the geolocation access control feature of Cisco Firepower Threat Defense (FTD) Software could allow an unauthenticated, remote attacker to bypass an access control policy.\r\n\r This vulnerability is due to improper assignment of geolocation data. An attacker could exploit this vulnerability by sending traffic through an affected device. A successful exploit could allow the attacker to bypass a geolocation-based access control policy and successfully send traffic to a protected device.",
    "published": "2024-10-23T18:15:10.440",
    "keywords": "remote,unauthenticated,bypass"
  },
  "CVE-2024-20474": {
    "cvss": 4.3,
    "description": "A vulnerability in Internet Key Exchange version 2 (IKEv2) processing of Cisco Secure Client Software could allow an unauthenticated, remote attacker to cause a denial of service (DoS) of Cisco Secure Client.\r\n\r This vulnerability is due to an integer underflow condition. An attacker could exploit this vulnerability by sending a crafted IKEv2 packet to an affected system. A successful exploit could allow the attacker to cause Cisco Secure Client Software to crash, resulting in a DoS condition on the client software.\r\n\r Note: Cisco Secure Client Software releases 4.10 and earlier were known as Cisco AnyConnect Secure Mobility Client.",
    "published": "2024-10-23T18:15:11.517",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20481": {
    "cvss": 5.8,
    "description": "A vulnerability in the Remote Access VPN (RAVPN) service of Cisco Adaptive Security Appliance (ASA) Software and Cisco Firepower Threat Defense (FTD) Software could allow an unauthenticated, remote attacker to cause a denial of service (DoS) of the RAVPN service.\r\n\r This vulnerability is due to resource exhaustion. An attacker could exploit this vulnerability by sending a large number of VPN authentication requests to an affected device. A successful exploit could allow the attacker to exhaust resources, resulting in a DoS of the RAVPN service on the affected device. Depending on the impact of the attack, a reload of the device may be required to restore the RAVPN service. Services that are not related to VPN are not affected.\r\n\r Cisco Talos discussed these attacks in the blog post Large-scale brute-force activity targeting VPNs, SSH services with commonly used login credentials.",
    "published": "2024-10-23T18:15:11.737",
    "keywords": "remote,unauthenticated,authentication,vpn"
  },
  "CVE-2024-20493": {
    "cvss": 5.3,
    "description": "A vulnerability in the login authentication functionality of the Remote Access SSL VPN feature of Cisco Adaptive Security Appliance (ASA) Software and Cisco Firepower Threat Defense (FTD) Software could allow an unauthenticated, remote attacker to deny further VPN user authentications for several minutes, resulting in a temporary denial of service (DoS) condition.\r\n\r This vulnerability is due to ineffective handling of memory resources during the authentication process. An attacker could exploit this vulnerability by sending crafted packets, which could cause resource exhaustion of the authentication process. A successful exploit could allow the attacker to deny authentication for Remote Access SSL VPN users for several minutes, resulting in a temporary DoS condition.",
    "published": "2024-10-23T18:15:12.533",
    "keywords": "remote,unauthenticated,authentication,vpn"
  },
  "CVE-2024-20494": {
    "cvss": 8.6,
    "description": "A vulnerability in the TLS cryptography functionality of Cisco Adaptive Security Appliance (ASA) Software and Cisco Firepower Threat Defense (FTD) Software could allow an unauthenticated, remote attacker to cause the device to reload unexpectedly, resulting in a denial of service (DoS) condition.\r\n\r This vulnerability is due to improper data validation during the TLS 1.3 handshake. An attacker could exploit this vulnerability by sending a crafted TLS 1.3 packet to an affected system through a TLS 1.3-enabled listening socket. A successful exploit could allow the attacker to cause the device to reload, resulting in a DoS condition.\r\n\r Note: This vulnerability can also impact the integrity of a device by causing VPN HostScan communication failures or file transfer failures when Cisco ASA Software is upgraded using Cisco Adaptive Security Device Manager (ASDM).",
    "published": "2024-10-23T18:15:12.783",
    "keywords": "remote,unauthenticated,vpn"
  },
  "CVE-2024-20495": {
    "cvss": 8.6,
    "description": "A vulnerability in the Remote Access VPN feature of Cisco Adaptive Security Appliance (ASA) Software and Cisco Firepower Threat Defense (FTD) Software could allow an unauthenticated, remote attacker to cause the device to reload unexpectedly, resulting in a denial of service (DoS) condition on an affected device.\r\n\r This vulnerability is due to improper validation of client key data after the TLS session is established. An attacker could exploit this vulnerability by sending a crafted key value to an affected system over the secure TLS session. A successful exploit could allow the attacker to cause the device to reload, resulting in a DoS condition.",
    "published": "2024-10-23T18:15:13.007",
    "keywords": "remote,unauthenticated,vpn"
  },
  "CVE-2024-20526": {
    "cvss": 5.3,
    "description": "A vulnerability in the SSH server of Cisco Adaptive Security Appliance (ASA) Software could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition for the SSH server of an affected device.\r\n\r This vulnerability is due to a logic error when an SSH session is established. An attacker could exploit this vulnerability by sending crafted SSH messages to an affected device. A successful exploit could allow the attacker to exhaust available SSH resources on the affected device so that new SSH connections to the device are denied, resulting in a DoS condition. Existing SSH connections to the device would continue to function normally. The device must be rebooted manually to recover. However, user traffic would not be impacted and could be managed using a remote application such as Cisco Adaptive Security Device Manager (ASDM).",
    "published": "2024-10-23T18:15:13.303",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-40595": {
    "cvss": 5.3,
    "description": "An authentication-bypass issue in the RDP component of One Identity Safeguard for Privileged Sessions (SPS) On Premise before 7.5.1 (and LTS before 7.0.5.1) allows man-in-the-middle attackers to obtain access to privileged sessions on target resources by intercepting cleartext RDP protocol information.",
    "published": "2024-10-24T06:15:11.703",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-6049": {
    "cvss": 7.5,
    "description": "The web server of Lawo AG vsm LTC Time Sync (vTimeSync) is affected by a \"...\" (triple dot) path traversal vulnerability. By sending a specially crafted HTTP request, an unauthenticated remote attacker could download arbitrary files from the operating system. As a limitation, the exploitation is only possible if the requested file has some file extension, e. g. .exe or .txt.",
    "published": "2024-10-24T08:15:02.297",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-10295": {
    "cvss": 5.9,
    "description": "A flaw was found in Gateway. Sending a non-base64 'basic' auth with special characters can cause APICast to incorrectly authenticate a request. A malformed basic authentication header containing special characters bypasses authentication and allows unauthorized access to the backend. This issue can occur due to a failure in the base64 decoding process, which causes APICast to skip the rest of the authentication checks and proceed with routing the request upstream.",
    "published": "2024-10-24T18:15:05.597",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-46478": {
    "url": "https://github.com/michaelrsweet/htmldoc/commit/683bec548e642cf4a17e003fb34f6bbaf2d27b98",
    "cvss": 9.8,
    "description": "HTMLDOC v1.9.18 contains a buffer overflow in parse_pre function,ps-pdf.cxx:5681.",
    "published": "2024-10-24T18:15:08.863"
  },
  "CVE-2024-48514": {
    "cvss": "-",
    "description": "php-heic-to-jpg <= 1.0.5 is vulnerable to remote code execution. An attacker who can upload heic images is able to execute code on the remote server via the file name. As a result, the CIA is no longer guaranteed. This affects php-heic-to-jpg 1.0.5 and below.",
    "published": "2024-10-24T18:15:10.227",
    "keywords": "remote,execution"
  },
  "CVE-2024-48427": {
    "cvss": "-",
    "description": "A SQL injection vulnerability in Sourcecodester Packers and Movers Management System v1.0 allows remote authenticated users to execute arbitrary SQL commands via the id parameter in /mpms/admin/?page=services/manage_service&id",
    "published": "2024-10-24T19:15:15.703",
    "keywords": "remote,command"
  },
  "CVE-2024-45261": {
    "cvss": "-",
    "description": "An issue was discovered on certain GL-iNet devices, including MT6000, MT3000, MT2500, AXT1800, and AX1800 4.6.2. The SID generated for a specific user is not tied to that user itself, which allows other users to potentially use it for authentication. Once an attacker bypasses the application's authentication procedures, they can generate a valid SID, escalate privileges, and gain full control.",
    "published": "2024-10-24T21:15:12.057",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-48423": {
    "url": "https://github.com/assimp/assimp/issues/5788",
    "cvss": "-",
    "description": "An issue in assimp v.5.4.3 allows a local attacker to execute arbitrary code via the CallbackToLogRedirector function within the Assimp library.",
    "published": "2024-10-24T21:15:14.143"
  },
  "CVE-2024-48424": {
    "url": "https://github.com/assimp/assimp/issues/5787",
    "cvss": "-",
    "description": "A heap-buffer-overflow vulnerability has been identified in the OpenDDLParser::parseStructure function within the Assimp library, specifically during the processing of OpenGEX files.",
    "published": "2024-10-24T21:15:14.223"
  },
  "CVE-2024-48425": {
    "url": "https://github.com/assimp/assimp/issues/5791",
    "cvss": "-",
    "description": "A segmentation fault (SEGV) was detected in the Assimp::SplitLargeMeshesProcess_Triangle::UpdateNode function within the Assimp library during fuzz testing using AddressSanitizer. The crash occurs due to a read access violation at address 0x000000000460, which points to the zero page, indicating a null or invalid pointer dereference.",
    "published": "2024-10-24T21:15:14.303"
  },
  "CVE-2024-48426": {
    "url": "https://github.com/assimp/assimp/issues/5789",
    "cvss": "-",
    "description": "A segmentation fault (SEGV) was detected in the SortByPTypeProcess::Execute function in the Assimp library during fuzz testing with AddressSanitizer. The crash occurred due to a read access to an invalid memory address (0x1000c9714971).",
    "published": "2024-10-24T21:15:14.387"
  },
  "CVE-2024-48932": {
    "cvss": 5.3,
    "description": "ZimaOS is a fork of CasaOS, an operating system for Zima devices and x86-64 systems with UEFI. In version 1.2.4 and all prior versions, the API endpoint `http://<Server-ip>/v1/users/name` allows unauthenticated users to access sensitive information, such as usernames, without any authorization. This vulnerability could be exploited by an attacker to enumerate usernames and leverage them for further attacks, such as brute-force or phishing campaigns. As of time of publication, no known patched versions are available.",
    "published": "2024-10-24T21:15:14.790",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-7763": {
    "cvss": 9.8,
    "description": "In WhatsUp Gold versions released before 2024.0.0, \n\nan Authentication Bypass issue exists which allows an attacker to obtain encrypted user credentials.",
    "published": "2024-10-24T21:15:15.033",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-41617": {
    "cvss": "-",
    "description": "Money Manager EX WebApp (web-money-manager-ex) 1.2.2 is vulnerable to Incorrect Access Control. The `redirect_if_not_loggedin` function in `functions_security.php` fails to terminate script execution after redirecting unauthenticated users. This flaw allows an unauthenticated attacker to upload arbitrary files, potentially leading to Remote Code Execution.",
    "published": "2024-10-24T22:15:03.687",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-49357": {
    "cvss": 7.5,
    "description": "ZimaOS is a fork of CasaOS, an operating system for Zima devices and x86-64 systems with UEFI. In version 1.2.4 and all prior versions, the API endpoints in ZimaOS, such as `http://<Server-IP>/v1/users/image?path=/var/lib/casaos/1/app_order.json` and `http://<Server-IP>/v1/users/image?path=/var/lib/casaos/1/system.json`, expose sensitive data like installed applications and system information without requiring any authentication or authorization. This sensitive data leak can be exploited by attackers to gain detailed knowledge about the system setup, installed applications, and other critical information. As of time of publication, no known patched versions are available.",
    "published": "2024-10-24T22:15:03.880",
    "keywords": "authentication,sensitive,leak"
  },
  "CVE-2024-49762": {
    "cvss": 4.6,
    "description": "Pterodactyl is a free, open-source game server management panel. When a user disables two-factor authentication via the Panel, a `DELETE` request with their current password in a query parameter will be sent.  While query parameters are encrypted when using TLS, many webservers (including ones officially documented for use with Pterodactyl) will log query parameters in plain-text, storing a user's password in plain text. Prior to version 1.11.8, if a malicious user obtains access to these logs they could potentially authenticate against a user's account; assuming they are able to discover the account's email address or username separately. This problem has been patched in version 1.11.8. There are no workarounds at this time. There is not a direct vulnerability within the software as it relates to logs generated by intermediate components such as web servers or Layer 7 proxies. Updating to `v1.11.8` or adding the linked patch manually are the only ways to avoid this problem. As this vulnerability relates to historical logging of sensitive data, users who have ever disabled 2FA on a Panel (self-hosted or operated by a company) should change their passwords and consider enabling 2FA if it was left disabled. While it's unlikely that their account swill be compromised by this vulnerability, it's not impossible. Panel administrators should consider clearing any access logs that may contain sensitive data.",
    "published": "2024-10-24T22:15:04.897",
    "keywords": "authentication,sensitive"
  },
  "CVE-2024-9488": {
    "cvss": 9.8,
    "description": "The Comments – wpDiscuz plugin for WordPress is vulnerable to authentication bypass in all versions up to, and including, 7.6.24. This is due to insufficient verification on the user being returned by the social login token. This makes it possible for unauthenticated attackers to log in as any existing user on the site, such as an administrator, if they have access to the email and the user does not have an already-existing account for the service returning the token.",
    "published": "2024-10-25T06:15:13.727",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-47406": {
    "cvss": 9.1,
    "description": "Sharp and Toshiba Tec MFPs improperly process HTTP authentication requests, resulting in an authentication bypass vulnerability.",
    "published": "2024-10-25T07:15:04.257",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-45785": {
    "cvss": 7.5,
    "description": "MUSASI version 3 contains an issue with use of client-side authentication. If this vulnerability is exploited, other users' credential and sensitive information may be retrieved.",
    "published": "2024-10-25T08:15:02.883",
    "keywords": "authentication,sensitive"
  },
  "CVE-2024-9630": {
    "cvss": 5.4,
    "description": "The WPS Telegram Chat plugin for WordPress is vulnerable to authorization bypass due to a missing capability check when accessing messages in versions up to, and including, 4.5.4. This makes it possible for unauthenticated attackers to view the messages that are sent through the Telegram Bot API.",
    "published": "2024-10-25T08:15:03.657",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2024-44099": {
    "cvss": 5.5,
    "description": "There is a possible Local bypass of user interaction due to an insecure default value. This could lead to local information disclosure with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-10-25T11:15:16.237",
    "keywords": "execution,bypass"
  },
  "CVE-2024-44101": {
    "cvss": 7.5,
    "description": "there is a possible Null Pointer Dereference (modem crash) due to improper input validation. This could lead to remote denial of service with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-10-25T11:15:16.343",
    "keywords": "remote,execution"
  },
  "CVE-2024-47021": {
    "cvss": "-",
    "description": "In sms_ExtractCbLanguage of sms_CellBroadcast.c, there is a possible out of bounds read due to a missing bounds check. This could lead to remote information disclosure with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-10-25T11:15:16.900",
    "keywords": "remote,execution"
  },
  "CVE-2024-47023": {
    "cvss": "-",
    "description": "there is a possible man-in-the-middle attack due to a logic error in the code. This could lead to remote escalation of privilege with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-10-25T11:15:17.003",
    "keywords": "remote,execution"
  },
  "CVE-2024-47483": {
    "cvss": 2.9,
    "description": "Dell Data Lakehouse, version(s) 1.0.0.0 and 1.1.0.0, contain(s) an Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection') vulnerability. An unauthenticated attacker with local access could potentially exploit this vulnerability, leading to Information disclosure.",
    "published": "2024-10-25T11:15:17.930",
    "keywords": "unauthenticated,command"
  },
  "CVE-2024-49380": {
    "cvss": "-",
    "description": "Plenti, a static site generator, has an arbitrary file write vulnerability in versions prior to 0.7.2. The `/postLocal` endpoint is vulnerable to an arbitrary file write vulnerability when a plenti user serves their website. This issue may lead to Remote Code Execution. Version 0.7.2 fixes the vulnerability.",
    "published": "2024-10-25T14:15:12.040",
    "keywords": "remote,execution"
  },
  "CVE-2024-49753": {
    "cvss": 5.9,
    "description": "Zitadel is open-source identity infrastructure software. Versions prior to 2.64.1, 2.63.6, 2.62.8, 2.61.4, 2.60.4, 2.59.5, and 2.58.7 have a flaw in the URL validation mechanism of Zitadel actions allows bypassing restrictions intended to block requests to localhost (127.0.0.1). The isHostBlocked check, designed to prevent such requests, can be circumvented by creating a DNS record that resolves to 127.0.0.1. This enables actions to send requests to localhost despite the intended security measures. This vulnerability potentially allows unauthorized access to unsecured internal endpoints, which may contain sensitive information or functionalities. Versions 2.64.1, 2.63.6, 2.62.8, 2.61.4, 2.60.4, 2.59.5, and 2.58.7 contain a patch. No known workarounds are available.",
    "published": "2024-10-25T14:15:12.280",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-48459": {
    "cvss": "-",
    "description": "A command execution vulnerability exists in the AX2 Pro home router produced by Shenzhen Tenda Technology Co., Ltd. (Jixiang Tenda) v.DI_7003G-19.12.24A1V16.03.29.50;V16.03.29.50;V16.03.29.50. An attacker can exploit this vulnerability by constructing a malicious payload to execute commands and further obtain shell access to the router's file system with the highest privileges.",
    "published": "2024-10-25T17:15:04.703",
    "keywords": "execution,command"
  },
  "CVE-2024-48655": {
    "url": "https://github.com/totaljs/cms/issues/49",
    "cvss": "-",
    "description": "An issue in Total.js CMS v.1.0 allows a remote attacker to execute arbitrary code via the func.js file.",
    "published": "2024-10-25T17:15:04.817"
  },
  "CVE-2024-37845": {
    "cvss": "-",
    "description": "MangoOS before 5.2.0 was discovered to contain an authenticated remote code execution (RCE) vulnerability via the Active Process Command feature.",
    "published": "2024-10-25T19:15:03.973",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-48218": {
    "url": "https://github.com/funadmin/funadmin/issues/21",
    "cvss": "-",
    "description": "Funadmin v5.0.2 has a SQL injection vulnerability in /curd/table/list.",
    "published": "2024-10-25T21:15:03.603"
  },
  "CVE-2024-48222": {
    "url": "https://github.com/funadmin/funadmin/issues/22",
    "cvss": "-",
    "description": "Funadmin v5.0.2 has a SQL injection vulnerability in /curd/table/edit.",
    "published": "2024-10-25T21:15:03.680"
  },
  "CVE-2024-48223": {
    "url": "https://github.com/funadmin/funadmin/issues/23",
    "cvss": "-",
    "description": "Funadmin v5.0.2 has a SQL injection vulnerability in /curd/table/fieldlist.",
    "published": "2024-10-25T21:15:03.740"
  },
  "CVE-2024-48224": {
    "url": "https://github.com/funadmin/funadmin/issues/24",
    "cvss": "-",
    "description": "Funadmin v5.0.2 has an arbitrary file read vulnerability in /curd/index/editfile.",
    "published": "2024-10-25T21:15:03.793"
  },
  "CVE-2024-48225": {
    "url": "https://github.com/funadmin/funadmin/issues/25",
    "cvss": "-",
    "description": "Funadmin v5.0.2 has an arbitrary file deletion vulnerability in /curd/index/delfile.",
    "published": "2024-10-25T21:15:03.893"
  },
  "CVE-2024-48226": {
    "url": "https://github.com/funadmin/funadmin/issues/26",
    "cvss": "-",
    "description": "Funadmin 5.0.2 is vulnerable to SQL Injection in curd/table/savefield.",
    "published": "2024-10-25T21:15:03.953"
  },
  "CVE-2024-48227": {
    "url": "https://github.com/funadmin/funadmin/issues/27",
    "cvss": "-",
    "description": "Funadmin 5.0.2 has a logical flaw in the Curd one click command deletion function, which can result in a Denial of Service (DOS).",
    "published": "2024-10-25T21:15:04.010"
  },
  "CVE-2024-48229": {
    "url": "https://github.com/funadmin/funadmin/issues/28",
    "cvss": "-",
    "description": "funadmin 5.0.2 has a SQL injection vulnerability in the Curd one click command mode plugin.",
    "published": "2024-10-25T21:15:04.063"
  },
  "CVE-2024-48230": {
    "url": "https://github.com/funadmin/funadmin/issues/30",
    "cvss": "-",
    "description": "funadmin 5.0.2 is vulnerable to SQL Injection via the parentField parameter in the index method of \\backend\\controller\\auth\\Auth.php.",
    "published": "2024-10-25T21:15:04.123"
  },
  "CVE-2024-48228": {
    "url": "https://github.com/funadmin/funadmin/issues/31",
    "cvss": "-",
    "description": "An issue was found in funadmin 5.0.2. The selectfiles method in \\backend\\controller\\sys\\Attachh.php directly stores the passed parameters and values into the param parameter without filtering, resulting in Cross Site Scripting (XSS).",
    "published": "2024-10-25T22:15:02.383"
  },
  "CVE-2024-48237": {
    "url": "https://github.com/taosir/wtcms/issues/15",
    "cvss": "-",
    "description": "WTCMS 1.0 is vulnerable to Incorrect Access Control in \\Common\\Controller\\HomebaseController.class.php.",
    "published": "2024-10-25T22:15:02.653"
  },
  "CVE-2024-48238": {
    "url": "https://github.com/taosir/wtcms/issues/14",
    "cvss": "-",
    "description": "WTCMS 1.0 is vulnerable to SQL Injection in the edit_post method of /Admin\\Controller\\NavControl.class.php via the parentid parameter.",
    "published": "2024-10-25T22:15:02.713"
  },
  "CVE-2024-48239": {
    "url": "https://github.com/taosir/wtcms/issues/16",
    "cvss": "-",
    "description": "An issue was discovered in WTCMS 1.0. In the plupload method in \\AssetController.class.php, the app parameters aren't processed, resulting in Cross Site Scripting (XSS).",
    "published": "2024-10-25T22:15:02.770"
  },
  "CVE-2024-47821": {
    "cvss": 9.1,
    "description": "pyLoad is a free and open-source Download Manager. The folder `/.pyload/scripts` has scripts which are run when certain actions are completed, for e.g. a download is finished. By downloading a executable file to a folder in /scripts and performing the respective action, remote code execution can be achieved in versions on the 0.5 branch prior to 0.5.0b3.dev87. A file can be downloaded to such a folder by changing the download folder to a folder in `/scripts` path and using the `/flashgot` API to download the file. This vulnerability allows an attacker with access to change the settings on a pyload server to execute arbitrary code and completely compromise the system. Version 0.5.0b3.dev87 fixes this issue.",
    "published": "2024-10-25T23:15:02.530",
    "keywords": "remote,execution"
  },
  "CVE-2024-9890": {
    "cvss": 8.8,
    "description": "The User Toolkit plugin for WordPress is vulnerable to authentication bypass in versions up to, and including, 1.2.3. This is due to an improper capability check in the 'switchUser' function. This makes it possible for authenticated attackers, with subscriber-level permissions and above, to log in as any existing user on the site, such as an administrator.",
    "published": "2024-10-26T03:15:04.340",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-9930": {
    "cvss": 9.8,
    "description": "The Extensions by HocWP Team plugin for WordPress is vulnerable to authentication bypass in versions up to, and including, 0.2.3.2. This is due to missing validation on the user being supplied in the 'verify_email' action. This makes it possible for unauthenticated attackers to log in as any existing user on the site, such as an administrator. The vulnerability is in the Account extension.",
    "published": "2024-10-26T03:15:04.553",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-9931": {
    "cvss": 9.8,
    "description": "The Wux Blog Editor plugin for WordPress is vulnerable to authentication bypass in versions up to, and including, 3.0.0. This is due to missing validation on the token being supplied during the autologin through the plugin. This makes it possible for unauthenticated attackers to log in to the first administrator user.",
    "published": "2024-10-26T03:15:04.770",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-9932": {
    "cvss": 9.8,
    "description": "The Wux Blog Editor plugin for WordPress is vulnerable to arbitrary file uploads due to insufficient file type validation in the 'wuxbt_insertImageNew' function in versions up to, and including, 3.0.0. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-10-26T03:15:04.980",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-9933": {
    "cvss": 9.8,
    "description": "The WatchTowerHQ plugin for WordPress is vulnerable to authentication bypass in versions up to, and including, 3.9.6. This is due to the 'watchtower_ota_token' default value is empty, and the not empty check is missing in the 'Password_Less_Access::login' function. This makes it possible for unauthenticated attackers to log in to the WatchTowerHQ client administrator user.",
    "published": "2024-10-26T03:15:05.207",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-8392": {
    "cvss": 7.2,
    "description": "The WordPress Post Grid Layouts with Pagination – Sogrid plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 1.5.2 via the 'tab' parameter. This makes it possible for authenticated attackers, with Administrator-level access and above, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included. This can also be exploited via CSRF techniques.",
    "published": "2024-10-26T09:15:04.383",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-9772": {
    "cvss": 7.3,
    "description": "The The Uix Shortcodes – Compatible with Gutenberg plugin for WordPress is vulnerable to arbitrary shortcode execution in all versions up to, and including, 1.9.9. This is due to the software allowing users to execute an action that does not properly validate a value before running do_shortcode. This makes it possible for unauthenticated attackers to execute arbitrary shortcodes.",
    "published": "2024-10-26T10:15:10.747",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-9501": {
    "cvss": 9.8,
    "description": "The Wp Social Login and Register Social Counter plugin for WordPress is vulnerable to authentication bypass in all versions up to, and including, 3.0.7. This is due to insufficient verification on the user being returned by the social login token. This makes it possible for unauthenticated attackers to log in as any existing user on the site, such as an administrator, if they have access to the email and the user does not have an already-existing account for the service returning the token.",
    "published": "2024-10-26T13:15:11.490",
    "keywords": "unauthenticated,authentication,bypass"
  }
}