{
  "CVE-2024-23724": {
    "url": "https://github.com/tryghost/ghost/pull/19646",
    "cvss": "-",
    "description": "Ghost through 5.76.0 allows stored XSS, and resultant privilege escalation in which a contributor can take over any account, via an SVG profile picture that contains JavaScript code to interact with the API on localhost TCP port 3001. NOTE: The discoverer reports that \"The vendor does not view this as a valid vector.\"",
    "published": "2024-02-11T01:15:08.080"
  },
  "CVE-2024-25715": {
    "url": "https://github.com/babelouest/glewlwyd/commit/c91c0155f2393274cc18efe77e06c6846e404c75",
    "cvss": "-",
    "description": "Glewlwyd SSO server 2.x through 2.7.6 allows open redirection via redirect_uri.",
    "published": "2024-02-11T03:15:09.453"
  },
  "CVE-2024-25728": {
    "cvss": "-",
    "description": "ExpressVPN before 12.73.0 on Windows, when split tunneling is used, sends DNS requests according to the Windows configuration (e.g., sends them to DNS servers operated by the user's ISP instead of to the ExpressVPN DNS servers), which may allow remote attackers to obtain sensitive information about websites visited by VPN users.",
    "published": "2024-02-11T22:15:08.360",
    "keywords": "remote,sensitive,vpn"
  },
  "CVE-2024-1433": {
    "url": "https://github.com/kde/plasma-workspace/commit/6cdf42916369ebf4ad5bd876c4dfa0170d7b2f01",
    "cvss": 3.1,
    "description": "A vulnerability, which was classified as problematic, was found in KDE Plasma Workspace up to 5.93.0. This affects the function EventPluginsManager::enabledPlugins of the file components/calendar/eventpluginsmanager.cpp of the component Theme File Handler. The manipulation of the argument pluginId leads to path traversal. It is possible to initiate the attack remotely. The complexity of an attack is rather high. The exploitability is told to be difficult. The patch is named 6cdf42916369ebf4ad5bd876c4dfa0170d7b2f01. It is recommended to apply a patch to fix this issue. The associated identifier of this vulnerability is VDB-253407. NOTE: This requires write access to user's home or the installation of third party global themes.",
    "published": "2024-02-11T23:15:07.850"
  },
  "CVE-2024-0164": {
    "cvss": 7.8,
    "description": "\nDell Unity, versions prior to 5.4, contain an OS Command Injection Vulnerability in its svc_topstats utility. An authenticated attacker could potentially exploit this vulnerability, leading to the execution of arbitrary commands with elevated privileges.\n\n",
    "published": "2024-02-12T19:15:09.473",
    "keywords": "execution,command"
  },
  "CVE-2024-0165": {
    "cvss": 7.8,
    "description": "\nDell Unity, versions prior to 5.4, contains an OS Command Injection Vulnerability in its svc_acldb_dump utility. An authenticated attacker could potentially exploit this vulnerability, leading to execution of arbitrary operating system commands with root privileges.\n\n",
    "published": "2024-02-12T19:15:09.700",
    "keywords": "execution,command"
  },
  "CVE-2024-0166": {
    "cvss": 7.8,
    "description": "\nDell Unity, versions prior to 5.4, contains an OS Command Injection Vulnerability in its svc_tcpdump utility. An authenticated attacker could potentially exploit this vulnerability, leading to the execution of arbitrary OS commands with elevated privileges.\n\n",
    "published": "2024-02-12T19:15:09.960",
    "keywords": "execution,command"
  },
  "CVE-2024-22222": {
    "cvss": 7.8,
    "description": "\nDell Unity, versions prior to 5.4, contains an OS Command Injection Vulnerability within its svc_udoctor utility. An authenticated malicious user with local access could potentially exploit this vulnerability, leading to the execution of arbitrary OS commands on the application's underlying OS, with the privileges of the vulnerable application.\n\n",
    "published": "2024-02-12T19:15:11.283",
    "keywords": "execution,command"
  },
  "CVE-2024-22223": {
    "cvss": 7.8,
    "description": "\nDell Unity, versions prior to 5.4, contains an OS Command Injection Vulnerability within its svc_cbr utility. An authenticated malicious user with local access could potentially exploit this vulnerability, leading to the execution of arbitrary OS commands on the application's underlying OS, with the privileges of the vulnerable application.\n\n",
    "published": "2024-02-12T19:15:11.497",
    "keywords": "execution,command"
  },
  "CVE-2024-22225": {
    "cvss": 7.8,
    "description": "\nDell Unity, versions prior to 5.4, contains an OS Command Injection Vulnerability in its svc_supportassist utility. An authenticated attacker could potentially exploit this vulnerability, leading to execution of arbitrary operating system commands with root privileges.\n\n",
    "published": "2024-02-12T19:15:11.927",
    "keywords": "execution,command"
  },
  "CVE-2024-25110": {
    "cvss": 9.8,
    "description": "The UAMQP is a general purpose C library for AMQP 1.0. During a call to open_get_offered_capabilities, a memory allocation may fail causing a use-after-free issue and if a client called it during connection communication it may cause a remote code execution. Users are advised to update the submodule with commit `30865c9c`. There are no known workarounds for this vulnerability.",
    "published": "2024-02-12T20:15:08.803",
    "keywords": "remote,execution"
  },
  "CVE-2024-23833": {
    "cvss": 7.5,
    "description": "OpenRefine is a free, open source power tool for working with messy data and improving it. A jdbc attack vulnerability exists in OpenRefine(version<=3.7.7) where an attacker may construct a JDBC query which may read files on the host filesystem. Due to the newer MySQL driver library in the latest version of OpenRefine (8.0.30), there is no associated deserialization utilization point, so original code execution cannot be achieved, but attackers can use this vulnerability to read sensitive files on the target server. This issue has been addressed in version 3.7.8. Users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-02-12T21:15:08.760",
    "keywords": "execution,sensitive"
  },
  "CVE-2024-1454": {
    "url": "https://github.com/opensc/opensc/commit/5835f0d4f6c033bd58806d33fa546908d39825c9",
    "cvss": 3.4,
    "description": "The use-after-free vulnerability was found in the AuthentIC driver in OpenSC packages, occuring in the card enrolment process using pkcs15-init when a user or administrator enrols or modifies cards. An attacker must have physical access to the computer system and requires a crafted USB device or smart card to present the system with specially crafted responses to the APDUs, which are considered high complexity and low severity. This manipulation can allow for compromised card management operations during enrolment.",
    "published": "2024-02-12T23:15:08.410"
  },
  "CVE-2024-25407": {
    "url": "https://github.com/steve-community/steve/issues/1296",
    "cvss": "-",
    "description": "SteVe v3.6.0 was discovered to use predictable transaction ID's when receiving a StartTransaction request. This vulnerability can allow attackers to cause a Denial of Service (DoS) by using the predicted transaction ID's to terminate other transactions.",
    "published": "2024-02-13T01:15:08.470"
  },
  "CVE-2024-22131": {
    "cvss": 9.1,
    "description": "In SAP ABA (Application Basis) - versions 700, 701, 702, 731, 740, 750, 751, 752, 75C, 75I, an attacker authenticated as a user with a remote execution authorization can use a vulnerable interface. This allows the attacker to use the interface to invoke an application function to perform actions which they would not normally be permitted to perform.  Depending on the function executed, the attack can read or modify any user/business data and can make the entire system unavailable.\n\n",
    "published": "2024-02-13T03:15:08.363",
    "keywords": "remote,execution"
  },
  "CVE-2024-24743": {
    "cvss": 8.6,
    "description": "SAP NetWeaver AS Java (CAF - Guided Procedures) - version 7.50, allows an unauthenticated attacker to submit a malicious request with a crafted XML file over the network, which when parsed will enable him to access sensitive files and data but not modify them. There are expansion limits in place so that availability is not affected.\n\n",
    "published": "2024-02-13T03:15:09.393",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-25642": {
    "cvss": 7.4,
    "description": "Due to improper validation of certificate in SAP Cloud Connector - version 2.0, attacker can impersonate the genuine servers to interact with SCC breaking the mutual authentication. Hence, the attacker can intercept the request to view/modify sensitive information. There is no impact on the availability of the system.\n\n",
    "published": "2024-02-13T03:15:09.613",
    "keywords": "authentication,sensitive"
  },
  "CVE-2024-21491": {
    "cvss": 6.8,
    "description": "Versions of the package svix before 1.17.0 are vulnerable to Authentication Bypass due to an issue in the verify function where signatures of different lengths are incorrectly compared. An attacker can bypass signature verification by providing a shorter signature that matches the beginning of the actual signature.\r\r**Note:**\r\rThe attacker would need to know a victim uses the Rust library for verification,no easy way to automatically check that; and uses webhooks by a service that uses Svix, and then figure out a way to craft a malicious payload that will actually include all of the correct identifiers needed to trick the receivers to cause actual issues.",
    "published": "2024-02-13T05:15:08.873",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-22445": {
    "cvss": 7.2,
    "description": "\nDell PowerProtect Data Manager, version 19.15 and prior versions, contain an OS command injection vulnerability. A remote high privileged attacker could potentially exploit this vulnerability, leading to the execution of arbitrary OS commands on the application's underlying OS, with the privileges of the vulnerable application. Exploitation may lead to a system take over by an attacker.\n\n",
    "published": "2024-02-13T08:16:35.723",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-22454": {
    "cvss": 8.8,
    "description": "\nDell PowerProtect Data Manager, version 19.15 and prior versions, contain a weak password recovery mechanism for forgotten passwords. A remote unauthenticated attacker could potentially exploit this vulnerability, leading to unauthorized access to the application with privileges of the compromised account. The attacker could retrieve the reset password token without authorization and then perform the password change\n\n",
    "published": "2024-02-13T08:16:35.993",
    "keywords": "remote,unauthenticated"
  }
}