{
  "CVE-2024-45346": {
    "cvss": 8.8,
    "description": "A code execution vulnerability exists in the XiaomiGetApps application product. This vulnerability is caused by the verification logic being bypassed, and an attacker can exploit this vulnerability to execute malicious code.",
    "published": "2024-08-28T07:15:08.823",
    "keywords": "execution,bypass"
  },
  "CVE-2024-6311": {
    "cvss": 7.2,
    "description": "The Funnelforms Free plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the 'af2_add_font' function in all versions up to, and including, 3.7.3.2. This makes it possible for authenticated attackers, with administrator-level and above permissions, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-08-28T07:15:10.800",
    "keywords": "remote,execution"
  },
  "CVE-2024-6312": {
    "cvss": 6.5,
    "description": "The Funnelforms Free plugin for WordPress is vulnerable to arbitrary file deletion in all versions up to, and including, 3.7.3.2 via the 'af2DeleteFontFile' function. This is due to the plugin not properly validating a file or its path prior to deleting it. This makes it possible for unauthenticated attackers to delete arbitrary files, including the wp-config.php file, which can make site takeover and remote code execution possible.",
    "published": "2024-08-28T07:15:11.413",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-6449": {
    "cvss": "-",
    "description": "HyperView Geoportal Toolkit in versions though 8.2.4 does not restrict cross-domain requests when fetching remote content pointed by one of GET request parameters.\nAn unauthenticated remote attacker can prepare links, which upon opening will load scripts from a remote location controlled by the attacker and execute them in the user space.\nBy manipulating this parameter it is also possible to enumerate some of the devices in Local Area Network in which the server resides.",
    "published": "2024-08-28T12:15:06.340",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-8195": {
    "cvss": 5.3,
    "description": "The Permalink Manager Lite plugin for WordPress is vulnerable to unauthorized access of data due to a missing capability check on the 'debug_data', 'debug_query', and 'debug_redirect' functions in all versions up to, and including, 2.4.4. This makes it possible for unauthenticated attackers to extract sensitive data including password, title, and content of password-protected posts.",
    "published": "2024-08-28T14:15:08.990",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-42698": {
    "url": "https://github.com/shedaniel/roughlyenoughitems/commit/e80ca84f1affb91d2388ddb298bfc6b141828cad",
    "cvss": 4.3,
    "description": "Roughly Enough Items (REI) v.16.0.729 and before contains an Improper Validation of Specified Index, Position, or Offset in Input vulnerability. The specific issue is a failure to validate slot index and decrement stack count in the Roughly Enough Items (REI) mod for Minecraft, which allows in-game item duplication.",
    "published": "2024-08-28T16:15:09.210"
  },
  "CVE-2024-20284": {
    "cvss": 5.3,
    "description": "A vulnerability in the Python interpreter of Cisco NX-OS Software could allow an authenticated, low-privileged, local attacker to escape the Python sandbox and gain unauthorized access to the underlying operating system of the device.\r\n\r\nThe vulnerability is due to insufficient validation of user-supplied input. An attacker could exploit this vulnerability by manipulating specific functions within the Python interpreter. A successful exploit could allow an attacker to escape the Python sandbox and execute arbitrary commands on the underlying operating system with the privileges of the authenticated user.&nbsp;\r\nNote: An attacker must be authenticated with Python execution privileges to exploit these vulnerabilities. For more information regarding Python execution privileges, see product-specific documentation, such as the  section of the Cisco Nexus 9000 Series NX-OS Programmability Guide.",
    "published": "2024-08-28T17:15:06.893",
    "keywords": "execution,command"
  },
  "CVE-2024-20285": {
    "cvss": 5.3,
    "description": "A vulnerability in the Python interpreter of Cisco NX-OS Software could allow an authenticated, low-privileged, local attacker to escape the Python sandbox and gain unauthorized access to the underlying operating system of the device.\r\n\r\nThe vulnerability is due to insufficient validation of user-supplied input. An attacker could exploit this vulnerability by manipulating specific functions within the Python interpreter. A successful exploit could allow an attacker to escape the Python sandbox and execute arbitrary commands on the underlying operating system with the privileges of the authenticated user.&nbsp;\r\nNote: An attacker must be authenticated with Python execution privileges to exploit these vulnerabilities. For more information regarding Python execution privileges, see product-specific documentation, such as the  section of the Cisco Nexus 9000 Series NX-OS Programmability Guide.",
    "published": "2024-08-28T17:15:07.687",
    "keywords": "execution,command"
  },
  "CVE-2024-20286": {
    "cvss": 5.3,
    "description": "A vulnerability in the Python interpreter of Cisco NX-OS Software could allow an authenticated, low-privileged, local attacker to escape the Python sandbox and gain unauthorized access to the underlying operating system of the device.\r\n\r\nThe vulnerability is due to insufficient validation of user-supplied input. An attacker could exploit this vulnerability by manipulating specific functions within the Python interpreter. A successful exploit could allow an attacker to escape the Python sandbox and execute arbitrary commands on the underlying operating system with the privileges of the authenticated user.&nbsp;\r\nNote: An attacker must be authenticated with Python execution privileges to exploit these vulnerabilities. For more information regarding Python execution privileges, see product-specific documentation, such as the  section of the Cisco Nexus 9000 Series NX-OS Programmability Guide.",
    "published": "2024-08-28T17:15:08.400",
    "keywords": "execution,command"
  },
  "CVE-2024-20446": {
    "cvss": 8.6,
    "description": "A vulnerability in the DHCPv6 relay agent of Cisco NX-OS Software could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition on an affected device.\r\n\r\nThis vulnerability is due to improper handling of specific fields in a DHCPv6 RELAY-REPLY message. An attacker could exploit this vulnerability by sending a crafted DHCPv6 packet to any IPv6 address that is configured on an affected device. A successful exploit could allow the attacker to cause the dhcp_snoop process to crash and restart multiple times, causing the affected device to reload and resulting in a DoS condition.",
    "published": "2024-08-28T17:15:09.997",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-42905": {
    "cvss": 9.8,
    "description": "Beijing Digital China Cloud Technology Co., Ltd. DCME-320 v.7.4.12.60 has a command execution vulnerability, which can be exploited to obtain device administrator privileges via the getVar function in the code/function/system/tool/ping.php file.",
    "published": "2024-08-28T18:15:09.630",
    "keywords": "execution,command"
  },
  "CVE-2024-34195": {
    "cvss": 9.8,
    "description": "TOTOLINK AC1200 Wireless Router A3002R Firmware V1.1.1-B20200824 is vulnerable to Buffer Overflow. In the boa server program's CGI handling function formWlEncrypt, there is a lack of length restriction on the wlan_ssid field. This oversight leads to potential buffer overflow under specific circumstances. For instance, by invoking the formWlanRedirect function with specific parameters to alter wlan_idx's value and subsequently invoking the formWlEncrypt function, an attacker can trigger buffer overflow, enabling arbitrary command execution or denial of service attacks.",
    "published": "2024-08-28T20:15:07.580",
    "keywords": "execution,command"
  },
  "CVE-2024-45043": {
    "cvss": 5.3,
    "description": "The OpenTelemetry Collector module AWS firehose receiver is for ingesting AWS Kinesis Data Firehose delivery stream messages and parsing the records received based on the configured record type. `awsfirehosereceiver` allows unauthenticated remote requests, even when configured to require a key. OpenTelemetry Collector can be configured to receive CloudWatch metrics via an AWS Firehose Stream. Firehose sets the header `X-Amz-Firehose-Access-Key` with an arbitrary configured string. The OpenTelemetry Collector awsfirehosereceiver can optionally be configured to require this key on incoming requests. However, when this is configured it **still accepts incoming requests with no key**. Only OpenTelemetry Collector users configured with the “alpha” `awsfirehosereceiver` module are affected. This module was added in version v0.49.0 of the “Contrib” distribution (or may be included in custom builds). There is a risk of unauthorized users writing metrics. Carefully crafted metrics could hide other malicious activity. There is no risk of exfiltrating data. It’s likely these endpoints will be exposed to the public internet, as Firehose does not support private HTTP endpoints. A fix was introduced in PR #34847 and released with v0.108.0. All users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-08-28T20:15:08.347",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-45057": {
    "url": "https://github.com/portabilis/i-educar/commit/f2d768534aabc09b2a1fc8a5cc5f9c93925cb273",
    "cvss": 6.3,
    "description": "i-Educar is free, completely online school management software that allows school secretaries, teachers, coordinators and area managers. The lack of sanitization of user-controlled parameters for generating HTML field values ??dynamically leads to XSS (Cross-Site Scripting) attacks. The dynamic generation of HTML fields in the ieducar/intranet/include/clsCampos.inc.php file does not perform the correct validation or sanitization, reflecting the user-controlled values ??to be shown in the page's HTML. This allows an attacker to inject a specific XSS payload into a parameter. Successful exploitation of this flaw allows an attacker to trick the victim into clicking a vulnerable URL, enabling JavaScript scripts to be executed in the browser. Due to the configuration of session cookies, with the HttpOnly and SameSite=Lax flags being defined, there is little an attacker can do to steal the session or force the victim to perform actions within the application. This issue hast been patched but a new release has not yet been made. Users are advised to contact the developer and to coordinate an update schedule.",
    "published": "2024-08-28T21:15:07.027"
  },
  "CVE-2024-45435": {
    "url": "https://github.com/chartist-js/chartist/issues/1427",
    "cvss": 9.8,
    "description": "Chartist 1.x through 1.3.0 allows Prototype Pollution via the extend function.",
    "published": "2024-08-29T03:15:05.357"
  },
  "CVE-2024-7856": {
    "cvss": 9.1,
    "description": "The MP3 Audio Player – Music Player, Podcast Player & Radio by Sonaar plugin for WordPress is vulnerable to unauthorized arbitrary file deletion due to a missing capability check on the removeTempFiles() function and insufficient path validation on the 'file' parameter in all versions up to, and including, 5.7.0.1. This makes it possible for authenticated attackers, with subscriber-level access and above, to delete arbitrary files which can make remote code execution possible when wp-config.php is deleted.",
    "published": "2024-08-29T11:15:29.173",
    "keywords": "remote,execution"
  },
  "CVE-2024-2541": {
    "cvss": 5.3,
    "description": "The Popup Builder plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 4.3.3 via the Subscribers Import feature. This makes it possible for unauthenticated attackers to extract sensitive data after an administrator has imported subscribers via a CSV file. This data may include the first name, last name, e-mail address, and potentially other personally identifiable information of subscribers.",
    "published": "2024-08-29T13:15:06.403",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-3679": {
    "cvss": 5.3,
    "description": "The Premium SEO Pack – WP SEO Plugin plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 1.6.001. This makes it possible for unauthenticated attackers to view limited information from password protected posts through the social meta data.",
    "published": "2024-08-29T13:15:06.627",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-8304": {
    "url": "https://github.com/jpressprojects/jpress/issues/189",
    "cvss": 4.7,
    "description": "A vulnerability has been found in jpress up to 5.1.1 and classified as critical. Affected by this vulnerability is an unknown functionality of the file /admin/template/edit of the component Template Module Handler. The manipulation leads to path traversal. The attack can be launched remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2024-08-29T15:15:35.070"
  },
  "CVE-2024-8255": {
    "cvss": "-",
    "description": "Delta Electronics DTN Soft version 2.0.1 and prior are vulnerable to an attacker achieving remote code execution through a deserialization of untrusted data vulnerability.",
    "published": "2024-08-29T16:15:10.140",
    "keywords": "remote,execution"
  },
  "CVE-2024-35133": {
    "cvss": 6.8,
    "description": "IBM Security Verify Access 10.0.0 through 10.0.8 OIDC Provider could allow a remote attacker to conduct phishing attacks, using an open redirect attack. By persuading a victim to visit a specially crafted Web site, a remote attacker could exploit this vulnerability to spoof the URL displayed to redirect a user to a malicious Web site that would appear to be trusted. This could allow the attacker to obtain highly sensitive information or conduct further attacks against the victim.",
    "published": "2024-08-29T17:15:07.250",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-44930": {
    "url": "https://github.com/serilog-contrib/serilog-enrichers-clientinfo/issues/29",
    "cvss": "-",
    "description": "Serilog before v2.1.0 was discovered to contain a Client IP Spoofing vulnerability, which allows attackers to falsify their IP addresses by specifying an arbitrary IP as a value of X-Forwarded-For or Client-Ip headers while performing HTTP requests.",
    "published": "2024-08-29T18:15:14.830"
  },
  "CVE-2024-41345": {
    "url": "https://github.com/jpatokal/openflights/issues/1480",
    "cvss": 6.1,
    "description": "openflights commit 5234b5b is vulnerable to Cross-Site Scripting (XSS) via php/trip.php",
    "published": "2024-08-29T20:15:08.393"
  },
  "CVE-2024-41346": {
    "url": "https://github.com/jpatokal/openflights/issues/1479",
    "cvss": 6.1,
    "description": "openflights commit 5234b5b is vulnerable to Cross-Site Scripting (XSS) via php/submit.php",
    "published": "2024-08-29T20:15:08.483"
  },
  "CVE-2024-41347": {
    "url": "https://github.com/jpatokal/openflights/issues/1477",
    "cvss": 6.1,
    "description": "openflights commit 5234b5b is vulnerable to Cross-Site Scripting (XSS) via php/settings.php",
    "published": "2024-08-29T20:15:08.573"
  },
  "CVE-2024-41348": {
    "url": "https://github.com/jpatokal/openflights/issues/1478",
    "cvss": 6.1,
    "description": "openflights commit 5234b5b is vulnerable to Cross-Site Scripting (XSS) via php/alsearch.php",
    "published": "2024-08-29T20:15:08.667"
  },
  "CVE-2024-41358": {
    "url": "https://github.com/phpipam/phpipam/issues/4148",
    "cvss": "-",
    "description": "phpipam 1.6 is vulnerable to Cross Site Scripting (XSS) via app\\admin\\import-export\\import-load-data.php.",
    "published": "2024-08-29T20:15:08.873"
  },
  "CVE-2024-41361": {
    "cvss": 9.8,
    "description": "RPi-Jukebox-RFID v2.7.0 was discovered to contain a remote code execution (RCE) vulnerability via htdocs\\manageFilesFolders.php",
    "published": "2024-08-29T20:15:08.953",
    "keywords": "remote,execution"
  },
  "CVE-2024-41364": {
    "cvss": 9.8,
    "description": "RPi-Jukebox-RFID v2.7.0 was discovered to contain a remote code execution (RCE) vulnerability via htdocs\\trackEdit.php",
    "published": "2024-08-29T20:15:09.033",
    "keywords": "remote,execution"
  },
  "CVE-2024-41366": {
    "cvss": 9.8,
    "description": "RPi-Jukebox-RFID v2.7.0 was discovered to contain a remote code execution (RCE) vulnerability via htdocs\\userScripts.php",
    "published": "2024-08-29T20:15:09.113",
    "keywords": "remote,execution"
  },
  "CVE-2024-41367": {
    "cvss": 9.8,
    "description": "RPi-Jukebox-RFID v2.7.0 was discovered to contain a remote code execution (RCE) vulnerability via htdocs\\api\\playlist\\appendFileToPlaylist.php",
    "published": "2024-08-29T20:15:09.193",
    "keywords": "remote,execution"
  },
  "CVE-2024-41368": {
    "cvss": 9.8,
    "description": "RPi-Jukebox-RFID v2.7.0 was discovered to contain a remote code execution (RCE) vulnerability via htdocs\\inc.setWlanIpMail.php",
    "published": "2024-08-29T20:15:09.277",
    "keywords": "remote,execution"
  },
  "CVE-2024-41369": {
    "cvss": 9.8,
    "description": "RPi-Jukebox-RFID v2.7.0 was discovered to contain a remote code execution (RCE) vulnerability via htdocs\\inc.setWifi.php",
    "published": "2024-08-29T20:15:09.350",
    "keywords": "remote,execution"
  },
  "CVE-2024-41370": {
    "url": "https://github.com/causefx/organizr/issues/1998",
    "cvss": 9.8,
    "description": "Organizr v1.90 was discovered to contain a SQL injection vulnerability via chat/setlike.php.",
    "published": "2024-08-29T20:15:09.433"
  },
  "CVE-2024-41371": {
    "url": "https://github.com/causefx/organizr/issues/1997",
    "cvss": 6.1,
    "description": "Organizr v1.90 is vulnerable to Cross Site Scripting (XSS) via api.php.",
    "published": "2024-08-29T20:15:09.493"
  },
  "CVE-2024-41372": {
    "url": "https://github.com/causefx/organizr/issues/1999",
    "cvss": 9.8,
    "description": "Organizr v1.90 was discovered to contain a SQL injection vulnerability via chat/settyping.php.",
    "published": "2024-08-29T20:15:09.553"
  },
  "CVE-2024-41349": {
    "url": "https://github.com/cdevroe/unmark/issues/290",
    "cvss": "-",
    "description": "unmark 1.9.2 is vulnerable to Cross Site Scripting (XSS) via application/views/marks/add_by_url.php.",
    "published": "2024-08-29T21:15:10.433"
  },
  "CVE-2024-8234": {
    "cvss": 7.5,
    "description": "** UNSUPPORTED WHEN ASSIGNED ** A command injection vulnerability in the functions formSysCmd(), formUpgradeCert(), and formDelcert() in the Zyxel NWA1100-N firmware version 1.00(AACE.1)C0 could allow an unauthenticated attacker to execute some OS commands to access system files on an affected device.",
    "published": "2024-08-30T01:15:03.797",
    "keywords": "unauthenticated,command"
  },
  "CVE-2024-45490": {
    "url": "https://github.com/libexpat/libexpat/pull/890",
    "cvss": 9.8,
    "description": "An issue was discovered in libexpat before 2.6.3. xmlparse.c does not reject a negative length for XML_ParseBuffer.",
    "published": "2024-08-30T03:15:03.757"
  },
  "CVE-2024-45491": {
    "url": "https://github.com/libexpat/libexpat/pull/891",
    "cvss": 7.3,
    "description": "An issue was discovered in libexpat before 2.6.3. dtdCopy in xmlparse.c can have an integer overflow for nDefaultAtts on 32-bit platforms (where UINT_MAX equals SIZE_MAX).",
    "published": "2024-08-30T03:15:03.850"
  },
  "CVE-2024-45492": {
    "url": "https://github.com/libexpat/libexpat/pull/892",
    "cvss": 7.3,
    "description": "An issue was discovered in libexpat before 2.6.3. nextScaffoldPart in xmlparse.c can have an integer overflow for m_groupSize on 32-bit platforms (where UINT_MAX equals SIZE_MAX).",
    "published": "2024-08-30T03:15:03.930"
  },
  "CVE-2024-8327": {
    "cvss": 8.8,
    "description": "Easy test\n\nOnline Learning and Testing Platform from HWA JIUH DIGITAL TECHNOLOGY does not properly validate a specific page parameter, allowing remote attackers with regular privilege to inject arbitrary SQL commands to read, modify, and delete database contents.",
    "published": "2024-08-30T03:15:04.020",
    "keywords": "remote,command"
  },
  "CVE-2024-8329": {
    "cvss": 8.8,
    "description": "6SHR system from Gether Technology does not properly validate the specific page parameter, allowing remote attackers with regular privilege to inject SQL command to read, modify, and delete database contents.",
    "published": "2024-08-30T03:15:04.463",
    "keywords": "remote,command"
  },
  "CVE-2024-8330": {
    "cvss": 8.8,
    "description": "6SHR system from Gether Technology does not properly validate uploaded file types, allowing remote attackers with regular privileges to upload web shell scripts and use them to execute arbitrary system commands on the server.",
    "published": "2024-08-30T03:15:04.660",
    "keywords": "remote,command"
  },
  "CVE-2024-39300": {
    "cvss": 8.1,
    "description": "Missing authentication vulnerability exists in Telnet function of WAB-I1750-PS v1.5.10 and earlier. When Telnet function of the product is enabled, a remote attacker may login to the product without authentication and alter the product's settings.",
    "published": "2024-08-30T07:15:11.837",
    "keywords": "remote,authentication"
  },
  "CVE-2024-8252": {
    "cvss": 8.8,
    "description": "The Clean Login plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 1.14.5 via the 'template' attribute of the clean-login-register shortcode. This makes it possible for authenticated attackers, with Contributor-level access and above, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-08-30T10:15:07.657",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-44916": {
    "cvss": 7.2,
    "description": "Vulnerability in admin_ip.php in Seacms v13.1, when action=set, allows attackers to control IP parameters that are written to the data/admin/ip.php file and could result in arbitrary command execution.",
    "published": "2024-08-30T16:15:09.623",
    "keywords": "execution,command"
  }
}