{
  "CVE-2025-10658": {
    "cvss": 6.5,
    "description": "The SupportCandy – Helpdesk & Customer Support Ticket System plugin for WordPress is vulnerable to Authentication Bypass in all versions up to, and including, 3.3.7. This is due to missing rate limiting on the OTP verification for guest login. This makes it possible for unauthenticated attackers to bypass authentication and gain unauthorized access to customer support tickets by brute forcing the 6-digit OTP code.",
    "published": "2025-09-20T07:15:35.607",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2025-10759": {
    "cvss": 5.3,
    "description": "A vulnerability was detected in Webkul QloApps up to 1.7.0. This affects an unknown function of the component CSRF Token Handler. Performing manipulation of the argument token results in authorization bypass. The attack may be initiated remotely. The exploit is now public and may be used. The vendor explains: \"As We are already aware about this vulnerability and our Internal team are already working on this issue. (...) We'll implement the fix for this vulnerability in our next major release.\"",
    "published": "2025-09-21T01:15:49.020",
    "keywords": "remote,bypass"
  },
  "CVE-2025-10761": {
    "cvss": 3.7,
    "description": "A vulnerability has been found in Harness 3.3.0. Affected is an unknown function of the file /api/v1/login of the component Login Endpoint. The manipulation leads to improper restriction of excessive authentication attempts. Remote exploitation of the attack is possible. The attack is considered to have high complexity. The exploitability is told to be difficult. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2025-09-21T04:15:37.760",
    "keywords": "remote,authentication"
  },
  "CVE-2025-10762": {
    "url": "https://github.com/kuaifan/dootask/issues/283#issue-3379188930",
    "cvss": 6.3,
    "description": "A vulnerability was found in kuaifan DooTask up to 1.2.49. Affected by this vulnerability is an unknown functionality of the file app/Http/Controllers/Api/UsersController.php. The manipulation of the argument keys[department] results in sql injection. The attack can be executed remotely. The exploit has been made public and could be used.",
    "published": "2025-09-21T05:15:33.433"
  },
  "CVE-2025-10767": {
    "cvss": 4.5,
    "description": "A vulnerability was detected in CosmodiumCS OnlyRAT up to 3.2. The affected element is the function connect/remote_upload/remote_download of the file main.py of the component Configuration File Handler. The manipulation of the argument configuration[\"PASSWORD\"] results in os command injection. The attack requires a local approach. Attacks of this nature are highly complex. The exploitability is described as difficult. The exploit is now public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2025-09-21T22:15:34.750",
    "keywords": "remote,command"
  },
  "CVE-2025-10770": {
    "url": "https://github.com/jeecgboot/jimureport/issues/4116#issue-3391107887",
    "cvss": 6.3,
    "description": "A vulnerability was found in jeecgboot JimuReport up to 2.1.2. This impacts an unknown function of the file /drag/onlDragDataSource/testConnection of the component MySQL JDBC Handler. Performing manipulation results in deserialization. Remote exploitation of the attack is possible. The exploit has been made public and could be used.",
    "published": "2025-09-21T23:15:34.940"
  },
  "CVE-2025-10771": {
    "url": "https://github.com/jeecgboot/jimureport/issues/4117#issue-3391268438",
    "cvss": 6.3,
    "description": "A vulnerability was determined in jeecgboot JimuReport up to 2.1.2. Affected is an unknown function of the file /drag/onlDragDataSource/testConnection of the component DB2 JDBC Handler. Executing manipulation of the argument clientRerouteServerListJNDIName can lead to deserialization. The attack can be executed remotely. The exploit has been publicly disclosed and may be utilized.",
    "published": "2025-09-21T23:15:35.150"
  },
  "CVE-2025-10772": {
    "cvss": 6.3,
    "description": "A vulnerability was identified in huggingface LeRobot up to 0.3.3. Affected by this vulnerability is an unknown functionality of the file lerobot/common/robot_devices/robots/lekiwi_remote.py of the component ZeroMQ Socket Handler. The manipulation leads to missing authentication. The attack can only be initiated within the local network. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2025-09-22T00:15:39.410",
    "keywords": "remote,authentication"
  },
  "CVE-2025-10775": {
    "cvss": 4.7,
    "description": "A security vulnerability has been detected in Wavlink WL-NU516U1 240425. This vulnerability affects the function sub_4012A0 of the file /cgi-bin/login.cgi. Such manipulation of the argument ipaddr leads to os command injection. It is possible to launch the attack remotely. The exploit has been disclosed publicly and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2025-09-22T01:15:36.260",
    "keywords": "remote,command"
  },
  "CVE-2025-5962": {
    "cvss": 7.7,
    "description": "A flaw was found in the Lightspeed history service. Insufficient access controls allow a local, unprivileged user to access and manipulate the chat history of another user on the same system. By abusing inter-process communication  calls to the history service, an attacker can view, delete, or inject arbitrary history entries, including misleading or malicious commands. This can be used to deceive another user into executing harmful actions, posing a risk of privilege misuse or unauthorized command execution through social engineering.",
    "published": "2025-09-22T08:15:34.533",
    "keywords": "execution,command"
  },
  "CVE-2025-10854": {
    "url": "https://github.com/neuml/txtai/issues/965",
    "cvss": 8.1,
    "description": "The txtai framework allows the loading of compressed tar files as embedding indices. While the validate function is intended to prevent path traversal vulnerabilities by ensuring safe filenames, it does not account for symbolic links within the tar file. An attacker is able to write a file anywhere in the filesystem when txtai is used to load untrusted embedding indices",
    "published": "2025-09-22T13:16:01.347"
  },
  "CVE-2025-51006": {
    "url": "https://github.com/appneta/tcpreplay/issues/926",
    "cvss": 7.8,
    "description": "Within tcpreplay's tcprewrite, a double free vulnerability has been identified in the dlt_linuxsll2_cleanup() function in plugins/dlt_linuxsll2/linuxsll2.c. This vulnerability is triggered when tcpedit_dlt_cleanup() indirectly invokes the cleanup routine multiple times on the same memory region. By supplying a specifically crafted pcap file to the tcprewrite binary, a local attacker can exploit this flaw to cause a Denial of Service (DoS) via memory corruption.",
    "published": "2025-09-22T14:15:49.713"
  },
  "CVE-2025-57432": {
    "cvss": "-",
    "description": "Blackmagic Web Presenter version 3.3 exposes a Telnet service on port 9977 that accepts unauthenticated commands. This service allows remote attackers to manipulate stream settings, including changing video modes and possibly altering device functionality. No credentials or authentication mechanisms are required to interact with the Telnet interface.",
    "published": "2025-09-22T16:15:44.753",
    "keywords": "remote,unauthenticated,authentication,command"
  },
  "CVE-2025-57601": {
    "cvss": "-",
    "description": "AiKaan Cloud Controller uses a single hardcoded SSH private key and the username `proxyuser` for remote terminal access to all managed IoT/edge devices. When an administrator initiates \"Open Remote Terminal\" from the AiKaan dashboard, the controller sends this same static private key to the target device. The device then uses it to establish a reverse SSH tunnel to a remote access server, enabling browser-based SSH access for the administrator. Because the same `proxyuser` account and SSH key are reused across all customer environments: - An attacker who obtains the key (e.g., by intercepting it in transit, extracting it from the remote access server, or from a compromised admin account) can impersonate any managed device. - They can establish unauthorized reverse SSH tunnels and interact with devices without the owner's consent. This is a design flaw in the authentication model: compromise of a single key compromises the trust boundary between the controller and devices.",
    "published": "2025-09-22T16:15:45.000",
    "keywords": "remote,authentication"
  },
  "CVE-2025-57602": {
    "cvss": "-",
    "description": "Insufficient hardening of the proxyuser account in the AiKaan IoT management platform, combined with the use of a shared, hardcoded SSH private key, allows remote attackers to authenticate to the cloud controller, gain interactive shell access, and pivot into other connected IoT devices. This can lead to remote code execution, information disclosure, and privilege escalation across customer environments.",
    "published": "2025-09-22T16:15:45.130",
    "keywords": "remote,execution"
  },
  "CVE-2025-57431": {
    "cvss": 8.8,
    "description": "The Sound4 PULSE-ECO AES67 1.22 web-based management interface is vulnerable to Remote Code Execution (RCE) via a malicious firmware update package. The update mechanism fails to validate the integrity of manual.sh, allowing an attacker to inject arbitrary commands by modifying this script and repackaging the firmware.",
    "published": "2025-09-22T17:16:08.303",
    "keywords": "remote,execution,command"
  },
  "CVE-2025-57434": {
    "cvss": 8.8,
    "description": "Creacast Creabox Manager contains a critical authentication flaw that allows an attacker to bypass login validation. The system grants access when the username is creabox and the password begins with the string creacast, regardless of what follows.",
    "published": "2025-09-22T17:16:08.423",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-57437": {
    "cvss": 9.8,
    "description": "The Blackmagic Web Presenter HD firmware version 3.3 exposes sensitive information via an unauthenticated Telnet service on port 9977. When connected, the service reveals extensive device configuration data including: - Model, version, and unique identifiers - Network settings including IP, MAC, DNS - Current stream platform, stream key, and streaming URL - Audio/video configuration This data can be used to hijack live streams or perform network reconnaissance.",
    "published": "2025-09-22T18:15:45.153",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-57438": {
    "cvss": 6.8,
    "description": "The 2wcom IP-4c 2.15.5 device suffers from a Broken Access Control vulnerability. Certain sensitive endpoints are intended to be accessible only after the admin explicitly grants access to a manager-level account. However, a manager-level user can bypass these controls by intercepting and modifying requests.",
    "published": "2025-09-22T18:15:45.357",
    "keywords": "sensitive,bypass"
  },
  "CVE-2025-57439": {
    "cvss": 8.8,
    "description": "Creacast Creabox Manager 4.4.4 contains a critical Remote Code Execution vulnerability accessible via the edit.php endpoint. An authenticated attacker can inject arbitrary Lua code into the configuration, which is then executed on the server. This allows full system compromise, including reverse shell execution or arbitrary command execution.",
    "published": "2025-09-22T18:15:45.610",
    "keywords": "remote,execution,command"
  },
  "CVE-2025-57440": {
    "cvss": "-",
    "description": "The Blackmagic ATEM Mini Pro 2.7 exposes an undocumented Telnet service on TCP port 9993, which accepts unauthenticated plaintext commands for controlling streaming, recording, formatting storage devices, and system reboot. This interface, referred to as the \"ATEM Ethernet Protocol 1.0\", provides complete device control without requiring credentials or encryption. An attacker on the same network (or with remote access to the exposed port) can exploit this interface to execute arbitrary streaming commands, erase disks, or shut down the device - effectively gaining full remote control.",
    "published": "2025-09-22T18:15:45.830",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2025-57441": {
    "cvss": 9.8,
    "description": "The Blackmagic ATEM Mini Pro 2.7 exposes sensitive device and stream configuration information via an unauthenticated Telnet service on port 9990. Upon connection, the attacker can access a protocol preamble that leaks the video mode, routing configuration, input/output labels, device model, and even internal identifiers such as the unique ID. This can be used for reconnaissance and planning further attacks.",
    "published": "2025-09-22T18:15:45.953",
    "keywords": "unauthenticated,sensitive,leak"
  },
  "CVE-2025-57685": {
    "cvss": "-",
    "description": "The LB-Link routers, including the BL-AC2100_AZ3 V1.0.4, BL-WR4000 v2.5.0, BL-WR9000_AE4 v2.4.9, BL-AC1900_AZ2 v1.0.2, BL-X26_AC8 v1.2.8, and BL-LTE300_DA4 V1.2.3 models, are vulnerable to unauthorized command injection. Attackers can exploit this vulnerability by accessing the /goform/set_serial_cfg interface to gain the highest level of device privileges without authorization, enabling them to remotely execute malicious commands.",
    "published": "2025-09-22T19:15:44.873",
    "keywords": "remote,command"
  },
  "CVE-2025-58250": {
    "cvss": 8.8,
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in ApusTheme Findgo allows Authentication Bypass. This issue affects Findgo: from n/a through 1.3.55.",
    "published": "2025-09-22T19:16:10.767",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-59526": {
    "url": "https://github.com/eladnava/mailgen/commit/741a0190ddae0f408b22ae3b5f0f4c3f5cf4f11d",
    "cvss": "-",
    "description": "mailgen is a Node.js package that generates responsive HTML e-mails for sending transactional mail. Prior to version 2.0.30, there is an HTML injection vulnerability in plaintext e-mails generated by Mailgen. Projects are affected if the Mailgen.generatePlaintext(email) method is used and given user-generated content. This vulnerability has been patched in version 2.0.30. A workaround involves stripping all HTML tags before passing any content into Mailgen.generatePlaintext(email).",
    "published": "2025-09-22T20:15:39.200"
  },
  "CVE-2025-59528": {
    "cvss": 10.0,
    "description": "Flowise is a drag & drop user interface to build a customized large language model flow. In version 3.0.5, Flowise is vulnerable to remote code execution. The CustomMCP node allows users to input configuration settings for connecting to an external MCP server. This node parses the user-provided mcpServerConfig string to build the MCP server configuration. However, during this process, it executes JavaScript code without any security validation. Specifically, inside the convertToValidJSONString function, user input is directly passed to the Function() constructor, which evaluates and executes the input as JavaScript code. Since this runs with full Node.js runtime privileges, it can access dangerous modules such as child_process and fs. This issue has been patched in version 3.0.6.",
    "published": "2025-09-22T20:15:39.530",
    "keywords": "remote,execution"
  }
}