{
  "CVE-2024-36470": {
    "cvss": 8.1,
    "description": "In JetBrains TeamCity before 2022.04.7, 2022.10.6, 2023.05.6, 2023.11.5 authentication bypass was possible in specific edge cases",
    "published": "2024-05-29T14:15:25.993",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-4358": {
    "cvss": 9.8,
    "description": "In Progress Telerik Report Server, version 2024 Q1 (10.0.24.305) or earlier, on IIS, an unauthenticated attacker can gain access to Telerik Report Server restricted functionality via an authentication bypass vulnerability.",
    "published": "2024-05-29T15:16:06.477",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-36114": {
    "cvss": 8.6,
    "description": "Aircompressor is a library with ports of the Snappy, LZO, LZ4, and Zstandard compression algorithms to Java. All decompressor implementations of Aircompressor (LZ4, LZO, Snappy, Zstandard) can crash the JVM for certain input, and in some cases also leak the content of other memory of the Java process (which could contain sensitive information). When decompressing certain data, the decompressors try to access memory outside the bounds of the given byte arrays or byte buffers. Because Aircompressor uses the JDK class `sun.misc.Unsafe` to speed up memory access, no additional bounds checks are performed and this has similar security consequences as out-of-bounds access in C or C++, namely it can lead to non-deterministic behavior or crash the JVM. Users should update to Aircompressor 0.27 or newer where these issues have been fixed. When decompressing data from untrusted users, this can be exploited for a denial-of-service attack by crashing the JVM, or to leak other sensitive information from the Java process. There are no known workarounds for this issue.",
    "published": "2024-05-29T21:15:49.237",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-5514": {
    "cvss": 9.8,
    "description": "MinMax CMS from MinMax Digital Technology contains a hidden administrator account with a fixed password that cannot be removed or disabled from the management interface. Remote attackers who obtain this account can bypass IP access control restrictions and log in to the backend system without being recorded in the system logs.",
    "published": "2024-05-30T03:15:08.467",
    "keywords": "remote,bypass"
  },
  "CVE-2024-3584": {
    "url": "https://github.com/qdrant/qdrant/commit/15479a45ffa3b955485ae516696f7e933a8cce8a",
    "cvss": 9.8,
    "description": "qdrant/qdrant version 1.9.0-dev is vulnerable to path traversal due to improper input validation in the `/collections/{name}/snapshots/upload` endpoint. By manipulating the `name` parameter through URL encoding, an attacker can upload a file to an arbitrary location on the system, such as `/root/poc.txt`. This vulnerability allows for the writing and overwriting of arbitrary files on the server, potentially leading to a full takeover of the system. The issue is fixed in version 1.9.0.",
    "published": "2024-05-30T13:15:49.947"
  },
  "CVE-2024-36024": {
    "cvss": "-",
    "description": "In the Linux kernel, the following vulnerability has been resolved:\n\ndrm/amd/display: Disable idle reallow as part of command/gpint execution\n\n[Why]\nWorkaroud for a race condition where DMCUB is in the process of\ncommitting to IPS1 during the handshake causing us to miss the\ntransition into IPS2 and touch the INBOX1 RPTR causing a HW hang.\n\n[How]\nDisable the reallow to ensure that we have enough of a gap between entry\nand exit and we're not seeing back-to-back wake_and_executes.",
    "published": "2024-05-30T15:15:49.420",
    "keywords": "execution,command"
  },
  "CVE-2024-3924": {
    "cvss": 4.4,
    "description": "A code injection vulnerability exists in the huggingface/text-generation-inference repository, specifically within the `autodocs.yml` workflow file. The vulnerability arises from the insecure handling of the `github.head_ref` user input, which is used to dynamically construct a command for installing a software package. An attacker can exploit this by forking the repository, creating a branch with a malicious payload as the name, and then opening a pull request to the base repository. Successful exploitation could lead to arbitrary code execution within the context of the GitHub Actions runner. This issue affects versions up to and including v2.0.0 and was fixed in version 2.0.0.",
    "published": "2024-05-30T15:15:49.653",
    "keywords": "execution,command"
  },
  "CVE-2024-3300": {
    "cvss": 9.0,
    "description": "An unsafe .NET object deserialization vulnerability in DELMIA Apriso Release 2019 through Release 2024 could lead to pre-authentication remote code execution.",
    "published": "2024-05-30T16:15:18.837",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2024-3301": {
    "cvss": 8.5,
    "description": "An unsafe .NET object deserialization vulnerability in DELMIA Apriso Release 2019 through Release 2024 could lead to post-authentication remote code execution.",
    "published": "2024-05-30T16:15:19.093",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2024-2420": {
    "cvss": "-",
    "description": "LenelS2 NetBox access control and event monitoring system was discovered to contain Hardcoded Credentials in versions prior to and including 5.6.1 which allows an attacker to bypass authentication requirements.",
    "published": "2024-05-30T18:15:09.070",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-2421": {
    "cvss": "-",
    "description": "LenelS2 NetBox access control and event monitoring system was discovered to contain an unauthenticated RCE in versions prior to and including 5.6.1, which allows an attacker to execute malicious commands with elevated permissions.",
    "published": "2024-05-30T18:15:09.230",
    "keywords": "unauthenticated,command"
  },
  "CVE-2024-37017": {
    "url": "https://github.com/cinecert/asdcplib/issues/138",
    "cvss": "-",
    "description": "asdcplib (aka AS-DCP Lib) 2.13.1 has a heap-based buffer over-read in ASDCP::TimedText::MXFReader::h__Reader::MD_to_TimedText_TDesc in AS_DCP_TimedText.cpp in libasdcp.so.",
    "published": "2024-05-31T00:15:08.890"
  },
  "CVE-2024-32850": {
    "cvss": "-",
    "description": "Improper neutralization of special elements used in a command ('Command Injection') exists in SkyBridge MB-A100/MB-A110 firmware Ver. 4.2.2 and earlier and SkyBridge BASIC MB-A130 firmware Ver. 1.5.5 and earlier. If the remote monitoring and control function is enabled on the product, an attacker with access to the product may execute an arbitrary command or login to the product with the administrator privilege.",
    "published": "2024-05-31T02:15:08.843",
    "keywords": "remote,command"
  },
  "CVE-2024-5345": {
    "cvss": 8.8,
    "description": "The Responsive Owl Carousel for Elementor plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 1.2.0 via the layout parameter. This makes it possible for authenticated attackers, with Contributor-level access and above, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included. The inclusion is limited to PHP files.",
    "published": "2024-05-31T03:15:08.613",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-23692": {
    "cvss": 9.8,
    "description": "Rejetto HTTP File Server, up to and including version 2.3m, is vulnerable to a template injection vulnerability. This vulnerability allows a remote, unauthenticated attacker to execute arbitrary commands on the affected system by sending a specially crafted HTTP request. As of the CVE assignment date, Rejetto HFS 2.3m is no longer supported.",
    "published": "2024-05-31T10:15:09.330",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-5565": {
    "cvss": 8.1,
    "description": "The Vanna library uses a prompt function to present the user with visualized results, it is possible to alter the prompt using prompt injection and run arbitrary Python code instead of the intended visualization code. Specifically - allowing external input to the library’s “ask” method with \"visualize\" set to True (default behavior) leads to remote code execution.",
    "published": "2024-05-31T15:15:09.673",
    "keywords": "remote,execution"
  },
  "CVE-2024-36120": {
    "url": "https://github.com/ben-sb/javascript-deobfuscator/commit/630d3caec83d5f31c5f7a07e6fadf613d06699d6",
    "cvss": 8.1,
    "description": "javascript-deobfuscator removes common JavaScript obfuscation techniques. In affected versions crafted payloads targeting expression simplification can lead to code execution. This issue has been patched in version 1.1.0. Users are advised to update. Users unable to upgrade should disable the expression simplification feature.",
    "published": "2024-05-31T17:15:09.317"
  },
  "CVE-2024-22060": {
    "cvss": 8.7,
    "description": "An unrestricted file upload vulnerability in web component of Ivanti Neurons for ITSM allows a remote, authenticated, high privileged user to write arbitrary files into sensitive directories of ITSM server.",
    "published": "2024-05-31T18:15:10.660",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-31030": {
    "url": "https://github.com/keith-cullen/freecoap/issues/36",
    "cvss": "-",
    "description": "An issue in coap_msg.c in Keith Cullen's FreeCoAP v.0.7 allows remote attackers to cause a Denial of Service or potentially disclose information via a specially crafted packet.",
    "published": "2024-05-31T18:15:12.893"
  },
  "CVE-2024-35196": {
    "cvss": 2.0,
    "description": "Sentry is a developer-first error tracking and performance monitoring platform. Sentry's Slack integration incorrectly records the incoming request body in logs. This request data can contain sensitive information, including the deprecated Slack verification token. With this verification token, it is possible under specific configurations, an attacker can forge requests and act as the Slack integration. The request body is leaked in log entries matching `event == \"slack.*\" && name == \"sentry.integrations.slack\" && request_data == *`. The deprecated slack verification token, will be found in the `request_data.token` key. **SaaS users** do not need to take any action. **Self-hosted users** should upgrade to version 24.5.0 or higher, rotate their Slack verification token, and use the Slack Signing Secret instead of the verification token. For users only using the `slack.signing-secret` in their self-hosted configuration, the legacy verification token is not used to verify the webhook payload. It is ignored. Users unable to upgrade should either set the `slack.signing-secret` instead of `slack.verification-token`. The signing secret is Slack's recommended way of authenticating webhooks. By having `slack.singing-secret` set, Sentry self-hosted will no longer use the verification token for authentication of the webhooks, regardless of whether `slack.verification-token` is set or not. Alternatively if the self-hosted instance is unable to be upgraded or re-configured to use the `slack.signing-secret`, the logging configuration can be adjusted to not generate logs from the integration. The default logging configuration can be found in `src/sentry/conf/server.py`. **Services should be restarted once the configuration change is saved.**\n",
    "published": "2024-05-31T18:15:12.993",
    "keywords": "authentication,sensitive,leak"
  },
  "CVE-2024-36843": {
    "url": "https://github.com/stephane/libmodbus/issues/748",
    "cvss": "-",
    "description": "libmodbus v3.1.6 was discovered to contain a heap overflow via the modbus_mapping_free() function.",
    "published": "2024-05-31T20:15:10.290"
  },
  "CVE-2024-36844": {
    "url": "https://github.com/stephane/libmodbus/issues/749",
    "cvss": "-",
    "description": "libmodbus v3.1.6 was discovered to contain a use-after-free via the ctx->backend pointer. This vulnerability allows attackers to cause a Denial of Service (DoS) via a crafted message sent to the unit-test-server.",
    "published": "2024-05-31T20:15:10.380"
  },
  "CVE-2024-36845": {
    "url": "https://github.com/stephane/libmodbus/issues/750",
    "cvss": "-",
    "description": "An invalid pointer in the modbus_receive() function of libmodbus v3.1.6 allows attackers to cause a Denial of Service (DoS) via a crafted message sent to the unit-test-server.",
    "published": "2024-05-31T20:15:10.463"
  },
  "CVE-2024-5138": {
    "url": "https://github.com/snapcore/snapd/commit/68ee9c6aa916ab87dbfd9a26030690f2cabf1e14",
    "cvss": "-",
    "description": "The snapctl component within snapd allows a confined snap to interact with the snapd daemon to take certain privileged actions on behalf of the snap. It was found that snapctl did not properly parse command-line arguments, allowing an unprivileged user to trigger an authorised action on behalf of the snap that would normally require administrator privileges to perform. This could possibly allow an unprivileged user to perform a denial of service or similar.",
    "published": "2024-05-31T21:15:09.930"
  },
  "CVE-2024-3564": {
    "cvss": 8.8,
    "description": "The Content Blocks (Custom Post Widget) plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 3.3.0 via the plugin's 'content_block' shortcode. This makes it possible for authenticated attackers, with contributor-level access and above, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-06-01T04:15:08.743",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-1324": {
    "cvss": 5.3,
    "description": "The QQWorld Auto Save Images plugin for WordPress is vulnerable to unauthorized access of data due to a missing capability check on the save_remote_images_get_auto_saved_results() function hooked via a norpriv AJAX in all versions up to, and including, 1.9.8. This makes it possible for unauthenticated attackers to retrieve the contents of arbitrary posts that may not be public.",
    "published": "2024-06-01T07:15:07.850",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-3820": {
    "cvss": 10.0,
    "description": "The wpDataTables – WordPress Data Table, Dynamic Tables & Table Charts Plugin plugin for WordPress is vulnerable to SQL Injection via the 'id_key' parameter of the wdt_delete_table_row AJAX action in all versions up to, and including, 6.3.1 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database. Please note this only affects the premium version of the plugin.",
    "published": "2024-06-01T09:15:09.660",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-5348": {
    "cvss": 8.8,
    "description": "The Elements For Elementor plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 2.1 via the 'beforeafter_layout' attribute of the beforeafter widget, the 'eventsgrid_layout' attribute of the eventsgrid and list widgets, the 'marquee_layout' attribute of the marquee widget, the 'postgrid_layout' attribute of the postgrid widget, the 'woocart_layout'  attribute of the woocart widget, and the 'woogrid_layout' attribute of the woogrid widget. This makes it possible for authenticated attackers, with Contributor-level access and above, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-06-01T09:15:10.063",
    "keywords": "execution,sensitive,bypass"
  }
}