{
  "CVE-2024-0787": {
    "cvss": 5.3,
    "description": "phpIPAM version 1.5.1 contains a vulnerability where an attacker can bypass the IP block mechanism to brute force passwords for users by using the 'X-Forwarded-For' header. The issue lies in the 'get_user_ip()' function in 'class.Common.php' at lines 1044 and 1045, where the presence of the 'X-Forwarded-For' header is checked and used instead of 'REMOTE_ADDR'. This vulnerability allows attackers to perform brute force attacks on user accounts, including the admin account. The issue is fixed in version 1.7.0.",
    "published": "2024-11-15T11:15:09.213",
    "keywords": "remote,bypass"
  },
  "CVE-2024-10443": {
    "cvss": 9.8,
    "description": "Improper neutralization of special elements used in a command ('Command Injection') vulnerability in Task Manager component in Synology BeePhotos before 1.0.2-10026 and 1.1.0-10053 and Synology Photos before 1.6.2-0720 and 1.7.0-0795 allows remote attackers to execute arbitrary code via unspecified vectors.",
    "published": "2024-11-15T11:15:09.750",
    "keywords": "remote,command"
  },
  "CVE-2024-1240": {
    "url": "https://github.com/pyload/pyload/commit/fe94451dcc2be90b3889e2fd9d07b483c8a6dccd",
    "cvss": 4.6,
    "description": "An open redirection vulnerability exists in pyload/pyload version 0.5.0. The vulnerability is due to improper handling of the 'next' parameter in the login functionality. An attacker can exploit this vulnerability to redirect users to malicious sites, which can be used for phishing or other malicious activities. The issue is fixed in pyload-ng 0.5.0b3.dev79.",
    "published": "2024-11-15T11:15:10.773"
  },
  "CVE-2024-20373": {
    "cvss": 5.3,
    "description": "A vulnerability in the implementation of the Simple Network Management Protocol (SNMP) IPv4 access control list (ACL) feature of Cisco IOS Software and Cisco IOS XE Software could allow an unauthenticated, remote attacker to perform SNMP polling of an affected device, even if it is configured to deny SNMP traffic.&nbsp;\r\n\r\nThis vulnerability exists because Cisco IOS Software and Cisco IOS XE Software do not support extended IPv4 ACLs for SNMP, but they do allow administrators to configure extended named IPv4 ACLs that are attached to the SNMP server configuration without a warning message. This can result in no ACL being applied to the SNMP listening process. An attacker could exploit this vulnerability by performing SNMP polling of an affected device. A successful exploit could allow the attacker to perform SNMP operations that should be denied. The attacker has no control of the SNMP ACL configuration and would still need a valid SNMP version 2c (SNMPv2c) community string or SNMP version 3 (SNMPv3) user credentials.\r\nSNMP with IPv6 ACL configurations is not affected.\r\nFor more information, see the  section of this advisory.",
    "published": "2024-11-15T15:15:06.823",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-43189": {
    "cvss": 5.9,
    "description": "IBM Concert Software 1.0.0 through 1.0.1 could allow a remote attacker to obtain sensitive information, caused by the failure to properly enable HTTP Strict Transport Security. An attacker could exploit this vulnerability to obtain sensitive information using man in the middle techniques.",
    "published": "2024-11-15T15:15:07.307",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-50647": {
    "cvss": "-",
    "description": "The python_food ordering system V1.0 has an unauthorized vulnerability that leads to the leakage of sensitive user information. Attackers can access it through https://ip:port/api/myapp/index/user/info?id=1 And modify the ID value to obtain sensitive user information beyond authorization.",
    "published": "2024-11-15T16:15:36.467",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-39726": {
    "cvss": 8.2,
    "description": "IBM Engineering Lifecycle Optimization - Engineering Insights 7.0.2 and 7.0.3 is vulnerable to an XML External Entity Injection (XXE) attack when processing XML data. A remote attacker could exploit this vulnerability to expose sensitive information or consume memory resources.",
    "published": "2024-11-15T17:15:19.983",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-51037": {
    "cvss": "-",
    "description": "An issue in kodbox v.1.52.04 and before allows a remote attacker to obtain sensitive information via the captcha feature in the password reset function.",
    "published": "2024-11-15T19:15:07.803",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-49536": {
    "cvss": 5.5,
    "description": "Audition versions 23.6.9, 24.4.6 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-11-15T20:15:20.683",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-9839": {
    "cvss": 7.3,
    "description": "The The Uix Slideshow plugin for WordPress is vulnerable to arbitrary shortcode execution in all versions up to, and including, 1.6.5. This is due to the software allowing users to execute an action that does not properly validate a value before running do_shortcode. This makes it possible for unauthenticated attackers to execute arbitrary shortcodes.",
    "published": "2024-11-16T04:15:07.467",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-9849": {
    "cvss": 8.8,
    "description": "The 3D FlipBook, PDF Viewer, PDF Embedder – Real 3D FlipBook WordPress Plugin plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the 'r3dfb_save_thumbnail_callback' function in all versions up to, and including, 4.6. This makes it possible for authenticated attackers, with Author-level access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-11-16T04:15:07.673",
    "keywords": "remote,execution"
  },
  "CVE-2024-9935": {
    "cvss": 7.5,
    "description": "The PDF Generator Addon for Elementor Page Builder plugin for WordPress is vulnerable to Path Traversal in all versions up to, and including, 1.7.5 via the rtw_pgaepb_dwnld_pdf() function. This makes it possible for unauthenticated attackers to read the contents of arbitrary files on the server, which can contain sensitive information.",
    "published": "2024-11-16T04:15:08.103",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-10728": {
    "cvss": 8.8,
    "description": "The Post Grid Gutenberg Blocks and WordPress Blog Plugin – PostX plugin for WordPress is vulnerable to unauthorized plugin installation/activation due to a missing capability check on the 'install_required_plugin_callback' function in all versions up to, and including, 4.1.16. This makes it possible for authenticated attackers, with Subscriber-level access and above, to install and activate arbitrary plugins which can be leveraged to achieve remote code execution if another vulnerable plugin is installed and activated.",
    "published": "2024-11-16T05:15:12.510",
    "keywords": "remote,execution"
  },
  "CVE-2024-8856": {
    "cvss": 9.8,
    "description": "The Backup and Staging by WP Time Capsule plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the the UploadHandler.php file and no direct file access prevention in all versions up to, and including, 1.22.21. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-11-16T05:15:13.920",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-10645": {
    "cvss": 7.5,
    "description": "The Blogger 301 Redirect plugin for WordPress is vulnerable to blind time-based SQL Injection via the ‘br’ parameter in all versions up to, and including, 2.5.3 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-11-16T09:15:04.037",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-11094": {
    "cvss": 5.3,
    "description": "The 404 Solution plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 2.35.17 via the export feature. This makes it possible for unauthenticated attackers to extract sensitive data such as redirects including GET parameters which may reveal sensitive information.",
    "published": "2024-11-16T10:15:04.737",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-52876": {
    "cvss": "-",
    "description": "Holy Stone Remote ID Module HSRID01, firmware distributed with the Drone Go2 mobile application before 1.1.8, allows unauthenticated \"remote power off\" actions (in broadcast mode) via multiple read operations on the ASTM Remote ID (0xFFFA) GATT.",
    "published": "2024-11-17T05:15:04.760",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-11309": {
    "cvss": 7.5,
    "description": "The DVC from TRCore has a Path Traversal vulnerability, allowing unauthenticated remote attackers to exploit this vulnerability to read arbitrary system files.",
    "published": "2024-11-18T06:15:04.673",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-11310": {
    "cvss": 7.5,
    "description": "The DVC from TRCore has a Path Traversal vulnerability, allowing unauthenticated remote attackers to exploit this vulnerability to read arbitrary system files.",
    "published": "2024-11-18T06:15:04.987",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-52945": {
    "cvss": 7.8,
    "description": "An issue was discovered in Veritas NetBackup before 10.5. This only applies to NetBackup components running on a Windows Operating System. If a user executes specific NetBackup commands or an attacker uses social engineering techniques to impel the user to execute the commands, a malicious DLL could be loaded, resulting in execution of the attacker's code in the user's security context.",
    "published": "2024-11-18T06:15:06.250",
    "keywords": "execution,command"
  },
  "CVE-2024-11311": {
    "cvss": 9.8,
    "description": "The DVC from TRCore has a Path Traversal vulnerability and does not restrict the types of uploaded files. This allows unauthenticated remote attackers to upload arbitrary files to any directory, leading to arbitrary code execution by uploading webshells.",
    "published": "2024-11-18T07:15:13.063",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-11312": {
    "cvss": 9.8,
    "description": "The DVC from TRCore has a Path Traversal vulnerability and does not restrict the types of uploaded files. This allows unauthenticated remote attackers to upload arbitrary files to any directory, leading to arbitrary code execution by uploading webshells.",
    "published": "2024-11-18T07:15:14.903",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-11313": {
    "cvss": 9.8,
    "description": "The DVC from TRCore has a Path Traversal vulnerability and does not restrict the types of uploaded files. This allows unauthenticated remote attackers to upload arbitrary files to any directory, leading to arbitrary code execution by uploading webshells.",
    "published": "2024-11-18T07:15:15.420",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-11314": {
    "cvss": 9.8,
    "description": "The DVC from TRCore has a Path Traversal vulnerability and does not restrict the types of uploaded files. This allows unauthenticated remote attackers to upload arbitrary files to any directory, leading to arbitrary code execution by uploading webshells.",
    "published": "2024-11-18T07:15:15.993",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-11315": {
    "cvss": 9.8,
    "description": "The DVC from TRCore has a Path Traversal vulnerability and does not restrict the types of uploaded files. This allows unauthenticated remote attackers to upload arbitrary files to any directory, leading to arbitrary code execution by uploading webshells.",
    "published": "2024-11-18T07:15:16.673",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-41969": {
    "cvss": 8.8,
    "description": "A low privileged remote attacker may modify the configuration of the CODESYS V3 service through a missing authentication vulnerability which could lead to full system access and/or DoS.",
    "published": "2024-11-18T09:15:05.637",
    "keywords": "remote,authentication"
  }
}