{
  "CVE-2024-1986": {
    "cvss": 8.8,
    "description": "The Booster Elite for WooCommerce plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the wc_add_new_product() function in all versions up to, and including, 7.1.7. This makes it possible for customer-level attackers, and above, to upload arbitrary files on the affected site's server which may make remote code execution possible. This is only exploitable when the user product upload functionality is enabled.",
    "published": "2024-03-07T21:15:08.013",
    "keywords": "remote,execution"
  },
  "CVE-2024-2044": {
    "url": "https://github.com/pgadmin-org/pgadmin4/issues/7258",
    "cvss": 4.6,
    "description": "pgAdmin 4 uses a file-based session management approach. The session files are saved on disk as pickle objects. When a user performs a request, the value of the session cookie 'pga4_session' is used to retrieve the file, then its content is deserialised, and finally its signature verified.\nThe cookie value is split in 2 parts at the first '!' character. The first part is the session ID (sid), while the second is the session digest.\n The vulnerability lies in versions of pgAdmin prior to 8.4 where a method loads session files by concatenating the sessions folder - located inside the pgAdmin 4 DATA_DIR - with the session ID. Precisely, the two values are concatenated using the ['os.path.join'] function. It does not set a trusted base-path which should not be escaped\n",
    "published": "2024-03-07T21:15:08.767"
  },
  "CVE-2024-2265": {
    "cvss": 5.3,
    "description": "A vulnerability, which was classified as problematic, was found in keerti1924 PHP-MYSQL-User-Login-System 1.0. This affects an unknown part of the file login.sql. The manipulation leads to inclusion of sensitive information in source code. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-256035. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-03-07T22:15:58.220",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-23239": {
    "cvss": "-",
    "description": "A race condition was addressed with improved state handling. This issue is fixed in tvOS 17.4, iOS 17.4 and iPadOS 17.4, macOS Sonoma 14.4, watchOS 10.4. An app may be able to leak sensitive user information.",
    "published": "2024-03-08T02:15:48.063",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-23241": {
    "cvss": "-",
    "description": "This issue was addressed through improved state management. This issue is fixed in tvOS 17.4, iOS 17.4 and iPadOS 17.4, macOS Sonoma 14.4. An app may be able to leak sensitive user information.",
    "published": "2024-03-08T02:15:48.153",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-26309": {
    "cvss": 5.3,
    "description": "Archer Platform 6.x before 6.14 P2 HF2 (6.14.0.2.2) contains a sensitive information disclosure vulnerability. An unauthenticated attacker could potentially obtain access to sensitive information via an internal URL.",
    "published": "2024-03-08T02:15:50.640",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-2352": {
    "cvss": 6.3,
    "description": "A vulnerability, which was classified as critical, has been found in 1Panel up to 1.10.1-lts. Affected by this issue is the function baseApi.UpdateDeviceSwap of the file /api/v1/toolbox/device/update/swap. The manipulation of the argument Path with the input 123123123\\nopen -a Calculator leads to command injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. It is recommended to apply a patch to fix this issue. The identifier of this vulnerability is VDB-256304.",
    "published": "2024-03-10T02:16:08.767",
    "keywords": "remote,command"
  },
  "CVE-2024-28757": {
    "url": "https://github.com/libexpat/libexpat/pull/842",
    "cvss": "-",
    "description": "libexpat through 2.6.1 allows an XML Entity Expansion attack when there is isolated use of external parsers (created via XML_ExternalEntityParserCreate).",
    "published": "2024-03-10T05:15:06.570"
  },
  "CVE-2024-2353": {
    "cvss": 8.8,
    "description": "A vulnerability, which was classified as critical, has been found in Totolink X6000R 9.4.0cu.852_20230719. This issue affects the function setDiagnosisCfg of the file /cgi-bin/cstecgi.cgi of the component shttpd. The manipulation of the argument ip leads to os command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-256313 was assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-03-10T08:15:05.920",
    "keywords": "remote,command"
  },
  "CVE-2024-2355": {
    "cvss": 3.7,
    "description": "A vulnerability has been found in keerti1924 Secret-Coder-PHP-Project 1.0 and classified as problematic. Affected by this vulnerability is an unknown functionality of the file /secret_coder.sql. The manipulation leads to inclusion of sensitive information in source code. The attack can be launched remotely. The complexity of an attack is rather high. The exploitation appears to be difficult. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-256315. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-03-10T12:15:06.613",
    "keywords": "remote,sensitive"
  }
}