{
  "CVE-2024-6479": {
    "cvss": 6.5,
    "description": "The SIP Reviews Shortcode for WooCommerce plugin for WordPress is vulnerable to SQL Injection via the 'no_of_reviews' attribute in the woocommerce_reviews shortcode in all versions up to, and including, 1.2.3 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-10-31T22:15:03.577",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-10620": {
    "cvss": 5.3,
    "description": "A vulnerability was found in knightliao Disconf 2.6.36. It has been classified as critical. This affects an unknown part of the file /api/config/list of the component Configuration Center. The manipulation leads to improper authentication. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2024-11-01T05:15:05.167",
    "keywords": "remote,authentication"
  },
  "CVE-2024-21510": {
    "url": "https://github.com/sinatra/sinatra/pull/2010",
    "cvss": 5.4,
    "description": "Versions of the package sinatra from 0.0.0 are vulnerable to Reliance on Untrusted Inputs in a Security Decision via the X-Forwarded-Host (XFH) header. When making a request to a method with redirect applied, it is possible to trigger an Open Redirect Attack by inserting an arbitrary address into this header. If used for caching purposes, such as with servers like Nginx, or as a reverse proxy, without handling the X-Forwarded-Host header, attackers can potentially exploit Cache Poisoning or Routing-based SSRF.",
    "published": "2024-11-01T05:15:05.640"
  },
  "CVE-2024-10652": {
    "cvss": 6.1,
    "description": "IDExpert from CHANGING Information Technology does not properly validate a parameter for a specific functionality, allowing unauthenticated remote attackers to inject JavsScript code and perform Reflected Cross-site scripting attacks.",
    "published": "2024-11-01T10:15:04.877",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-10653": {
    "cvss": 10.0,
    "description": "IDExpert from CHANGING Information Technology does not properly validate a specific parameter in the administrator interface, allowing remote attackers with administrative privileges to inject and execute OS commands on the server.",
    "published": "2024-11-01T10:15:05.103",
    "keywords": "remote,command"
  },
  "CVE-2024-10654": {
    "cvss": 5.3,
    "description": "A vulnerability has been found in TOTOLINK LR350 up to 9.3.5u.6369 and classified as critical. Affected by this vulnerability is an unknown functionality of the file /formLoginAuth.htm. The manipulation of the argument authCode with the input 1 leads to authorization bypass. The attack can be launched remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2024-11-01T12:15:03.077",
    "keywords": "remote,bypass"
  },
  "CVE-2024-51406": {
    "url": "https://github.com/floodlight/floodlight/issues/870",
    "cvss": "-",
    "description": "Floodlight SDN Open Flow Controller v.1.2 has an issue that allows local hosts to build fake LLDP packets that allow specific clusters to be missed by Floodlight, which in turn leads to missed hosts inside and outside the cluster.",
    "published": "2024-11-01T14:15:07.073"
  },
  "CVE-2024-51407": {
    "url": "https://github.com/floodlight/floodlight/issues/869",
    "cvss": "-",
    "description": "Floodlight SDN OpenFlow Controller v.1.2 has an issue that allows local hosts to construct false broadcast ports causing inter-host communication anomalies.",
    "published": "2024-11-01T14:15:07.193"
  },
  "CVE-2024-22733": {
    "cvss": "-",
    "description": "TP Link MR200 V4 Firmware version 210201 was discovered to contain a null-pointer-dereference in the web administration panel on /cgi/login via the sign, Action or LoginStatus query parameters which could lead to a denial of service by a local or remote unauthenticated attacker.",
    "published": "2024-11-01T16:15:08.077",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-40490": {
    "cvss": "-",
    "description": "An issue in Sourcebans++ before v.1.8.0 allows a remote attacker to obtain sensitive information via a crafted XAJAX call to the Forgot Password function.",
    "published": "2024-11-01T16:15:08.793",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-51377": {
    "url": "https://github.com/ladybirdweb/faveo-helpdesk/issues/8303",
    "cvss": "-",
    "description": "An issue in Ladybird Web Solution Faveo Helpdesk & Servicedesk (On-Premise and Cloud) 9.2.0 allows a remote attacker to execute arbitrary code via the Subject and Identifier fields",
    "published": "2024-11-01T16:15:09.400"
  },
  "CVE-2024-49770": {
    "cvss": "-",
    "description": "`oak` is a middleware framework for Deno's native HTTP server, Deno Deploy, Node.js 16.5 and later, Cloudflare Workers and Bun. By default `oak` does not allow transferring of hidden files with `Context.send` API. However, prior to version 17.1.3, this can be bypassed by encoding `/` as its URL encoded form `%2F`. For an attacker this has potential to read sensitive user data or to gain access to server secrets. Version 17.1.3 fixes the issue.",
    "published": "2024-11-01T17:15:17.710",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-10697": {
    "cvss": 6.3,
    "description": "A vulnerability has been found in Tenda AC6 15.03.05.19 and classified as critical. Affected by this vulnerability is the function formWriteFacMac of the file /goform/WriteFacMac of the component API Endpoint. The manipulation of the argument The leads to command injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2024-11-02T12:15:15.780",
    "keywords": "remote,command"
  }
}