{
  "CVE-2024-8072": {
    "cvss": 5.3,
    "description": "Mage AI allows remote unauthenticated attackers to leak the terminal server command history of arbitrary users",
    "published": "2024-08-22T08:15:04.360",
    "keywords": "remote,unauthenticated,command,leak"
  },
  "CVE-2024-39746": {
    "cvss": 5.9,
    "description": "IBM Sterling Connect:Direct Web Services 6.0, 6.1, 6.2, and 6.3 could allow a remote attacker to obtain sensitive information, caused by the failure to properly enable HTTP Strict Transport Security. An attacker could exploit this vulnerability to obtain sensitive information using man in the middle techniques.",
    "published": "2024-08-22T11:15:13.920",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-36445": {
    "cvss": 9.8,
    "description": "Swissphone DiCal-RED 4009 devices allow a remote attacker to gain a root shell via TELNET without authentication.",
    "published": "2024-08-22T15:15:16.187",
    "keywords": "remote,authentication"
  },
  "CVE-2024-43787": {
    "cvss": 5.0,
    "description": "Hono is a Web application framework that provides support for any JavaScript runtime. Hono CSRF middleware can be bypassed using crafted Content-Type header. MIME types are case insensitive, but isRequestedByFormElementRe only matches lower-case. As a result, attacker can bypass csrf middleware using upper-case form-like MIME type. This vulnerability is fixed in 4.5.8.",
    "published": "2024-08-22T15:15:16.857",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-8088": {
    "url": "https://github.com/python/cpython/pull/122906",
    "cvss": 7.5,
    "description": "There is a HIGH severity vulnerability affecting the CPython \"zipfile\"\nmodule.\n\n\n\n\n\nWhen iterating over names of entries in a zip archive (for example, methods\nof \"zipfile.ZipFile\" like \"namelist()\", \"iterdir()\", \"extractall()\", etc)\nthe process can be put into an infinite loop with a maliciously crafted\nzip archive. This defect applies when reading only metadata or extracting\nthe contents of the zip archive. Programs that are not handling\nuser-controlled zip archives are not affected.",
    "published": "2024-08-22T19:15:09.720"
  },
  "CVE-2024-42599": {
    "cvss": "-",
    "description": "SeaCMS 13.0 has a remote code execution vulnerability. The reason for this vulnerability is that although admin_files.php imposes restrictions on edited files, attackers can still bypass these restrictions and write code, allowing authenticated attackers to exploit the vulnerability to execute arbitrary commands and gain system privileges.",
    "published": "2024-08-22T20:15:09.730",
    "keywords": "remote,execution,command,bypass"
  },
  "CVE-2024-8075": {
    "cvss": 6.3,
    "description": "A vulnerability has been found in TOTOLINK AC1200 T8 4.1.5cu.862_B20230228 and classified as critical. Affected by this vulnerability is the function setDiagnosisCfg. The manipulation leads to os command injection. The attack can be launched remotely. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-08-22T20:15:10.210",
    "keywords": "remote,command"
  },
  "CVE-2024-8077": {
    "cvss": 6.3,
    "description": "A vulnerability was found in TOTOLINK AC1200 T8 4.1.5cu.862_B20230228. It has been classified as critical. This affects the function setTracerouteCfg. The manipulation leads to os command injection. It is possible to initiate the attack remotely. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-08-22T20:15:11.690",
    "keywords": "remote,command"
  },
  "CVE-2024-8079": {
    "cvss": 8.8,
    "description": "A vulnerability was found in TOTOLINK AC1200 T8 4.1.5cu.862_B20230228. It has been rated as critical. This issue affects the function exportOvpn. The manipulation leads to buffer overflow. The attack may be initiated remotely. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-08-22T21:15:17.910",
    "keywords": "remote,vpn"
  },
  "CVE-2024-38209": {
    "cvss": 7.8,
    "description": "Microsoft Edge (Chromium-based) Remote Code Execution Vulnerability",
    "published": "2024-08-22T23:15:07.740",
    "keywords": "remote,execution"
  },
  "CVE-2024-38210": {
    "cvss": 7.8,
    "description": "Microsoft Edge (Chromium-based) Remote Code Execution Vulnerability",
    "published": "2024-08-22T23:15:07.933",
    "keywords": "remote,execution"
  },
  "CVE-2024-7559": {
    "cvss": 8.8,
    "description": "The File Manager Pro plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation and capability checks in the mk_file_folder_manager AJAX action in all versions up to, and including, 8.3.7. This makes it possible for authenticated attackers, with Subscriber-level access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-08-23T03:15:04.060",
    "keywords": "remote,execution"
  },
  "CVE-2024-7258": {
    "cvss": 8.8,
    "description": "The WooCommerce Google Feed Manager plugin for WordPress is vulnerable to unauthorized loss of data due to a missing capability check on the 'wppfm_removeFeedFile' function in all versions up to, and including, 2.8.0. This makes it possible for authenticated attackers, with Contributor-level access and above, to delete arbitrary files on the server, which can easily lead to remote code execution when the right file is deleted (such as wp-config.php).",
    "published": "2024-08-23T05:15:15.437",
    "keywords": "remote,execution"
  },
  "CVE-2024-5466": {
    "cvss": 8.8,
    "description": "Zohocorp ManageEngine OpManager and Remote Monitoring and Management versions 128329 and below are vulnerable to the authenticated remote code execution in the deploy agent option.",
    "published": "2024-08-23T14:15:11.073",
    "keywords": "remote,execution"
  },
  "CVE-2024-42765": {
    "cvss": 9.8,
    "description": "A SQL injection vulnerability in \"/login.php\" of the Kashipara Bus Ticket Reservation System v1.0 allows remote attackers to execute arbitrary SQL commands and bypass Login via the \"email\" or \"password\" Login page parameters.",
    "published": "2024-08-23T15:15:16.447",
    "keywords": "remote,command,bypass"
  },
  "CVE-2024-8113": {
    "cvss": "-",
    "description": "Stored XSS in organizer and event settings of pretix up to 2024.7.0 allows malicious event organizers to inject HTML tags into e-mail previews on settings page. The default Content Security Policy of pretix prevents execution of attacker-provided scripts, making exploitation unlikely. However, combined with a CSP bypass (which is not currently known) the vulnerability could be used to impersonate other organizers or staff users.",
    "published": "2024-08-23T15:15:17.593",
    "keywords": "execution,bypass"
  },
  "CVE-2024-43032": {
    "cvss": 4.3,
    "description": "autMan v2.9.6 allows attackers to bypass authentication via a crafted web request.",
    "published": "2024-08-23T16:15:06.953",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-44381": {
    "cvss": 8.8,
    "description": "D-Link DI_8004W 16.07.26A1 contains a command execution vulnerability in jhttpd msp_info_htm function.",
    "published": "2024-08-23T16:15:07.013",
    "keywords": "execution,command"
  },
  "CVE-2024-44382": {
    "cvss": 8.8,
    "description": "D-Link DI_8004W 16.07.26A1 contains a command execution vulnerability in the jhttpd upgrade_filter_asp function.",
    "published": "2024-08-23T16:15:07.070",
    "keywords": "execution,command"
  },
  "CVE-2024-7954": {
    "cvss": 9.8,
    "description": "The porte_plume plugin used by SPIP before 4.30-alpha2, 4.2.13, and 4.1.16 is vulnerable to an arbitrary code execution vulnerability. A remote and unauthenticated attacker can execute arbitrary PHP as the SPIP user by sending a crafted HTTP request.",
    "published": "2024-08-23T18:15:07.677",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-45188": {
    "cvss": 6.5,
    "description": "Mage AI allows remote users with the \"Viewer\" role to leak arbitrary files from the Mage server due to a path traversal in the \"File Content\" request",
    "published": "2024-08-23T20:15:07.937",
    "keywords": "remote,leak"
  },
  "CVE-2024-45189": {
    "cvss": 6.5,
    "description": "Mage AI allows remote users with the \"Viewer\" role to leak arbitrary files from the Mage server due to a path traversal in the \"Git Content\" request",
    "published": "2024-08-23T20:15:08.197",
    "keywords": "remote,leak"
  },
  "CVE-2024-45190": {
    "cvss": 6.5,
    "description": "Mage AI allows remote users with the \"Viewer\" role to leak arbitrary files from the Mage server due to a path traversal in the \"Pipeline Interaction\" request",
    "published": "2024-08-23T20:15:08.403",
    "keywords": "remote,leak"
  },
  "CVE-2024-8127": {
    "cvss": 6.3,
    "description": "A vulnerability classified as critical was found in D-Link DNS-120, DNR-202L, DNS-315L, DNS-320, DNS-320L, DNS-320LW, DNS-321, DNR-322L, DNS-323, DNS-325, DNS-326, DNS-327L, DNR-326, DNS-340L, DNS-343, DNS-345, DNS-726-4, DNS-1100-4, DNS-1200-05 and DNS-1550-04 up to 20240814. This vulnerability affects the function cgi_unzip of the file /cgi-bin/webfile_mgr.cgi of the component HTTP POST Request Handler. The manipulation of the argument path leads to command injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. NOTE: This vulnerability only affects products that are no longer supported by the maintainer. NOTE: Vendor was contacted early and confirmed that the product is end-of-life. It should be retired and replaced.",
    "published": "2024-08-24T10:15:04.370",
    "keywords": "remote,command"
  },
  "CVE-2024-8128": {
    "cvss": 6.3,
    "description": "A vulnerability, which was classified as critical, has been found in D-Link DNS-120, DNR-202L, DNS-315L, DNS-320, DNS-320L, DNS-320LW, DNS-321, DNR-322L, DNS-323, DNS-325, DNS-326, DNS-327L, DNR-326, DNS-340L, DNS-343, DNS-345, DNS-726-4, DNS-1100-4, DNS-1200-05 and DNS-1550-04 up to 20240814. This issue affects the function cgi_add_zip of the file /cgi-bin/webfile_mgr.cgi of the component HTTP POST Request Handler. The manipulation of the argument path leads to command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. NOTE: This vulnerability only affects products that are no longer supported by the maintainer. NOTE: Vendor was contacted early and confirmed that the product is end-of-life. It should be retired and replaced.",
    "published": "2024-08-24T12:15:04.557",
    "keywords": "remote,command"
  },
  "CVE-2024-8129": {
    "cvss": 6.3,
    "description": "A vulnerability, which was classified as critical, was found in D-Link DNS-120, DNR-202L, DNS-315L, DNS-320, DNS-320L, DNS-320LW, DNS-321, DNR-322L, DNS-323, DNS-325, DNS-326, DNS-327L, DNR-326, DNS-340L, DNS-343, DNS-345, DNS-726-4, DNS-1100-4, DNS-1200-05 and DNS-1550-04 up to 20240814. Affected is the function cgi_s3_modify of the file /cgi-bin/s3.cgi of the component HTTP POST Request Handler. The manipulation of the argument f_job_name leads to command injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. NOTE: This vulnerability only affects products that are no longer supported by the maintainer. NOTE: Vendor was contacted early and confirmed that the product is end-of-life. It should be retired and replaced.",
    "published": "2024-08-24T16:15:04.057",
    "keywords": "remote,command"
  },
  "CVE-2024-8130": {
    "cvss": 6.3,
    "description": "A vulnerability has been found in D-Link DNS-120, DNR-202L, DNS-315L, DNS-320, DNS-320L, DNS-320LW, DNS-321, DNR-322L, DNS-323, DNS-325, DNS-326, DNS-327L, DNR-326, DNS-340L, DNS-343, DNS-345, DNS-726-4, DNS-1100-4, DNS-1200-05 and DNS-1550-04 up to 20240814 and classified as critical. Affected by this vulnerability is the function cgi_s3 of the file /cgi-bin/s3.cgi of the component HTTP POST Request Handler. The manipulation of the argument f_a_key leads to command injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. NOTE: This vulnerability only affects products that are no longer supported by the maintainer. NOTE: Vendor was contacted early and confirmed that the product is end-of-life. It should be retired and replaced.",
    "published": "2024-08-24T17:15:03.290",
    "keywords": "remote,command"
  },
  "CVE-2024-8131": {
    "cvss": 6.3,
    "description": "A vulnerability was found in D-Link DNS-120, DNR-202L, DNS-315L, DNS-320, DNS-320L, DNS-320LW, DNS-321, DNR-322L, DNS-323, DNS-325, DNS-326, DNS-327L, DNR-326, DNS-340L, DNS-343, DNS-345, DNS-726-4, DNS-1100-4, DNS-1200-05 and DNS-1550-04 up to 20240814 and classified as critical. Affected by this issue is the function module_enable_disable of the file /cgi-bin/apkg_mgr.cgi of the component HTTP POST Request Handler. The manipulation of the argument f_module_name leads to command injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. NOTE: This vulnerability only affects products that are no longer supported by the maintainer. NOTE: Vendor was contacted early and confirmed that the product is end-of-life. It should be retired and replaced.",
    "published": "2024-08-24T18:15:04.420",
    "keywords": "remote,command"
  },
  "CVE-2024-8132": {
    "cvss": 6.3,
    "description": "A vulnerability was found in D-Link DNS-120, DNR-202L, DNS-315L, DNS-320, DNS-320L, DNS-320LW, DNS-321, DNR-322L, DNS-323, DNS-325, DNS-326, DNS-327L, DNR-326, DNS-340L, DNS-343, DNS-345, DNS-726-4, DNS-1100-4, DNS-1200-05 and DNS-1550-04 up to 20240814. It has been classified as critical. This affects the function webdav_mgr of the file /cgi-bin/webdav_mgr.cgi of the component HTTP POST Request Handler. The manipulation of the argument f_path leads to command injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. NOTE: This vulnerability only affects products that are no longer supported by the maintainer. NOTE: Vendor was contacted early and confirmed that the product is end-of-life. It should be retired and replaced.",
    "published": "2024-08-24T18:15:04.727",
    "keywords": "remote,command"
  },
  "CVE-2024-8133": {
    "cvss": 6.3,
    "description": "A vulnerability was found in D-Link DNS-120, DNR-202L, DNS-315L, DNS-320, DNS-320L, DNS-320LW, DNS-321, DNR-322L, DNS-323, DNS-325, DNS-326, DNS-327L, DNR-326, DNS-340L, DNS-343, DNS-345, DNS-726-4, DNS-1100-4, DNS-1200-05 and DNS-1550-04 up to 20240814. It has been declared as critical. This vulnerability affects the function cgi_FMT_R5_SpareDsk_DiskMGR of the file /cgi-bin/hd_config.cgi of the component HTTP POST Request Handler. The manipulation of the argument f_source_dev leads to command injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. NOTE: This vulnerability only affects products that are no longer supported by the maintainer. NOTE: Vendor was contacted early and confirmed that the product is end-of-life. It should be retired and replaced.",
    "published": "2024-08-24T19:15:05.963",
    "keywords": "remote,command"
  },
  "CVE-2024-8134": {
    "cvss": 6.3,
    "description": "A vulnerability was found in D-Link DNS-120, DNR-202L, DNS-315L, DNS-320, DNS-320L, DNS-320LW, DNS-321, DNR-322L, DNS-323, DNS-325, DNS-326, DNS-327L, DNR-326, DNS-340L, DNS-343, DNS-345, DNS-726-4, DNS-1100-4, DNS-1200-05 and DNS-1550-04 up to 20240814. It has been rated as critical. This issue affects the function cgi_FMT_Std2R5_1st_DiskMGR of the file /cgi-bin/hd_config.cgi of the component HTTP POST Request Handler. The manipulation of the argument f_source_dev leads to command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. NOTE: This vulnerability only affects products that are no longer supported by the maintainer. NOTE: Vendor was contacted early and confirmed that the product is end-of-life. It should be retired and replaced.",
    "published": "2024-08-24T20:15:04.503",
    "keywords": "remote,command"
  },
  "CVE-2024-45244": {
    "url": "https://github.com/hyperledger/fabric/commit/155457a6624b3c74b22e5729c35c8499bfe952cd",
    "cvss": "-",
    "description": "Hyperledger Fabric through 2.5.9 does not verify that a request has a timestamp within the expected time window.",
    "published": "2024-08-25T02:15:03.383"
  }
}