{
  "CVE-2024-37082": {
    "cvss": 9.0,
    "description": "Security check loophole in HAProxy release (in combination with routing release) in Cloud Foundry prior to v40.17.0 potentially allows bypass of mTLS authentication to applications hosted on Cloud Foundry.",
    "published": "2024-07-03T06:15:03.633",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-6427": {
    "cvss": 7.5,
    "description": "Uncontrolled Resource Consumption vulnerability in MESbook 20221021.03 version. An unauthenticated remote attacker can use the \"message\" parameter to inject a payload with dangerous JavaScript code, causing the application to loop requests on itself, which could lead to resource consumption and disable the application.",
    "published": "2024-07-03T12:15:03.430",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-5672": {
    "cvss": 7.2,
    "description": "A high privileged remote attacker can execute arbitrary system commands via GET requests due to improper neutralization of special elements used in an OS command.\n",
    "published": "2024-07-03T13:15:03.043",
    "keywords": "remote,command"
  },
  "CVE-2024-32937": {
    "cvss": 8.1,
    "description": "An os command injection vulnerability exists in the CWMP SelfDefinedTimeZone functionality of Grandstream GXP2135 1.0.9.129, 1.0.11.74 and 1.0.11.79. A specially crafted network packet can lead to arbitrary command execution. An attacker can send a sequence of malicious packets to trigger this vulnerability.",
    "published": "2024-07-03T14:15:05.340",
    "keywords": "execution,command"
  },
  "CVE-2024-39223": {
    "cvss": "-",
    "description": "An authentication bypass in the SSH service of gost v2.11.5 allows attackers to intercept communications via setting the HostKeyCallback function to ssh.InsecureIgnoreHostKey",
    "published": "2024-07-03T15:15:06.083",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-39844": {
    "cvss": "-",
    "description": "In ZNC before 1.9.1, remote code execution can occur in modtcl via a KICK.",
    "published": "2024-07-03T17:15:04.403",
    "keywords": "remote,execution"
  },
  "CVE-2024-31223": {
    "url": "https://github.com/ethyca/fides/commit/0555080541f18a5aacff452c590ac9a1b56d7097",
    "cvss": 5.3,
    "description": "Fides is an open-source privacy engineering platform, and `SERVER_SIDE_FIDES_API_URL` is a server-side configuration environment variable used by the Fides Privacy Center to communicate with the Fides webserver backend. The value of this variable is a URL which typically includes a private IP address, private domain name, and/or port. A vulnerability present starting in version 2.19.0 and prior to version 2.39.2rc0 allows an unauthenticated attacker to make a HTTP GET request from the Privacy Center that discloses the value of this server-side URL. This could result in disclosure of server-side configuration giving an attacker information on server-side ports, private IP addresses, and/or private domain names. The vulnerability has been patched in Fides version 2.39.2rc0. No known workarounds are available.",
    "published": "2024-07-03T18:15:05.097"
  },
  "CVE-2024-33869": {
    "cvss": "-",
    "description": "An issue was discovered in Artifex Ghostscript before 10.03.1. Path traversal and command execution can occur (via a crafted PostScript document) because of path reduction in base/gpmisc.c. For example, restrictions on use of %pipe% can be bypassed via the aa/../%pipe%command# output filename.",
    "published": "2024-07-03T19:15:03.767",
    "keywords": "execution,command,bypass"
  },
  "CVE-2024-6284": {
    "url": "https://github.com/google/nftables/issues/225",
    "cvss": "-",
    "description": "In  https://github.com/google/nftables  IP addresses were encoded in the wrong byte order, resulting in an nftables configuration which does not work as intended (might block or not block the desired addresses).\n\nThis issue affects:  https://pkg.go.dev/github.com/google/nftables@v0.1.0 \n\nThe bug was fixed in the next released version:  https://pkg.go.dev/github.com/google/nftables@v0.2.0",
    "published": "2024-07-03T23:15:02.333"
  },
  "CVE-2024-2385": {
    "cvss": 8.8,
    "description": "The Elementor Addons by Livemesh plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 8.3.7 via several of the plugin's widgets through the 'style' attribute. This makes it possible for authenticated attackers, with contributor-level access and above, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-07-04T04:15:14.000",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-1573": {
    "cvss": 5.9,
    "description": "Improper Authentication vulnerability in the mobile monitoring feature of ICONICS GENESIS64 versions 10.97 to 10.97.2, Mitsubishi Electric GENESIS64 versions 10.97 to 10.97.2 and Mitsubishi Electric MC Works64 all versions allows a remote unauthenticated attacker to bypass proper authentication and log in to the system when all of the following conditions are met:  *  Active Directory is used in the security setting.\n  *  “Automatic log in” option is enabled in the security setting.\n  *  The IcoAnyGlass IIS Application Pool is running under an Active Directory Domain Account.\n  *  The IcoAnyGlass IIS Application Pool account is included in GENESIS64TM and MC Works64 Security and has permission to log in.",
    "published": "2024-07-04T09:15:03.260",
    "keywords": "remote,unauthenticated,authentication,bypass"
  },
  "CVE-2024-6318": {
    "cvss": 8.8,
    "description": "The IMGspider plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the 'upload_img_file' function in all versions up to, and including, 2.3.10. This makes it possible for authenticated attackers, with contributor-level and above permissions, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-07-04T09:15:04.653",
    "keywords": "remote,execution"
  },
  "CVE-2024-6319": {
    "cvss": 8.8,
    "description": "The IMGspider plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the 'upload' function in all versions up to, and including, 2.3.10. This makes it possible for authenticated attackers, with contributor-level and above permissions, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-07-04T09:15:05.087",
    "keywords": "remote,execution"
  },
  "CVE-2024-6507": {
    "cvss": 8.1,
    "description": "Command injection when ingesting a remote Kaggle dataset due to a lack of input sanitization in the ingest_kaggle() API",
    "published": "2024-07-04T12:15:03.963",
    "keywords": "remote,command"
  },
  "CVE-2024-6506": {
    "cvss": 8.2,
    "description": "Information exposure vulnerability in the MRW plugin, in its 5.4.3 version, affecting the \"mrw_log\" functionality. This vulnerability could allow a remote attacker to obtain other customers' order information and access sensitive information such as name and phone number. This vulnerability also allows an attacker to create or overwrite shipping labels.",
    "published": "2024-07-04T13:15:10.240",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-39929": {
    "cvss": "-",
    "description": "Exim through 4.97.1 misparses a multiline RFC 2231 header filename, and thus remote attackers can bypass a $mime_filename extension-blocking protection mechanism, and potentially deliver executable attachments to the mailboxes of end users.",
    "published": "2024-07-04T15:15:10.323",
    "keywords": "remote,bypass"
  },
  "CVE-2024-39930": {
    "cvss": 9.9,
    "description": "The built-in SSH server of Gogs through 0.13.0 allows argument injection in internal/ssh/ssh.go, leading to remote code execution. Authenticated attackers can exploit this by opening an SSH connection and sending a malicious --split-string env request if the built-in SSH server is activated. Windows installations are unaffected.",
    "published": "2024-07-04T16:15:02.277",
    "keywords": "remote,execution"
  },
  "CVE-2024-39943": {
    "cvss": 9.9,
    "description": "rejetto HFS (aka HTTP File Server) 3 before 0.52.10 on Linux, UNIX, and macOS allows OS command execution by remote authenticated users (if they have Upload permissions). This occurs because a shell is used to execute df (i.e., with execSync instead of spawnSync in child_process in Node.js).",
    "published": "2024-07-04T23:15:09.940",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-38346": {
    "cvss": "-",
    "description": "The CloudStack cluster service runs on unauthenticated port (default 9090) that can be misused to run arbitrary commands on targeted hypervisors and CloudStack management server hosts. Some of these commands were found to have command injection vulnerabilities that can result in arbitrary code execution via agents on the hosts that may run as a privileged user. An attacker that can reach the cluster service on the unauthenticated port (default 9090), can exploit this to perform remote code execution on CloudStack managed hosts and result in complete compromise of the confidentiality, integrity, and availability of CloudStack managed infrastructure.\n\nUsers are recommended to restrict the network access to the cluster service port (default 9090) on a CloudStack management server host to only its peer CloudStack management server hosts. Users are recommended to upgrade to version 4.18.2.1, 4.19.0.2 or later, which addresses this issue.\n\n",
    "published": "2024-07-05T14:15:02.867",
    "keywords": "remote,execution,unauthenticated,command"
  },
  "CVE-2024-39027": {
    "cvss": "-",
    "description": "SeaCMS v12.9 has an unauthorized SQL injection vulnerability. The vulnerability is caused by the SQL injection through the cid parameter at /js/player/dmplayer/dmku/index.php?ac=edit, which can cause sensitive database information to be leaked.",
    "published": "2024-07-05T14:15:02.997",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-39864": {
    "cvss": "-",
    "description": "The CloudStack integration API service allows running its unauthenticated API server (usually on port 8096 when configured and enabled via integration.api.port global setting) for internal portal integrations and for testing purposes. By default, the integration API service port is disabled and is considered disabled when integration.api.port is set to 0 or negative. Due to an improper initialisation logic, the integration API service would listen on a random port when its port value is set to 0 (default value). An attacker that can access the CloudStack management network could scan and find the randomised integration API service port and exploit it to perform unauthorised administrative actions and perform remote code execution on CloudStack managed hosts and result in complete compromise of the confidentiality, integrity, and availability of CloudStack managed infrastructure.\n\nUsers are recommended to restrict the network access on the CloudStack management server hosts to only essential ports. Users are recommended to upgrade to version 4.18.2.1, 4.19.0.2 or later, which addresses this issue.\n\n",
    "published": "2024-07-05T14:15:03.203",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-6526": {
    "url": "https://github.com/kirilkirkov/ecommerce-codeigniter-bootstrap/commit/1b3da45308bb6c3f55247d0e99620b600bd85277",
    "cvss": 3.5,
    "description": "A vulnerability classified as problematic has been found in CodeIgniter Ecommerce-CodeIgniter-Bootstrap up to 1998845073cf433bc6c250b0354461fbd84d0e03. This affects an unknown part. The manipulation of the argument search_title/catName/sub/name/categorie leads to cross site scripting. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The identifier of the patch is 1b3da45308bb6c3f55247d0e99620b600bd85277. It is recommended to apply a patch to fix this issue. The identifier VDB-270369 was assigned to this vulnerability.",
    "published": "2024-07-05T14:15:03.910"
  },
  "CVE-2024-37768": {
    "url": "https://github.com/b1ackc4t/14finger/issues/12",
    "cvss": "-",
    "description": "14Finger v1.1 was discovered to contain an arbitrary user deletion vulnerability via the component /api/admin/user?id.",
    "published": "2024-07-05T16:15:05.010"
  },
  "CVE-2024-37769": {
    "url": "https://github.com/b1ackc4t/14finger/issues/12",
    "cvss": "-",
    "description": "Insecure permissions in 14Finger v1.1 allow attackers to escalate privileges from normal user to Administrator via a crafted POST request.",
    "published": "2024-07-05T16:15:05.110"
  },
  "CVE-2024-27710": {
    "cvss": "-",
    "description": "An issue in Eskooly Free Online School management Software v.3.0 and before allows a remote attacker to escalate privileges via the authentication mechanism.",
    "published": "2024-07-05T17:15:10.940",
    "keywords": "remote,authentication"
  },
  "CVE-2024-27712": {
    "cvss": "-",
    "description": "An issue in Eskooly Free Online School management Software v.3.0 and before allows a remote attacker to escalate privileges via the User Account Mangemnt component in the authentication mechanism.",
    "published": "2024-07-05T17:15:11.107",
    "keywords": "remote,authentication"
  },
  "CVE-2024-37767": {
    "url": "https://github.com/b1ackc4t/14finger/issues/12",
    "cvss": "-",
    "description": "Insecure permissions in the component /api/admin/user of 14Finger v1.1 allows attackers to access all user information via a crafted GET request.",
    "published": "2024-07-05T17:15:11.533"
  },
  "CVE-2024-34361": {
    "cvss": 8.5,
    "description": "Pi-hole is a DNS sinkhole that protects devices from unwanted content without installing any client-side software. A vulnerability in versions prior to 5.18.3 allows an authenticated user to make internal requests to the server via the `gravity_DownloadBlocklistFromUrl()` function. Depending on some circumstances, the vulnerability could lead to remote command execution. Version 5.18.3 contains a patch for this issue.",
    "published": "2024-07-05T19:15:09.610",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-39696": {
    "url": "https://github.com/evmos/evmos/commit/0a620e176617a835ac697eea494afea09185dfaf",
    "cvss": 8.8,
    "description": "Evmos is a decentralized Ethereum Virtual Machine chain on the Cosmos Network. Prior to version 19.0.0, a user can create a vesting account with a 3rd party account (EOA or contract) as funder. Then, this user can create an authorization for the contract.CallerAddress, this is the authorization checked in the code. But the funds are taken from the funder address provided in the message. Consequently, the user can fund a vesting account with a 3rd party account without its permission. The funder address can be any address, so this vulnerability can be used to drain all the accounts in the chain. The issue has been patched in version 19.0.0.",
    "published": "2024-07-05T19:15:10.673"
  },
  "CVE-2024-5753": {
    "cvss": 7.5,
    "description": "vanna-ai/vanna version v0.3.4 is vulnerable to SQL injection in some file-critical functions such as `pg_read_file()`. This vulnerability allows unauthenticated remote users to read arbitrary local files on the victim server, including sensitive files like `/etc/passwd`, by exploiting the exposed SQL queries via a Python Flask API.",
    "published": "2024-07-05T20:15:02.343",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-39182": {
    "cvss": "-",
    "description": "An information disclosure vulnerability in ISPmanager v6.98.0 allows attackers to access sensitive details of the root user's session via an arbitrary command (ISP6-1779).",
    "published": "2024-07-05T23:15:10.137",
    "keywords": "command,sensitive"
  }
}