{
  "CVE-2025-11920": {
    "cvss": 8.8,
    "description": "The WPCOM Member plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 1.7.14 via the action parameter in one of its shortcodes. This makes it possible for authenticated attackers, with Contributor-level access and above, to include and execute arbitrary .php files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where .php file types can be uploaded and included.",
    "published": "2025-11-01T02:15:33.037",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2025-10487": {
    "cvss": 7.3,
    "description": "The Advanced Ads – Ad Manager & AdSense plugin for WordPress is vulnerable to Remote Code Execution in all versions up to, and including, 2.0.12 via the select_one() function. This is due to the endpoint not properly restricting access to the AJAX endpoint or limiting the functions that can be called to safe functions. This makes it possible for unauthenticated attackers to call arbitrary functions beginning with get_the_ like get_the_excerpt which can make information exposure possible.",
    "published": "2025-11-01T07:15:33.610",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2025-11499": {
    "cvss": 9.8,
    "description": "The Tablesome Table – Contact Form DB – WPForms, CF7, Gravity, Forminator, Fluent plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the set_featured_image_from_external_url() function in all versions up to, and including, 1.1.32. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected site's server which may make remote code execution possible in configurations where unauthenticated users have been provided with a method for adding featured images, and the workflow trigger is created.",
    "published": "2025-11-01T07:15:34.940",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2025-11755": {
    "cvss": 8.8,
    "description": "The WP Delicious – Recipe Plugin for Food Bloggers (formerly Delicious Recipes) plugin for WordPress is vulnerable to arbitrary file uploads when importing recipes via CSV in all versions up to, and including, 1.9.0. This flaw allows an attacker with at least Contributor-level permissions to upload a malicious PHP file by providing a remote URL during a recipe import process, leading to Remote Code Execution (RCE).",
    "published": "2025-11-01T07:15:35.130",
    "keywords": "remote,execution"
  },
  "CVE-2025-12171": {
    "cvss": 8.8,
    "description": "The RESTful Content Syndication plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the ingest_image() function in versions 1.1.0 to 1.5.0. This makes it possible for authenticated attackers, with Author-level access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible. This requires the attacker have access to a defined third-party server as specified in the settings, so it is unlikely that this will be exploitable by contributor-level users, and more likely to be exploited by administrators who also have access to the plugin's settings.",
    "published": "2025-11-01T07:15:35.557",
    "keywords": "remote,execution"
  },
  "CVE-2025-6990": {
    "cvss": 8.8,
    "description": "The kallyas theme for WordPress is vulnerable to Remote Code Execution in all versions up to, and including, 4.24.0 via the  `TH_PhpCode` pagebuilder widget. This is due to the theme not restricting access to the code editor widget for non-administrators. This makes it possible for authenticated attackers, with Contributor-level access and above, to execute code on the server.",
    "published": "2025-11-01T08:15:32.600",
    "keywords": "remote,execution"
  },
  "CVE-2025-12616": {
    "cvss": 3.7,
    "description": "A vulnerability was detected in PHPGurukul News Portal 1.0. The impacted element is an unknown function of the file /onps/settings.py. Performing manipulation results in insertion of sensitive information into debugging code. It is possible to initiate the attack remotely. The attack's complexity is rated as high. The exploitability is regarded as difficult. The exploit is now public and may be used.",
    "published": "2025-11-03T04:15:32.240",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-12503": {
    "cvss": 6.5,
    "description": "EasyFlow .NET and EasyFlow AiNet developed by Digiwin has a SQL Injection vulnerability, allowing authenticated remote attackers to inject arbitrary SQL commands to read database contents.",
    "published": "2025-11-03T07:15:41.480",
    "keywords": "remote,command"
  },
  "CVE-2025-12623": {
    "cvss": 3.1,
    "description": "A vulnerability was identified in fushengqian fuint up to 41e26be8a2c609413a0feaa69bdad33a71ae8032. Affected by this issue is some unknown functionality of the file fuint-application/src/main/java/com/fuint/module/clientApi/controller/ClientSignController.java of the component Authentication Token Handler. Such manipulation leads to authorization bypass. The attack may be launched remotely. Attacks of this nature are highly complex. The exploitation is known to be difficult. The exploit is publicly available and might be used. This product operates on a rolling release basis, ensuring continuous delivery. Consequently, there are no version details for either affected or updated releases.",
    "published": "2025-11-03T08:15:33.853",
    "keywords": "remote,authentication,bypass"
  },
  "CVE-2025-12626": {
    "url": "https://github.com/jeecgboot/jeewx-boot/issues/47",
    "cvss": 4.3,
    "description": "A security flaw has been discovered in jeecgboot jeewx-boot up to 641ab52c3e1845fec39996d7794c33fb40dad1dd. This affects the function getImgUrl of the file WxActGoldeneggsPrizesController.java. Performing manipulation of the argument imgurl results in path traversal. Remote exploitation of the attack is possible. The exploit has been released to the public and may be exploited. This product follows a rolling release approach for continuous delivery, so version details for affected or updated releases are not provided. The root cause was initially fixed but can be evaded with additional encoding.",
    "published": "2025-11-03T13:15:35.923"
  },
  "CVE-2025-60892": {
    "url": "https://github.com/raspberrypi/rpi-imager/issues/1185",
    "cvss": 6.8,
    "description": "An issue in Raspberry Pi Imager version 1.9.6 for Windows, affecting its OS customization feature. The imager's 'public-key authentication' setting unintentionally re-adds a user's id_rsa.pub key from their local Windows machine to the authorized_keys file on the Raspberry Pi, even after the user explicitly deletes the key from the user interface. This creates an unintended attack surface, as it could allow an attacker to use a different key than the intended one to login to the device.",
    "published": "2025-11-03T15:15:36.040"
  },
  "CVE-2025-60785": {
    "cvss": "-",
    "description": "A remote code execution (RCE) vulnerability in the Postgres Drivers component of iceScrum v7.54 Pro On-prem allows attackers to execute arbitrary code via a crafted HTML page.",
    "published": "2025-11-03T16:15:35.470",
    "keywords": "remote,execution"
  },
  "CVE-2025-11953": {
    "cvss": 9.8,
    "description": "The Metro Development Server, which is opened by the React Native Community CLI, binds to external interfaces by default. The server exposes an endpoint that is vulnerable to OS command injection. This allows unauthenticated network attackers to send a POST request to the server and run arbitrary executables. On Windows, the attackers can also execute arbitrary shell commands with fully controlled arguments.",
    "published": "2025-11-03T17:15:32.677",
    "keywords": "unauthenticated,command"
  },
  "CVE-2025-63441": {
    "url": "https://github.com/opensource-socialnetwork/opensource-socialnetwork/issues/2501",
    "cvss": 7.3,
    "description": "Open Source Social Network (OSSN) 8.6 is vulnerable to Cross Site Scripting (XSS) via the parameter param` at endpoint u/administrator/friends.",
    "published": "2025-11-03T17:15:33.327"
  },
  "CVE-2025-8558": {
    "cvss": "-",
    "description": "Insider Threat Management (ITM) Server versions prior to 7.17.2 contain an authentication bypass vulnerability that allows unauthenticated users on an adjacent network to perform agent unregistration when the number of registered agents exceeds the licensed limit. Successful exploitation prevents the server from receiving new events from affected agents, resulting in a partial loss of integrity and availability with no impact to confidentiality.",
    "published": "2025-11-03T19:16:16.227",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2025-12531": {
    "cvss": 7.1,
    "description": "IBM InfoSphere Information Server 11.7.0.0 through 11.7.1.6 is vulnerable to an XML external entity injection (XXE) attack when processing XML data. A remote attacker could exploit this vulnerability to expose sensitive information or consume memory resources.",
    "published": "2025-11-03T20:17:06.247",
    "keywords": "remote,sensitive"
  }
}