{
  "CVE-2024-49803": {
    "cvss": 9.8,
    "description": "IBM Security Verify Access Appliance 10.0.0 through 10.0.8 could allow a remote authenticated attacker to execute arbitrary commands on the system by sending a specially crafted request.",
    "published": "2024-11-29T17:15:08.180",
    "keywords": "remote,command"
  },
  "CVE-2024-52800": {
    "cvss": "-",
    "description": "veraPDF is an open source PDF/A validation library. Executing policy checks using custom schematron files via the CLI invokes an XSL transformation that may theoretically lead to a remote code execution (RCE) vulnerability. This doesn't affect the standard validation and policy checks functionality, veraPDF's common use cases. Most veraPDF users don't insert any custom XSLT code into policy profiles, which are based on Schematron syntax rather than direct XSL transforms. For users who do, only load custom policy files from sources you trust. This issue has not yet been patched. Users are advised to be cautious of XSLT code until a patch is available.",
    "published": "2024-11-29T19:15:08.713",
    "keywords": "remote,execution"
  },
  "CVE-2024-52810": {
    "cvss": "-",
    "description": "@intlify/shared is a shared library for the intlify project. The latest version of @intlify/shared (10.0.4) is vulnerable to Prototype Pollution through the entry function(s) lib.deepCopy. An attacker can supply a payload with Object.prototype setter to introduce or modify properties within the global prototype chain, causing denial of service (DoS) as the minimum consequence. Moreover, the consequences of this vulnerability can escalate to other injection-based attacks, depending on how the library integrates within the application. For instance, if the polluted property propagates to sensitive Node.js APIs (e.g., exec, eval), it could enable an attacker to execute arbitrary commands within the application's context. This issue has been addressed in versions 9.14.2, and 10.0.5. Users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-11-29T19:15:09.163",
    "keywords": "command,sensitive"
  },
  "CVE-2024-53504": {
    "url": "https://github.com/siyuan-note/siyuan/issues/13077",
    "cvss": "-",
    "description": "A SQL injection vulnerability has been identified in Siyuan 3.1.11 via the notebook parameter in /searchHistory.",
    "published": "2024-11-29T20:15:20.763"
  },
  "CVE-2024-53505": {
    "url": "https://github.com/siyuan-note/siyuan/issues/13077",
    "cvss": "-",
    "description": "A SQL injection vulnerability has been identified in Siyuan 3.1.11 via the id parameter at /getAssetContent.",
    "published": "2024-11-29T20:15:20.853"
  },
  "CVE-2024-53506": {
    "url": "https://github.com/siyuan-note/siyuan/issues/13077",
    "cvss": "-",
    "description": "A SQL injection vulnerability has been identified in Siyuan 3.1.11 via the ids array parameter in /batchGetBlockAttrs.",
    "published": "2024-11-29T20:15:20.943"
  },
  "CVE-2024-53507": {
    "url": "https://github.com/siyuan-note/siyuan/issues/13077",
    "cvss": "-",
    "description": "A SQL injection vulnerability was discovered in Siyuan 3.1.11 in /getHistoryItems.",
    "published": "2024-11-29T20:15:21.027"
  },
  "CVE-2024-20127": {
    "cvss": "-",
    "description": "In Telephony, there is a possible out of bounds read due to a missing bounds check. This could lead to remote denial of service with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: ALPS09289881; Issue ID: MSV-2023.",
    "published": "2024-12-02T04:15:04.777",
    "keywords": "remote,execution"
  },
  "CVE-2024-20128": {
    "cvss": "-",
    "description": "In Telephony, there is a possible out of bounds read due to a missing bounds check. This could lead to remote denial of service with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: ALPS09289881; Issue ID: MSV-2024.",
    "published": "2024-12-02T04:15:04.967",
    "keywords": "remote,execution"
  },
  "CVE-2024-20129": {
    "cvss": "-",
    "description": "In Telephony, there is a possible out of bounds read due to a missing bounds check. This could lead to remote denial of service with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: ALPS09289881; Issue ID: MSV-2025.",
    "published": "2024-12-02T04:15:05.073",
    "keywords": "remote,execution"
  },
  "CVE-2024-20137": {
    "cvss": 7.5,
    "description": "In wlan driver, there is a possible client disconnection due to improper handling of exceptional conditions. This could lead to remote denial of service with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: WCNCR00384543; Issue ID: MSV-1727.",
    "published": "2024-12-02T04:15:06.030",
    "keywords": "remote,execution"
  },
  "CVE-2024-20138": {
    "cvss": 7.5,
    "description": "In wlan driver, there is a possible out of bound read due to improper input validation. This could lead to remote information disclosure with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: ALPS08998291; Issue ID: MSV-1604.",
    "published": "2024-12-02T04:15:06.133",
    "keywords": "remote,execution"
  },
  "CVE-2024-10490": {
    "cvss": "-",
    "description": "An “Authentication Bypass Using an Alternate Path or Channel” vulnerability in the OPC UA Server configuration required for B&R mapp Cockpit before 6.0, B&R mapp View before 6.0, B&R mapp Services before 6.0, B&R mapp Motion before 6.0 and B&R mapp Vision before 6.0 may be used by an unauthenticated network-based attacker to cause information disclosure, unintended change of data, or denial of service conditions.\nB&R mapp Services is only affected, when mpUserX or mpCodeBox are used in the Automation Studio project.",
    "published": "2024-12-02T09:15:04.613",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-46909": {
    "cvss": 9.8,
    "description": "In WhatsUp Gold versions released before 2024.0.1, a remote unauthenticated attacker could leverage this vulnerability to execute code in the context of the service account.",
    "published": "2024-12-02T15:15:12.120",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-8785": {
    "cvss": 9.8,
    "description": "In WhatsUp Gold versions released before 2024.0.1, a remote unauthenticated attacker could leverage NmAPI.exe to create or change an existing registry value in registry path HKEY_LOCAL_MACHINE\\SOFTWARE\\WOW6432Node\\Ipswitch\\.",
    "published": "2024-12-02T15:15:12.380",
    "keywords": "remote,unauthenticated"
  }
}