{
  "CVE-2024-27497": {
    "cvss": "-",
    "description": "Linksys E2000 Ver.1.0.06 build 1 is vulnerable to authentication bypass via the position.js file.",
    "published": "2024-03-01T15:15:08.580",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-1624": {
    "cvss": 9.4,
    "description": "An OS Command Injection vulnerability affecting documentation server on 3DEXPERIENCE from Release 3DEXPERIENCE R2022x through Release 3DEXPERIENCE R2024x, SIMULIA Abaqus from Release 2022 through Release 2024, SIMULIA Isight from Release 2022 through Release 2024 and CATIA Composer from Release R2023 through Release R2024. A specially crafted HTTP request can lead to arbitrary command execution.",
    "published": "2024-03-01T16:15:45.723",
    "keywords": "execution,command"
  },
  "CVE-2024-2076": {
    "cvss": 5.3,
    "description": "A vulnerability was found in CodeAstro House Rental Management System 1.0. It has been rated as problematic. Affected by this issue is some unknown functionality of the file booking.php/owner.php/tenant.php. The manipulation leads to missing authentication. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-255392.",
    "published": "2024-03-01T19:15:07.247",
    "keywords": "remote,authentication"
  },
  "CVE-2024-21767": {
    "cvss": 9.4,
    "description": "\nA remote attacker may be able to bypass access control of Commend WS203VICM by creating a malicious request.\n\n\n\n",
    "published": "2024-03-01T21:15:07.973",
    "keywords": "remote,bypass"
  },
  "CVE-2024-22182": {
    "cvss": 8.6,
    "description": "A remote, unauthenticated attacker may be able to send crafted messages \nto the web server of the Commend WS203VICM causing the system to \nrestart, interrupting service.\n\n",
    "published": "2024-03-01T21:15:08.167",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-0795": {
    "url": "https://github.com/mintplex-labs/anything-llm/commit/9a237db3d1f66cdbcf5079599258f5fb251c5564",
    "cvss": 7.2,
    "description": "If an attacked was given access to an instance with the admin or manager role there is no backend authentication that would prevent the attacked from creating a new user with an `admin` role and then be able to use this new account to have elevated privileges on the instance",
    "published": "2024-03-02T22:15:49.813"
  },
  "CVE-2024-0968": {
    "url": "https://github.com/langchain-ai/chat-langchain/commit/e13db53cba2a48e4e26d103fd51598856f6bdd33",
    "cvss": 4.6,
    "description": "Cross-site Scripting (XSS) - DOM in GitHub repository langchain-ai/chat-langchain prior to 0.0.0.",
    "published": "2024-03-02T22:15:50.123"
  },
  "CVE-2024-25865": {
    "url": "https://github.com/anzhiyu-c/hexo-theme-anzhiyu/issues/200",
    "cvss": "-",
    "description": "Cross Site Scripting (XSS) vulnerability in hexo-theme-anzhiyu v1.6.12, allows remote attackers to execute arbitrary code via the algolia search function.",
    "published": "2024-03-02T22:15:50.293"
  },
  "CVE-2024-25016": {
    "cvss": 7.5,
    "description": "IBM MQ and IBM MQ Appliance 9.0, 9.1, 9.2, 9.3 LTS and 9.3 CD could allow a remote unauthenticated attacker to cause a denial of service due to incorrect buffering logic.  IBM X-Force ID:  281279.",
    "published": "2024-03-03T04:15:06.057",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-24307": {
    "cvss": "-",
    "description": "Path Traversal vulnerability in Tunis Soft \"Product Designer\" (productdesigner) module for PrestaShop before version 1.178.36, allows a remote attacker to escalate privileges and obtain sensitive information via the ajaxProcessCropImage() method.",
    "published": "2024-03-03T08:15:08.140",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-25844": {
    "cvss": "-",
    "description": "An issue was discovered in Common-Services \"So Flexibilite\" (soflexibilite) module for PrestaShop before version 4.1.26, allows remote attackers to escalate privileges and obtain sensitive information via debug file.",
    "published": "2024-03-03T08:15:08.280",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-24302": {
    "cvss": "-",
    "description": "An issue was discovered in Tunis Soft \"Product Designer\" (productdesigner) module for PrestaShop before version 1.178.36, allows remote attackers to execute arbitrary code, escalate privileges, and obtain sensitive information via the postProcess() method.",
    "published": "2024-03-03T09:15:06.100",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-25842": {
    "cvss": "-",
    "description": "An issue was discovered in Presta World \"Account Manager - Sales Representative & Dealers - CRM\" (prestasalesmanager) module for PrestaShop before version 9.0, allows remote attackers to escalate privilege and obtain sensitive information via the uploadLogo() and postProcess methods.",
    "published": "2024-03-03T09:15:06.210",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-0765": {
    "url": "https://github.com/mintplex-labs/anything-llm/commit/08d33cfd8fc47c5052b6ea29597c964a9da641e2",
    "cvss": 9.6,
    "description": "As a default user on a multi-user instance of AnythingLLM, you could execute a call to the `/export-data` endpoint of the system and then unzip and read that export that would enable you do exfiltrate data of the system at that save state.\n\nThis would require the attacked to be granted explicit access to the system, but they can do this at any role. Additionally, post-download, the data is deleted so no evidence would exist that the exfiltration occured.",
    "published": "2024-03-03T15:15:07.113"
  },
  "CVE-2024-28088": {
    "cvss": "-",
    "description": "LangChain through 0.1.10 allows ../ directory traversal by an actor who is able to control the final part of the path parameter in a load_chain call. This bypasses the intended behavior of loading configurations only from the hwchase17/langchain-hub GitHub repository. The outcome can be disclosure of an API key for a large language model online service, or remote code execution.",
    "published": "2024-03-04T00:15:47.017",
    "keywords": "remote,execution,bypass"
  },
  "CVE-2024-20005": {
    "cvss": "-",
    "description": "In da, there is a possible permission bypass due to a missing permission check. This could lead to local escalation of privilege with System execution privileges needed. User interaction is not needed for exploitation. Patch ID: ALPS08355599; Issue ID: ALPS08355599.",
    "published": "2024-03-04T03:15:06.917",
    "keywords": "execution,bypass"
  },
  "CVE-2024-20019": {
    "cvss": "-",
    "description": "In wlan driver, there is a possible memory leak due to improper input handling. This could lead to remote denial of service with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: WCNCR00351241; Issue ID: MSV-1173.",
    "published": "2024-03-04T03:15:07.060",
    "keywords": "remote,execution,leak"
  },
  "CVE-2024-20032": {
    "cvss": "-",
    "description": "In aee, there is a possible permission bypass due to a missing permission check. This could lead to local escalation of privilege with System execution privileges needed. User interaction is not needed for exploitation. Patch ID: ALPS08487630; Issue ID: MSV-1020.",
    "published": "2024-03-04T03:15:07.587",
    "keywords": "execution,bypass"
  },
  "CVE-2024-20036": {
    "cvss": "-",
    "description": "In vdec, there is a possible permission bypass due to a permissions bypass. This could lead to local information disclosure with System execution privileges needed. User interaction is not needed for exploitation. Patch ID: ALPS08509508; Issue ID: ALPS08509508.",
    "published": "2024-03-04T03:15:07.717",
    "keywords": "execution,bypass"
  },
  "CVE-2024-21826": {
    "cvss": 4.3,
    "description": "in OpenHarmony v3.2.4 and prior versions allow a local attacker cause sensitive information leak through insecure storage.",
    "published": "2024-03-04T07:15:10.380",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-22463": {
    "cvss": 7.4,
    "description": "Dell PowerScale OneFS 8.2.x through 9.6.0.x contains a use of a broken or risky cryptographic algorithm vulnerability. A remote unprivileged attacker could potentially exploit this vulnerability, leading to compromise of confidentiality and integrity of sensitive information",
    "published": "2024-03-04T14:15:41.193",
    "keywords": "remote,sensitive"
  }
}