{
  "CVE-2024-37569": {
    "cvss": 8.8,
    "description": "An issue was discovered on Mitel 6869i through 4.5.0.41 and 5.x through 5.0.0.1018 devices. A command injection vulnerability exists in the hostname parameter taken in by the provis.html endpoint. The provis.html endpoint performs no sanitization on the hostname parameter (sent by an authenticated user), which is subsequently written to disk. During boot, the hostname parameter is executed as part of a series of shell commands. Attackers can achieve remote code execution in the root context by placing shell metacharacters in the hostname parameter.",
    "published": "2024-06-09T20:15:09.377",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-37570": {
    "cvss": 8.8,
    "description": "On Mitel 6869i 4.5.0.41 devices, the Manual Firmware Update (upgrade.html) page does not perform sanitization on the username and path parameters (sent by an authenticated user) before appending flags to the busybox ftpget command. This leads to $() command execution.",
    "published": "2024-06-09T20:15:09.460",
    "keywords": "execution,command"
  },
  "CVE-2024-4577": {
    "url": "https://github.com/rapid7/metasploit-framework/pull/19247",
    "cvss": 9.8,
    "description": "In PHP versions 8.1.* before 8.1.29, 8.2.* before 8.2.20, 8.3.* before 8.3.8, when using Apache and PHP-CGI on Windows, if the system is set up to use certain code pages, Windows may use \"Best-Fit\" behavior to replace characters in command line given to Win32 API functions. PHP CGI module may misinterpret those characters as PHP options, which may allow a malicious user to pass options to PHP binary being run, and thus reveal the source code of scripts, run arbitrary PHP code on the server, etc.",
    "published": "2024-06-09T20:15:09.550"
  },
  "CVE-2024-37880": {
    "url": "https://github.com/pq-crystals/kyber/commit/9b8d30698a3e7449aeb34e62339d4176f11e3c6c",
    "cvss": 7.5,
    "description": "The Kyber reference implementation before 9b8d306, when compiled by LLVM Clang through 18.x with some common optimization options, has a timing side channel that allows attackers to recover an ML-KEM 512 secret key in minutes. This occurs because poly_frommsg in poly.c does not prevent Clang from emitting a vulnerable secret-dependent branch.",
    "published": "2024-06-10T02:15:47.160"
  },
  "CVE-2024-36405": {
    "url": "https://github.com/pq-crystals/kyber/commit/9b8d30698a3e7449aeb34e62339d4176f11e3c6c",
    "cvss": 5.9,
    "description": "liboqs is a C-language cryptographic library that provides implementations of post-quantum cryptography algorithms. A control-flow timing lean has been identified in the reference implementation of the Kyber key encapsulation mechanism when it is compiled with Clang 15-18 for `-Os`, `-O1`, and other compilation options. A proof-of-concept local attack on the reference implementation leaks the entire ML-KEM 512 secret key in ~10 minutes using end-to-end decapsulation timing measurements. The issue has been fixed in version 0.10.1. As a possible workaround, some compiler options may produce vectorized code that does not leak secret information, however relying on these compiler options as a workaround may not be reliable.",
    "published": "2024-06-10T13:15:50.700"
  },
  "CVE-2024-35307": {
    "cvss": "-",
    "description": "Argument Injection Leading to Remote Code Execution in Realtime Graph Extension, allowing unauthenticated attackers to execute arbitrary code on the server. This issue affects Pandora FMS: from 700 through <777.",
    "published": "2024-06-10T15:15:51.803",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-35747": {
    "cvss": 5.3,
    "description": "Improper Restriction of Excessive Authentication Attempts vulnerability in wpdevart Contact Form Builder, Contact Widget allows Functionality Bypass.This issue affects Contact Form Builder, Contact Widget: from n/a through 2.1.7.",
    "published": "2024-06-10T17:16:30.947",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-35749": {
    "cvss": 5.3,
    "description": "Authentication Bypass by Spoofing vulnerability in Acurax Under Construction / Maintenance Mode from Acurax allows Authentication Bypass.This issue affects Under Construction / Maintenance Mode from Acurax: from n/a through 2.6.",
    "published": "2024-06-10T17:16:31.187",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-36415": {
    "cvss": 9.1,
    "description": "SuiteCRM is an open-source Customer Relationship Management (CRM) software application. Prior to versions 7.14.4 and 8.6.1, a vulnerability in uploaded file verification in products allows for remote code execution. Versions 7.14.4 and 8.6.1 contain a fix for this issue.",
    "published": "2024-06-10T20:15:14.503",
    "keywords": "remote,execution"
  },
  "CVE-2024-37014": {
    "cvss": 9.8,
    "description": "Langflow through 0.6.19 allows remote code execution if untrusted users are able to reach the \"POST /api/v1/custom_component\" endpoint and provide a Python script.",
    "published": "2024-06-10T20:15:15.213",
    "keywords": "remote,execution"
  },
  "CVE-2024-37393": {
    "cvss": 7.5,
    "description": "Multiple LDAP injections vulnerabilities exist in SecurEnvoy MFA before 9.4.514 due to improper validation of user-supplied input. An unauthenticated remote attacker could exfiltrate data from Active Directory through blind LDAP injection attacks against the DESKTOP service exposed on the /secserver HTTP endpoint. This may include ms-Mcs-AdmPwd, which has a cleartext password for the Local Administrator Password Solution (LAPS) feature.",
    "published": "2024-06-10T20:15:15.293",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-23251": {
    "cvss": "-",
    "description": "An authentication issue was addressed with improved state management. This issue is fixed in macOS Sonoma 14.5, watchOS 10.5, iOS 17.5 and iPadOS 17.5, iOS 16.7.8 and iPadOS 16.7.8. An attacker with physical access may be able to leak Mail account credentials.",
    "published": "2024-06-10T21:15:49.430",
    "keywords": "authentication,leak"
  },
  "CVE-2024-27840": {
    "cvss": "-",
    "description": "The issue was addressed with improved memory handling. This issue is fixed in macOS Ventura 13.6.7, macOS Monterey 12.7.5, iOS 16.7.8 and iPadOS 16.7.8, tvOS 17.5, visionOS 1.2, iOS 17.5 and iPadOS 17.5, watchOS 10.5. An attacker that has already achieved kernel code execution may be able to bypass kernel memory protections.",
    "published": "2024-06-10T21:15:51.313",
    "keywords": "execution,bypass"
  },
  "CVE-2024-27857": {
    "cvss": "-",
    "description": "An out-of-bounds access issue was addressed with improved bounds checking. This issue is fixed in visionOS 1.2, macOS Sonoma 14.5, tvOS 17.5, iOS 17.5 and iPadOS 17.5. A remote attacker may be able to cause unexpected app termination or arbitrary code execution.",
    "published": "2024-06-10T21:15:51.833",
    "keywords": "remote,execution"
  },
  "CVE-2024-36418": {
    "cvss": 8.5,
    "description": "SuiteCRM is an open-source Customer Relationship Management (CRM) software application. Prior to versions 7.14.4 and 8.6.1, a vulnerability in connectors allows an authenticated user to perform a remote code execution attack. Versions 7.14.4 and 8.6.1 contain a fix for this issue.",
    "published": "2024-06-10T21:15:52.120",
    "keywords": "remote,execution"
  },
  "CVE-2024-28164": {
    "cvss": 5.3,
    "description": "SAP NetWeaver AS Java (CAF - Guided Procedures)\nallows an unauthenticated user to access non-sensitive information about the\nserver which would otherwise be restricted causing low impact on\nconfidentiality of the application.",
    "published": "2024-06-11T03:15:09.953",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-29855": {
    "cvss": 9.0,
    "description": "Hard-coded JWT secret allows authentication bypass in Veeam Recovery Orchestrator",
    "published": "2024-06-11T04:15:12.953",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-3723": {
    "cvss": 5.3,
    "description": "The Advanced Contact form 7 DB plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 2.0.2 via the wp-content/uploads/advanced-cf7-upload directory. This makes it possible for unauthenticated attackers to extract sensitive data uploaded via this plugin through a form.",
    "published": "2024-06-11T06:15:10.793",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-4266": {
    "cvss": 5.3,
    "description": "The MetForm – Contact Form, Survey, Quiz, & Custom Form Builder for Elementor plugin for WordPress is vulnerable to Sensitive Information Exposure in versions up to, and including, 3.8.8 via the 'handle_file' function. This can allow unauthenticated attackers to extract sensitive data, such as Personally Identifiable Information, from files uploaded by users.",
    "published": "2024-06-11T08:15:50.850",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-36266": {
    "cvss": 9.3,
    "description": "A vulnerability has been identified in PowerSys (All versions < V3.11). The affected application insufficiently protects responses to authentication requests. This could allow a local attacker to bypass authentication, thereby gaining administrative privileges for the managed remote devices.",
    "published": "2024-06-11T12:15:18.657",
    "keywords": "remote,authentication,bypass"
  },
  "CVE-2024-2012": {
    "cvss": 9.1,
    "description": "vulnerability exists in the FOXMAN-UN/UNEM server / API Gateway that if exploited an attacker could use to allow unintended commands or \ncode to be executed on the UNEM server allowing sensitive data to \nbe read or modified or could cause other unintended behavior",
    "published": "2024-06-11T14:15:11.273",
    "keywords": "command,sensitive"
  },
  "CVE-2024-2013": {
    "cvss": 10.0,
    "description": "An authentication bypass vulnerability exists in the FOXMAN-UN/UNEM server /\nAPI Gateway component that if exploited allows attackers without \nany access to interact with the services and the post-authentication \nattack surface.",
    "published": "2024-06-11T14:15:11.503",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-35235": {
    "cvss": 4.4,
    "description": "OpenPrinting CUPS is an open source printing system for Linux and other Unix-like operating systems. In versions 2.4.8 and earlier, when starting the cupsd server with a Listen configuration item pointing to a symbolic link, the cupsd process can be caused to perform an arbitrary chmod of the provided argument, providing world-writable access to the target. Given that cupsd is often running as root, this can result in the change of permission of any user or system files to be world writable. Given the aforementioned Ubuntu AppArmor context, on such systems this vulnerability is limited to those files modifiable by the cupsd process. In that specific case it was found to be possible to turn the configuration of the Listen argument into full control over the cupsd.conf and cups-files.conf configuration files. By later setting the User and Group arguments in cups-files.conf, and printing with a printer configured by PPD with a `FoomaticRIPCommandLine` argument, arbitrary user and group (not root) command execution could be achieved, which can further be used on Ubuntu systems to achieve full root command execution. Commit ff1f8a623e090dee8a8aadf12a6a4b25efac143d contains a patch for the issue.\n",
    "published": "2024-06-11T15:16:07.473",
    "keywords": "execution,command"
  },
  "CVE-2024-30052": {
    "cvss": 4.7,
    "description": "Visual Studio Remote Code Execution Vulnerability",
    "published": "2024-06-11T17:15:51.600",
    "keywords": "remote,execution"
  },
  "CVE-2024-30062": {
    "cvss": 7.8,
    "description": "Windows Standards-Based Storage Management Service Remote Code Execution Vulnerability",
    "published": "2024-06-11T17:15:51.840",
    "keywords": "remote,execution"
  },
  "CVE-2024-30063": {
    "cvss": 6.7,
    "description": "Windows Distributed File System (DFS) Remote Code Execution Vulnerability",
    "published": "2024-06-11T17:15:52.040",
    "keywords": "remote,execution"
  },
  "CVE-2024-30072": {
    "cvss": 7.8,
    "description": "Microsoft Event Trace Log File Parsing Remote Code Execution Vulnerability",
    "published": "2024-06-11T17:15:53.910",
    "keywords": "remote,execution"
  },
  "CVE-2024-30074": {
    "cvss": 8.0,
    "description": "Windows Link Layer Topology Discovery Protocol Remote Code Execution Vulnerability",
    "published": "2024-06-11T17:15:54.110",
    "keywords": "remote,execution"
  },
  "CVE-2024-30075": {
    "cvss": 8.0,
    "description": "Windows Link Layer Topology Discovery Protocol Remote Code Execution Vulnerability",
    "published": "2024-06-11T17:15:54.307",
    "keywords": "remote,execution"
  },
  "CVE-2024-30077": {
    "cvss": 8.0,
    "description": "Windows OLE Remote Code Execution Vulnerability",
    "published": "2024-06-11T17:15:54.737",
    "keywords": "remote,execution"
  },
  "CVE-2024-30078": {
    "cvss": 8.8,
    "description": "Windows Wi-Fi Driver Remote Code Execution Vulnerability",
    "published": "2024-06-11T17:15:54.977",
    "keywords": "remote,execution"
  },
  "CVE-2024-30080": {
    "cvss": 9.8,
    "description": "Microsoft Message Queuing (MSMQ) Remote Code Execution Vulnerability",
    "published": "2024-06-11T17:15:55.207",
    "keywords": "remote,execution"
  },
  "CVE-2024-30094": {
    "cvss": 7.8,
    "description": "Windows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability",
    "published": "2024-06-11T17:15:57.917",
    "keywords": "remote,execution"
  },
  "CVE-2024-30095": {
    "cvss": 7.8,
    "description": "Windows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability",
    "published": "2024-06-11T17:15:58.150",
    "keywords": "remote,execution"
  },
  "CVE-2024-30097": {
    "cvss": 8.8,
    "description": "Microsoft Speech Application Programming Interface (SAPI) Remote Code Execution Vulnerability",
    "published": "2024-06-11T17:15:58.700",
    "keywords": "remote,execution"
  },
  "CVE-2024-30100": {
    "cvss": 7.8,
    "description": "Microsoft SharePoint Server Remote Code Execution Vulnerability",
    "published": "2024-06-11T17:15:59.140",
    "keywords": "remote,execution"
  },
  "CVE-2024-30101": {
    "cvss": 7.5,
    "description": "Microsoft Office Remote Code Execution Vulnerability",
    "published": "2024-06-11T17:15:59.353",
    "keywords": "remote,execution"
  },
  "CVE-2024-30102": {
    "cvss": 7.3,
    "description": "Microsoft Office Remote Code Execution Vulnerability",
    "published": "2024-06-11T17:15:59.560",
    "keywords": "remote,execution"
  },
  "CVE-2024-30103": {
    "cvss": 8.8,
    "description": "Microsoft Outlook Remote Code Execution Vulnerability",
    "published": "2024-06-11T17:15:59.800",
    "keywords": "remote,execution"
  },
  "CVE-2024-30104": {
    "cvss": 7.8,
    "description": "Microsoft Office Remote Code Execution Vulnerability",
    "published": "2024-06-11T17:16:00.030",
    "keywords": "remote,execution"
  },
  "CVE-2024-35249": {
    "cvss": 8.8,
    "description": "Microsoft Dynamics 365 Business Central Remote Code Execution Vulnerability",
    "published": "2024-06-11T17:16:02.417",
    "keywords": "remote,execution"
  },
  "CVE-2024-5851": {
    "url": "https://github.com/playsms/playsms/commit/7a88920f6b536c6a91512e739bcb4e8adefeed2b",
    "cvss": 3.5,
    "description": "A vulnerability classified as problematic has been found in playSMS up to 1.4.7. Affected is an unknown function of the file /index.php?app=main&inc=feature_schedule&op=list of the component SMS Schedule Handler. The manipulation of the argument name/message leads to basic cross site scripting. It is possible to launch the attack remotely. Upgrading to version 1.4.8 is able to address this issue. The name of the patch is 7a88920f6b536c6a91512e739bcb4e8adefeed2b. It is recommended to upgrade the affected component. The identifier of this vulnerability is VDB-267912. NOTE: The code maintainer was contacted early about this disclosure and was eager to prepare a fix as quickly as possible.",
    "published": "2024-06-11T18:15:14.437"
  },
  "CVE-2024-36702": {
    "url": "https://github.com/mz-automation/libiec61850/issues/505",
    "cvss": "-",
    "description": "libiec61850 v1.5 was discovered to contain a heap overflow via the BerEncoder_encodeLength function at /asn1/ber_encoder.c.",
    "published": "2024-06-11T19:16:07.697"
  },
  "CVE-2024-37301": {
    "cvss": 9.9,
    "description": "Document Merge Service is a document template merge service providing an API to manage templates and merge them with given data. Versions 6.5.1 and prior are vulnerable to remote code execution via server-side template injection which, when executed as root, can result in full takeover of the affected system. As of time of publication, no patched version exists, nor have any known workarounds been disclosed.",
    "published": "2024-06-11T19:16:07.890",
    "keywords": "remote,execution"
  },
  "CVE-2024-5840": {
    "cvss": "-",
    "description": "Policy bypass in CORS in Google Chrome prior to 126.0.6478.54 allowed a remote attacker to bypass discretionary access control via a crafted HTML page. (Chromium security severity: Medium)",
    "published": "2024-06-11T21:15:54.933",
    "keywords": "remote,bypass"
  },
  "CVE-2024-4315": {
    "url": "https://github.com/parisneo/lollms/commit/95ad36eeffc6a6be3e3f35ed35a384d768f0ecf6",
    "cvss": 9.1,
    "description": "parisneo/lollms version 9.5 is vulnerable to Local File Inclusion (LFI) attacks due to insufficient path sanitization. The `sanitize_path_from_endpoint` function fails to properly sanitize Windows-style paths (backward slash `\\`), allowing attackers to perform directory traversal attacks on Windows systems. This vulnerability can be exploited through various routes, including `personalities` and `/del_preset`, to read or delete any file on the Windows filesystem, compromising the system's availability.",
    "published": "2024-06-12T01:15:49.490"
  },
  "CVE-2024-5211": {
    "url": "https://github.com/mintplex-labs/anything-llm/commit/e208074ef4c240fe03e4147ab097ec3b52b97619",
    "cvss": 9.1,
    "description": "A path traversal vulnerability in mintplex-labs/anything-llm allowed a manager to bypass the `normalizePath()` function, intended to defend against path traversal attacks. This vulnerability enables the manager to read, delete, or overwrite the 'anythingllm.db' database file and other files stored in the 'storage' directory, such as internal communication keys and .env secrets. Exploitation of this vulnerability could lead to application compromise, denial of service (DoS) attacks, and unauthorized admin account takeover. The issue stems from improper validation of user-supplied input in the process of setting a custom logo for the app, which can be manipulated to achieve arbitrary file read, deletion, or overwrite, and to execute a DoS attack by deleting critical files required for the application's operation.",
    "published": "2024-06-12T12:15:10.520"
  },
  "CVE-2024-1577": {
    "cvss": "-",
    "description": "Remote Code Execution vulnerability in MegaBIP software allows to execute arbitrary code on the server without requiring authentication by saving crafted by the attacker PHP code to one of the website files. This issue affects all versions of MegaBIP software.",
    "published": "2024-06-12T14:15:10.683",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2024-36263": {
    "url": "https://github.com/apache/submarine/pull/1121",
    "cvss": "-",
    "description": "** UNSUPPORTED WHEN ASSIGNED ** Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection') vulnerability in Apache Submarine Server Core.\n\nThis issue affects Apache Submarine Server Core: all versions.\n\nAs this project is retired, we do not plan to release a version that fixes this issue. Users are recommended to find an alternative or restrict access to the instance to trusted users.\n\nNOTE: This vulnerability only affects products that are no longer supported by the maintainer.\n\n",
    "published": "2024-06-12T14:15:11.740"
  },
  "CVE-2024-36264": {
    "url": "https://github.com/apache/submarine/pull/1125",
    "cvss": "-",
    "description": "** UNSUPPORTED WHEN ASSIGNED ** Improper Authentication vulnerability in Apache Submarine Commons Utils.\n\nThis issue affects Apache Submarine Commons Utils: from 0.8.0.\n\nAs this project is retired, we do not plan to release a version that fixes this issue. Users are recommended to find an alternative or restrict access to the instance to trusted users.\n\nNOTE: This vulnerability only affects products that are no longer supported by the maintainer.\n\n",
    "published": "2024-06-12T14:15:11.983"
  },
  "CVE-2024-28964": {
    "cvss": 7.8,
    "description": "Dell Common Event Enabler, version 8.9.10.0 and prior, contain an insecure deserialization vulnerability in CAVATools. A local unauthenticated attacker could potentially exploit this vulnerability, leading to arbitrary code execution in the context of the logged in user. Exploitation of this issue requires a victim to open a malicious file.",
    "published": "2024-06-12T15:15:50.647",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-34065": {
    "cvss": 7.1,
    "description": "Strapi is an open-source content management system. By combining two vulnerabilities (an `Open Redirect` and `session token sent as URL query parameter`) in @strapi/plugin-users-permissions before version 4.24.2, is its possible of an unauthenticated attacker to bypass authentication mechanisms and retrieve the 3rd party tokens. The attack requires user interaction (one click). Unauthenticated attackers can leverage two vulnerabilities to obtain an 3rd party token and the bypass authentication of Strapi apps. Users should upgrade @strapi/plugin-users-permissions to version 4.24.2 to receive a patch.",
    "published": "2024-06-12T15:15:51.460",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-36840": {
    "cvss": "-",
    "description": "SQL Injection vulnerability in Boelter Blue System Management v.1.3 allows a remote attacker to execute arbitrary code and obtain sensitive information via the id parameter to news_details.php and location_details.php; and the section parameter to services.php.",
    "published": "2024-06-12T15:15:52.493",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-37297": {
    "url": "https://github.com/woocommerce/woocommerce/commit/915e32a42762916b745a7e663c8b69a698da8b67",
    "cvss": 5.4,
    "description": "WooCommerce is an open-source e-commerce platform built on WordPress. A vulnerability introduced in WooCommerce 8.8 allows for cross-site scripting. A bad actor can manipulate a link to include malicious HTML & JavaScript content. While the content is not saved to the database, the links may be sent to victims for malicious purposes. The injected JavaScript could hijack content & data stored in the browser, including the session. The URL content is read through the `Sourcebuster.js` library and then inserted without proper sanitization to the classic checkout and registration forms. Versions 8.8.5 and 8.9.3 contain a patch for the issue. As a workaround, one may disable the Order Attribution feature.",
    "published": "2024-06-12T15:15:52.677"
  },
  "CVE-2024-36761": {
    "url": "https://github.com/gfx-rs/naga/issues/2591",
    "cvss": "-",
    "description": "naga v0.14.0 was discovered to contain a stack overflow via the component /wgsl/parse/mod.rs.",
    "published": "2024-06-12T16:15:11.983"
  },
  "CVE-2024-37036": {
    "cvss": 9.8,
    "description": "CWE-787: Out-of-bounds Write vulnerability exists that could result in an authentication bypass\nwhen sending a malformed POST request and particular configuration parameters are set.",
    "published": "2024-06-12T17:15:50.637",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-37629": {
    "url": "https://github.com/summernote/summernote/issues/4642",
    "cvss": "-",
    "description": "SummerNote 0.8.18 is vulnerable to Cross Site Scripting (XSS) via the Code View Function.",
    "published": "2024-06-12T18:15:12.293"
  }
}