{
  "CVE-2024-3969": {
    "cvss": 7.8,
    "description": "XML External Entity injection vulnerability found in OpenText™ iManager 3.2.6.0200. This could lead to remote code execution by parsing untrusted XML payload\n\n",
    "published": "2024-05-28T15:15:09.953",
    "keywords": "remote,execution"
  },
  "CVE-2024-22187": {
    "cvss": 9.1,
    "description": "A write-what-where vulnerability exists in the Programming Software Connection Remote Memory Diagnostics functionality of AutomationDirect P3-550E 1.2.10.9. A specially crafted network packet can lead to an arbitrary write. An attacker can send an unauthenticated packet to trigger this vulnerability.",
    "published": "2024-05-28T16:15:12.330",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-23315": {
    "cvss": 7.5,
    "description": "A read-what-where vulnerability exists in the Programming Software Connection IMM 01A1 Memory Read functionality of AutomationDirect P3-550E 1.2.10.9. A specially crafted network packet can lead to a disclosure of sensitive information. An attacker can send an unauthenticated packet to trigger this vulnerability.",
    "published": "2024-05-28T16:15:12.663",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-30164": {
    "cvss": "-",
    "description": "Amazon AWS Client VPN has a buffer overflow that could potentially allow a local actor to execute arbitrary commands with elevated permissions. This is resolved in 3.11.1 on Windows, 3.9.1 on macOS, and 3.12.1 on Linux. NOTE: although the macOS resolution is the same as for CVE-2024-30165, this vulnerability on macOS is not the same as CVE-2024-30165.",
    "published": "2024-05-28T17:15:10.160",
    "keywords": "command,vpn"
  },
  "CVE-2024-30165": {
    "cvss": "-",
    "description": "Amazon AWS Client VPN before 3.9.1 on macOS has a buffer overflow that could potentially allow a local actor to execute arbitrary commands with elevated permissions, a different vulnerability than CVE-2024-30164.",
    "published": "2024-05-28T17:15:10.237",
    "keywords": "command,vpn"
  },
  "CVE-2024-34852": {
    "cvss": "-",
    "description": "F-logic DataCube3 v1.0 is affected by command injection due to improper string filtering at the command execution point in the ./admin/transceiver_schedule.php file. An unauthenticated remote attacker can exploit this vulnerability by sending a file name containing command injection. Successful exploitation of this vulnerability may allow the attacker to execute system commands.",
    "published": "2024-05-28T17:15:10.303",
    "keywords": "remote,execution,unauthenticated,command"
  },
  "CVE-2024-24919": {
    "cvss": 8.6,
    "description": "Potentially allowing an attacker to read certain information on Check Point Security Gateways once connected to the internet and enabled with remote Access VPN or Mobile Access Software Blades. A Security fix that mitigates this vulnerability is available.",
    "published": "2024-05-28T19:15:10.060",
    "keywords": "remote,vpn"
  },
  "CVE-2024-33450": {
    "cvss": "-",
    "description": "SQL Injection in Finereport v.8.0 allows a remote attacker to obtain sensitive information",
    "published": "2024-05-28T19:15:10.530",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-36109": {
    "url": "https://github.com/sagemathinc/cocalc/commit/419862a9c9879c",
    "cvss": 7.6,
    "description": "CoCalc is web-based software that enables collaboration in research, teaching, and scientific publishing. In affected versions the markdown parser allows `<script>` tags to be included which execute when published. This issue has been addressed in commit `419862a9c9879c`. Users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-05-28T19:15:10.910"
  },
  "CVE-2024-5433": {
    "cvss": "-",
    "description": "The Campbell Scientific CSI Web Server supports a command that will return the most recent file that matches a given expression. A specially crafted expression can lead to a path traversal vulnerability. This command combined with a specially crafted expression allows anonymous, unauthenticated access (allowed by default) by an attacker to files and directories outside of the webserver root directory they should be restricted to.",
    "published": "2024-05-28T19:15:11.500",
    "keywords": "unauthenticated,command"
  },
  "CVE-2024-5434": {
    "cvss": "-",
    "description": "The Campbell Scientific CSI Web Server stores web authentication credentials in a file with a specific file name. Passwords within that file are stored in a weakly encoded format. There is no known way to remotely access the file unless it has been manually renamed. However, if an attacker were to gain access to the file, passwords could be decoded and reused to gain access.",
    "published": "2024-05-28T19:15:11.623",
    "keywords": "remote,authentication"
  },
  "CVE-2024-35548": {
    "url": "https://github.com/baomidou/mybatis-plus/issues/6167",
    "cvss": "-",
    "description": "A SQL injection vulnerability in Mybatis plus versions below 3.5.6 allows remote attackers to obtain database information via a Boolean blind injection. NOTE: the vendor's position is that this can only occur in a misconfigured application; the documentation discusses how to develop applications that avoid SQL injection.",
    "published": "2024-05-28T21:16:31.680"
  },
  "CVE-2024-5150": {
    "cvss": 9.8,
    "description": "The Login with phone number plugin for WordPress is vulnerable to authentication bypass in versions up to, and including, 1.7.26. This is due to the 'activation_code' default value is empty, and the not empty check is missing in the 'lwp_ajax_register' function. This makes it possible for unauthenticated attackers to log in as any existing user on the site, such as an administrator, if they have access to the user email. The vulnerability is patched in version 1.7.26, but there is an issue in the patch that causes the entire function to not work, and this issue is fixed in version 1.7.27.",
    "published": "2024-05-29T02:16:32.303",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-5204": {
    "cvss": 8.8,
    "description": "The Swiss Toolkit For WP plugin for WordPress is vulnerable to authentication bypass in versions up to, and including, 1.0.7. This is due to the plugin storing custom data in post metadata without an underscore prefix. This makes it possible for authenticated attackers with contributor-level and above permissions to log in as any existing user on the site, such as an administrator.",
    "published": "2024-05-29T02:16:32.570",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-3412": {
    "cvss": 9.1,
    "description": "The WP STAGING WordPress Backup Plugin – Migration Backup Restore plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the wpstg_processing AJAX action in all versions up to, and including, 3.4.3. This makes it possible for authenticated attackers, with administrator-level access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-05-29T09:15:09.103",
    "keywords": "remote,execution"
  },
  "CVE-2024-36470": {
    "cvss": 8.1,
    "description": "In JetBrains TeamCity before 2022.04.7, 2022.10.6, 2023.05.6, 2023.11.5 authentication bypass was possible in specific edge cases",
    "published": "2024-05-29T14:15:25.993",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-4358": {
    "cvss": 9.8,
    "description": "In Progress Telerik Report Server, version 2024 Q1 (10.0.24.305) or earlier, on IIS, an unauthenticated attacker can gain access to Telerik Report Server restricted functionality via an authentication bypass vulnerability.",
    "published": "2024-05-29T15:16:06.477",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-36114": {
    "cvss": 8.6,
    "description": "Aircompressor is a library with ports of the Snappy, LZO, LZ4, and Zstandard compression algorithms to Java. All decompressor implementations of Aircompressor (LZ4, LZO, Snappy, Zstandard) can crash the JVM for certain input, and in some cases also leak the content of other memory of the Java process (which could contain sensitive information). When decompressing certain data, the decompressors try to access memory outside the bounds of the given byte arrays or byte buffers. Because Aircompressor uses the JDK class `sun.misc.Unsafe` to speed up memory access, no additional bounds checks are performed and this has similar security consequences as out-of-bounds access in C or C++, namely it can lead to non-deterministic behavior or crash the JVM. Users should update to Aircompressor 0.27 or newer where these issues have been fixed. When decompressing data from untrusted users, this can be exploited for a denial-of-service attack by crashing the JVM, or to leak other sensitive information from the Java process. There are no known workarounds for this issue.",
    "published": "2024-05-29T21:15:49.237",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-5514": {
    "cvss": 9.8,
    "description": "MinMax CMS from MinMax Digital Technology contains a hidden administrator account with a fixed password that cannot be removed or disabled from the management interface. Remote attackers who obtain this account can bypass IP access control restrictions and log in to the backend system without being recorded in the system logs.",
    "published": "2024-05-30T03:15:08.467",
    "keywords": "remote,bypass"
  },
  "CVE-2024-3584": {
    "url": "https://github.com/qdrant/qdrant/commit/15479a45ffa3b955485ae516696f7e933a8cce8a",
    "cvss": 9.8,
    "description": "qdrant/qdrant version 1.9.0-dev is vulnerable to path traversal due to improper input validation in the `/collections/{name}/snapshots/upload` endpoint. By manipulating the `name` parameter through URL encoding, an attacker can upload a file to an arbitrary location on the system, such as `/root/poc.txt`. This vulnerability allows for the writing and overwriting of arbitrary files on the server, potentially leading to a full takeover of the system. The issue is fixed in version 1.9.0.",
    "published": "2024-05-30T13:15:49.947"
  },
  "CVE-2024-36024": {
    "cvss": "-",
    "description": "In the Linux kernel, the following vulnerability has been resolved:\n\ndrm/amd/display: Disable idle reallow as part of command/gpint execution\n\n[Why]\nWorkaroud for a race condition where DMCUB is in the process of\ncommitting to IPS1 during the handshake causing us to miss the\ntransition into IPS2 and touch the INBOX1 RPTR causing a HW hang.\n\n[How]\nDisable the reallow to ensure that we have enough of a gap between entry\nand exit and we're not seeing back-to-back wake_and_executes.",
    "published": "2024-05-30T15:15:49.420",
    "keywords": "execution,command"
  },
  "CVE-2024-3924": {
    "cvss": 4.4,
    "description": "A code injection vulnerability exists in the huggingface/text-generation-inference repository, specifically within the `autodocs.yml` workflow file. The vulnerability arises from the insecure handling of the `github.head_ref` user input, which is used to dynamically construct a command for installing a software package. An attacker can exploit this by forking the repository, creating a branch with a malicious payload as the name, and then opening a pull request to the base repository. Successful exploitation could lead to arbitrary code execution within the context of the GitHub Actions runner. This issue affects versions up to and including v2.0.0 and was fixed in version 2.0.0.",
    "published": "2024-05-30T15:15:49.653",
    "keywords": "execution,command"
  },
  "CVE-2024-3300": {
    "cvss": 9.0,
    "description": "An unsafe .NET object deserialization vulnerability in DELMIA Apriso Release 2019 through Release 2024 could lead to pre-authentication remote code execution.",
    "published": "2024-05-30T16:15:18.837",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2024-3301": {
    "cvss": 8.5,
    "description": "An unsafe .NET object deserialization vulnerability in DELMIA Apriso Release 2019 through Release 2024 could lead to post-authentication remote code execution.",
    "published": "2024-05-30T16:15:19.093",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2024-2420": {
    "cvss": "-",
    "description": "LenelS2 NetBox access control and event monitoring system was discovered to contain Hardcoded Credentials in versions prior to and including 5.6.1 which allows an attacker to bypass authentication requirements.",
    "published": "2024-05-30T18:15:09.070",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-2421": {
    "cvss": "-",
    "description": "LenelS2 NetBox access control and event monitoring system was discovered to contain an unauthenticated RCE in versions prior to and including 5.6.1, which allows an attacker to execute malicious commands with elevated permissions.",
    "published": "2024-05-30T18:15:09.230",
    "keywords": "unauthenticated,command"
  },
  "CVE-2024-37017": {
    "url": "https://github.com/cinecert/asdcplib/issues/138",
    "cvss": "-",
    "description": "asdcplib (aka AS-DCP Lib) 2.13.1 has a heap-based buffer over-read in ASDCP::TimedText::MXFReader::h__Reader::MD_to_TimedText_TDesc in AS_DCP_TimedText.cpp in libasdcp.so.",
    "published": "2024-05-31T00:15:08.890"
  },
  "CVE-2024-32850": {
    "cvss": "-",
    "description": "Improper neutralization of special elements used in a command ('Command Injection') exists in SkyBridge MB-A100/MB-A110 firmware Ver. 4.2.2 and earlier and SkyBridge BASIC MB-A130 firmware Ver. 1.5.5 and earlier. If the remote monitoring and control function is enabled on the product, an attacker with access to the product may execute an arbitrary command or login to the product with the administrator privilege.",
    "published": "2024-05-31T02:15:08.843",
    "keywords": "remote,command"
  },
  "CVE-2024-5345": {
    "cvss": 8.8,
    "description": "The Responsive Owl Carousel for Elementor plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 1.2.0 via the layout parameter. This makes it possible for authenticated attackers, with Contributor-level access and above, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included. The inclusion is limited to PHP files.",
    "published": "2024-05-31T03:15:08.613",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-23692": {
    "cvss": 9.8,
    "description": "Rejetto HTTP File Server, up to and including version 2.3m, is vulnerable to a template injection vulnerability. This vulnerability allows a remote, unauthenticated attacker to execute arbitrary commands on the affected system by sending a specially crafted HTTP request. As of the CVE assignment date, Rejetto HFS 2.3m is no longer supported.",
    "published": "2024-05-31T10:15:09.330",
    "keywords": "remote,unauthenticated,command"
  }
}