{
  "CVE-2024-34361": {
    "cvss": 8.5,
    "description": "Pi-hole is a DNS sinkhole that protects devices from unwanted content without installing any client-side software. A vulnerability in versions prior to 5.18.3 allows an authenticated user to make internal requests to the server via the `gravity_DownloadBlocklistFromUrl()` function. Depending on some circumstances, the vulnerability could lead to remote command execution. Version 5.18.3 contains a patch for this issue.",
    "published": "2024-07-05T19:15:09.610",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-39696": {
    "url": "https://github.com/evmos/evmos/commit/0a620e176617a835ac697eea494afea09185dfaf",
    "cvss": 8.8,
    "description": "Evmos is a decentralized Ethereum Virtual Machine chain on the Cosmos Network. Prior to version 19.0.0, a user can create a vesting account with a 3rd party account (EOA or contract) as funder. Then, this user can create an authorization for the contract.CallerAddress, this is the authorization checked in the code. But the funds are taken from the funder address provided in the message. Consequently, the user can fund a vesting account with a 3rd party account without its permission. The funder address can be any address, so this vulnerability can be used to drain all the accounts in the chain. The issue has been patched in version 19.0.0.",
    "published": "2024-07-05T19:15:10.673"
  },
  "CVE-2024-5753": {
    "cvss": 7.5,
    "description": "vanna-ai/vanna version v0.3.4 is vulnerable to SQL injection in some file-critical functions such as `pg_read_file()`. This vulnerability allows unauthenticated remote users to read arbitrary local files on the victim server, including sensitive files like `/etc/passwd`, by exploiting the exposed SQL queries via a Python Flask API.",
    "published": "2024-07-05T20:15:02.343",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-39182": {
    "cvss": "-",
    "description": "An information disclosure vulnerability in ISPmanager v6.98.0 allows attackers to access sensitive details of the root user's session via an arbitrary command (ISP6-1779).",
    "published": "2024-07-05T23:15:10.137",
    "keywords": "command,sensitive"
  },
  "CVE-2024-5711": {
    "url": "https://github.com/stitionai/devika/commit/6acce21fb08c3d1123ef05df6a33912bf0ee77c2",
    "cvss": 8.1,
    "description": "Cross-site Scripting (XSS) - Stored in GitHub repository stitionai/devika prior to -.",
    "published": "2024-07-08T00:15:01.940"
  },
  "CVE-2024-24974": {
    "cvss": "-",
    "description": "The interactive service in OpenVPN 2.6.9 and earlier allows the OpenVPN service pipe to be accessed remotely, which allows a remote attacker to interact with the privileged OpenVPN interactive service.",
    "published": "2024-07-08T11:15:10.103",
    "keywords": "remote,vpn"
  },
  "CVE-2024-6163": {
    "cvss": 5.3,
    "description": "Certain http endpoints of Checkmk in Checkmk < 2.3.0p10 < 2.2.0p31, < 2.1.0p46, <= 2.0.0p39 allows remote attacker to bypass authentication and access data",
    "published": "2024-07-08T13:15:10.593",
    "keywords": "remote,authentication,bypass"
  },
  "CVE-2024-39742": {
    "cvss": 8.1,
    "description": "IBM MQ Operator 3.2.2 and IBM MQ Operator 2.0.24 could allow a user to bypass authentication under certain configurations due to a partial string comparison vulnerability.  IBM X-Force ID:  297169.",
    "published": "2024-07-08T14:15:02.550",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-23562": {
    "cvss": 5.3,
    "description": "A security vulnerability in HCL Domino could allow disclosure of sensitive configuration information.  A remote unauthenticated attacker could exploit this vulnerability to obtain information to launch further attacks against the affected system.",
    "published": "2024-07-08T16:15:07.797",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-39202": {
    "cvss": "-",
    "description": "D-Link DIR-823X firmware - 240126 was discovered to contain a remote command execution (RCE) vulnerability via the dhcpd_startip parameter at /goform/set_lan_settings.",
    "published": "2024-07-08T16:15:08.490",
    "keywords": "remote,execution,command"
  }
}