{
  "CVE-2024-3366": {
    "url": "https://github.com/xuxueli/xxl-job/issues/3391",
    "cvss": 3.5,
    "description": "A vulnerability classified as problematic was found in Xuxueli xxl-job up to 2.4.1. This vulnerability affects the function deserialize of the file com/xxl/job/core/util/JdkSerializeTool.java of the component Template Handler. The manipulation leads to injection. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-259480.",
    "published": "2024-04-06T11:15:08.740"
  },
  "CVE-2024-25029": {
    "cvss": 9.0,
    "description": "IBM Personal Communications 14.0.6 through 15.0.1 includes a Windows service that is vulnerable to remote code execution (RCE) and local privilege escalation (LPE). The vulnerability allows any unprivileged user with network access to a target computer to run commands with full privileges in the context of NT AUTHORITY\\SYSTEM. This allows for a low privileged attacker to move laterally to affected systems and to escalate their privileges.  IBM X-Force ID:  281619.",
    "published": "2024-04-06T12:15:08.400",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-3376": {
    "cvss": 7.3,
    "description": "A vulnerability classified as critical has been found in SourceCodester Computer Laboratory Management System 1.0. This affects an unknown part of the file config.php. The manipulation of the argument url leads to execution after redirect. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-259497 was assigned to this vulnerability.",
    "published": "2024-04-06T12:15:08.603",
    "keywords": "remote,execution"
  },
  "CVE-2024-27620": {
    "cvss": "-",
    "description": "An issue in Ladder v.0.0.1 thru v.0.0.21 allows a remote attacker to obtain sensitive information via a crafted request to the API.",
    "published": "2024-04-06T19:15:07.183",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-31950": {
    "url": "https://github.com/frrouting/frr/pull/15674/",
    "cvss": "-",
    "description": "In FRRouting (FRR) through 9.1, there can be a buffer overflow and daemon crash in ospf_te_parse_ri for OSPF LSA packets during an attempt to read Segment Routing subTLVs (their size is not validated).",
    "published": "2024-04-07T21:15:07.540"
  },
  "CVE-2024-31951": {
    "url": "https://github.com/frrouting/frr/pull/15674/",
    "cvss": "-",
    "description": "In the Opaque LSA Extended Link parser in FRRouting (FRR) through 9.1, there can be a buffer overflow and daemon crash in ospf_te_parse_ext_link for OSPF LSA packets during an attempt to read Segment Routing Adjacency SID subTLVs (lengths are not validated).",
    "published": "2024-04-07T21:15:07.600"
  },
  "CVE-2024-27488": {
    "cvss": "-",
    "description": "Incorrect Access Control vulnerability in ZLMediaKit versions 1.0 through 8.0, allows remote attackers to escalate privileges and obtain sensitive information. The application system enables the http API interface by default and uses the secret parameter method to authenticate the http restful api interface, but the secret is hardcoded by default.",
    "published": "2024-04-08T06:15:07.533",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-30661": {
    "cvss": "-",
    "description": "An unauthorized access vulnerability has been discovered in ROS Melodic Morenia versions where ROS_VERSION is 1 and ROS_PYTHON_VERSION is 3. This vulnerability could potentially allow a malicious user to gain unauthorized information access to multiple ROS nodes remotely. Unauthorized information access to these nodes could result in compromised system integrity, the execution of arbitrary commands, and disclosure of sensitive information.",
    "published": "2024-04-08T07:15:09.370",
    "keywords": "remote,execution,command,sensitive"
  },
  "CVE-2024-30665": {
    "cvss": "-",
    "description": "An OS command injection vulnerability has been discovered in ROS (Robot Operating System) Melodic Morenia in ROS_VERSION 1 and ROS_PYTHON_VERSION 3. This vulnerability primarily affects the command processing or system call components in ROS, making them susceptible to manipulation by malicious entities. Through this, unauthorized commands can be executed, leading to remote code execution (RCE), data theft, and malicious activities. The affected components include External Command Execution Modules, System Call Handlers, and Interface Scripts.",
    "published": "2024-04-08T07:15:09.643",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-30674": {
    "cvss": "-",
    "description": "Unauthorized access vulnerability in ROS2 Iron Irwini in ROS_VERSION is 2 and ROS_PYTHON_VERSION is 3, allows remote attackers to gain control of multiple ROS2 nodes. Unauthorized information access to these nodes could result in compromised system integrity, the execution of arbitrary commands, and disclosure of sensitive information.",
    "published": "2024-04-08T08:15:11.570",
    "keywords": "remote,execution,command,sensitive"
  },
  "CVE-2024-31807": {
    "cvss": "-",
    "description": "TOTOLINK EX200 V4.0.3c.7646_B20201211 was discovered to contain a remote code execution (RCE) vulnerability via the hostTime parameter in the NTPSyncWithHost function.",
    "published": "2024-04-08T13:15:08.603",
    "keywords": "remote,execution"
  },
  "CVE-2024-31808": {
    "cvss": "-",
    "description": "TOTOLINK EX200 V4.0.3c.7646_B20201211 was discovered to contain a remote code execution (RCE) vulnerability via the webWlanIdx parameter in the setWebWlanIdx function.",
    "published": "2024-04-08T13:15:08.650",
    "keywords": "remote,execution"
  },
  "CVE-2024-31809": {
    "cvss": "-",
    "description": "TOTOLINK EX200 V4.0.3c.7646_B20201211 was discovered to contain a remote code execution (RCE) vulnerability via the FileName parameter in the setUpgradeFW function.",
    "published": "2024-04-08T13:15:08.700",
    "keywords": "remote,execution"
  },
  "CVE-2024-31811": {
    "cvss": "-",
    "description": "TOTOLINK EX200 V4.0.3c.7646_B20201211 was discovered to contain a remote code execution (RCE) vulnerability via the langType parameter in the setLanguageCfg function.",
    "published": "2024-04-08T13:15:08.750",
    "keywords": "remote,execution"
  },
  "CVE-2024-28732": {
    "url": "https://github.com/faucetsdn/ryu/issues/188",
    "cvss": "-",
    "description": "An issue was discovered in OFPMatch in parser.py in Faucet SDN Ryu version 4.34, allows remote attackers to cause a denial of service (DoS) (infinite loop).",
    "published": "2024-04-08T14:15:07.600"
  },
  "CVE-2024-31205": {
    "cvss": 4.2,
    "description": "Saleor is an e-commerce platform. Starting in version 3.10.0 and prior to versions 3.14.64, 3.15.39, 3.16.39, 3.17.35, 3.18.31, and 3.19.19, an attacker may bypass cross-set request forgery (CSRF) validation when calling refresh token mutation with empty string. When a user provides an empty string in `refreshToken` mutation, while the token persists in `JWT_REFRESH_TOKEN_COOKIE_NAME` cookie, application omits validation against CSRF token and returns valid access token. Versions 3.14.64, 3.15.39, 3.16.39, 3.17.35, 3.18.31, and 3.19.19 contain a patch for the issue. As a workaround, one may replace `saleor.graphql.account.mutations.authentication.refresh_token.py.get_refresh_token`. This will fix the issue, but be aware, that it returns `JWT_MISSING_TOKEN` instead of `JWT_INVALID_TOKEN`.\n",
    "published": "2024-04-08T15:15:08.023",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-31224": {
    "cvss": 9.8,
    "description": "GPT Academic provides interactive interfaces for large language models. A vulnerability was found in gpt_academic versions 3.64 through 3.73. The server deserializes untrustworthy data from the client, which may risk remote code execution. Any device that exposes the GPT Academic service to the Internet is vulnerable. Version 3.74 contains a patch for the issue. There are no known workarounds aside from upgrading to a patched version.",
    "published": "2024-04-08T16:15:07.790",
    "keywords": "remote,execution"
  },
  "CVE-2024-31047": {
    "url": "https://github.com/academysoftwarefoundation/openexr/issues/1680",
    "cvss": "-",
    "description": "An issue in Academy Software Foundation openexr v.3.2.3 and before allows a local attacker to cause a denial of service (DoS) via the convert function of exrmultipart.cpp.",
    "published": "2024-04-08T23:15:08.023"
  },
  "CVE-2024-30680": {
    "cvss": "-",
    "description": "Shell injection vulnerability was discovered in ROS2 (Robot Operating System 2) Iron Irwini in versions ROS_VERSION 2 and ROS_PYTHON_VERSION 3, allows attackers to execute arbitrary code escalate privileges, and obtain sensitive information due to the way ROS2 handles shell command execution in components like command interpreters or interfaces that process external inputs.",
    "published": "2024-04-09T04:15:10.583",
    "keywords": "execution,command,sensitive"
  },
  "CVE-2024-30681": {
    "cvss": "-",
    "description": "An OS command injection vulnerability has been discovered in ROS2 Iron Irwini version ROS_VERSION 2 and ROS_PYTHON_VERSION 3, allows attackers to execute arbitrary code, escalate privileges, and obtain sensitive information via the command processing or system call components in ROS2.",
    "published": "2024-04-09T04:15:10.747",
    "keywords": "command,sensitive"
  },
  "CVE-2024-30691": {
    "cvss": "-",
    "description": "An issue was discovered in ROS2 Galactic Geochelone in version ROS_VERSION 2 and ROS_PYTHON_VERSION 3, allows remote attackers to execute arbitrary code, escalate privileges, obtain sensitive information, and gain unauthorized access to multiple ROS2 nodes.",
    "published": "2024-04-09T07:15:08.467",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-30694": {
    "cvss": "-",
    "description": "A shell injection vulnerability was discovered in ROS2 (Robot Operating System 2) Galactic Geochelone ROS_VERSION 2 and ROS_PYTHON_VERSION 3, allows attackers to execute arbitrary code, escalate privileges, and obtain sensitive information due to the way ROS2 handles shell command execution in components like command interpreters or interfaces that process external inputs.",
    "published": "2024-04-09T08:15:07.420",
    "keywords": "execution,command,sensitive"
  },
  "CVE-2024-30696": {
    "cvss": "-",
    "description": "OS command injection vulnerability in ROS2 Galactic Geochelone in ROS_VERSION 2 and ROS_PYTHON_VERSION 3, allows remote attackers to execute arbitrary code, escalate privileges, and obtain sensitive information via the command processing or system call components in ROS2, including External Command Execution Modules, System Call Handlers, and Interface Scripts.",
    "published": "2024-04-09T08:15:07.587",
    "keywords": "remote,execution,command,sensitive"
  }
}