{
  "CVE-2025-64444": {
    "cvss": 7.2,
    "description": "Improper neutralization of special elements used in an OS command ('OS Command Injection') issue exists in NCP-HG100 1.4.48.16 and earlier. If exploited, a remote attacker who has obtained the authentication information to log in to the management page of the product may execute an arbitrary OS command with root privileges.",
    "published": "2025-11-14T06:15:42.877",
    "keywords": "remote,authentication,command"
  },
  "CVE-2025-55070": {
    "cvss": 6.5,
    "description": "Mattermost versions <11 fail to enforce multi-factor authentication on WebSocket connections which allows unauthenticated users to access sensitive information via WebSocket events",
    "published": "2025-11-14T08:15:45.500",
    "keywords": "unauthenticated,authentication,sensitive"
  },
  "CVE-2025-8855": {
    "cvss": 8.1,
    "description": "Authorization Bypass Through User-Controlled Key, Weak Password Recovery Mechanism for Forgotten Password, Authentication Bypass by Assumed-Immutable Data vulnerability in Optimus Software Brokerage Automation allows Exploiting Trust in Client, Authentication Bypass, Manipulate Registry Information.This issue affects Brokerage Automation: before 1.1.71.",
    "published": "2025-11-14T13:15:45.337",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-9982": {
    "cvss": "-",
    "description": "A vulnerability exists in QuickCMS version 6.8 where sensitive admin credentials are hardcoded in a configuration file and stored in plaintext. This flaw allows attackers with access to the source code or the server file system to retrieve authentication details, potentially leading to privilege escalation.\n\nThe vendor was notified early about this vulnerability, but didn't respond with the details of vulnerability or vulnerable version range. Only version 6.8 was tested and confirmed as vulnerable, other versions were not tested and might also be vulnerable.",
    "published": "2025-11-14T14:15:47.113",
    "keywords": "authentication,sensitive"
  },
  "CVE-2025-13204": {
    "url": "https://github.com/silentmatt/expr-eval/pull/252/files",
    "cvss": 7.3,
    "description": "npm package `expr-eval` is vulnerable to Prototype Pollution. An attacker with access to express eval interface can use JavaScript prototype-based inheritance model to achieve arbitrary code execution. The npm expr-eval-fork package resolves this issue.",
    "published": "2025-11-14T17:16:01.603"
  },
  "CVE-2025-13033": {
    "cvss": 7.5,
    "description": "A vulnerability was identified in the email parsing library due to improper handling of specially formatted recipient email addresses. An attacker can exploit this flaw by crafting a recipient address that embeds an external address within quotes. This causes the application to misdirect the email to the attacker's external address instead of the intended internal recipient. This could lead to a significant data leak of sensitive information and allow an attacker to bypass security filters and access controls.",
    "published": "2025-11-14T20:15:45.957",
    "keywords": "sensitive,bypass,leak"
  },
  "CVE-2025-63744": {
    "url": "https://github.com/radareorg/radare2/commit/e37e15d10fd8a19c3e57b3d7735a2cfe0082ec79",
    "cvss": 4.3,
    "description": "A NULL pointer dereference vulnerability was discovered in radare2 6.0.5 and earlier within the load() function of bin_dyldcache.c. Processing a crafted file can cause a segmentation fault and crash the program.",
    "published": "2025-11-14T21:15:44.933"
  },
  "CVE-2025-63745": {
    "url": "https://github.com/radareorg/radare2/commit/6c5df3f8570d4f0c360681c08241ad8af3b919fd",
    "cvss": 5.5,
    "description": "A NULL pointer dereference vulnerability was discovered in radare2 6.0.5 and earlier within the info() function of bin_ne.c. A crafted binary input can trigger a segmentation fault, leading to a denial of service when the tool processes malformed data.",
    "published": "2025-11-14T21:15:45.083"
  },
  "CVE-2025-63891": {
    "cvss": 7.5,
    "description": "Information Disclosure in web-accessible backup file in SourceCodester Simple Online Book Store System allows a remote unauthenticated attacker to disclose full database contents (including schema and credential hashes) via an unauthenticated HTTP GET request to /obs/database/obs_db.sql.",
    "published": "2025-11-14T21:15:45.223",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-64084": {
    "cvss": 5.4,
    "description": "An authenticated SQL injection vulnerability exists in Cloudlog 2.7.5 and earlier. The vucc_details_ajax function in application/controllers/Awards.php does not properly sanitize the user-supplied Gridsquare POST parameter. This allows a remote, authenticated attacker to execute arbitrary SQL commands by injecting a malicious payload, which is then concatenated directly into a raw SQL query in the vucc_qso_details function.",
    "published": "2025-11-14T21:15:45.367",
    "keywords": "remote,command"
  },
  "CVE-2025-13188": {
    "cvss": 9.8,
    "description": "A vulnerability was detected in D-Link DIR-816L 2_06_b09_beta. Affected by this vulnerability is the function authenticationcgi_main of the file /authentication.cgi. Performing manipulation of the argument Password results in stack-based buffer overflow. Remote exploitation of the attack is possible. The exploit is now public and may be used. This vulnerability only affects products that are no longer supported by the maintainer.",
    "published": "2025-11-14T23:15:43.843",
    "keywords": "remote,authentication"
  },
  "CVE-2025-58083": {
    "cvss": 10.0,
    "description": "General Industrial Controls Lynx+ Gateway \n is missing critical authentication in the embedded web server which could allow an attacker to remotely reset the device.",
    "published": "2025-11-15T00:15:47.087",
    "keywords": "remote,authentication"
  },
  "CVE-2025-59780": {
    "cvss": 7.5,
    "description": "General Industrial Controls Lynx+ Gateway is missing critical authentication in the embedded web server which \ncould allow an attacker to send GET requests to obtain sensitive device \ninformation.",
    "published": "2025-11-15T00:15:47.313",
    "keywords": "authentication,sensitive"
  },
  "CVE-2025-12849": {
    "cvss": 5.3,
    "description": "The Contest Gallery plugin for WordPress is vulnerable to authorization bypass in all versions up to, and including, 28.0.2. This is due to the plugin registering the `cg_check_wp_admin_upload_v10` AJAX action for both authenticated and unauthenticated users without implementing capability checks or nonce verification. This makes it possible for unauthenticated attackers to inject arbitrary WordPress media attachments into galleries and manipulate gallery metadata via the `cg_check_wp_admin_upload_v10` action. It does not enable an attacker to move or upload files.",
    "published": "2025-11-15T07:15:42.640",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2025-6945": {
    "cvss": 3.5,
    "description": "GitLab has remediated an issue in GitLab EE affecting all versions from 17.8 before 18.3.6, 18.4 before 18.4.4, and 18.5 before 18.5.2 that could have allowed an authenticated attacker to leak sensitive information from confidential issues by injecting hidden prompts into merge request comments.",
    "published": "2025-11-15T08:15:46.280",
    "keywords": "sensitive,leak"
  },
  "CVE-2025-12482": {
    "cvss": 7.5,
    "description": "The Booking for Appointments and Events Calendar – Amelia plugin for WordPress is vulnerable to SQL Injection via the ‘search’ parameter in all versions up to, and including, 1.2.35 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2025-11-16T05:15:59.280",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-13246": {
    "cvss": 6.3,
    "description": "A vulnerability was identified in shsuishang ShopSuite ModulithShop up to 45a99398cec3b7ad7ff9383694f0b53339f2d35a. Impacted is the function JwtAuthenticationFilter of the file src/main/java/com/suisung/shopsuite/common/security/JwtAuthenticationFilter.java. The manipulation leads to path traversal. It is possible to initiate the attack remotely. The exploit is publicly available and might be used. This product is using a rolling release to provide continious delivery. Therefore, no version details for affected nor updated releases are available.",
    "published": "2025-11-16T10:15:54.827",
    "keywords": "remote,authentication"
  },
  "CVE-2025-13252": {
    "url": "https://github.com/shsuishang/modulithshop/issues/2#issue-3580272472",
    "cvss": 7.3,
    "description": "A vulnerability was found in shsuishang ShopSuite ModulithShop up to 45a99398cec3b7ad7ff9383694f0b53339f2d35a. Affected by this issue is some unknown functionality of the component RSA/OAuth2/Database. The manipulation results in hard-coded credentials. The attack can be executed remotely. The exploit has been made public and could be used. This product implements a rolling release for ongoing delivery, which means version information for affected or updated releases is unavailable.",
    "published": "2025-11-16T23:15:43.173"
  },
  "CVE-2025-10460": {
    "cvss": "-",
    "description": "A SQL Injection vulnerability on an endpoint in BEIMS Contractor Web, a legacy product that is no longer maintained or patched by the vendor, allows an unauthorised user to retrieve sensitive database contents via unsanitized parameter input. This vulnerability occurs due to improper input validation on /BEIMSWeb/contractor.asp endpoint and successful exploitation requires a contractor.asp endpoint open to the internet. This vulnerability allows attackers to execute arbitrary SQL commands, compromising the confidentiality, integrity and potentially the availability of the database. \n\n\n\n\n\nVersion 5.7.139\n\n has been confirmed as vulnerable. Other versions have not been confirmed by the vendor and users should assume that all versions of BEIMS Contractor Web may be impacted until further guidance is provided by the vendor.",
    "published": "2025-11-17T03:15:55.170",
    "keywords": "command,sensitive"
  },
  "CVE-2025-13261": {
    "url": "https://github.com/lsfusion/platform/issues/1543#issue-3576922131",
    "cvss": 5.3,
    "description": "A vulnerability was found in lsfusion platform up to 6.1. Affected is the function DownloadFileRequestHandler of the file web-client/src/main/java/lsfusion/http/controller/file/DownloadFileRequestHandler.java. Performing manipulation of the argument Version results in path traversal. Remote exploitation of the attack is possible. The exploit has been made public and could be used.",
    "published": "2025-11-17T04:15:54.303"
  },
  "CVE-2025-13282": {
    "cvss": 8.1,
    "description": "TenderDocTransfer developed by Chunghwa Telecom has a Arbitrary File Delete vulnerability. The application sets up a simple local web server and provides APIs for communication with the target website. Due to the lack of CSRF protection in the APIs, unauthenticated remote attackers could use these APIs through phishing. Additionally, one of the APIs contains an Absolute Path Traversal vulnerability, allowing attackers to delete arbitrary files on the user's system.",
    "published": "2025-11-17T04:15:54.543",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-13283": {
    "cvss": 7.1,
    "description": "TenderDocTransfer developed by Chunghwa Telecom has a Arbitrary File Copy and Paste vulnerability.  The application sets up a simple local web server and provides APIs for communication with the target website. Due to the lack of CSRF protection in the APIs, unauthenticated remote attackers could use these APIs through phishing. Additionally, one of the APIs contains an Absolute Path Traversal vulnerability. Attackers can copy arbitrary files on the user's system and paste them into any path, which poses a potential risk of information leakage or could consume hard drive space by copying files in large volumes.",
    "published": "2025-11-17T04:15:54.800",
    "keywords": "remote,unauthenticated,leak"
  },
  "CVE-2025-13284": {
    "cvss": 9.8,
    "description": "ThinPLUS developed by ThinPLUS has an OS Command Injection vulnerability, allowing unauthenticated remote attackers to inject arbitrary OS commands and execute them on the server.",
    "published": "2025-11-17T04:15:55.020",
    "keywords": "remote,unauthenticated,command"
  }
}