{
  "CVE-2024-30302": {
    "cvss": 5.5,
    "description": "Acrobat Reader versions 20.005.30539, 23.008.20470 and earlier are affected by a Use After Free vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-05-02T21:16:11.747",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-34408": {
    "url": "https://github.com/tencent/libpag/pull/2243",
    "cvss": "-",
    "description": "Tencent libpag through 4.3.51 has an integer overflow in DecodeStream::checkEndOfFile() in codec/utils/DecodeStream.cpp via a crafted PAG (Portable Animated Graphics) file.",
    "published": "2024-05-03T06:15:13.883"
  },
  "CVE-2024-34063": {
    "url": "https://github.com/matrix-org/vodozemac/commit/297548cad4016ce448c4b5007c54db7ee39489d9",
    "cvss": 2.5,
    "description": "vodozemac is an implementation of Olm and Megolm in pure Rust. Versions 0.5.0 and 0.5.1 of vodozemac have degraded secret zeroization capabilities, due to changes in third-party cryptographic dependencies (the Dalek crates), which moved secret zeroization capabilities behind a feature flag and defaulted this feature to off. The degraded zeroization capabilities could result in the production of more memory copies of encryption secrets and secrets could linger in memory longer than necessary. This marginally increases the risk of sensitive data exposure. This issue has been addressed in version 0.6.0 and users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-05-03T10:15:08.690"
  },
  "CVE-2024-34072": {
    "cvss": 7.8,
    "description": "sagemaker-python-sdk is a library for training and deploying machine learning models on Amazon SageMaker. The sagemaker.base_deserializers.NumpyDeserializer module before v2.218.0 allows potentially unsafe deserialization when untrusted data is passed as pickled object arrays. This consequently may allow an unprivileged third party to cause remote code execution, denial of service, affecting both confidentiality and integrity. Users are advised to upgrade to version 2.218.0. Users unable to upgrade should not pass pickled numpy object arrays which originated from an untrusted source, or that could have been tampered with. Only pass pickled numpy object arrays from trusted sources.",
    "published": "2024-05-03T11:15:22.260",
    "keywords": "remote,execution"
  },
  "CVE-2024-34073": {
    "cvss": 7.8,
    "description": "sagemaker-python-sdk is a library for training and deploying machine learning models on Amazon SageMaker. In affected versions the capture_dependencies function in `sagemaker.serve.save_retrive.version_1_0_0.save.utils` module allows for potentially unsafe Operating System (OS) Command Injection if inappropriate command is passed as the “requirements_path” parameter. This consequently may allow an unprivileged third party to cause remote code execution, denial of service, affecting both confidentiality and integrity. This issue has been addressed in version 2.214.3. Users are advised to upgrade. Users unable to upgrade should not override the “requirements_path” parameter of capture_dependencies function in `sagemaker.serve.save_retrive.version_1_0_0.save.utils`, and instead use the default value.",
    "published": "2024-05-03T11:15:22.447",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-34446": {
    "cvss": "-",
    "description": "Mullvad VPN through 2024.1 on Android does not set a DNS server in the blocking state (after a hard failure to create a tunnel), and thus DNS traffic can leave the device. Data showing that the affected device was the origin of sensitive DNS requests may be observed and logged by operators of unintended DNS servers.",
    "published": "2024-05-03T15:15:08.210",
    "keywords": "sensitive,vpn"
  },
  "CVE-2024-34449": {
    "url": "https://github.com/vanessa219/vditor/issues/1604",
    "cvss": "-",
    "description": "Vditor 3.10.3 allows XSS via an attribute of an A element. NOTE: the vendor indicates that a user is supposed to mitigate this via sanitize=true.",
    "published": "2024-05-03T16:15:11.520"
  },
  "CVE-2024-31636": {
    "url": "https://github.com/lief-project/lief/issues/1038",
    "cvss": "-",
    "description": "An issue in LIEF v.0.14.1 allows a local attacker to obtain sensitive information via the name parameter of the machd_reader.c component.",
    "published": "2024-05-03T17:15:07.687"
  },
  "CVE-2024-31673": {
    "url": "https://github.com/kliqqi-cms/kliqqi-cms/issues/265",
    "cvss": "-",
    "description": "Kliqqi-CMS 2.0.2 is vulnerable to SQL Injection in load_data.php via the userid parameter.",
    "published": "2024-05-03T18:15:09.310"
  },
  "CVE-2024-34068": {
    "cvss": 6.4,
    "description": "Pterodactyl wings is the server control plane for Pterodactyl Panel. An authenticated user who has access to a game server is able to bypass the previously implemented access control (GHSA-6rg3-8h8x-5xfv) that prevents accessing internal endpoints of the node hosting Wings in the pull endpoint. This would allow malicious users to potentially access resources on local networks that would otherwise be inaccessible. This issue has been addressed in version 1.11.2 and users are advised to upgrade. Users unable to upgrade may enable the `api.disable_remote_download` option as a workaround. ",
    "published": "2024-05-03T18:15:09.773",
    "keywords": "remote,bypass"
  },
  "CVE-2024-34453": {
    "url": "https://github.com/tznb1/twonav/issues/9#issuecomment-2022194939",
    "cvss": "-",
    "description": "TwoNav 2.1.13 contains an SSRF vulnerability via the url paramater to index.php?c=api&method=read_data&type=connectivity_test (which reaches /system/api.php).",
    "published": "2024-05-03T18:15:10.160"
  },
  "CVE-2024-34455": {
    "url": "https://github.com/buildroot/buildroot/commit/0b2967e15800421efbdfe3a7a6061cf6bd84134d",
    "cvss": "-",
    "description": "Buildroot before 0b2967e lacks the sticky bit for the /dev/shm directory.",
    "published": "2024-05-03T19:15:07.950"
  },
  "CVE-2024-34462": {
    "url": "https://github.com/alinto/sogo/commit/2e37e59ed140d4aee0ff2fba579ca5f83f2c5920",
    "cvss": "-",
    "description": "Alinto SOGo through 5.10.0 allows XSS during attachment preview.",
    "published": "2024-05-04T19:15:46.510"
  },
  "CVE-2024-34467": {
    "url": "https://github.com/top-think/framework/issues/2996",
    "cvss": "-",
    "description": "ThinkPHP 8.0.3 allows remote attackers to discover the PHPSESSION cookie because think_exception.tpl (aka the debug error output source code) provides this in an error message for a crafted URI in a GET request.",
    "published": "2024-05-04T20:15:07.527"
  },
  "CVE-2024-34483": {
    "url": "https://github.com/faucetsdn/ryu/issues/193",
    "cvss": "-",
    "description": "OFPGroupDescStats in parser.py in Faucet SDN Ryu 4.34 allows attackers to cause a denial of service (infinite loop) via OFPBucket.len=0.",
    "published": "2024-05-05T02:15:06.613"
  },
  "CVE-2024-34484": {
    "url": "https://github.com/faucetsdn/ryu/issues/194",
    "cvss": "-",
    "description": "OFPBucket in parser.py in Faucet SDN Ryu 4.34 allows attackers to cause a denial of service (infinite loop) via action.len=0.",
    "published": "2024-05-05T02:15:07.187"
  },
  "CVE-2024-34486": {
    "url": "https://github.com/faucetsdn/ryu/issues/190",
    "cvss": "-",
    "description": "OFPPacketQueue in parser.py in Faucet SDN Ryu 4.34 allows attackers to cause a denial of service (infinite loop) via OFPQueueProp.len=0.",
    "published": "2024-05-05T03:15:07.120"
  },
  "CVE-2024-34487": {
    "url": "https://github.com/faucetsdn/ryu/issues/192",
    "cvss": "-",
    "description": "OFPFlowStats in parser.py in Faucet SDN Ryu 4.34 allows attackers to cause a denial of service (infinite loop) via inst.length=0.",
    "published": "2024-05-05T03:15:07.167"
  },
  "CVE-2024-34488": {
    "url": "https://github.com/faucetsdn/ryu/issues/191",
    "cvss": "-",
    "description": "OFPMultipartReply in parser.py in Faucet SDN Ryu 4.34 allows attackers to cause a denial of service (infinite loop) via b.length=0.",
    "published": "2024-05-05T03:15:07.207"
  },
  "CVE-2024-34489": {
    "url": "https://github.com/faucetsdn/ryu/issues/195",
    "cvss": "-",
    "description": "OFPHello in parser.py in Faucet SDN Ryu 4.34 allows attackers to cause a denial of service (infinite loop) via length=0.",
    "published": "2024-05-05T03:15:07.250"
  },
  "CVE-2024-4497": {
    "cvss": 8.8,
    "description": "A vulnerability was found in Tenda i21 1.0.0.14(4656). It has been declared as critical. This vulnerability affects the function formexeCommand. The manipulation of the argument cmdinput leads to stack-based buffer overflow. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. VDB-263086 is the identifier assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-05-05T07:15:06.463",
    "keywords": "remote,command"
  },
  "CVE-2024-4501": {
    "cvss": 4.7,
    "description": "A vulnerability was found in Ruijie RG-UAC up to 20240428. It has been rated as critical. This issue affects some unknown processing of the file /view/bugSolve/captureData/commit.php. The manipulation of the argument tcpDump leads to os command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-263105 was assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-05-05T20:15:07.923",
    "keywords": "remote,command"
  }
}