{
  "CVE-2026-0581": {
    "cvss": 6.3,
    "description": "A vulnerability was determined in Tenda AC1206 15.03.06.23. Affected by this issue is the function formBehaviorManager of the file /goform/BehaviorManager of the component httpd. Executing a manipulation of the argument modulename/option/data/switch can lead to command injection. The attack can be launched remotely. The exploit has been publicly disclosed and may be utilized.",
    "published": "2026-01-05T09:15:54.867",
    "keywords": "remote,command"
  },
  "CVE-2026-0589": {
    "cvss": 7.3,
    "description": "A vulnerability was found in code-projects Online Product Reservation System 1.0. Impacted is an unknown function of the component Administration Backend. The manipulation results in improper authentication. The attack may be performed from remote. The exploit has been made public and could be used.",
    "published": "2026-01-05T13:15:55.457",
    "keywords": "remote,authentication"
  },
  "CVE-2026-0621": {
    "url": "https://github.com/modelcontextprotocol/typescript-sdk/issues/965",
    "cvss": "-",
    "description": "Anthropic's MCP TypeScript SDK versions up to and including 1.25.1 contain a regular expression denial of service (ReDoS) vulnerability in the UriTemplate class when processing RFC 6570 exploded array patterns. The dynamically generated regular expression used during URI matching contains nested quantifiers that can trigger catastrophic backtracking on specially crafted inputs, resulting in excessive CPU consumption. An attacker can exploit this by supplying a malicious URI that causes the Node.js process to become unresponsive, leading to a denial of service.",
    "published": "2026-01-05T21:16:14.533"
  },
  "CVE-2026-0625": {
    "cvss": "-",
    "description": "Multiple D-Link DSL gateway devices contain a command injection vulnerability in the dnscfg.cgi endpoint due to improper sanitization of user-supplied DNS configuration parameters. An unauthenticated remote attacker can inject and execute arbitrary shell commands, resulting in remote code execution. The affected endpoint is also associated with unauthenticated DNS modification (“DNSChanger”) behavior documented by D-Link, which reported active exploitation campaigns targeting firmware variants of the DSL-2740R, DSL-2640B, DSL-2780B, and DSL-526B models from 2016 through 2019. Exploitation evidence was observed by the Shadowserver Foundation on 2025-11-27 (UTC). Affected devices were declared end-of-life/end-of-service in early 2020.",
    "published": "2026-01-05T22:15:54.483",
    "keywords": "remote,execution,unauthenticated,command"
  },
  "CVE-2026-21411": {
    "cvss": 8.8,
    "description": "Authentication bypass issue exists in OpenBlocks series versions prior to FW5.0.8, which may allow an attacker to bypass administrator authentication and change the password.",
    "published": "2026-01-06T07:15:43.870",
    "keywords": "authentication,bypass"
  },
  "CVE-2026-0641": {
    "cvss": 6.3,
    "description": "A security vulnerability has been detected in TOTOLINK WA300 5.2cu.7112_B20190227. This vulnerability affects the function sub_401510 of the file cstecgi.cgi. The manipulation of the argument UPLOAD_FILENAME leads to command injection. The attack may be initiated remotely. The exploit has been disclosed publicly and may be used.",
    "published": "2026-01-06T19:16:07.573",
    "keywords": "remote,command"
  }
}