{
  "CVE-2024-50944": {
    "url": "https://github.com/simplcommerce/simplcommerce/issues/1110",
    "cvss": 9.8,
    "description": "Integer overflow vulnerability exists in SimplCommerce at commit 230310c8d7a0408569b292c5a805c459d47a1d8f in the shopping cart functionality. The issue lies in the quantity parameter in the CartController's AddToCart method.",
    "published": "2024-12-27T19:15:08.833"
  },
  "CVE-2024-53476": {
    "url": "https://github.com/simplcommerce/simplcommerce/issues/1111",
    "cvss": 5.9,
    "description": "A race condition vulnerability in SimplCommerce at commit 230310c8d7a0408569b292c5a805c459d47a1d8f allows attackers to bypass inventory restrictions by simultaneously submitting purchase requests from multiple accounts for the same product. This can lead to overselling when stock is limited, as the system fails to accurately track inventory under high concurrency, resulting in potential loss and unfulfilled orders.",
    "published": "2024-12-27T19:15:09.103"
  },
  "CVE-2024-56732": {
    "url": "https://github.com/harfbuzz/harfbuzz/commit/1767f99e2e2196c3fcae27db6d8b60098d3f6d26",
    "cvss": 8.8,
    "description": "HarfBuzz is a text shaping engine. Starting with 8.5.0 through 10.0.1, there is a heap-based buffer overflow in the hb_cairo_glyphs_from_buffer function.",
    "published": "2024-12-27T20:15:23.900"
  },
  "CVE-2024-50715": {
    "cvss": 7.5,
    "description": "An issue in smarts-srl.com Smart Agent v.1.1.0 allows a remote attacker to obtain sensitive information via command injection through a vulnerable unsanitized parameter defined in the /youtubeInfo.php component.",
    "published": "2024-12-27T21:15:07.957",
    "keywords": "remote,command,sensitive"
  },
  "CVE-2024-50714": {
    "cvss": 7.5,
    "description": "A Server-Side Request Forgery (SSRF) in smarts-srl.com Smart Agent v.1.1.0 allows a remote attacker to obtain sensitive information via a crafted script to the /FB/getFbVideoSource.php component.",
    "published": "2024-12-27T22:15:11.070",
    "keywords": "remote,sensitive"
  }
}