{
  "CVE-2024-24156": {
    "url": "https://github.com/gnuboard/g6/issues/316",
    "cvss": "-",
    "description": "Cross Site Scripting (XSS) vulnerability in Gnuboard g6 before Github commit 58c737a263ac0c523592fd87ff71b9e3c07d7cf5, allows remote attackers execute arbitrary code via the wr_content parameter.",
    "published": "2024-03-16T06:15:13.547"
  },
  "CVE-2024-28069": {
    "cvss": "-",
    "description": "A vulnerability in the legacy chat component of Mitel MiContact Center Business through 10.0.0.4 could allow an unauthenticated attacker to conduct an information disclosure attack due to improper configuration. A successful exploit could allow an attacker to access sensitive information and potentially conduct unauthorized actions within the vulnerable component.",
    "published": "2024-03-16T06:15:13.763",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-28070": {
    "cvss": "-",
    "description": "A vulnerability in the legacy chat component of Mitel MiContact Center Business through 10.0.0.4 could allow an unauthenticated attacker to conduct a reflected cross-site scripting (XSS) attack due to insufficient input validation. A successful exploit could allow an attacker to access sensitive information and gain unauthorized access.",
    "published": "2024-03-16T06:15:14.117",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-28640": {
    "cvss": "-",
    "description": "Buffer Overflow vulnerability in TOTOLink X5000R V9.1.0u.6118-B20201102 and A7000R V9.1.0u.6115-B20201022 allows a remote attacker to cause a denial of service (D0S) via the command field.",
    "published": "2024-03-16T06:15:14.613",
    "keywords": "remote,command"
  },
  "CVE-2024-1857": {
    "cvss": 5.3,
    "description": "The Ultimate Gift Cards for WooCommerce – Create, Redeem & Manage Digital Gift Certificates with Personalized Templates plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 2.6.6 via the wps_wgm_preview_email_template(). This makes it possible for unauthenticated attackers to read password protected and draft posts that may contain sensitive data.",
    "published": "2024-03-16T09:15:06.897",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-2558": {
    "cvss": 8.8,
    "description": "A vulnerability was found in Tenda AC18 15.03.05.05. It has been rated as critical. This issue affects the function formexeCommand of the file /goform/execCommand. The manipulation of the argument cmdinput leads to stack-based buffer overflow. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-257057 was assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-03-17T09:15:07.253",
    "keywords": "remote,command"
  },
  "CVE-2024-2562": {
    "url": "https://github.com/pandaxgo/pandax/issues/4",
    "cvss": 6.3,
    "description": "A vulnerability, which was classified as critical, was found in PandaXGO PandaX up to 20240310. This affects the function InsertRole of the file /apps/system/services/role_menu.go. The manipulation of the argument roleKey leads to sql injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-257061 was assigned to this vulnerability.",
    "published": "2024-03-17T12:15:07.343"
  },
  "CVE-2024-2563": {
    "url": "https://github.com/pandaxgo/pandax/pull/3",
    "cvss": 5.4,
    "description": "A vulnerability has been found in PandaXGO PandaX up to 20240310 and classified as critical. This vulnerability affects the function DeleteImage of the file /apps/system/router/upload.go. The manipulation of the argument fileName with the input ../../../../../../../../../tmp/1.txt leads to path traversal: '../filedir'. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. VDB-257062 is the identifier assigned to this vulnerability.",
    "published": "2024-03-17T12:15:07.617"
  },
  "CVE-2024-2564": {
    "url": "https://github.com/pandaxgo/pandax/issues/6",
    "cvss": 6.3,
    "description": "A vulnerability was found in PandaXGO PandaX up to 20240310 and classified as critical. This issue affects the function ExportUser of the file /apps/system/api/user.go. The manipulation of the argument filename leads to path traversal: '../filedir'. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-257063.",
    "published": "2024-03-17T14:15:06.973"
  },
  "CVE-2024-2565": {
    "url": "https://github.com/pandaxgo/pandax/issues/5",
    "cvss": 6.3,
    "description": "A vulnerability was found in PandaXGO PandaX up to 20240310. It has been classified as critical. Affected is an unknown function of the file /apps/system/router/upload.go of the component File Extension Handler. The manipulation of the argument file leads to unrestricted upload. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-257064.",
    "published": "2024-03-17T15:15:07.187"
  },
  "CVE-2024-2566": {
    "cvss": 7.3,
    "description": "A vulnerability was found in Fujian Kelixin Communication Command and Dispatch Platform up to 20240313. It has been declared as critical. Affected by this vulnerability is an unknown functionality of the file api/client/get_extension_yl.php. The manipulation of the argument imei leads to sql injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-257065 was assigned to this vulnerability.",
    "published": "2024-03-17T15:15:07.420",
    "keywords": "remote,command"
  },
  "CVE-2024-2569": {
    "cvss": 7.3,
    "description": "A vulnerability was found in SourceCodester Employee Task Management System 1.0 and classified as critical. Affected by this issue is some unknown functionality of the file /admin-manage-user.php. The manipulation leads to execution after redirect. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-257072.",
    "published": "2024-03-18T00:15:07.753",
    "keywords": "remote,execution"
  },
  "CVE-2024-2570": {
    "cvss": 7.3,
    "description": "A vulnerability was found in SourceCodester Employee Task Management System 1.0. It has been classified as critical. This affects an unknown part of the file /edit-task.php. The manipulation leads to execution after redirect. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-257073 was assigned to this vulnerability.",
    "published": "2024-03-18T00:15:08.073",
    "keywords": "remote,execution"
  },
  "CVE-2024-2571": {
    "cvss": 7.3,
    "description": "A vulnerability was found in SourceCodester Employee Task Management System 1.0. It has been declared as critical. This vulnerability affects unknown code of the file /manage-admin.php. The manipulation leads to execution after redirect. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. VDB-257074 is the identifier assigned to this vulnerability.",
    "published": "2024-03-18T01:15:48.493",
    "keywords": "remote,execution"
  },
  "CVE-2024-2572": {
    "cvss": 7.3,
    "description": "A vulnerability was found in SourceCodester Employee Task Management System 1.0. It has been rated as critical. This issue affects some unknown processing of the file /task-details.php. The manipulation leads to execution after redirect. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-257075.",
    "published": "2024-03-18T01:15:48.707",
    "keywords": "remote,execution"
  },
  "CVE-2024-2573": {
    "cvss": 7.3,
    "description": "A vulnerability classified as critical has been found in SourceCodester Employee Task Management System 1.0. Affected is an unknown function of the file /task-info.php. The manipulation leads to execution after redirect. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-257076.",
    "published": "2024-03-18T01:15:48.923",
    "keywords": "remote,execution"
  },
  "CVE-2024-24230": {
    "cvss": "-",
    "description": "Komm.One CMS 10.4.2.14 has a Server-Side Template Injection (SSTI) vulnerability via the Velocity template engine. It allows remote attackers to execute arbitrary code via a URL that specifies java.lang.Runtime in conjunction with getRuntime().exec followed by an OS command.",
    "published": "2024-03-18T02:15:06.123",
    "keywords": "remote,command"
  },
  "CVE-2024-2574": {
    "cvss": 7.3,
    "description": "A vulnerability classified as critical was found in SourceCodester Employee Task Management System 1.0. Affected by this vulnerability is an unknown functionality of the file /edit-task.php. The manipulation of the argument task_id leads to authorization bypass. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-257077 was assigned to this vulnerability.",
    "published": "2024-03-18T02:15:06.177",
    "keywords": "remote,bypass"
  },
  "CVE-2024-2575": {
    "cvss": 7.3,
    "description": "A vulnerability, which was classified as critical, has been found in SourceCodester Employee Task Management System 1.0. Affected by this issue is some unknown functionality of the file /task-details.php. The manipulation of the argument task_id leads to authorization bypass. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. VDB-257078 is the identifier assigned to this vulnerability.",
    "published": "2024-03-18T02:15:06.397",
    "keywords": "remote,bypass"
  },
  "CVE-2024-2576": {
    "cvss": 7.3,
    "description": "A vulnerability, which was classified as critical, was found in SourceCodester Employee Task Management System 1.0. This affects an unknown part of the file /update-admin.php. The manipulation of the argument admin_id leads to authorization bypass. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-257079.",
    "published": "2024-03-18T02:15:06.620",
    "keywords": "remote,bypass"
  },
  "CVE-2024-2577": {
    "cvss": 7.3,
    "description": "A vulnerability has been found in SourceCodester Employee Task Management System 1.0 and classified as critical. This vulnerability affects unknown code of the file /update-employee.php. The manipulation of the argument admin_id leads to authorization bypass. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-257080.",
    "published": "2024-03-18T03:15:06.123",
    "keywords": "remote,bypass"
  },
  "CVE-2024-29156": {
    "cvss": "-",
    "description": "In OpenStack Murano through 16.0.0, when YAQL before 3.0.0 is used, the Murano service's MuranoPL extension to the YAQL language fails to sanitize the supplied environment, leading to potential leakage of sensitive service account information.",
    "published": "2024-03-18T07:15:05.880",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-22475": {
    "cvss": "-",
    "description": "Cross-site request forgery vulnerability in multiple printers and scanners which implement Web Based Management provided by BROTHER INDUSTRIES, LTD. allows a remote unauthenticated attacker to perform unintended operations on the affected product. As for the details of affected product names, model numbers, and versions, refer to the information provided by the respective vendors listed under [References].",
    "published": "2024-03-18T08:15:06.173",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-23604": {
    "cvss": "-",
    "description": "Cross-site scripting vulnerability exists in FitNesse all releases, which may allow a remote unauthenticated attacker to execute an arbitrary script on the web browser of the user who is using the product and accessing a link with specially crafted multiple parameters.",
    "published": "2024-03-18T08:15:06.233",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-27974": {
    "cvss": "-",
    "description": "Cross-site request forgery vulnerability in FUJIFILM printers which implement CentreWare Internet Services or Internet Services allows a remote unauthenticated attacker to alter user information. In the case the user is an administrator, the settings such as the administrator's ID, password, etc. may be altered. As for the details of affected product names, model numbers, and versions, refer to the information provided by the vendor listed under [References].",
    "published": "2024-03-18T08:15:06.287",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-28125": {
    "cvss": "-",
    "description": "FitNesse all releases allows a remote authenticated attacker to execute arbitrary OS commands.",
    "published": "2024-03-18T08:15:06.347",
    "keywords": "remote,command"
  },
  "CVE-2024-28128": {
    "cvss": "-",
    "description": "Cross-site scripting vulnerability exists in FitNesse releases prior to 20220319, which may allow a remote unauthenticated attacker to execute an arbitrary script on the web browser of the user who is using the product and accessing a link with a specially crafted certain parameter.",
    "published": "2024-03-18T08:15:06.400",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-28039": {
    "cvss": "-",
    "description": "Improper restriction of XML external entity references vulnerability exists in FitNesse all releases, which allows a remote unauthenticated attacker to obtain sensitive information, alter data, or cause a denial-of-service (DoS) condition.",
    "published": "2024-03-18T09:15:06.483",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-1013": {
    "url": "https://github.com/lurcher/unixodbc/pull/157",
    "cvss": 7.1,
    "description": "An out-of-bounds stack write flaw was found in unixODBC on 64-bit architectures where the caller has 4 bytes and callee writes 8 bytes. This issue may go unnoticed on little-endian architectures, while big-endian architectures can be broken.",
    "published": "2024-03-18T11:15:09.227"
  },
  "CVE-2024-20767": {
    "cvss": 8.2,
    "description": "ColdFusion versions 2023.6, 2021.12 and earlier are affected by an Improper Access Control vulnerability that could lead to arbitrary file system read. An attacker could leverage this vulnerability to bypass security measures and gain unauthorized access to sensitive files and perform arbitrary file system write. Exploitation of this issue does not require user interaction.",
    "published": "2024-03-18T12:15:06.870",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-27767": {
    "cvss": 10.0,
    "description": "\nCWE-287: Improper Authentication may allow Authentication Bypass\n\n",
    "published": "2024-03-18T14:15:08.050",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-20757": {
    "cvss": 5.5,
    "description": "Bridge versions 13.0.5, 14.0.1 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-03-18T16:15:08.193",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-2229": {
    "cvss": 7.8,
    "description": "\nCWE-502: Deserialization of Untrusted Data vulnerability exists that could cause remote code\nexecution when a malicious project file is loaded into the application by a valid user.\n\n",
    "published": "2024-03-18T16:15:09.580",
    "keywords": "remote,execution"
  },
  "CVE-2024-20762": {
    "cvss": 5.5,
    "description": "Animate versions 24.0, 23.0.3 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-03-18T18:15:08.777",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-20763": {
    "cvss": 5.5,
    "description": "Animate versions 24.0, 23.0.3 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-03-18T18:15:09.017",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-20764": {
    "cvss": 5.5,
    "description": "Animate versions 24.0, 23.0.3 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-03-18T18:15:09.237",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-26063": {
    "cvss": 5.3,
    "description": "Adobe Experience Manager versions 6.5.19 and earlier are affected by an Information Exposure vulnerability that could result in a Security feature bypass. An attacker could leverage this vulnerability to gain unauthorized access to sensitive information, potentially bypassing security measures. Exploitation of this issue does not require user interaction.",
    "published": "2024-03-18T18:15:14.973",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-24578": {
    "cvss": 10.0,
    "description": "RaspberryMatic is an open-source operating system for HomeMatic internet-of-things devices. RaspberryMatic / OCCU prior to version 3.75.6.20240316 contains a unauthenticated remote code execution (RCE) vulnerability, caused by multiple issues within the Java based `HMIPServer.jar` component. RaspberryMatric includes a Java based `HMIPServer`, that can be accessed through URLs starting with `/pages/jpages`. The `FirmwareController` class does however not perform any session id checks, thus this feature can be accessed without a valid session. Due to this issue, attackers can gain remote code execution as root user, allowing a full system compromise. Version 3.75.6.20240316 contains a patch.",
    "published": "2024-03-18T22:15:07.683",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-28855": {
    "cvss": 8.1,
    "description": "ZITADEL, open source authentication management software, uses Go templates to render the login UI. Due to a improper use of the `text/template` instead of the `html/template` package, the Login UI did not sanitize input parameters prior to versions 2.47.3, 2.46.1, 2.45.1, 2.44.3, 2.43.9, 2.42.15, and 2.41.15. An attacker could create a malicious link, where he injected code which would be rendered as part of the login screen. While it was possible to inject HTML including JavaScript, the execution of such scripts would be prevented by the Content Security Policy. Versions 2.47.3, 2.46.1, 2.45.1, 2.44.3, 2.43.9, 2.42.15, and 2.41.15 contain a patch for this issue. No known workarounds are available.",
    "published": "2024-03-18T22:15:08.963",
    "keywords": "execution,authentication"
  },
  "CVE-2024-28865": {
    "url": "https://github.com/django-wiki/django-wiki/commit/8e280fd6c0bd27ce847c67b2d216c6cbf920f88c",
    "cvss": 7.5,
    "description": "django-wiki is a wiki system for Django. Installations of django-wiki prior to version 0.10.1 are vulnerable to maliciously crafted article content that can cause severe use of server CPU through a regular expression loop. Version 0.10.1 fixes this issue. As a workaround, close off access to create and edit articles by anonymous users.",
    "published": "2024-03-18T22:15:09.510"
  },
  "CVE-2024-2620": {
    "cvss": 6.3,
    "description": "A vulnerability has been found in Fujian Kelixin Communication Command and Dispatch Platform up to 20240318 and classified as critical. Affected by this vulnerability is an unknown functionality of the file api/client/down_file.php. The manipulation of the argument uuid leads to sql injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-257197 was assigned to this vulnerability.",
    "published": "2024-03-19T01:15:44.953",
    "keywords": "remote,command"
  },
  "CVE-2024-2621": {
    "cvss": 6.3,
    "description": "A vulnerability was found in Fujian Kelixin Communication Command and Dispatch Platform up to 20240318 and classified as critical. Affected by this issue is some unknown functionality of the file api/client/user/pwd_update.php. The manipulation of the argument uuid leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. VDB-257198 is the identifier assigned to this vulnerability.",
    "published": "2024-03-19T01:15:45.180",
    "keywords": "remote,command"
  }
}