{
  "CVE-2024-10389": {
    "url": "https://github.com/google/safearchive/commit/f7ce9d7b6f9c6ecd72d0b0f16216b046e55e44dc",
    "cvss": 5.3,
    "description": "There exists a Path Traversal vulnerability in Safearchive on Platforms with Case-Insensitive Filesystems (e.g., NTFS). This allows Attackers to Write Arbitrary Files via Archive Extraction containing symbolic links. We recommend upgrading past commit f7ce9d7b6f9c6ecd72d0b0f16216b046e55e44dc",
    "published": "2024-11-04T11:15:04.647"
  },
  "CVE-2024-51556": {
    "cvss": "-",
    "description": "This vulnerability exists in the Wave 2.0 due to weak encryption of sensitive data received at the API response. An authenticated remote attacker could exploit this vulnerability by manipulating a parameter “user_id” through API request URLs leading to unauthorized access to sensitive information belonging to other users.",
    "published": "2024-11-04T13:17:04.850",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-51558": {
    "cvss": "-",
    "description": "This vulnerability exists in the Wave 2.0 due to missing restrictions for excessive failed authentication attempts on its API based login. A remote attacker could exploit this vulnerability by conducting a brute force attack against legitimate user OTP, MPIN or password, which could lead to gain unauthorized access and compromise other user accounts.",
    "published": "2024-11-04T13:17:05.450",
    "keywords": "remote,authentication"
  },
  "CVE-2024-51560": {
    "cvss": "-",
    "description": "This vulnerability exists in the Wave 2.0 due to improper exception handling for invalid inputs at certain API endpoint. An authenticated remote attacker could exploit this vulnerability by providing invalid inputs for “userId” parameter in the API request leading to generation of error message containing sensitive information on the targeted system.",
    "published": "2024-11-04T13:17:05.810",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-51561": {
    "cvss": "-",
    "description": "This vulnerability exists in Aero due to improper implementation of OTP validation mechanism in certain API endpoints. An authenticated remote attacker could exploit this vulnerability by intercepting and manipulating the responses exchanged during the second factor authentication process.  \n\nSuccessful exploitation of this vulnerability could allow the attacker to bypass OTP verification for accessing other user accounts.",
    "published": "2024-11-04T13:17:05.963",
    "keywords": "remote,authentication,bypass"
  },
  "CVE-2024-45884": {
    "cvss": 8.0,
    "description": "DrayTek Vigor3900 1.5.1.3 contains a post-authentication command injection vulnerability. This vulnerability occurs when the `action` parameter in `cgi-bin/mainfunction.cgi` is set to `setSWMGroup.`",
    "published": "2024-11-04T15:15:21.937",
    "keywords": "authentication,command"
  },
  "CVE-2024-45885": {
    "cvss": 8.0,
    "description": "DrayTek Vigor3900 1.5.1.3 contains a post-authentication command injection vulnerability. This vulnerability occurs when the `action` parameter in `cgi-bin/mainfunction.cgi` is set to `autodiscovery_clear.`",
    "published": "2024-11-04T15:15:22.040",
    "keywords": "authentication,command"
  },
  "CVE-2024-45887": {
    "cvss": 8.0,
    "description": "DrayTek Vigor3900 1.5.1.3 contains a post-authentication command injection vulnerability. This vulnerability occurs when the `action` parameter in `cgi-bin/mainfunction.cgi` is set to `doOpenVPN.`",
    "published": "2024-11-04T15:15:22.123",
    "keywords": "authentication,command,vpn"
  },
  "CVE-2024-45889": {
    "cvss": 8.0,
    "description": "DrayTek Vigor3900 1.5.1.3 contains a post-authentication command injection vulnerability. This vulnerability occurs when the `action` parameter in `cgi-bin/mainfunction.cgi` is set to `commandTable.`",
    "published": "2024-11-04T15:15:22.297",
    "keywords": "authentication,command"
  },
  "CVE-2024-45890": {
    "cvss": 8.0,
    "description": "DrayTek Vigor3900 1.5.1.3 contains a post-authentication command injection vulnerability This vulnerability occurs when the `action` parameter in `cgi-bin/mainfunction.cgi` is set to `download_ovpn.`",
    "published": "2024-11-04T15:15:22.400",
    "keywords": "authentication,command,vpn"
  },
  "CVE-2024-45891": {
    "cvss": 8.0,
    "description": "DrayTek Vigor3900 1.5.1.3 contains a post-authentication command injection vulnerability. This vulnerability occurs when the `action` parameter in `cgi-bin/mainfunction.cgi` is set to `delete_wlan_profile.`",
    "published": "2024-11-04T15:15:22.477",
    "keywords": "authentication,command"
  },
  "CVE-2024-45893": {
    "cvss": 8.0,
    "description": "DrayTek Vigor3900 1.5.1.3 contains a post-authentication command injection vulnerability. This vulnerability occurs when the `action` parameter in `cgi-bin/mainfunction.cgi` is set to `setSWMOption.`",
    "published": "2024-11-04T15:15:22.560",
    "keywords": "authentication,command"
  },
  "CVE-2024-51136": {
    "url": "https://github.com/openimaj/openimaj/issues/382",
    "cvss": "-",
    "description": "An XML External Entity (XXE) vulnerability in Dmoz2CSV in openimaj v1.3.10 allows attackers to access sensitive information or execute arbitrary code via supplying a crafted XML file.",
    "published": "2024-11-04T17:15:08.050"
  },
  "CVE-2024-51327": {
    "cvss": "-",
    "description": "SQL Injection in loginform.php in ProjectWorld's Travel Management System v1.0 allows remote attackers to bypass authentication via SQL Injection in the 'username' and 'password' fields.",
    "published": "2024-11-04T18:15:05.310",
    "keywords": "remote,authentication,bypass"
  },
  "CVE-2024-48061": {
    "cvss": "-",
    "description": "langflow <=1.0.18 is vulnerable to Remote Code Execution (RCE) as any component provided the code functionality and the components run on the local machine rather than in a sandbox.",
    "published": "2024-11-04T23:15:04.560",
    "keywords": "remote,execution"
  },
  "CVE-2024-51498": {
    "url": "https://github.com/imputnet/cobalt/commit/c4be1d3a37b0deb6b6087ec7a815262ac942daf1",
    "cvss": "-",
    "description": "cobalt is a media downloader that doesn't piss you off. A malicious cobalt instance could serve links with the `javascript:` protocol, resulting in Cross-site Scripting (XSS) when the user tries to download an item from a picker. This issue has been present since commit `66bac03e`, was mitigated in commit `97977efa` (correctly configured web instances were no longer vulnerable) and fully fixed in commit `c4be1d3a` (included in release version 10.2.1). Users are advised to upgrade. Users unable to upgrade should enable a content-security-policy.",
    "published": "2024-11-05T00:15:04.680"
  },
  "CVE-2024-10097": {
    "cvss": 8.1,
    "description": "The Loginizer Security and Loginizer plugins for WordPress are vulnerable to authentication bypass in all versions up to, and including, 1.9.2. This is due to insufficient verification on the user being returned by the social login token. This makes it possible for unauthenticated attackers to log in as any existing user on the site, such as an administrator, if they have access to the email and the user does not have an already-existing account for the service returning the token.",
    "published": "2024-11-05T07:15:13.327",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-47137": {
    "cvss": 8.4,
    "description": "in OpenHarmony v4.1.0 and prior versions allow a local attacker cause the common permission is upgraded to root and sensitive information leak through out-of-bounds write.",
    "published": "2024-11-05T08:15:02.830",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-47404": {
    "cvss": 8.4,
    "description": "in OpenHarmony v4.1.0 and prior versions allow a local attacker cause the common permission is upgraded to root and sensitive information leak through double free.",
    "published": "2024-11-05T08:15:03.500",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-47797": {
    "cvss": 8.4,
    "description": "in OpenHarmony v4.1.0 and prior versions allow a local attacker cause the common permission is upgraded to root and sensitive information leak through out-of-bounds write.",
    "published": "2024-11-05T08:15:03.730",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-10114": {
    "cvss": 8.1,
    "description": "The WooCommerce - Social Login plugin for WordPress is vulnerable to authentication bypass in all versions up to, and including, 2.7.7. This is due to insufficient verification on the user being returned by the social login token. This makes it possible for unauthenticated attackers to log in as any existing user on the site, such as an administrator, if they have access to the email and the user does not have an already-existing account for the service returning the token.",
    "published": "2024-11-05T09:15:03.333",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-10687": {
    "cvss": 9.8,
    "description": "The Photos, Files, YouTube, Twitter, Instagram, TikTok, Ecommerce Contest Gallery – Upload, Vote, Sell via PayPal, Social Share Buttons plugin for WordPress is vulnerable to time-based SQL Injection via the $collectedIds parameter in all versions up to, and including, 24.0.3 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-11-05T10:15:24.760",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-47253": {
    "cvss": 7.2,
    "description": "In 2N Access Commander versions 3.1.1.2 and prior, a Path Traversal vulnerability could allow an attacker with administrative privileges to write files on the filesystem and potentially achieve arbitrary remote code execution. This vulnerability cannot be exploited by users with lower privilege roles.",
    "published": "2024-11-05T10:20:03.973",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-47255": {
    "cvss": 4.7,
    "description": "In 2N Access Commander versions 3.1.1.2 and prior, a local attacker can escalate their privileges in the system which could allow for arbitrary \ncode execution with root permissions.",
    "published": "2024-11-05T10:20:05.300",
    "keywords": "execution,command"
  },
  "CVE-2024-10263": {
    "cvss": 7.3,
    "description": "The Tickera – WordPress Event Ticketing plugin for WordPress is vulnerable to arbitrary shortcode execution in all versions up to, and including, 3.5.4.4. This is due to the software allowing users to execute an action that does not properly validate a value before running do_shortcode. This makes it possible for unauthenticated attackers to execute arbitrary shortcodes.",
    "published": "2024-11-05T13:15:03.203",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-51005": {
    "cvss": 8.0,
    "description": "Netgear R8500 v1.0.2.160 was discovered to contain a command injection vulnerability in the share_name parameter at usb_remote_smb_conf.cgi. This vulnerability allows attackers to execute arbitrary OS commands via a crafted request.",
    "published": "2024-11-05T15:15:24.470",
    "keywords": "remote,command"
  },
  "CVE-2024-50096": {
    "cvss": "-",
    "description": "In the Linux kernel, the following vulnerability has been resolved:\n\nnouveau/dmem: Fix vulnerability in migrate_to_ram upon copy error\n\nThe `nouveau_dmem_copy_one` function ensures that the copy push command is\nsent to the device firmware but does not track whether it was executed\nsuccessfully.\n\nIn the case of a copy error (e.g., firmware or hardware failure), the\ncopy push command will be sent via the firmware channel, and\n`nouveau_dmem_copy_one` will likely report success, leading to the\n`migrate_to_ram` function returning a dirty HIGH_USER page to the user.\n\nThis can result in a security vulnerability, as a HIGH_USER page that may\ncontain sensitive or corrupted data could be returned to the user.\n\nTo prevent this vulnerability, we allocate a zero page. Thus, in case of\nan error, a non-dirty (zero) page will be returned to the user.",
    "published": "2024-11-05T17:15:06.870",
    "keywords": "command,sensitive"
  },
  "CVE-2024-51362": {
    "cvss": "-",
    "description": "The LSC Smart Connect Indoor IP Camera V7.6.32 is vulnerable to an information disclosure issue where live camera footage can be accessed through the RTSP protocol on port 8554 without requiring authentication. This allows unauthorized users with network access to view the camera's feed, potentially compromising user privacy and security. No credentials or special permissions are required, and access can be gained remotely over the network.",
    "published": "2024-11-05T17:15:07.383",
    "keywords": "remote,authentication"
  }
}