{
  "CVE-2024-27081": {
    "cvss": 7.2,
    "description": "ESPHome is a system to control your ESP8266/ESP32. A security misconfiguration in the edit configuration file API in the dashboard component of ESPHome version 2023.12.9 (command line installation) allows authenticated remote attackers to read and write arbitrary files under the configuration directory rendering remote code execution possible.  This vulnerability is patched in 2024.2.1.\n",
    "published": "2024-02-26T17:15:10.550",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-27093": {
    "url": "https://github.com/stacklok/minder/commit/53868a878e93f29c43437f96dbc990b548e48d1d",
    "cvss": 4.6,
    "description": "Minder is a Software Supply Chain Security Platform. In version 0.0.31 and earlier, it is possible for an attacker to register a repository with a invalid or differing upstream ID, which causes Minder to report the repository as registered, but not remediate any future changes which conflict with policy (because the webhooks for the repo do not match any known repository in the database).  When attempting to register a repo with a different repo ID, the registered provider must have admin on the named repo, or a 404 error will result.  Similarly, if the stored provider token does not have repo access, then the remediations will not apply successfully.  Lastly, it appears that reconciliation actions do not execute against repos with this type of mismatch. This appears to primarily be a potential denial-of-service vulnerability.  This vulnerability is patched in version 0.20240226.1425+ref.53868a8.",
    "published": "2024-02-26T22:15:07.113"
  },
  "CVE-2024-0759": {
    "url": "https://github.com/mintplex-labs/anything-llm/commit/0db6c3b2aa1787a7054ffdaba975474f122c20eb",
    "cvss": 9.6,
    "description": "Should an instance of AnythingLLM be hosted on an internal network and the attacked be explicitly granted a permission level of manager or admin, they could link-scrape internally resolving IPs of other services that are on the same network as AnythingLLM.\n\nThis would require the attacker also be able to guess these internal IPs as `/*` ranging is not possible, but could be brute forced.\n\nThere is a duty of care that other services on the same network would not be fully open and accessible via a simple CuRL with zero authentication as it is not possible to set headers or access via the link collector.",
    "published": "2024-02-27T06:15:45.493"
  },
  "CVE-2024-1698": {
    "cvss": 9.8,
    "description": "The NotificationX – Best FOMO, Social Proof, WooCommerce Sales Popup & Notification Bar Plugin With Elementor plugin for WordPress is vulnerable to SQL Injection via the 'type' parameter in all versions up to, and including, 2.8.2 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-02-27T06:15:46.140",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-0551": {
    "url": "https://github.com/mintplex-labs/anything-llm/commit/7aaa4b38e7112a6cd879c1238310c56b1844c6d8",
    "cvss": 7.1,
    "description": "Enable exports of the database and associated exported information of the system via the default user role. The attacked would have to have been granted access to the system prior to the attack.\n\nIt is worth noting that the deterministic nature of the export name is lower risk as the UI for exporting would start the download at the same time, which once downloaded - deletes the export from the system.\n\nThe endpoint for exporting should simply be patched to a higher privilege level.",
    "published": "2024-02-27T14:15:27.130"
  },
  "CVE-2024-27905": {
    "cvss": "-",
    "description": "** UNSUPPORTED WHEN ASSIGNED ** Exposure of Sensitive Information to an Unauthorized Actor vulnerability in Apache Aurora.\n\nAn endpoint exposing internals to unauthenticated users can be used as a \"padding oracle\" allowing an anonymous attacker to construct a valid authentication cookie. Potentially this could be combined with vulnerabilities in other components to achieve remote code execution.\n\nAs this project is retired, we do not plan to release a version that fixes this issue. Users are recommended to find an alternative or restrict access to the instance to trusted users.\n\nNOTE: This vulnerability only affects products that are no longer supported by the maintainer.\n\n",
    "published": "2024-02-27T15:15:07.930",
    "keywords": "remote,execution,unauthenticated,authentication,sensitive"
  },
  "CVE-2024-1403": {
    "cvss": 10.0,
    "description": "In OpenEdge Authentication Gateway and AdminServer prior to 11.7.19, 12.2.14, 12.8.1 on all platforms supported by the OpenEdge product, an authentication bypass vulnerability has been identified.  The\nvulnerability is a bypass to authentication based on a failure to properly\nhandle username and password.  Certain unexpected\ncontent passed into the credentials can lead to unauthorized access without proper\nauthentication.    \n\n\n\n\n\n\n",
    "published": "2024-02-27T16:15:45.643",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-25400": {
    "url": "https://github.com/intelliants/subrion/issues/910",
    "cvss": "-",
    "description": "Subrion CMS 4.2.1 is vulnerable to SQL Injection via ia.core.mysqli.php.",
    "published": "2024-02-27T16:15:46.517"
  },
  "CVE-2024-26144": {
    "cvss": 5.3,
    "description": "Rails is a web-application framework. Starting with version 5.2.0, there is a possible sensitive session information leak in Active Storage. By default, Active Storage sends a Set-Cookie header along with the user's session cookie when serving blobs. It also sets Cache-Control to public. Certain proxies may cache the Set-Cookie, leading to an information leak. The vulnerability is fixed in 7.0.8.1 and 6.1.7.7.",
    "published": "2024-02-27T16:15:46.970",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-24323": {
    "cvss": "-",
    "description": "SQL injection vulnerability in linlinjava litemall v.1.8.0 allows a remote attacker to obtain sensitive information via the nickname, consignee, orderSN, orderStatusArray parameters of the AdminOrdercontroller.java component.",
    "published": "2024-02-27T17:15:12.103",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-27099": {
    "url": "https://github.com/azure/azure-uamqp-c/commit/2ca42b6e4e098af2d17e487814a91d05f6ae4987",
    "cvss": 9.8,
    "description": "The uAMQP is a C library for AMQP 1.0 communication to Azure Cloud Services. When processing an incorrect `AMQP_VALUE` failed state, may cause a double free problem. This may cause a RCE. Update submodule with commit 2ca42b6e4e098af2d17e487814a91d05f6ae4987.",
    "published": "2024-02-27T19:04:07.603"
  },
  "CVE-2024-0763": {
    "url": "https://github.com/mintplex-labs/anything-llm/commit/8a7324d0e77a15186e1ad5e5119fca4fb224c39c",
    "cvss": 8.1,
    "description": "Any user can delete an arbitrary folder (recursively) on a remote server due to bad input sanitization leading to path traversal. The attacker would need access to the server at some privilege level since this endpoint is protected and requires authorization.",
    "published": "2024-02-27T22:15:14.597"
  },
  "CVE-2024-26294": {
    "cvss": 7.2,
    "description": "Vulnerabilities in the ClearPass Policy Manager web-based management interface allow remote authenticated users to run arbitrary commands on the underlying host. A successful exploit could allow an attacker to execute arbitrary commands as root on the underlying operating system leading to complete system compromise.\n\n",
    "published": "2024-02-27T22:15:14.923",
    "keywords": "remote,command"
  },
  "CVE-2024-26295": {
    "cvss": 7.2,
    "description": "Vulnerabilities in the ClearPass Policy Manager web-based management interface allow remote authenticated users to run arbitrary commands on the underlying host. A successful exploit could allow an attacker to execute arbitrary commands as root on the underlying operating system leading to complete system compromise.\n\n",
    "published": "2024-02-27T22:15:15.100",
    "keywords": "remote,command"
  },
  "CVE-2024-26296": {
    "cvss": 7.2,
    "description": "Vulnerabilities in the ClearPass Policy Manager web-based management interface allow remote authenticated users to run arbitrary commands on the underlying host. A successful exploit could allow an attacker to execute arbitrary commands as root on the underlying operating system leading to complete system compromise.\n\n",
    "published": "2024-02-27T22:15:15.263",
    "keywords": "remote,command"
  },
  "CVE-2024-26297": {
    "cvss": 7.2,
    "description": "Vulnerabilities in the ClearPass Policy Manager web-based management interface allow remote authenticated users to run arbitrary commands on the underlying host. A successful exploit could allow an attacker to execute arbitrary commands as root on the underlying operating system leading to complete system compromise.\n\n",
    "published": "2024-02-27T22:15:15.420",
    "keywords": "remote,command"
  },
  "CVE-2024-26298": {
    "cvss": 7.2,
    "description": "Vulnerabilities in the ClearPass Policy Manager web-based management interface allow remote authenticated users to run arbitrary commands on the underlying host. A successful exploit could allow an attacker to execute arbitrary commands as root on the underlying operating system leading to complete system compromise.\n\n",
    "published": "2024-02-27T22:15:15.573",
    "keywords": "remote,command"
  },
  "CVE-2024-26301": {
    "cvss": 6.5,
    "description": "A vulnerability in the web-based management interface of ClearPass Policy Manager could allow a remote attacker authenticated with low privileges to access sensitive information. A successful exploit allows an attacker to retrieve information which could be used to potentially gain further access to network services supported by ClearPass Policy Manager.\n\n",
    "published": "2024-02-27T23:15:07.450",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-26302": {
    "cvss": 4.8,
    "description": "A vulnerability in the web-based management interface of ClearPass Policy Manager could allow a remote attacker authenticated with low privileges to access sensitive information. A successful exploit allows an attacker to retrieve information which could be used to potentially gain further access to network services supported by ClearPass Policy Manager.\n\n",
    "published": "2024-02-27T23:15:07.627",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-0550": {
    "url": "https://github.com/mintplex-labs/anything-llm/commit/e1dcd5ded010b03abd6aa32d1bf0668a48e38e17",
    "cvss": 9.6,
    "description": "A user who is privileged already `manager` or `admin` can set their profile picture via the frontend API using a relative filepath to then user the PFP GET API to download any valid files.\n\nThe attacker would have to have been granted privileged permissions to the system before executing this attack.",
    "published": "2024-02-28T05:15:08.770"
  },
  "CVE-2024-0975": {
    "cvss": 5.3,
    "description": "The WordPress Access Control plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 4.0.13  via the REST API. This makes it possible for unauthenticated attackers to bypass the plugin's \"Make Website Members Only\" feature (when unset) and view restricted page and post content.",
    "published": "2024-02-28T09:15:42.377",
    "keywords": "unauthenticated,sensitive,bypass"
  },
  "CVE-2024-1476": {
    "cvss": 5.3,
    "description": "The Under Construction / Maintenance Mode from Acurax plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 2.6 via the REST API. This makes it possible for unauthenticated attackers to obtain the contents of posts and pages when maintenance mode is active thus bypassing the protection provided by the plugin.",
    "published": "2024-02-28T09:15:42.850",
    "keywords": "unauthenticated,sensitive,bypass"
  },
  "CVE-2024-1514": {
    "cvss": 9.8,
    "description": "The WP eCommerce plugin for WordPress is vulnerable to time-based blind SQL Injection via the 'cart_contents' parameter in all versions up to, and including, 3.15.1 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-02-28T09:15:43.023",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-21885": {
    "cvss": 7.8,
    "description": "A flaw was found in X.Org server. In the XISendDeviceHierarchyEvent function, it is possible to exceed the allocated array length when certain new device IDs are added to the xXIHierarchyInfo struct. This can trigger a heap buffer overflow condition, which may lead to an application crash or remote code execution in SSH X11 forwarding environments.",
    "published": "2024-02-28T13:15:08.197",
    "keywords": "remote,execution"
  },
  "CVE-2024-21886": {
    "cvss": 7.8,
    "description": "A heap buffer overflow flaw was found in the DisableDevice function in the X.Org server. This issue may lead to an application crash or, in some circumstances, remote code execution in SSH X11 forwarding environments.",
    "published": "2024-02-28T13:15:08.440",
    "keywords": "remote,execution"
  },
  "CVE-2024-27515": {
    "url": "https://github.com/mindstellar/osclass/issues/495",
    "cvss": "-",
    "description": "Osclass 5.1.2 is vulnerable to SQL Injection.",
    "published": "2024-02-28T13:15:09.530"
  },
  "CVE-2024-0560": {
    "url": "https://github.com/3scale/apicast/pull/1438",
    "cvss": 6.3,
    "description": "A vulnerability was found in 3Scale, when used with Keycloak 15 (or RHSSO 7.5.0) and superiors. When the auth_type is use_3scale_oidc_issuer_endpoint, the Token Introspection policy discovers the Token Introspection endpoint from the token_introspection_endpoint field, but the field was removed on RH-SSO 7.5. As a result, the policy doesn't inspect tokens, it determines that all tokens are valid.",
    "published": "2024-02-28T17:15:08.340"
  },
  "CVE-2024-24148": {
    "url": "https://github.com/libming/libming/issues/308",
    "cvss": "-",
    "description": "A memory leak issue discovered in parseSWF_FREECHARACTER in libming v0.4.8 allows attackers to cause a denial of service via a crafted SWF file.",
    "published": "2024-02-28T20:15:41.683"
  },
  "CVE-2024-25866": {
    "cvss": "-",
    "description": "A SQL Injection vulnerability in CodeAstro Membership Management System in PHP v.1.0 allows a remote attacker to execute arbitrary SQL commands via the email parameter in the index.php component.",
    "published": "2024-02-28T22:15:26.573",
    "keywords": "remote,command"
  },
  "CVE-2024-25867": {
    "cvss": "-",
    "description": "A SQL Injection vulnerability in CodeAstro Membership Management System in PHP v.1.0 allows a remote attacker to execute arbitrary SQL commands via the membershipType and membershipAmount parameters in the add_type.php component.",
    "published": "2024-02-28T22:15:26.617",
    "keywords": "remote,command"
  },
  "CVE-2024-26476": {
    "url": "https://github.com/mpdf/mpdf/issues/867",
    "cvss": "-",
    "description": "An issue in open-emr before v.7.0.2 allows a remote attacker to escalate privileges via a crafted script to the formid parameter in the ereq_form.php component.",
    "published": "2024-02-28T22:15:26.767"
  },
  "CVE-2024-23910": {
    "cvss": "-",
    "description": "Cross-site request forgery (CSRF) vulnerability in ELECOM wireless LAN routers allows a remote unauthenticated attacker to hijack the authentication of administrators and to perform unintended operations to the affected product. Affected products and versions are as follows: WRC-1167GS2-B v1.67 and earlier, WRC-1167GS2H-B v1.67 and earlier, WRC-2533GS2-B v1.62 and earlier, WRC-2533GS2-W v1.62 and earlier, and WRC-2533GS2V-B v1.62 and earlier.",
    "published": "2024-02-28T23:15:09.557",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2024-25422": {
    "cvss": "-",
    "description": "SQL Injection vulnerability in SEMCMS v.4.8 allows a remote attacker to execute arbitrary code and obtain sensitive information via the SEMCMS_Menu.php component.",
    "published": "2024-02-28T23:15:09.610",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-26559": {
    "cvss": "-",
    "description": "An issue in uverif v.2.0 allows a remote attacker to obtain sensitive information.",
    "published": "2024-02-28T23:15:09.763",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-0616": {
    "cvss": 5.3,
    "description": "The Passster – Password Protect Pages and Content plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 4.2.6.2 via API. This makes it possible for unauthenticated attackers to obtain post titles, slugs, IDs, content and other metadata including passwords of password-protected posts and pages.",
    "published": "2024-02-29T01:43:23.320",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-0620": {
    "cvss": 5.3,
    "description": "The PPWP – Password Protect Pages plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 1.8.9 via API. This makes it possible for unauthenticated attackers to obtain post titles, IDs, slugs as well as other information including for password-protected posts.",
    "published": "2024-02-29T01:43:23.493",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-0978": {
    "cvss": 5.3,
    "description": "The My Private Site plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 3.0.14 via the REST API. This makes it possible for unauthenticated attackers to bypass the plugin's site privacy feature and view restricted page and post content.",
    "published": "2024-02-29T01:43:33.917",
    "keywords": "unauthenticated,sensitive,bypass"
  },
  "CVE-2024-1294": {
    "cvss": 5.3,
    "description": "The Sunshine Photo Cart: Free Client Galleries for Photographers plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 3.0.24 via the 'invoice'. This makes it possible for unauthenticated attackers to extract sensitive data including customer email and physical addresses.",
    "published": "2024-02-29T01:43:47.133",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-1472": {
    "cvss": 5.3,
    "description": "The WP Maintenance plugin for WordPress is vulnerable to Information Exposure in all versions up to, and including, 6.1.6 via the REST API. This makes it possible for unauthenticated attackers to bypass the plugin's maintenance mode obtain post and page content via REST API.",
    "published": "2024-02-29T01:43:51.553",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2024-1475": {
    "cvss": 5.3,
    "description": "The Coming Soon Maintenance Mode plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 1.0.5 via the REST API. This makes it possible for unauthenticated attackers to obtain post and page content thus bypassing the protection provided by the plugin.",
    "published": "2024-02-29T01:43:51.730",
    "keywords": "unauthenticated,sensitive,bypass"
  },
  "CVE-2024-1722": {
    "cvss": 3.7,
    "description": "A flaw was found in Keycloak. In certain conditions, this issue may allow a remote unauthenticated attacker to block other accounts from logging in.",
    "published": "2024-02-29T01:43:54.010",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20267": {
    "cvss": 8.6,
    "description": "A vulnerability with the handling of MPLS traffic for Cisco NX-OS Software could allow an unauthenticated, remote attacker to cause the netstack process to unexpectedly restart, which could cause the device to stop processing network traffic or to reload. \r\n\r This vulnerability is due to lack of proper error checking when processing an ingress MPLS frame. An attacker could exploit this vulnerability by sending a crafted IPv6 packet that is encapsulated within an MPLS frame to an MPLS-enabled interface of the targeted device. A successful exploit could allow the attacker to cause a denial of service (DoS) condition.\r\n\r Note: The IPv6 packet can be generated multiple hops away from the targeted device and then encapsulated within MPLS. The DoS condition may occur when the NX-OS device processes the packet.",
    "published": "2024-02-29T01:43:58.370",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20291": {
    "cvss": 5.8,
    "description": "A vulnerability in the access control list (ACL) programming for port channel subinterfaces of Cisco Nexus 3000 and 9000 Series Switches in standalone NX-OS mode could allow an unauthenticated, remote attacker to send traffic that should be blocked through an affected device.\r\n\r This vulnerability is due to incorrect hardware programming that occurs when configuration changes are made to port channel member ports. An attacker could exploit this vulnerability by attempting to send traffic through an affected device. A successful exploit could allow the attacker to access network resources that should be protected by an ACL that was applied on port channel subinterfaces.",
    "published": "2024-02-29T01:43:59.000",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20294": {
    "cvss": 6.6,
    "description": "A vulnerability in the Link Layer Discovery Protocol (LLDP) feature of Cisco FXOS Software and Cisco NX-OS Software could allow an unauthenticated, adjacent attacker to cause a denial of service (DoS) condition on an affected device.\r\n\r This vulnerability is due to improper handling of specific fields in an LLDP frame. An attacker could exploit this vulnerability by sending a crafted LLDP packet to an interface of an affected device and having an authenticated user retrieve LLDP statistics from the affected device through CLI show commands or Simple Network Management Protocol (SNMP) requests. A successful exploit could allow the attacker to cause the LLDP service to crash and stop running on the affected device. In certain situations, the LLDP crash may result in a reload of the affected device.\r\n\r Note: LLDP is a Layer 2 link protocol. To exploit this vulnerability, an attacker would need to be directly connected to an interface of an affected device, either physically or logically (for example, through a Layer 2 Tunnel configured to transport the LLDP protocol).",
    "published": "2024-02-29T01:43:59.207",
    "keywords": "unauthenticated,command"
  },
  "CVE-2024-20321": {
    "cvss": 8.6,
    "description": "A vulnerability in the External Border Gateway Protocol (eBGP) implementation of Cisco NX-OS Software could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition on an affected device.\r\n\r This vulnerability exists because eBGP traffic is mapped to a shared hardware rate-limiter queue. An attacker could exploit this vulnerability by sending large amounts of network traffic with certain characteristics through an affected device. A successful exploit could allow the attacker to cause eBGP neighbor sessions to be dropped, leading to a DoS condition in the network.",
    "published": "2024-02-29T01:43:59.410",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20344": {
    "cvss": 5.3,
    "description": "A vulnerability in system resource management in Cisco UCS 6400 and 6500 Series Fabric Interconnects that are in Intersight Managed Mode (IMM) could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition on the Device Console UI of an affected device.\r\n\r This vulnerability is due to insufficient rate-limiting of TCP connections to an affected device. An attacker could exploit this vulnerability by sending a high number of TCP packets to the Device Console UI. A successful exploit could allow an attacker to cause the Device Console UI process to crash, resulting in a DoS condition. A manual reload of the fabric interconnect is needed to restore complete functionality.",
    "published": "2024-02-29T01:43:59.613",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-23052": {
    "url": "https://github.com/wukongopensource/wukongcrm-9.0-java/issues/28",
    "cvss": "-",
    "description": "An issue in WuKongOpenSource WukongCRM v.72crm_9.0.1_20191202 allows a remote attacker to execute arbitrary code via the parseObject() function in the fastjson component.",
    "published": "2024-02-29T01:44:07.820"
  },
  "CVE-2024-23328": {
    "cvss": 9.1,
    "description": "Dataease is an open source data visualization analysis tool. A deserialization vulnerability exists in the DataEase datasource, which can be exploited to execute arbitrary code. The location of the vulnerability code is `core/core-backend/src/main/java/io/dataease/datasource/type/Mysql.java.` The blacklist of mysql jdbc attacks can be bypassed and attackers can further exploit it for deserialized execution or reading arbitrary files. This vulnerability is patched in 1.18.15 and 2.3.0.",
    "published": "2024-02-29T01:44:08.483",
    "keywords": "execution,bypass"
  },
  "CVE-2024-23807": {
    "url": "https://github.com/apache/xerces-c/pull/54",
    "cvss": "-",
    "description": "The Apache Xerces C++ XML parser on versions 3.0.0 before 3.2.5 contains a use-after-free error triggered during the scanning of external DTDs.\n\nUsers are recommended to upgrade to version 3.2.5 which fixes the issue, or mitigate the issue by disabling DTD processing. This can be accomplished via the DOM using a standard parser feature, or via SAX using the XERCES_DISABLE_DTD environment variable.\n\nThis issue has been disclosed before as CVE-2018-1311, but unfortunately that advisory incorrectly stated the issue would be fixed in version 3.2.3 or 3.2.4.\n\n",
    "published": "2024-02-29T01:44:10.340"
  },
  "CVE-2024-24146": {
    "url": "https://github.com/libming/libming/issues/307",
    "cvss": "-",
    "description": "A memory leak issue discovered in parseSWF_DEFINEBUTTON in libming v0.4.8 allows attackers to cause s denial of service via a crafted SWF file.",
    "published": "2024-02-29T01:44:11.657"
  },
  "CVE-2024-24147": {
    "url": "https://github.com/libming/libming/issues/311",
    "cvss": "-",
    "description": "A memory leak issue discovered in parseSWF_FILLSTYLEARRAY in libming v0.4.8 allows attackers to cause s denial of service via a crafted SWF file.",
    "published": "2024-02-29T01:44:11.693"
  },
  "CVE-2024-24149": {
    "url": "https://github.com/libming/libming/issues/310",
    "cvss": "-",
    "description": "A memory leak issue discovered in parseSWF_GLYPHENTRY in libming v0.4.8 allows attackers to cause a denial of service via a crafted SWF file.",
    "published": "2024-02-29T01:44:11.737"
  },
  "CVE-2024-24150": {
    "url": "https://github.com/libming/libming/issues/309",
    "cvss": "-",
    "description": "A memory leak issue discovered in parseSWF_TEXTRECORD in libming v0.4.8 allows attackers to cause a denial of service via a crafted SWF file.",
    "published": "2024-02-29T01:44:11.777"
  },
  "CVE-2024-24155": {
    "url": "https://github.com/axiomatic-systems/bento4/issues/919",
    "cvss": "-",
    "description": "Bento4 v1.5.1-628 contains a Memory leak on AP4_Movie::AP4_Movie, parsing tracks and added into m_Tracks list, but mp42aac cannot correctly delete when we got an no audio track found error. This vulnerability allows attackers to cause a Denial of Service (DoS) via a crafted mp4 file.",
    "published": "2024-02-29T01:44:11.810"
  },
  "CVE-2024-25065": {
    "cvss": "-",
    "description": "\nPossible path traversal in Apache OFBiz allowing authentication bypass.\nUsers are recommended to upgrade to version 18.12.12, that fixes the issue.\n\n",
    "published": "2024-02-29T01:44:14.480",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-25713": {
    "cvss": "-",
    "description": "yyjson through 0.8.0 has a double free, leading to remote code execution in some cases, because the pool_free function lacks loop checks. (pool_free is part of the pool series allocator, along with pool_malloc and pool_realloc.)",
    "published": "2024-02-29T01:44:16.333",
    "keywords": "remote,execution"
  },
  "CVE-2024-25830": {
    "cvss": "-",
    "description": "F-logic DataCube3 v1.0 is vulnerable to Incorrect Access Control due to an improper directory access restriction. An unauthenticated, remote attacker can exploit this, by sending a URI that contains the path of the configuration file. A successful exploit could allow the attacker to extract the root and admin password.",
    "published": "2024-02-29T01:44:16.533",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-27516": {
    "url": "https://github.com/livehelperchat/livehelperchat/issues/2054",
    "cvss": "-",
    "description": "livehelperchat 4.28v is vulnerable to Server-Side Template Injection (SSTI).",
    "published": "2024-02-29T01:44:20.137"
  },
  "CVE-2024-27517": {
    "url": "https://github.com/webasyst/webasyst-framework/issues/377",
    "cvss": "-",
    "description": "Webasyst 2.9.9 has a Cross-Site Scripting (XSS) vulnerability, Attackers can create blogs containing malicious code after gaining blog permissions.",
    "published": "2024-02-29T01:44:20.180"
  },
  "CVE-2024-1468": {
    "cvss": 8.8,
    "description": "The Avada | Website Builder For WordPress & WooCommerce theme for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the ajax_import_options() function in all versions up to, and including, 7.11.4. This makes it possible for authenticated attackers, with contributor-level access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-02-29T04:15:06.020",
    "keywords": "remote,execution"
  },
  "CVE-2024-1981": {
    "cvss": 9.8,
    "description": "The Migration, Backup, Staging – WPvivid plugin for WordPress is vulnerable to SQL Injection via the 'table_prefix' parameter in version 0.9.68 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-02-29T07:15:06.930",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-0864": {
    "cvss": "-",
    "description": "Enabling Simple Ajax Uploader plugin included in Laragon open-source software allows for a remote code execution (RCE) attack via an improper input validation in a file_upload.php file which serves as an example.\nBy default, Laragon is not vulnerable until a user decides to use the aforementioned plugin. \n",
    "published": "2024-02-29T13:15:07.260",
    "keywords": "remote,execution"
  }
}