{
  "CVE-2024-23324": {
    "cvss": 8.6,
    "description": "Envoy is a high-performance edge/middle/service proxy. External authentication can be bypassed by downstream connections. Downstream clients can force invalid gRPC requests to be sent to ext_authz, circumventing ext_authz checks when failure_mode_allow is set to true. This issue has been addressed in released 1.29.1, 1.28.1, 1.27.3, and 1.26.7. Users are advised to upgrade. There are no known workarounds for this vulnerability.\n",
    "published": "2024-02-09T23:15:09.223",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-23724": {
    "url": "https://github.com/tryghost/ghost/pull/19646",
    "cvss": "-",
    "description": "Ghost through 5.76.0 allows stored XSS, and resultant privilege escalation in which a contributor can take over any account, via an SVG profile picture that contains JavaScript code to interact with the API on localhost TCP port 3001. NOTE: The discoverer reports that \"The vendor does not view this as a valid vector.\"",
    "published": "2024-02-11T01:15:08.080"
  },
  "CVE-2024-25715": {
    "url": "https://github.com/babelouest/glewlwyd/commit/c91c0155f2393274cc18efe77e06c6846e404c75",
    "cvss": "-",
    "description": "Glewlwyd SSO server 2.x through 2.7.6 allows open redirection via redirect_uri.",
    "published": "2024-02-11T03:15:09.453"
  },
  "CVE-2024-25728": {
    "cvss": "-",
    "description": "ExpressVPN before 12.73.0 on Windows, when split tunneling is used, sends DNS requests according to the Windows configuration (e.g., sends them to DNS servers operated by the user's ISP instead of to the ExpressVPN DNS servers), which may allow remote attackers to obtain sensitive information about websites visited by VPN users.",
    "published": "2024-02-11T22:15:08.360",
    "keywords": "remote,sensitive,vpn"
  },
  "CVE-2024-1433": {
    "url": "https://github.com/kde/plasma-workspace/commit/6cdf42916369ebf4ad5bd876c4dfa0170d7b2f01",
    "cvss": 3.1,
    "description": "A vulnerability, which was classified as problematic, was found in KDE Plasma Workspace up to 5.93.0. This affects the function EventPluginsManager::enabledPlugins of the file components/calendar/eventpluginsmanager.cpp of the component Theme File Handler. The manipulation of the argument pluginId leads to path traversal. It is possible to initiate the attack remotely. The complexity of an attack is rather high. The exploitability is told to be difficult. The patch is named 6cdf42916369ebf4ad5bd876c4dfa0170d7b2f01. It is recommended to apply a patch to fix this issue. The associated identifier of this vulnerability is VDB-253407. NOTE: This requires write access to user's home or the installation of third party global themes.",
    "published": "2024-02-11T23:15:07.850"
  }
}