{
  "CVE-2025-11953": {
    "cvss": 9.8,
    "description": "The Metro Development Server, which is opened by the React Native Community CLI, binds to external interfaces by default. The server exposes an endpoint that is vulnerable to OS command injection. This allows unauthenticated network attackers to send a POST request to the server and run arbitrary executables. On Windows, the attackers can also execute arbitrary shell commands with fully controlled arguments.",
    "published": "2025-11-03T17:15:32.677",
    "keywords": "unauthenticated,command"
  },
  "CVE-2025-63441": {
    "url": "https://github.com/opensource-socialnetwork/opensource-socialnetwork/issues/2501",
    "cvss": 7.3,
    "description": "Open Source Social Network (OSSN) 8.6 is vulnerable to Cross Site Scripting (XSS) via the parameter param` at endpoint u/administrator/friends.",
    "published": "2025-11-03T17:15:33.327"
  },
  "CVE-2025-8558": {
    "cvss": "-",
    "description": "Insider Threat Management (ITM) Server versions prior to 7.17.2 contain an authentication bypass vulnerability that allows unauthenticated users on an adjacent network to perform agent unregistration when the number of registered agents exceeds the licensed limit. Successful exploitation prevents the server from receiving new events from affected agents, resulting in a partial loss of integrity and availability with no impact to confidentiality.",
    "published": "2025-11-03T19:16:16.227",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2025-12531": {
    "cvss": 9.1,
    "description": "IBM InfoSphere Information Server 11.7.0.0 through 11.7.1.6 is vulnerable to an XML external entity injection (XXE) attack when processing XML data. A remote attacker could exploit this vulnerability to expose sensitive information or consume memory resources.",
    "published": "2025-11-03T20:17:06.247",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-43376": {
    "cvss": 7.5,
    "description": "A logic issue was addressed with improved state management. This issue is fixed in Safari 26, tvOS 26, watchOS 26, iOS 26 and iPadOS 26, visionOS 26. A remote attacker may be able to view leaked DNS queries with Private Relay turned on.",
    "published": "2025-11-04T02:15:44.710",
    "keywords": "remote,leak"
  },
  "CVE-2025-43502": {
    "cvss": 7.5,
    "description": "A privacy issue was addressed by removing sensitive data. This issue is fixed in iOS 26.1 and iPadOS 26.1, Safari 26.1, visionOS 26.1. An app may be able to bypass certain Privacy preferences.",
    "published": "2025-11-04T02:15:53.177",
    "keywords": "sensitive,bypass"
  },
  "CVE-2025-11007": {
    "cvss": 9.8,
    "description": "The CE21 Suite plugin for WordPress is vulnerable to unauthorized plugin settings update due to a missing capability check on the wp_ajax_nopriv_ce21_single_sign_on_save_api_settings AJAX action in versions 2.2.1 to 2.3.1. This makes it possible for unauthenticated attackers to update the plugin's API settings including a secret key used for authentication. This allows unauthenticated attackers to create new admin accounts on an affected site.",
    "published": "2025-11-04T04:15:36.903",
    "keywords": "unauthenticated,authentication"
  },
  "CVE-2025-11008": {
    "cvss": 9.8,
    "description": "The CE21 Suite plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 2.3.1 via the log file. This makes it possible for unauthenticated attackers to extract sensitive data including authentication credentials, which can be used to log in as other users as long as they have used the plugin's custom authentication feature before. This may include administrators, which makes a complete site takeover possible.",
    "published": "2025-11-04T04:15:37.113",
    "keywords": "unauthenticated,authentication,sensitive"
  },
  "CVE-2025-10896": {
    "cvss": 8.8,
    "description": "Multiple plugins for WordPress with the Jewel Theme Recommended Plugins Library are vulnerable to Unrestricted Upload of File with Dangerous Type via arbitrary plugin installation in all versions up to, and including, 1.0.2.3. This is due to missing capability checks on the '*_recommended_upgrade_plugin' function which allows arbitrary plugin URLs to be installed. This makes it possible for authenticated attackers with subscriber-level access and above to upload arbitrary plugin packages to the affected site's server via a crafted plugin URL, which may make remote code execution possible.",
    "published": "2025-11-04T05:15:49.360",
    "keywords": "remote,execution"
  },
  "CVE-2025-11704": {
    "cvss": 7.5,
    "description": "The Elegance Menu plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 1.9 via the 'elegance-menu' attribute of the `elegance-menu` shortcode. This makes it possible for authenticated attackers, with Contributor-level access and above, to include and execute arbitrary .php files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where .php file types can be uploaded and included.",
    "published": "2025-11-04T05:15:53.957",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2025-11724": {
    "cvss": 8.8,
    "description": "The EM Beer Manager plugin for WordPress is vulnerable to arbitrary file upload leading to remote code execution in all versions up to, and including, 3.2.3. This is due to missing file type validation in the EMBM_Admin_Untappd_Import_image() function and missing authorization checks on the wp_ajax_embm-untappd-import action. This makes it possible for authenticated attackers, with subscriber-level access and above, to upload arbitrary files including PHP files and execute code on the server granted they can provide a mock HTTP server that responds with specific JSON data.",
    "published": "2025-11-04T05:15:56.887",
    "keywords": "remote,execution"
  },
  "CVE-2025-11890": {
    "cvss": 7.5,
    "description": "The Crypto Payment Gateway with Payeer for WooCommerce plugin for WordPress is vulnerable to payment bypass in all versions up to, and including, 1.0.3. This is due to the plugin not properly verifying a payments status through server-side validation though the /wc-api/bp-payeer-gateway-callback endpoint. This makes it possible for unauthenticated attackers to update unpaid order statuses to paid resulting in a loss of revenue.",
    "published": "2025-11-04T05:16:04.337",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2025-20725": {
    "cvss": 7.5,
    "description": "In ims service, there is a possible out of bounds write due to a missing bounds check. This could lead to remote escalation of privilege, if a UE has connected to a rogue base station controlled by the attacker, with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: MOLY01671924; Issue ID: MSV-4620.",
    "published": "2025-11-04T07:15:32.113",
    "keywords": "remote,execution"
  },
  "CVE-2025-20726": {
    "cvss": 7.5,
    "description": "In Modem, there is a possible out of bounds write due to an incorrect bounds check. This could lead to remote escalation of privilege, if a UE has connected to a rogue base station controlled by the attacker, with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: MOLY01672598; Issue ID: MSV-4622.",
    "published": "2025-11-04T07:15:34.037",
    "keywords": "remote,execution"
  },
  "CVE-2025-20727": {
    "cvss": 7.5,
    "description": "In Modem, there is a possible out of bounds write due to a heap buffer overflow. This could lead to remote escalation of privilege, if a UE has connected to a rogue base station controlled by the attacker, with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: MOLY01672601; Issue ID: MSV-4623.",
    "published": "2025-11-04T07:15:34.540",
    "keywords": "remote,execution"
  },
  "CVE-2025-20742": {
    "cvss": 8.0,
    "description": "In wlan AP driver, there is a possible out of bounds write due to an incorrect bounds check. This could lead to remote (proximal/adjacent) escalation of privilege with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: WCNCR00432680; Issue ID: MSV-3949.",
    "published": "2025-11-04T07:15:45.627",
    "keywords": "remote,execution"
  },
  "CVE-2025-12493": {
    "cvss": 9.8,
    "description": "The ShopLentor – WooCommerce Builder for Elementor & Gutenberg +21 Modules – All in One Solution (formerly WooLentor) plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 3.2.5 via the 'load_template' function. This makes it possible for unauthenticated attackers to include and execute arbitrary .php files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where .php file types can be uploaded and included.",
    "published": "2025-11-04T12:15:36.957",
    "keywords": "execution,unauthenticated,sensitive,bypass"
  },
  "CVE-2025-12682": {
    "cvss": 9.8,
    "description": "The Easy Upload Files During Checkout plugin for WordPress is vulnerable to arbitrary JavaScript file uploads due to missing file type validation in the 'file_during_checkout' function in all versions up to, and including, 2.9.8. This makes it possible for unauthenticated attackers to upload arbitrary JavaScript files on the affected site's server which may make remote code execution possible.",
    "published": "2025-11-04T14:15:33.377",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2025-54863": {
    "cvss": 10.0,
    "description": "Radiometrics VizAir is vulnerable to exposure of the system's REST API key through a publicly accessible configuration file. This allows attackers to remotely alter weather data and configurations, automate attacks against multiple instances, and extract sensitive meteorological data, which could potentially compromise airport operations. Additionally, attackers could flood the system with false alerts, leading to a denial-of-service condition and significant disruption to airport operations. Unauthorized remote control over aviation weather monitoring and data manipulation could result in incorrect flight planning and hazardous takeoff and landing conditions.",
    "published": "2025-11-04T17:16:22.967",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-61945": {
    "cvss": 10.0,
    "description": "Radiometrics VizAir is vulnerable to any remote attacker via access to the admin panel of the VizAir system without authentication. Once inside, the attacker can modify critical weather parameters such as wind shear alerts, inversion depth, and CAPE values, which are essential for accurate weather forecasting and flight safety. This unauthorized access could result in the disabling of vital alerts, causing hazardous conditions for aircraft, and manipulating runway assignments, which could result in mid-air conflicts or runway incursions.",
    "published": "2025-11-04T17:16:23.320",
    "keywords": "remote,authentication"
  },
  "CVE-2025-62369": {
    "cvss": 7.2,
    "description": "Xibo is an open source digital signage platform with a web content management system (CMS). Versions 4.3.0 and below contain a Remote Code Execution vulnerability in the CMS Developer menu's Module Templating functionality, allowing authenticated users with \"System -> Add/Edit custom modules and templates\" permissions to manipulate Twig filters and execute arbitrary server-side functions as the web server user. This issue is fixed in version 4.3.1. To workaround this issue, use the 4.1 and 4.2 patch commits.",
    "published": "2025-11-04T22:16:38.160",
    "keywords": "remote,execution"
  },
  "CVE-2025-62507": {
    "cvss": "-",
    "description": "Redis is an open source, in-memory database that persists on disk. In versions 8.2.0 and above, a user can run the XACKDEL command with multiple ID's and trigger a stack buffer overflow, which may potentially lead to remote code execution. This issue is fixed in version 8.2.3. To workaround this issue without patching the redis-server executable is to prevent users from executing XACKDEL operation. This can be done using ACL to restrict XACKDEL command.",
    "published": "2025-11-04T22:16:38.330",
    "keywords": "remote,execution,command"
  },
  "CVE-2025-64106": {
    "cvss": 8.8,
    "description": "Cursor is a code editor built for programming with AI. In versions 1.7.28 and below, an input validation flaw in Cursor's MCP server installation enables specially crafted deep-links to bypass the standard security warnings and conceal executed commands from users if they choose to accept the server. If an attacker is able to convince a victim to navigate to a malicious deeplink, the victim will not see the correct speedbump modal, and if they choose to accept, will execute commands specified by the attackers deeplink.",
    "published": "2025-11-04T23:15:44.170",
    "keywords": "command,bypass"
  },
  "CVE-2025-64109": {
    "cvss": 8.8,
    "description": "Cursor is a code editor built for programming with AI. In versions and below, a vulnerability in the Cursor CLI Beta allowed an attacker to achieve remote code execution through the MCP (Model Context Protocol) server mechanism by uploading a malicious MCP configuration in .cursor/mcp.json file in a GitHub repository. Once a victim clones the project and opens it using Cursor CLI, the command to run the malicious MCP server is immediately executed without any warning, leading to potential code execution as soon as the command runs. This issue is fixed in version 2025.09.17-25b418f.",
    "published": "2025-11-05T00:15:34.810",
    "keywords": "remote,execution,command"
  },
  "CVE-2025-12735": {
    "url": "https://github.com/silentmatt/expr-eval/pull/288",
    "cvss": 9.8,
    "description": "The expr-eval library is a JavaScript expression parser and evaluator designed to safely evaluate mathematical expressions with user-defined variables. However, due to insufficient input validation, an attacker can pass a crafted variables object into the evaluate() function and trigger arbitrary code execution.",
    "published": "2025-11-05T01:15:33.313"
  },
  "CVE-2025-8871": {
    "cvss": 5.6,
    "description": "The Everest Forms (Pro) plugin for WordPress is vulnerable to PHP Object Injection in all versions up to, and including, 1.9.7 via deserialization of untrusted input in the mime_content_type() function. This makes it possible for unauthenticated attackers to inject a PHP Object. This vulnerability may be exploited by unauthenticated attackers when a form is present on the site with a non-required signature form field along with an image upload field. No known POP chain is present in the vulnerable software, which means this vulnerability has no impact unless another plugin or theme containing a POP chain is installed on the site. If a POP chain is present via an additional plugin or theme installed on the target system, it may allow the attacker to perform actions like delete arbitrary files, retrieve sensitive data, or execute code depending on the POP chain present. This vulnerability is only exploitable in PHP versions prior to 8.",
    "published": "2025-11-05T03:15:42.880",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-12197": {
    "cvss": 7.5,
    "description": "The The Events Calendar plugin for WordPress is vulnerable to blind SQL Injection via the 's' parameter in versions 6.15.1.1 to 6.15.9 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2025-11-05T05:15:51.590",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-11749": {
    "cvss": 9.8,
    "description": "The AI Engine plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 3.1.3 via the /mcp/v1/ REST API endpoint that exposes the 'Bearer Token' value when 'No-Auth URL' is enabled. This makes it possible for unauthenticated attackers to extract the bearer token, which can be used to gain access to a valid session and perform many actions like creating a new administrator account, leading to privilege escalation.",
    "published": "2025-11-05T06:15:33.097",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-12139": {
    "cvss": 7.5,
    "description": "The File Manager for Google Drive – Integrate Google Drive with WordPress plugin for WordPress is vulnerable to sensitive information exposure in all versions up to, and including, 1.5.3 via the \"get_localize_data\" function. This makes it possible for unauthenticated attackers to extract sensitive data including Google OAuth credentials (client_id and client_secret) and Google account email addresses.",
    "published": "2025-11-05T07:15:32.340",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-10622": {
    "cvss": 8.0,
    "description": "A flaw was found in Red Hat Satellite (Foreman component). This vulnerability allows an authenticated user with edit_settings permissions to achieve arbitrary command execution on the underlying operating system via insufficient server-side validation of command whitelisting.",
    "published": "2025-11-05T08:15:32.990",
    "keywords": "execution,command"
  },
  "CVE-2025-12674": {
    "cvss": 9.8,
    "description": "The KiotViet Sync plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the create_media() function in all versions up to, and including, 1.8.5. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2025-11-05T08:15:33.313",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2025-12676": {
    "cvss": 5.3,
    "description": "The KiotViet Sync plugin for WordPress is vulnerable to authorizarion bypass in all versions up to, and including, 1.8.5. This is due to the plugin using a hardcoded password for authentication in the QueryControllerAdmin::authenticated function. This makes it possible for unauthenticated attackers to create and sync products.",
    "published": "2025-11-05T08:15:33.680",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2025-12677": {
    "cvss": 5.3,
    "description": "The KiotViet Sync plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 1.8.5 via the register_api_route() function in kiotvietsync/includes/public_actions/WebHookAction.php. This makes it possible for unauthenticated attackers to extract the webhook token value when configured.",
    "published": "2025-11-05T08:15:33.843",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-55108": {
    "cvss": 10.0,
    "description": "The Control-M/Agent is vulnerable to unauthenticated remote code execution, arbitrary file read and write and similar unauthorized actions when mutual SSL/TLS authentication is not enabled (i.e. in the default configuration).\n\n\nNOTE: The vendor believes that this vulnerability only occurs when documented security best practices are not followed. BMC has always strongly recommended to use security best practices such as configuring SSL/TLS between Control-M Server and Agent.",
    "published": "2025-11-05T09:15:32.170",
    "keywords": "remote,execution,unauthenticated,authentication"
  },
  "CVE-2025-12468": {
    "cvss": 5.3,
    "description": "The FunnelKit Automations – Email Marketing Automation and CRM for WordPress & WooCommerce plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 3.6.4.1 via the '/wc-coupons/' REST API endpoint. This is due to the endpoint being marked as a public API (`public_api = true`), which results in the endpoint being registered with `permission_callback => '__return_true'`, bypassing all authentication and capability checks. This makes it possible for unauthenticated attackers to extract sensitive data including all WooCommerce coupon codes, coupon IDs, and expiration status.",
    "published": "2025-11-05T10:15:35.463",
    "keywords": "unauthenticated,authentication,sensitive,bypass"
  },
  "CVE-2025-12497": {
    "cvss": 8.1,
    "description": "The Premium Portfolio Features for Phlox theme plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 2.3.10 via the 'args[extra_template_path]' parameter. This makes it possible for unauthenticated attackers to include and execute arbitrary .php files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where .php file types can be uploaded and included.",
    "published": "2025-11-05T12:15:33.347",
    "keywords": "execution,unauthenticated,sensitive,bypass"
  },
  "CVE-2025-3125": {
    "cvss": 6.7,
    "description": "An arbitrary file upload vulnerability exists in multiple WSO2 products due to improper input validation in the CarbonAppUploader admin service endpoint. An authenticated attacker with appropriate privileges can upload a malicious file to a user-controlled location on the server, potentially leading to remote code execution (RCE).\n\nThis functionality is restricted by default to admin users; therefore, successful exploitation requires valid credentials with administrative permissions.",
    "published": "2025-11-05T15:15:33.953",
    "keywords": "remote,execution"
  },
  "CVE-2025-60753": {
    "url": "https://github.com/libarchive/libarchive/issues/2725",
    "cvss": 5.5,
    "description": "An issue was discovered in libarchive bsdtar before version 3.8.1 in function apply_substitution in file tar/subst.c when processing crafted -s substitution rules. This can cause unbounded memory allocation and lead to denial of service (Out-of-Memory crash).",
    "published": "2025-11-05T16:15:40.430"
  },
  "CVE-2025-63601": {
    "cvss": 9.9,
    "description": "Snipe-IT before version 8.3.3 contains a remote code execution vulnerability that allows an authenticated attacker to upload a malicious backup file containing arbitrary files and execute system commands.",
    "published": "2025-11-05T16:15:40.897",
    "keywords": "remote,execution,command"
  },
  "CVE-2025-20289": {
    "cvss": 4.8,
    "description": "Multiple vulnerabilities in the web-based management interface of Cisco ISE and Cisco ISE-PIC could allow an authenticated, remote attacker to conduct a reflected XSS attack against a user of the interface.\r\n\r These vulnerabilities are due to insufficient validation of user-supplied input by the web-based management interface of an affected system. An attacker could exploit these vulnerabilities by injecting malicious code into specific pages of the interface. A successful exploit could allow the attacker to execute arbitrary script code in the context of the affected interface or access sensitive, browser-based information. To exploit these vulnerabilities, the attacker must have at least a low-privileged account on the affected device.",
    "published": "2025-11-05T17:15:35.867",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-20303": {
    "cvss": 5.4,
    "description": "Multiple vulnerabilities in the web-based management interface of Cisco ISE and Cisco ISE-PIC could allow an authenticated, remote attacker to conduct a reflected XSS attack against a user of the interface.\r\n\r These vulnerabilities are due to insufficient validation of user-supplied input by the web-based management interface of an affected system. An attacker could exploit these vulnerabilities by injecting malicious code into specific pages of the interface. A successful exploit could allow the attacker to execute arbitrary script code in the context of the affected interface or access sensitive, browser-based information. To exploit these vulnerabilities, the attacker must have at least a low-privileged account on the affected device.",
    "published": "2025-11-05T17:15:36.737",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-20304": {
    "cvss": 5.4,
    "description": "Multiple vulnerabilities in the web-based management interface of Cisco ISE and Cisco ISE-PIC could allow an authenticated, remote attacker to conduct a reflected XSS attack against a user of the interface.\r\n\r These vulnerabilities are due to insufficient validation of user-supplied input by the web-based management interface of an affected system. An attacker could exploit these vulnerabilities by injecting malicious code into specific pages of the interface. A successful exploit could allow the attacker to execute arbitrary script code in the context of the affected interface or access sensitive, browser-based information. To exploit these vulnerabilities, the attacker must have at least a low-privileged account on the affected device.",
    "published": "2025-11-05T17:15:36.957",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-20305": {
    "cvss": 4.3,
    "description": "A vulnerability in the web-based management interface of Cisco ISE could allow an authenticated, remote attacker to obtain sensitive information from an affected device.\r\n\r This vulnerability exists because certain files lack proper data protection mechanisms. An attacker with read-only Administrator privileges could exploit this vulnerability by performing actions where the results should only be viewable to a high-privileged user. A successful exploit could allow the attacker to view passwords that are normally not visible to read-only administrators.",
    "published": "2025-11-05T17:15:37.170",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-20343": {
    "cvss": 8.6,
    "description": "A vulnerability in the RADIUS setting Reject RADIUS requests from clients with repeated failures on Cisco Identity Services Engine (ISE) could allow an unauthenticated, remote attacker to cause Cisco ISE to restart unexpectedly.\r\n\r\nThis vulnerability is due to a logic error when processing a RADIUS access request for a MAC address that is already a rejected endpoint. An attacker could exploit this vulnerability by sending a specific sequence of multiple crafted RADIUS access request messages to Cisco ISE. A successful exploit could allow the attacker to cause a denial of service (DoS) condition when Cisco ISE restarts.",
    "published": "2025-11-05T17:15:37.443",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-20354": {
    "cvss": 9.8,
    "description": "A vulnerability in the Java Remote Method Invocation (RMI) process of Cisco Unified CCX could allow an unauthenticated, remote attacker to upload arbitrary files and execute arbitrary commands with root permissions on an affected system.\r\n\r\nThis vulnerability is due to improper authentication mechanisms that are associated to specific Cisco Unified CCX features. An attacker could exploit this vulnerability by uploading a crafted file to an affected system through the Java RMI process. A successful exploit could allow the attacker to execute arbitrary commands on the underlying operating system and elevate privileges to root.",
    "published": "2025-11-05T17:15:37.743",
    "keywords": "remote,unauthenticated,authentication,command"
  },
  "CVE-2025-20358": {
    "cvss": 9.4,
    "description": "A vulnerability in the Contact Center Express (CCX) Editor application of Cisco Unified CCX could allow an unauthenticated, remote attacker to bypass authentication and obtain administrative permissions pertaining to script creation and execution.\r\n\r\nThis vulnerability is due to improper authentication mechanisms in the communication between the CCX Editor and an affected Unified CCX server. An attacker could exploit this vulnerability by redirecting the authentication flow to a malicious server and tricking the CCX Editor into believing the authentication was successful. A successful exploit could allow the attacker to create and execute arbitrary scripts on the underlying operating system of an affected Unified CCX server, as an internal non-root user account.",
    "published": "2025-11-05T17:15:38.120",
    "keywords": "remote,execution,unauthenticated,authentication,bypass"
  },
  "CVE-2025-20376": {
    "cvss": 6.5,
    "description": "A vulnerability in the web UI of Cisco Unified CCX could allow an authenticated, remote attacker to upload and execute arbitrary files.\r\n\r\nThis vulnerability is due to an insufficient input validation associated to file upload mechanisms. An attacker could exploit this vulnerability by uploading a malicious file to the web UI and executing it. A successful exploit could allow the attacker to execute arbitrary commands on the underlying system and elevate privileges to root. To exploit this vulnerability, the attacker must have valid administrative credentials.",
    "published": "2025-11-05T17:15:38.953",
    "keywords": "remote,command"
  },
  "CVE-2025-20377": {
    "cvss": 4.3,
    "description": "A vulnerability in the API subsystem of Cisco Unified Intelligence Center could allow an authenticated, remote attacker to obtain sensitive information from an affected system.\r\n\r\nThis vulnerability is due to improper validation of requests to certain API endpoints. An attacker could exploit this vulnerability by sending a valid request to a specific API endpoint within the affected system. A successful exploit could allow a low-privileged user to view sensitive information on the affected system that should be restricted. To exploit this vulnerability, the attacker must have valid user credentials on the affected system.",
    "published": "2025-11-05T17:15:39.200",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-43990": {
    "cvss": 7.3,
    "description": "Dell Command Monitor (DCM), versions prior to 10.12.3.28, contains an Execution with Unnecessary Privileges vulnerability. A low privileged attacker with local access could potentially exploit this vulnerability, leading to Elevation of Privileges.",
    "published": "2025-11-05T17:15:40.210",
    "keywords": "execution,command"
  },
  "CVE-2025-10713": {
    "cvss": 6.5,
    "description": "An XML External Entity (XXE) vulnerability exists in multiple WSO2 products due to improper configuration of the XML parser. The application parses user-supplied XML without applying sufficient restrictions, allowing resolution of external entities.\n\nA successful attack could enable a remote, unauthenticated attacker to read sensitive files from the server's filesystem or perform denial-of-service (DoS) attacks that render affected services unavailable.",
    "published": "2025-11-05T18:15:32.247",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2025-10907": {
    "cvss": 8.4,
    "description": "An arbitrary file upload vulnerability exists in multiple WSO2 products due to insufficient validation of uploaded content and destination in SOAP admin services. A malicious actor with administrative privileges can upload a specially crafted file to a user-controlled location within the deployment.\n\nSuccessful exploitation may lead to remote code execution (RCE) on the server, depending on how the uploaded file is processed. By default, this vulnerability is only exploitable by users with administrative access to the affected SOAP services.",
    "published": "2025-11-05T18:15:33.347",
    "keywords": "remote,execution"
  },
  "CVE-2025-12745": {
    "url": "https://github.com/bellard/quickjs/commit/c6fe5a98fd3ef3b7064e6e0145dfebfe12449fea",
    "cvss": 5.3,
    "description": "A weakness has been identified in QuickJS up to eb2c89087def1829ed99630cb14b549d7a98408c. This affects the function js_array_buffer_slice of the file quickjs.c. This manipulation causes buffer over-read. The attack is restricted to local execution. The exploit has been made available to the public and could be exploited. This product adopts a rolling release strategy to maintain continuous delivery Patch name: c6fe5a98fd3ef3b7064e6e0145dfebfe12449fea. To fix this issue, it is recommended to deploy a patch.",
    "published": "2025-11-05T19:15:50.390"
  },
  "CVE-2025-63334": {
    "cvss": 9.8,
    "description": "PocketVJ CP PocketVJ-CP-v3 pvj version 3.9.1 contains an unauthenticated remote code execution vulnerability in the submit_opacity.php component. The application fails to sanitize user input in the opacityValue POST parameter before passing it to a shell command, allowing remote attackers to execute arbitrary commands with root privileges on the underlying system.",
    "published": "2025-11-05T20:15:36.507",
    "keywords": "remote,execution,unauthenticated,command"
  },
  "CVE-2025-63585": {
    "url": "https://github.com/opensource-socialnetwork/opensource-socialnetwork/issues/2503",
    "cvss": "-",
    "description": "OSSN (Open Source Social Network) 8.6 is vulnerable to SQL Injection in /action/rtcomments/status via the timestamp parameter.",
    "published": "2025-11-05T21:15:36.357"
  },
  "CVE-2025-55278": {
    "cvss": 8.1,
    "description": "Improper authentication in the API authentication middleware of HCL DevOps Loop allows authentication tokens to be accepted without proper validation of their expiration and cryptographic signature.  As a result, an attacker could potentially use expired or tampered tokens to gain unauthorized access to sensitive resources and perform actions with elevated privileges.",
    "published": "2025-11-05T23:16:05.147",
    "keywords": "authentication,sensitive"
  },
  "CVE-2025-11271": {
    "cvss": 5.3,
    "description": "The Easy Digital Downloads plugin for WordPress is vulnerable to Order Manipulation in all versions up to, and including, 3.5.2 due to an order verification bypass. The verification is unconditionally skipped when the POST body includes verification_override=1. Because this value is attacker-supplied, an unauthenticated actor can submit a forged IPN and have it treated as verified, even on production sites and with verification otherwise enabled. A valid PayPal transaction id is needed, restricting order manipulation to orders placed by the attacker.  This, in turn, requires them to have a customer account.",
    "published": "2025-11-06T05:15:54.917",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2025-11268": {
    "cvss": 4.3,
    "description": "The Strong Testimonials plugin for WordPress is vulnerable to arbitrary shortcode execution in all versions up to, and including, 3.2.16. This is due to the software allowing users to submit a testimonial in which a value is not properly validated or sanitized prior to being passed to a do_shortcode call. This makes it possible for unauthenticated attackers to execute arbitrary shortcodes if an administrator previews or publishes a crafted testimonial.",
    "published": "2025-11-06T09:15:33.197",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2025-58595": {
    "cvss": "-",
    "description": "Authentication Bypass by Spoofing vulnerability in Saad Iqbal All In One Login change-wp-admin-login allows Identity Spoofing.This issue affects All In One Login: from n/a through <= 2.0.8.",
    "published": "2025-11-06T16:15:59.233",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-62064": {
    "cvss": "-",
    "description": "Authentication Bypass Using an Alternate Path or Channel vulnerability in Elated-Themes Search & Go search-and-go allows Password Recovery Exploitation.This issue affects Search & Go: from n/a through <= 2.7.",
    "published": "2025-11-06T16:16:12.327",
    "keywords": "authentication,bypass"
  }
}