{
  "CVE-2024-28757": {
    "url": "https://github.com/libexpat/libexpat/pull/842",
    "cvss": "-",
    "description": "libexpat through 2.6.1 allows an XML Entity Expansion attack when there is isolated use of external parsers (created via XML_ExternalEntityParserCreate).",
    "published": "2024-03-10T05:15:06.570"
  },
  "CVE-2024-2353": {
    "cvss": 8.8,
    "description": "A vulnerability, which was classified as critical, has been found in Totolink X6000R 9.4.0cu.852_20230719. This issue affects the function setDiagnosisCfg of the file /cgi-bin/cstecgi.cgi of the component shttpd. The manipulation of the argument ip leads to os command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-256313 was assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-03-10T08:15:05.920",
    "keywords": "remote,command"
  },
  "CVE-2024-2355": {
    "cvss": 3.7,
    "description": "A vulnerability has been found in keerti1924 Secret-Coder-PHP-Project 1.0 and classified as problematic. Affected by this vulnerability is an unknown functionality of the file /secret_coder.sql. The manipulation leads to inclusion of sensitive information in source code. The attack can be launched remotely. The complexity of an attack is rather high. The exploitation appears to be difficult. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-256315. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-03-10T12:15:06.613",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-2314": {
    "url": "https://github.com/iovisor/bcc/commit/008ea09e891194c072f2a9305a3c872a241dc342",
    "cvss": 2.8,
    "description": "If kernel headers need to be extracted, bcc will attempt to load them from a temporary directory. An unprivileged attacker could use this to force bcc to load compromised linux headers. Linux distributions which provide kernel headers by default are not affected by default.",
    "published": "2024-03-10T23:15:53.967"
  },
  "CVE-2024-28816": {
    "url": "https://github.com/aaravrajsingh/chatbot/pull/10",
    "cvss": "-",
    "description": "Student Information Chatbot a0196ab allows SQL injection via the username to the login function in index.php.",
    "published": "2024-03-11T03:15:05.943"
  },
  "CVE-2024-28823": {
    "url": "https://github.com/awslabs/aws-js-s3-explorer/commit/f62f12960d081895960d0dc6fde8364f25d651b6",
    "cvss": "-",
    "description": "Amazon AWS aws-js-s3-explorer (aka AWS JavaScript S3 Explorer) 1.0.0 allows XSS via a crafted S3 bucket name to index.html.",
    "published": "2024-03-11T05:15:05.930"
  },
  "CVE-2024-23608": {
    "cvss": 7.8,
    "description": "An out of bounds write due to a missing bounds check in LabVIEW may result in remote code execution.  Successful exploitation requires an attacker to provide a user with a specially crafted VI.  This vulnerability affects LabVIEW 2024 Q1 and prior versions.\n",
    "published": "2024-03-11T16:15:07.897",
    "keywords": "remote,execution"
  },
  "CVE-2024-23609": {
    "cvss": 7.8,
    "description": "An improper error handling vulnerability in LabVIEW may result in remote code execution.  Successful exploitation requires an attacker to provide a user with a specially crafted VI.  This vulnerability affects LabVIEW 2024 Q1 and prior versions.\n\n",
    "published": "2024-03-11T16:15:08.157",
    "keywords": "remote,execution"
  },
  "CVE-2024-23610": {
    "cvss": 7.8,
    "description": "An out of bounds write due to a missing bounds check in LabVIEW may result in remote code execution. Successful exploitation requires an attacker to provide a user with a specially crafted VI. This vulnerability affects LabVIEW 2024 Q1 and prior versions.\n\n\n",
    "published": "2024-03-11T16:15:08.370",
    "keywords": "remote,execution"
  },
  "CVE-2024-23611": {
    "cvss": 7.8,
    "description": "An out of bounds write due to a missing bounds check in LabVIEW may result in remote code execution. Successful exploitation requires an attacker to provide a user with a specially crafted VI. This vulnerability affects LabVIEW 2024 Q1 and prior versions.\n\n",
    "published": "2024-03-11T16:15:08.557",
    "keywords": "remote,execution"
  },
  "CVE-2024-23612": {
    "cvss": 7.8,
    "description": "An improper error handling vulnerability in LabVIEW may result in remote code execution.  Successful exploitation requires an attacker to provide a user with a specially crafted VI.  This vulnerability affects LabVIEW 2024 Q1 and prior versions.\n\n",
    "published": "2024-03-11T16:15:08.743",
    "keywords": "remote,execution"
  },
  "CVE-2024-0039": {
    "cvss": "-",
    "description": "In attp_build_value_cmd of att_protocol.cc, there is a possible out of bounds write due to a missing bounds check. This could lead to remote code execution with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-03-11T17:15:45.350",
    "keywords": "remote,execution"
  },
  "CVE-2024-0045": {
    "cvss": "-",
    "description": "In smp_proc_sec_req of smp_act.cc, there is a possible out of bounds read due to improper input validation. This could lead to remote (proximal/adjacent) information disclosure with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-03-11T17:15:45.507",
    "keywords": "remote,execution"
  },
  "CVE-2024-0046": {
    "cvss": "-",
    "description": "In installExistingPackageAsUser of InstallPackageHelper.java, there is a possible carrier restriction bypass due to a logic error in the code. This could lead to local escalation of privilege with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-03-11T17:15:45.563",
    "keywords": "execution,bypass"
  },
  "CVE-2024-0052": {
    "cvss": "-",
    "description": "In multiple functions of healthconnect, there is a possible leakage of exercise route data due to a missing permission check. This could lead to local information disclosure with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-03-11T17:15:45.897",
    "keywords": "execution,leak"
  },
  "CVE-2024-23717": {
    "cvss": "-",
    "description": "In access_secure_service_from_temp_bond of btm_sec.cc, there is a possible way to achieve keystroke injection due to improper input validation. This could lead to remote (proximal/adjacent) escalation of privilege with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-03-11T17:15:46.253",
    "keywords": "remote,execution"
  },
  "CVE-2024-1279": {
    "cvss": "-",
    "description": "The Paid Memberships Pro WordPress plugin before 2.12.9 does not prevent user with at least the contributor role from leaking other users' sensitive metadata.",
    "published": "2024-03-11T18:15:17.950",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-1290": {
    "cvss": "-",
    "description": "The User Registration WordPress plugin before 2.12 does not prevent users with at least the contributor role from rendering sensitive shortcodes, allowing them to generate, and leak, valid password reset URLs, which they can use to take over any accounts.",
    "published": "2024-03-11T18:15:18.003",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-22005": {
    "cvss": "-",
    "description": "In TBD of TBD, there is a possible Authentication Bypass due to improperly used crypto. This could lead to local escalation of privilege with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-03-11T19:15:47.120",
    "keywords": "execution,authentication,bypass"
  },
  "CVE-2024-22011": {
    "cvss": "-",
    "description": "In ss_ProcessRejectComponent of ss_MmConManagement.c, there is a possible out of bounds read due to a missing bounds check. This could lead to remote information disclosure with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-03-11T19:15:47.413",
    "keywords": "remote,execution"
  },
  "CVE-2024-25987": {
    "cvss": "-",
    "description": "In pt_sysctl_command of pt.c, there is a possible out of bounds write due to an incorrect bounds check. This could lead to local escalation of privilege with System execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-03-11T19:15:47.603",
    "keywords": "execution,command"
  },
  "CVE-2024-25988": {
    "cvss": "-",
    "description": "In SAEMM_DiscloseGuti of SAEMM_RadioMessageCodec.c, there is a possible out of bounds read due to a missing bounds check. This could lead to remote information disclosure with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-03-11T19:15:47.650",
    "keywords": "remote,execution"
  },
  "CVE-2024-27206": {
    "cvss": "-",
    "description": "In tbd of tbd, there is a possible out of bounds read due to a missing bounds check. This could lead to remote information disclosure with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-03-11T19:15:48.020",
    "keywords": "remote,execution"
  },
  "CVE-2024-27213": {
    "cvss": "-",
    "description": "In BroadcastSystemMessage of servicemgr.cpp, there is a possible Remote Code Execution due to a use after free. This could lead to local escalation of privilege with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-03-11T19:15:48.333",
    "keywords": "remote,execution"
  },
  "CVE-2024-27223": {
    "cvss": "-",
    "description": "In EUTRAN_LCS_DecodeFacilityInformationElement of LPP_LcsManagement.c, there is a possible out of bounds read due to a missing bounds check. This could lead to remote information disclosure after authenticating the cell connection with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-03-11T19:15:48.603",
    "keywords": "remote,execution"
  },
  "CVE-2024-27225": {
    "cvss": "-",
    "description": "In sendHciCommand of bluetooth_hci.cc, there is a possible out of bounds read due to a heap buffer overflow. This could lead to local information disclosure with System execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-03-11T19:15:48.693",
    "keywords": "execution,command"
  },
  "CVE-2024-27227": {
    "cvss": "-",
    "description": "Android kernel allows Remote code execution.",
    "published": "2024-03-11T19:15:48.783",
    "keywords": "remote,execution"
  },
  "CVE-2024-27228": {
    "cvss": "-",
    "description": "In TBD of TBD, there is a possible out of bounds write due to a heap buffer overflow. This could lead to remote code execution with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-03-11T19:15:48.827",
    "keywords": "remote,execution"
  },
  "CVE-2024-27229": {
    "cvss": "-",
    "description": "In ss_SendCallBarringPwdRequiredIndMsg of ss_CallBarring.c, there is a possible null pointer deref due to a missing null check. This could lead to remote denial of service with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-03-11T19:15:48.873",
    "keywords": "remote,execution"
  },
  "CVE-2024-27233": {
    "cvss": "-",
    "description": "In ppcfw_init_secpolicy of ppcfw.c, there is a possible permission bypass due to uninitialized data. This could lead to local escalation of privilege with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-03-11T19:15:48.963",
    "keywords": "execution,bypass"
  },
  "CVE-2024-28199": {
    "url": "https://github.com/phlex-ruby/phlex/commit/aa50c604cdee1d0ce7ef068a4c66cbd5d43f96a1",
    "cvss": 7.1,
    "description": "phlex is an open source framework for building object-oriented views in Ruby. There is a potential cross-site scripting (XSS) vulnerability that can be exploited via maliciously crafted user data. This was due to improper case-sensitivity in the code that was meant to prevent these attacks. If you render an `<a>` tag with an `href` attribute set to a user-provided link, that link could potentially execute JavaScript when clicked by another user. If you splat user-provided attributes when rendering any HTML tag, malicious event attributes could be included in the output, executing JavaScript when the events are triggered by another user. Patches are available on RubyGems for all 1.x minor versions. Users are advised to upgrade. Users unable to upgrade should consider configuring a content security policy that does not allow `unsafe-inline`.",
    "published": "2024-03-11T23:15:47.333"
  },
  "CVE-2024-26521": {
    "cvss": "-",
    "description": "HTML Injection vulnerability in CE Phoenix v1.0.8.20 and before allows a remote attacker to execute arbitrary code, escalate privileges, and obtain sensitive information via a crafted payload to the english.php component.",
    "published": "2024-03-12T05:15:47.653",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-25331": {
    "cvss": "-",
    "description": "DIR-822 Rev. B Firmware v2.02KRB09 and DIR-822-CA Rev. B Firmware v2.03WWb01 suffer from a LAN-Side Unauthenticated Remote Code Execution (RCE) vulnerability elevated from HNAP Stack-Based Buffer Overflow.",
    "published": "2024-03-12T06:15:07.970",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-0906": {
    "cvss": 5.3,
    "description": "The f(x) Private Site plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 1.2.1 via the API. This makes it possible for unauthenticated attackers to obtain page and post contents of a site protected with this plugin.",
    "published": "2024-03-12T09:15:06.670",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-25994": {
    "cvss": 5.3,
    "description": "An unauthenticated remote attacker can upload a arbitrary script file due to improper input validation. The upload destination is fixed and is write only.",
    "published": "2024-03-12T09:15:07.080",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-25995": {
    "cvss": 9.8,
    "description": "An unauthenticated remote attacker can modify configurations to perform a remote code execution due to a missing authentication for a critical function.",
    "published": "2024-03-12T09:15:07.343",
    "keywords": "remote,execution,unauthenticated,authentication"
  },
  "CVE-2024-25996": {
    "cvss": 5.3,
    "description": "An unauthenticated remote attacker can perform a remote code execution due to an origin validation error. The access is limited to the service user.",
    "published": "2024-03-12T09:15:07.573",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-25997": {
    "cvss": 5.3,
    "description": "An unauthenticated remote attacker can perform a log injection due to improper input validation. Only a certain log file is affected.\n\n",
    "published": "2024-03-12T09:15:07.810",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-25998": {
    "cvss": 7.3,
    "description": "An unauthenticated remote attacker can perform a command injection in the OCPP Service with limited privileges due to improper input validation.\n\n",
    "published": "2024-03-12T09:15:08.020",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-26000": {
    "cvss": 5.9,
    "description": "An unauthenticated remote attacker can read memory out of bounds due to improper input validation in the MQTT stack. The brute force attack is not always successful because of memory randomization. ",
    "published": "2024-03-12T09:15:08.493",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-26001": {
    "cvss": 7.4,
    "description": "An unauthenticated remote attacker can write memory out of bounds due to improper input validation in the MQTT stack. The brute force attack is not always successful because of memory randomization. \n",
    "published": "2024-03-12T09:15:08.730",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-26003": {
    "cvss": 7.5,
    "description": "An unauthenticated remote attacker can DoS the control agent due to a out-of-bounds read which may prevent or disrupt the charging functionality. ",
    "published": "2024-03-12T09:15:09.140",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-26004": {
    "cvss": 7.5,
    "description": "An unauthenticated remote attacker can DoS a control agent due to access of a uninitialized pointer which may prevent or disrupt the charging functionality. ",
    "published": "2024-03-12T09:15:09.357",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-26005": {
    "cvss": 4.8,
    "description": "An unauthenticated remote attacker can gain service level privileges through an incomplete cleanup during service restart after a DoS. ",
    "published": "2024-03-12T09:15:09.577",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-26288": {
    "cvss": 8.7,
    "description": "An unauthenticated remote attacker can influence the communication due to the lack of encryption of sensitive data via a MITM. Charging is not affected.",
    "published": "2024-03-12T09:15:09.823",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-22039": {
    "cvss": 10.0,
    "description": "A vulnerability has been identified in Cerberus PRO EN Engineering Tool (All versions < IP8), Cerberus PRO EN Fire Panel FC72x (All versions < IP8), Cerberus PRO EN X200 Cloud Distribution (All versions < V4.0.5016), Cerberus PRO EN X300 Cloud Distribution (All versions < V4.2.5015), Sinteso FS20 EN Engineering Tool (All versions < MP8), Sinteso FS20 EN Fire Panel FC20 (All versions < MP8), Sinteso FS20 EN X200 Cloud Distribution (All versions < V4.0.5016), Sinteso FS20 EN X300 Cloud Distribution (All versions < V4.2.5015), Sinteso Mobile (All versions < V3.0.0). The network communication library in affected systems does not validate the length of certain X.509 certificate attributes which might result in a stack-based buffer overflow.\r\nThis could allow an unauthenticated remote attacker to execute code on the underlying operating system with root privileges.",
    "published": "2024-03-12T11:15:48.420",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-22040": {
    "cvss": 7.5,
    "description": "A vulnerability has been identified in Cerberus PRO EN Engineering Tool (All versions), Cerberus PRO EN Fire Panel FC72x (All versions < IP8 SR4), Cerberus PRO EN X200 Cloud Distribution (All versions < V4.3.5618), Cerberus PRO EN X300 Cloud Distribution (All versions < V4.3.5617), Sinteso FS20 EN Engineering Tool (All versions), Sinteso FS20 EN Fire Panel FC20 (All versions < MP8 SR4), Sinteso FS20 EN X200 Cloud Distribution (All versions < V4.3.5618), Sinteso FS20 EN X300 Cloud Distribution (All versions < V4.3.5617), Sinteso Mobile (All versions). The network communication library in affected systems insufficiently validates HMAC values which might result in a buffer overread.\r\nThis could allow an unauthenticated remote attacker to crash the network service.",
    "published": "2024-03-12T11:15:48.637",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-22041": {
    "cvss": 7.5,
    "description": "A vulnerability has been identified in Cerberus PRO EN Engineering Tool (All versions), Cerberus PRO EN Fire Panel FC72x (All versions < IP8 SR4), Cerberus PRO EN X200 Cloud Distribution (All versions < V4.3.5618), Cerberus PRO EN X300 Cloud Distribution (All versions < V4.3.5617), Sinteso FS20 EN Engineering Tool (All versions), Sinteso FS20 EN Fire Panel FC20 (All versions < MP8 SR4), Sinteso FS20 EN X200 Cloud Distribution (All versions < V4.3.5618), Sinteso FS20 EN X300 Cloud Distribution (All versions < V4.3.5617), Sinteso Mobile (All versions). The network communication library in affected systems improperly handles memory buffers when parsing X.509 certificates.\r\nThis could allow an unauthenticated remote attacker to crash the network service.",
    "published": "2024-03-12T11:15:48.940",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-22045": {
    "cvss": 7.6,
    "description": "A vulnerability has been identified in SINEMA Remote Connect Client (All versions < V3.1 SP1). The product places sensitive information into files or directories that are accessible to actors who are allowed to have access to the files, but not to the sensitive information. This information is also available via the web interface of the product.",
    "published": "2024-03-12T11:15:49.390",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-23112": {
    "cvss": 8.0,
    "description": "An authorization bypass through user-controlled key vulnerability [CWE-639] in FortiOS version 7.4.0 through 7.4.1, 7.2.0 through 7.2.6, 7.0.1 through 7.0.13, 6.4.7 through 6.4.14, and FortiProxy version 7.4.0 through 7.4.2, 7.2.0 through 7.2.8, 7.0.0 through 7.0.14 SSL-VPN may allow an authenticated attacker to gain access to another user’s bookmark via URL manipulation.",
    "published": "2024-03-12T15:15:49.090",
    "keywords": "vpn,bypass"
  },
  "CVE-2024-1527": {
    "cvss": 9.8,
    "description": "Unrestricted file upload vulnerability in CMS Made Simple, affecting version 2.2.14. This vulnerability allows an authenticated user to bypass the security measures of the upload functionality and potentially create a remote execution of commands via webshell.",
    "published": "2024-03-12T16:15:07.990",
    "keywords": "remote,execution,command,bypass"
  },
  "CVE-2024-27758": {
    "cvss": "-",
    "description": "In RPyC before 6.0.0, when a server exposes a method that calls the attribute named __array__ for a client-provided netref (e.g., np.array(client_netref)), a remote attacker can craft a class that results in remote code execution.",
    "published": "2024-03-12T16:15:08.600",
    "keywords": "remote,execution"
  },
  "CVE-2024-21334": {
    "cvss": 9.8,
    "description": "Open Management Infrastructure (OMI) Remote Code Execution Vulnerability",
    "published": "2024-03-12T17:15:49.310",
    "keywords": "remote,execution"
  },
  "CVE-2024-21407": {
    "cvss": 8.1,
    "description": "Windows Hyper-V Remote Code Execution Vulnerability",
    "published": "2024-03-12T17:15:49.957",
    "keywords": "remote,execution"
  },
  "CVE-2024-21411": {
    "cvss": 8.8,
    "description": "Skype for Consumer Remote Code Execution Vulnerability",
    "published": "2024-03-12T17:15:50.290",
    "keywords": "remote,execution"
  },
  "CVE-2024-21426": {
    "cvss": 7.8,
    "description": "Microsoft SharePoint Server Remote Code Execution Vulnerability",
    "published": "2024-03-12T17:15:51.080",
    "keywords": "remote,execution"
  },
  "CVE-2024-21429": {
    "cvss": 6.8,
    "description": "Windows USB Hub Driver Remote Code Execution Vulnerability",
    "published": "2024-03-12T17:15:51.400",
    "keywords": "remote,execution"
  },
  "CVE-2024-21430": {
    "cvss": 5.7,
    "description": "Windows USB Attached SCSI (UAS) Protocol Remote Code Execution Vulnerability",
    "published": "2024-03-12T17:15:51.573",
    "keywords": "remote,execution"
  },
  "CVE-2024-21435": {
    "cvss": 8.8,
    "description": "Windows OLE Remote Code Execution Vulnerability",
    "published": "2024-03-12T17:15:52.387",
    "keywords": "remote,execution"
  },
  "CVE-2024-21440": {
    "cvss": 8.8,
    "description": "Microsoft ODBC Driver Remote Code Execution Vulnerability",
    "published": "2024-03-12T17:15:53.207",
    "keywords": "remote,execution"
  },
  "CVE-2024-21441": {
    "cvss": 8.8,
    "description": "Microsoft WDAC OLE DB provider for SQL Server Remote Code Execution Vulnerability",
    "published": "2024-03-12T17:15:53.377",
    "keywords": "remote,execution"
  },
  "CVE-2024-21444": {
    "cvss": 8.8,
    "description": "Microsoft WDAC OLE DB provider for SQL Server Remote Code Execution Vulnerability",
    "published": "2024-03-12T17:15:53.907",
    "keywords": "remote,execution"
  },
  "CVE-2024-21450": {
    "cvss": 8.8,
    "description": "Microsoft WDAC OLE DB provider for SQL Server Remote Code Execution Vulnerability",
    "published": "2024-03-12T17:15:54.567",
    "keywords": "remote,execution"
  },
  "CVE-2024-21451": {
    "cvss": 8.8,
    "description": "Microsoft ODBC Driver Remote Code Execution Vulnerability",
    "published": "2024-03-12T17:15:54.743",
    "keywords": "remote,execution"
  },
  "CVE-2024-26159": {
    "cvss": 8.8,
    "description": "Microsoft ODBC Driver Remote Code Execution Vulnerability",
    "published": "2024-03-12T17:15:54.903",
    "keywords": "remote,execution"
  },
  "CVE-2024-26161": {
    "cvss": 8.8,
    "description": "Microsoft WDAC OLE DB provider for SQL Server Remote Code Execution Vulnerability",
    "published": "2024-03-12T17:15:55.230",
    "keywords": "remote,execution"
  },
  "CVE-2024-26162": {
    "cvss": 8.8,
    "description": "Microsoft ODBC Driver Remote Code Execution Vulnerability",
    "published": "2024-03-12T17:15:55.400",
    "keywords": "remote,execution"
  },
  "CVE-2024-26164": {
    "cvss": 8.8,
    "description": "Microsoft Django Backend for SQL Server Remote Code Execution Vulnerability",
    "published": "2024-03-12T17:15:55.643",
    "keywords": "remote,execution"
  },
  "CVE-2024-26166": {
    "cvss": 8.8,
    "description": "Microsoft WDAC OLE DB provider for SQL Server Remote Code Execution Vulnerability",
    "published": "2024-03-12T17:15:55.993",
    "keywords": "remote,execution"
  },
  "CVE-2024-26198": {
    "cvss": 8.8,
    "description": "Microsoft Exchange Server Remote Code Execution Vulnerability",
    "published": "2024-03-12T17:15:58.223",
    "keywords": "remote,execution"
  },
  "CVE-2024-28339": {
    "cvss": "-",
    "description": "An information leak in the debuginfo.htm component of Netgear CBR40 2.5.0.28, Netgear CBK40 2.5.0.28, and Netgear CBK43 2.5.0.28 allows attackers to obtain sensitive information without any authentication required.",
    "published": "2024-03-12T17:15:59.093",
    "keywords": "authentication,sensitive,leak"
  },
  "CVE-2024-28340": {
    "cvss": "-",
    "description": "An information leak in the currentsetting.htm component of Netgear CBR40 2.5.0.28, Netgear CBK40 2.5.0.28, and Netgear CBK43 2.5.0.28 allows attackers to obtain sensitive information without any authentication required.",
    "published": "2024-03-12T17:15:59.140",
    "keywords": "authentication,sensitive,leak"
  },
  "CVE-2024-1410": {
    "cvss": 3.7,
    "description": "Cloudflare quiche was discovered to be vulnerable to unbounded storage of information related to connection ID retirement, which could lead to excessive resource consumption. Each QUIC connection possesses a set of connection Identifiers (IDs); see  RFC 9000 Section 5.1 https://datatracker.ietf.org/doc/html/rfc9000#section-5.1 . Endpoints declare the number of active connection IDs they are willing to support using the active_connection_id_limit transport parameter. The peer can create new IDs using a NEW_CONNECTION_ID frame but must stay within the active ID limit. This is done by retirement of old IDs, the endpoint sends NEW_CONNECTION_ID includes a value in the retire_prior_to field, which elicits a RETIRE_CONNECTION_ID frame as confirmation. An unauthenticated remote attacker can exploit the vulnerability by sending NEW_CONNECTION_ID frames and manipulating the connection (e.g. by restricting the peer's congestion window size) so that RETIRE_CONNECTION_ID frames can only be sent at a slower rate than they are received, leading to storage of information related to connection IDs in an unbounded queue. Quiche versions 0.19.2 and 0.20.1 are the earliest to address this problem. There is no workaround for affected versions.\n",
    "published": "2024-03-12T18:15:07.493",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-27894": {
    "cvss": 8.5,
    "description": "The Pulsar Functions Worker includes a capability that permits authenticated users to create functions where the function's implementation is referenced by a URL. The supported URL schemes include \"file\", \"http\", and \"https\". When a function is created using this method, the Functions Worker will retrieve the implementation from the URL provided by the user. However, this feature introduces a vulnerability that can be exploited by an attacker to gain unauthorized access to any file that the Pulsar Functions Worker process has permissions to read. This includes reading the process environment which potentially includes sensitive information, such as secrets. Furthermore, an attacker could leverage this vulnerability to use the Pulsar Functions Worker as a proxy to access the content of remote HTTP and HTTPS endpoint URLs. This could also be used to carry out denial of service attacks.\nThis vulnerability also applies to the Pulsar Broker when it is configured with \"functionsWorkerEnabled=true\".\n\nThis issue affects Apache Pulsar versions from 2.4.0 to 2.10.5, from 2.11.0 to 2.11.3, from 3.0.0 to 3.0.2, from 3.1.0 to 3.1.2, and 3.2.0. \n\n2.10 Pulsar Function Worker users should upgrade to at least 2.10.6.\n2.11 Pulsar Function Worker users should upgrade to at least 2.11.4.\n3.0 Pulsar Function Worker users should upgrade to at least 3.0.3.\n3.1 Pulsar Function Worker users should upgrade to at least 3.1.3.\n3.2 Pulsar Function Worker users should upgrade to at least 3.2.1.\n\nUsers operating versions prior to those listed above should upgrade to the aforementioned patched versions or newer versions.\n\nThe updated versions of Pulsar Functions Worker will, by default, impose restrictions on the creation of functions using URLs. For users who rely on this functionality, the Function Worker configuration provides two configuration keys: \"additionalEnabledConnectorUrlPatterns\" and \"additionalEnabledFunctionsUrlPatterns\". These keys allow users to specify a set of URL patterns that are permitted, enabling the creation of functions using URLs that match the defined patterns. This approach ensures that the feature remains available to those who require it, while limiting the potential for unauthorized access and exploitation.",
    "published": "2024-03-12T19:15:47.970",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-28114": {
    "cvss": 8.1,
    "description": "Peering Manager is a BGP session management tool. There is a Server Side Template Injection vulnerability that leads to Remote Code Execution in Peering Manager <=1.8.2. As a result arbitrary commands can be executed on the operating system that is running Peering Manager. This issue has been addressed in version 1.8.3. Users are advised to upgrade. There are no known workarounds for this vulnerability.\n",
    "published": "2024-03-12T20:15:08.113",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-2107": {
    "cvss": 5.8,
    "description": "The Blossom Spa theme for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 1.3.4 via generated source. This makes it possible for unauthenticated attackers to extract sensitive data including contents of password-protected or scheduled posts.",
    "published": "2024-03-12T22:15:07.470",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-2413": {
    "cvss": 9.8,
    "description": "Intumit SmartRobot uses a fixed encryption key for authentication. Remote attackers can use this key to encrypt a string composed of the user's name and timestamp to generate an authentication code. With this authentication code, they can obtain administrator privileges and subsequently execute arbitrary code on the remote server using built-in system functionality.",
    "published": "2024-03-13T03:15:06.793",
    "keywords": "remote,authentication"
  }
}