{
  "CVE-2025-5255": {
    "url": "https://github.com/phcode-dev/phoenix-desktop/pull/623/commits/0c75fb57f89d0b7d9b180026bc2624b7dcf807da",
    "cvss": "-",
    "description": "The Phoenix Code's configuration on macOS, specifically the presence of entitlements: \"com.apple.security.cs.allow-dyld-environment-variables\" and \"com.apple.security.cs.disable-library-validation\" allows for Dynamic Library (Dylib) injection. A local attacker with unprivileged access can use environment variables like DYLD_INSERT_LIBRARIES to successfully inject code in application's context and bypass Transparency, Consent, and Control (TCC). Acquired resource access is limited to previously granted permissions by the user. Access to other resources beyond granted-permissions requires user interaction with a system prompt asking for permission.\n\nThis issue was fixed in commit 0c75fb57f89d0b7d9b180026bc2624b7dcf807da",
    "published": "2025-06-20T10:15:21.653"
  },
  "CVE-2025-6329": {
    "cvss": 5.4,
    "description": "A vulnerability was found in ScriptAndTools Real Estate Management System 1.0. It has been rated as critical. This issue affects some unknown processing of the file userdelete.php of the component User Delete Handler. The manipulation of the argument ID leads to authorization bypass. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2025-06-20T10:15:22.820",
    "keywords": "remote,bypass"
  },
  "CVE-2025-4981": {
    "cvss": 9.9,
    "description": "Mattermost versions 10.5.x <= 10.5.5, 9.11.x <= 9.11.15, 10.8.x <= 10.8.0, 10.7.x <= 10.7.2, 10.6.x <= 10.6.5 fail to sanitize filenames in the archive extractor which allows authenticated users to write files to arbitrary locations on the filesystem via uploading archives with path traversal sequences in filenames, potentially leading to remote code execution. The vulnerability impacts instances where file uploads and document search by content is enabled (FileSettings.EnableFileAttachments = true and FileSettings.ExtractContent = true). These configuration settings are enabled by default.",
    "published": "2025-06-20T11:15:20.993",
    "keywords": "remote,execution"
  },
  "CVE-2025-4102": {
    "cvss": 7.2,
    "description": "The Beaver Builder Plugin (Starter Version) plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the 'save_enabled_icons' function in all versions up to, and including, 2.9.1. This makes it possible for authenticated attackers, with Administrator-level access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible. The vulnerability was partially patched in version 2.9.1.",
    "published": "2025-06-20T12:15:22.140",
    "keywords": "remote,execution"
  },
  "CVE-2025-3319": {
    "cvss": 8.1,
    "description": "IBM Spectrum Protect Server 8.1 through 8.1.26 could allow attacker to bypass authentication due to improper session authentication which can result in access to unauthorized resources.",
    "published": "2025-06-20T15:15:20.717",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-45331": {
    "url": "https://github.com/branc116/brplot/commit/b90e93a0e0d514d48f38d1584496130fa5fe4fe4",
    "cvss": "-",
    "description": "brplot v420.69.1 contains a Null Pointer Dereference (NPD) vulnerability in the br_dagens_handle_once function of its data processing module, leading to unpredictable program behavior, causing segmentation faults, and program crashes.",
    "published": "2025-06-20T16:15:29.083"
  },
  "CVE-2025-44635": {
    "cvss": "-",
    "description": "There are multiple unauthorized remote command execution vulnerabilities in the H3C ER2200G2, ERG2-450W, ERG2-1200W, ERG2-1350W, NR1200W series routers before ERG2AW-MNW100-R1117; H3C ER3100G2, ER3200G2, ER3260G2, ER5100G2, ER5200G2, ER6300G2, ER8300G2, ER8300G2-X series routers before ERHMG2-MNW100-R1126; GR3200, GR5200, GR8300 and other series routers before MiniGR1B0V100R018L50; GR-1800AX before MiniGRW1B0V100R009L50; GR-3000AX before SWBRW1A0V100R007L50; and GR-5400AX before SWBRW1B0V100R009L50. Attackers can bypass authentication by including specially crafted text in the request URL or message header, and then inject arbitrary malicious commands into some fields related to ACL access control list and user group functions and execute to obtain the highest ROOT privileges of remote devices, thereby completely taking over the remote target devices.",
    "published": "2025-06-20T17:15:40.400",
    "keywords": "remote,execution,authentication,command,bypass"
  },
  "CVE-2025-25034": {
    "cvss": "-",
    "description": "A PHP object injection vulnerability exists in SugarCRM versions prior to 6.5.24, 6.7.13, 7.5.2.5, 7.6.2.2, and 7.7.1.0 due to improper validation of PHP serialized input in the SugarRestSerialize.php script. The vulnerable code fails to sanitize the rest_data parameter before passing it to the unserialize() function. This allows an unauthenticated attacker to submit crafted serialized data containing malicious object declarations, resulting in arbitrary code execution within the application context. Although SugarCRM released a prior fix in advisory sugarcrm-sa-2016-001, the patch was incomplete and failed to address some vectors.",
    "published": "2025-06-20T19:15:35.693",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2025-25037": {
    "cvss": "-",
    "description": "An information disclosure vulnerability exists in Aquatronica Controller System firmware versions <= 5.1.6 and web interface versions <= 2.0. The tcp.php endpoint fails to restrict unauthenticated access, allowing remote attackers to issue crafted POST requests and retrieve sensitive configuration data, including plaintext administrative credentials. Exploitation of this flaw can lead to full compromise of the system, enabling unauthorized manipulation of connected devices and aquarium parameters.",
    "published": "2025-06-20T19:15:35.870",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2025-25038": {
    "cvss": "-",
    "description": "An OS command injection vulnerability exists in MiniDVBLinux version 5.4 and earlier. The system’s web-based management interface fails to properly sanitize user-supplied input before passing it to operating system commands. A remote unauthenticated attacker can exploit this vulnerability to execute arbitrary commands as the root user, potentially compromising the entire device.",
    "published": "2025-06-20T19:15:36.050",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2025-34021": {
    "cvss": "-",
    "description": "A server-side request forgery (SSRF) vulnerability exists in multiple Selea Targa IP OCR-ANPR camera models, including iZero, Targa 512, Targa 504, Targa Semplice, Targa 704 TKM, Targa 805, Targa 710 INOX, Targa 750, and Targa 704 ILB. The application fails to validate user-supplied input in JSON POST parameters such as ipnotify_address and url, which are used by internal mechanisms to perform image fetch and DNS lookups. This allows remote unauthenticated attackers to induce the system to make arbitrary HTTP requests to internal or external systems, potentially bypassing firewall policies or conducting internal service enumeration.",
    "published": "2025-06-20T19:15:36.530",
    "keywords": "remote,unauthenticated,bypass"
  },
  "CVE-2025-34022": {
    "cvss": "-",
    "description": "A path traversal vulnerability exists in multiple models of Selea Targa IP OCR-ANPR cameras, including iZero, Targa 512, Targa 504, Targa Semplice, Targa 704 TKM, Targa 805, Targa 710 INOX, Targa 750, and Targa 704 ILB. The /common/get_file.php script in the “Download Archive in Storage” page fails to properly validate user-supplied input to the file parameter. Unauthenticated remote attackers can exploit this vulnerability to read arbitrary files on the device, including sensitive system files containing cleartext credentials, potentially leading to authentication bypass and exposure of system information.",
    "published": "2025-06-20T19:15:36.720",
    "keywords": "remote,unauthenticated,authentication,sensitive,bypass"
  },
  "CVE-2025-34023": {
    "cvss": "-",
    "description": "A path traversal vulnerability exists in the Karel IP1211 IP Phone's web management panel. The /cgi-bin/cgiServer.exx endpoint fails to properly sanitize user input to the page parameter, allowing remote authenticated attackers to access arbitrary files on the underlying system by using crafted path traversal sequences (e.g., ../../). This can expose sensitive files such as /etc/passwd and /etc/shadow.",
    "published": "2025-06-20T19:15:36.887",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-34024": {
    "cvss": "-",
    "description": "An OS command injection vulnerability exists in the Edimax EW-7438RPn firmware version 1.13 and prior via the mp.asp form handler. The /goform/mp endpoint improperly handles user-supplied input to the command parameter. An authenticated attacker can inject shell commands using shell metacharacters to achieve arbitrary command execution as the root user.",
    "published": "2025-06-20T19:15:37.053",
    "keywords": "execution,command"
  },
  "CVE-2025-34029": {
    "cvss": "-",
    "description": "An OS command injection vulnerability exists in the Edimax EW-7438RPn Mini firmware version 1.13 and prior via the syscmd.asp form handler. The /goform/formSysCmd endpoint exposes a system command interface through the sysCmd parameter. A remote authenticated attacker can submit arbitrary shell commands directly, resulting in command execution as the root user.",
    "published": "2025-06-20T19:15:37.210",
    "keywords": "remote,execution,command"
  },
  "CVE-2025-34030": {
    "cvss": "-",
    "description": "An OS command injection vulnerability exists in sar2html version 3.2.2 and prior via the plot parameter in index.php. The application fails to sanitize user-supplied input before using it in a system-level context. Remote, unauthenticated attackers can inject shell commands by appending them to the plot parameter (e.g., ?plot=;id) in a crafted GET request. The output of the command is displayed in the application's interface after interacting with the host selection UI. Successful exploitation leads to arbitrary command execution on the underlying system.",
    "published": "2025-06-20T19:15:37.343",
    "keywords": "remote,execution,unauthenticated,command"
  },
  "CVE-2025-6365": {
    "url": "https://github.com/hobbesosr/kitten/issues/17",
    "cvss": 5.7,
    "description": "A vulnerability was found in HobbesOSR Kitten up to c4f8b7c3158983d1020af432be1b417b28686736 and classified as critical. Affected by this issue is the function set_pte_at in the library /include/arch-arm64/pgtable.h. The manipulation leads to resource consumption. Continious delivery with rolling releases is used by this product. Therefore, no version details of affected nor updated releases are available.",
    "published": "2025-06-20T21:15:23.140"
  },
  "CVE-2025-5475": {
    "cvss": 7.5,
    "description": "Sony XAV-AX8500 Bluetooth Packet Handling Integer Overflow Remote Code Execution Vulnerability. This vulnerability allows network-adjacent attackers to execute arbitrary code on affected Sony XAV-AX8500 devices. An attacker must first obtain the ability to pair a malicious Bluetooth device with the target system in order to exploit this vulnerability.\n\nThe specific flaw exists within the handling of Bluetooth packets. The issue results from the lack of proper validation of user-supplied data, which can result in an integer overflow before writing to memory. An attacker can leverage this vulnerability to execute code in the context of the elysian-bt-service process. Was ZDI-CAN-26283.",
    "published": "2025-06-21T01:15:28.037",
    "keywords": "remote,execution"
  },
  "CVE-2025-5476": {
    "cvss": 6.3,
    "description": "Sony XAV-AX8500 Bluetooth Improper Isolation Authentication Bypass Vulnerability. This vulnerability allows network-adjacent attackers to bypass authentication on affected Sony XAV-AX8500 devices. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the implementation of ACL-U links. The issue results from the lack of L2CAP channel isolation. An attacker can leverage this vulnerability to bypass authentication on the system. Was ZDI-CAN-26284.",
    "published": "2025-06-21T01:15:28.193",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-5477": {
    "cvss": 7.5,
    "description": "Sony XAV-AX8500 Bluetooth L2CAP Protocol Heap-based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows network-adjacent attackers to execute arbitrary code on affected Sony XAV-AX8500 devices. An attacker must first obtain the ability to pair a malicious Bluetooth device with the target system in order to exploit this vulnerability.\n\nThe specific flaw exists within the implementation of the Bluetooth L2CAP protocol. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a heap-based buffer. An attacker can leverage this vulnerability to execute code in the context of the elysian-bt-service process. Was ZDI-CAN-26286.",
    "published": "2025-06-21T01:15:28.330",
    "keywords": "remote,execution"
  },
  "CVE-2025-5478": {
    "cvss": 8.8,
    "description": "Sony XAV-AX8500 Bluetooth SDP Protocol Integer Overflow Remote Code Execution Vulnerability. This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of Sony XAV-AX8500 devices. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the implementation of the Bluetooth SDP protocol. The issue results from the lack of proper validation of user-supplied data, which can result in an integer overflow before allocating a buffer. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-26288.",
    "published": "2025-06-21T01:15:28.457",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2025-5479": {
    "cvss": 7.5,
    "description": "Sony XAV-AX8500 Bluetooth AVCTP Protocol Heap-based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of Sony XAV-AX8500 devices. An attacker must first obtain the ability to pair a malicious Bluetooth device with the target system in order to exploit this vulnerability.\n\nThe specific flaw exists within the implementation of the Bluetooth AVCTP protocol. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a heap-based buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-26290.",
    "published": "2025-06-21T01:15:28.593",
    "keywords": "remote,execution"
  },
  "CVE-2025-5820": {
    "cvss": 6.3,
    "description": "Sony XAV-AX8500 Bluetooth ERTM Channel Authentication Bypass Vulnerability. This vulnerability allows network-adjacent attackers to bypass authentication on affected Sony XAV-AX8500 devices. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the implementation of Bluetooth ERTM channel communication. The issue results from improper channel data initialization. An attacker can leverage this vulnerability to bypass authentication on the system. Was ZDI-CAN-26285.",
    "published": "2025-06-21T01:15:28.723",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-6216": {
    "cvss": 9.8,
    "description": "Allegra calculateTokenExpDate Password Recovery Authentication Bypass Vulnerability. This vulnerability allows remote attackers to bypass authentication on affected installations of Allegra. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the password recovery mechanism. The issue results from reliance upon a predictable value when generating a password reset token. An attacker can leverage this vulnerability to bypass authentication on the application. Was ZDI-CAN-27104.",
    "published": "2025-06-21T01:15:28.860",
    "keywords": "remote,authentication,bypass"
  },
  "CVE-2025-6218": {
    "cvss": 7.8,
    "description": "RARLAB WinRAR Directory Traversal Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of RARLAB WinRAR. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the handling of file paths within archive files. A crafted file path can cause the process to traverse to unintended directories. An attacker can leverage this vulnerability to execute code in the context of the current user. Was ZDI-CAN-27198.",
    "published": "2025-06-21T01:15:29.123",
    "keywords": "remote,execution"
  },
  "CVE-2025-52557": {
    "url": "https://github.com/mail-0/zero/pull/1386",
    "cvss": "-",
    "description": "Mail-0's Zero is an open-source email solution. In version 0.8 it's possible for an attacker to craft an email that executes javascript leading to session hijacking due to improper sanitization. This issue has been patched in version 0.81.",
    "published": "2025-06-21T02:15:20.107"
  },
  "CVE-2025-36016": {
    "cvss": 6.8,
    "description": "IBM Process Mining 2.0.1 IF001 and 2.0.1 could allow a remote attacker to conduct phishing attacks, using an open redirect attack. By persuading a victim to visit a specially crafted Web site, a remote attacker could exploit this vulnerability to spoof the URL displayed to redirect a user to a malicious Web site that would appear to be trusted. This could allow the attacker to obtain highly sensitive information or conduct further attacks against the victim.",
    "published": "2025-06-21T13:15:20.913",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-6485": {
    "cvss": 6.3,
    "description": "A vulnerability was found in TOTOLINK A3002R 1.1.1-B20200824.0128. It has been classified as critical. This affects the function formWlSiteSurvey of the file /boafrm/formWlSiteSurvey. The manipulation of the argument wlanif leads to os command injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2025-06-22T17:15:23.043",
    "keywords": "remote,command"
  },
  "CVE-2025-6490": {
    "url": "https://github.com/sparklemotion/nokogiri/issues/3500",
    "cvss": 3.3,
    "description": "A vulnerability was found in sparklemotion nokogiri up to 1.18.7 and classified as problematic. This issue affects the function hashmap_set_with_hash of the file gumbo-parser/src/hashmap.c. The manipulation leads to heap-based buffer overflow. An attack has to be approached locally. The exploit has been disclosed to the public and may be used.",
    "published": "2025-06-22T19:15:20.790"
  },
  "CVE-2025-6492": {
    "url": "https://github.com/marktext/marktext/pull/3952",
    "cvss": 5.3,
    "description": "A vulnerability has been found in MarkText up to 0.17.1 and classified as problematic. Affected by this vulnerability is the function getRecommendTitleFromMarkdownString of the file marktext/src/main/utils/index.js. The manipulation leads to inefficient regular expression complexity. The attack can be launched remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2025-06-22T20:15:19.803"
  },
  "CVE-2025-6493": {
    "url": "https://github.com/codemirror/codemirror5/issues/7128",
    "cvss": 5.3,
    "description": "A vulnerability was found in CodeMirror up to 5.17.0 and classified as problematic. Affected by this issue is some unknown functionality of the file mode/markdown/markdown.js of the component Markdown Mode. The manipulation leads to inefficient regular expression complexity. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. Not all code samples mentioned in the GitHub issue can be found. The repository mentions, that \"CodeMirror 6 exists, and is [...] much more actively maintained.\"",
    "published": "2025-06-22T22:15:22.430"
  },
  "CVE-2025-6494": {
    "url": "https://github.com/sparklemotion/nokogiri/issues/3508",
    "cvss": 3.3,
    "description": "A vulnerability was found in sparklemotion nokogiri up to 1.18.7. It has been classified as problematic. This affects the function hashmap_get_with_hash of the file gumbo-parser/src/hashmap.c. The manipulation leads to heap-based buffer overflow. An attack has to be approached locally. The exploit has been disclosed to the public and may be used.",
    "published": "2025-06-22T23:15:20.103"
  },
  "CVE-2025-6496": {
    "url": "https://github.com/htacg/tidy-html5/issues/1141",
    "cvss": 3.3,
    "description": "A vulnerability was found in HTACG tidy-html5 5.8.0. It has been declared as problematic. This vulnerability affects the function InsertNodeAsParent of the file src/parser.c. The manipulation leads to null pointer dereference. Local access is required to approach this attack. The exploit has been disclosed to the public and may be used.",
    "published": "2025-06-23T00:15:23.117"
  },
  "CVE-2025-6497": {
    "url": "https://github.com/htacg/tidy-html5/issues/1142",
    "cvss": 3.3,
    "description": "A vulnerability was found in HTACG tidy-html5 5.8.0. It has been rated as problematic. This issue affects the function prvTidyParseNamespace of the file src/parser.c. The manipulation leads to reachable assertion. Attacking locally is a requirement. The exploit has been disclosed to the public and may be used.",
    "published": "2025-06-23T01:15:22.073"
  },
  "CVE-2025-6498": {
    "url": "https://github.com/htacg/tidy-html5/issues/1152",
    "cvss": 3.3,
    "description": "A vulnerability classified as problematic has been found in HTACG tidy-html5 5.8.0. Affected is the function defaultAlloc of the file src/alloc.c. The manipulation leads to memory leak. It is possible to launch the attack on the local host. The exploit has been disclosed to the public and may be used.",
    "published": "2025-06-23T02:15:20.703"
  },
  "CVE-2025-6499": {
    "url": "https://github.com/vstakhov/libucl/issues/319",
    "cvss": 3.3,
    "description": "A vulnerability classified as problematic was found in vstakhov libucl up to 0.9.2. Affected by this vulnerability is the function ucl_parse_multiline_string of the file src/ucl_parser.c. The manipulation leads to heap-based buffer overflow. The attack needs to be approached locally. The exploit has been disclosed to the public and may be used.",
    "published": "2025-06-23T03:15:26.717"
  }
}