{
  "CVE-2024-1817": {
    "cvss": 7.3,
    "description": "A vulnerability has been found in Demososo DM Enterprise Website Building System up to 2022.8 and classified as critical. Affected by this vulnerability is the function dmlogin of the file indexDM_load.php of the component Cookie Handler. The manipulation of the argument is_admin with the input y leads to improper authentication. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-254605 was assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-02-23T14:15:44.847",
    "keywords": "remote,authentication"
  },
  "CVE-2024-27318": {
    "url": "https://github.com/onnx/onnx/commit/66b7fb630903fdcf3e83b6b6d56d82e904264a20",
    "cvss": 7.5,
    "description": "Versions of the package onnx before and including 1.15.0 are vulnerable to Directory Traversal as the external_data field of the tensor proto can have a path to the file which is outside the model current directory or user-provided directory. The vulnerability occurs as a bypass for the patch added for CVE-2022-25882.\n",
    "published": "2024-02-23T18:15:50.767"
  },
  "CVE-2024-27319": {
    "url": "https://github.com/onnx/onnx/commit/08a399ba75a805b7813ab8936b91d0e274b08287",
    "cvss": 4.4,
    "description": "Versions of the package onnx before and including 1.15.0 are vulnerable to Out-of-bounds Read as the ONNX_ASSERT and ONNX_ASSERTM functions have an off by one string copy.\n",
    "published": "2024-02-23T18:15:50.960"
  },
  "CVE-2024-25469": {
    "cvss": "-",
    "description": "SQL Injection vulnerability in CRMEB crmeb_java v.1.3.4 and before allows a remote attacker to obtain sensitive information via the latitude and longitude parameters in the api/front/store/list component.",
    "published": "2024-02-23T23:15:09.740",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-22395": {
    "cvss": 6.3,
    "description": "Improper access control vulnerability has been identified in the SMA100 SSL-VPN virtual office portal, which in specific conditions could potentially enable a remote authenticated attacker to associate another user's MFA mobile application.",
    "published": "2024-02-24T00:15:45.673",
    "keywords": "remote,vpn"
  }
}