{
  "CVE-2024-39351": {
    "cvss": 7.2,
    "description": "A vulnerability regarding improper neutralization of special elements used in an OS command ('OS Command Injection') is found in the NTP configuration. This allows remote authenticated users with administrator privileges to execute arbitrary commands via unspecified vectors. The following models with Synology Camera Firmware versions before 1.0.7-0298 may be affected: BC500 and TC500.",
    "published": "2024-06-28T06:15:05.887",
    "keywords": "remote,command"
  },
  "CVE-2024-39352": {
    "cvss": 4.9,
    "description": "A vulnerability regarding incorrect authorization is found in the firmware upgrade functionality. This allows remote authenticated users with administrator privileges to bypass firmware integrity check via unspecified vectors. The following models with Synology Camera Firmware versions before 1.0.7-0298 may be affected: BC500 and TC500.",
    "published": "2024-06-28T06:15:06.223",
    "keywords": "remote,bypass"
  },
  "CVE-2024-39350": {
    "cvss": 7.5,
    "description": "A vulnerability regarding authentication bypass by spoofing is found in the RTSP functionality. This allows man-in-the-middle attackers to obtain privileges without consent via unspecified vectors. The following models with Synology Camera Firmware versions before 1.0.7-0298 may be affected: BC500 and TC500.",
    "published": "2024-06-28T07:15:06.330",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-37741": {
    "url": "https://github.com/thiagoralves/openplc_v3/issues/242",
    "cvss": "-",
    "description": "OpenPLC 3 through 9cd8f1b allows XSS via an SVG document as a profile picture.",
    "published": "2024-06-28T13:15:02.860"
  },
  "CVE-2024-35155": {
    "cvss": 6.5,
    "description": "IBM MQ Console 9.3 LTS and 9.3 CD could disclose could allow a remote attacker to obtain sensitive information when a detailed technical error message is returned in the browser.  This information could be used in further attacks against the system.  IBM X-Force ID:  292765.",
    "published": "2024-06-28T18:15:04.170",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-25041": {
    "cvss": 5.4,
    "description": "IBM Cognos Analytics 11.2.0, 11.2.1, 11.2.2, 11.2.3, 11.2.4, 12.0.0, 12.0.1, and 12.0.2 is potentially vulnerable to cross site scripting (XSS). A remote attacker could execute malicious commands due to improper validation of column headings in Cognos Assistant.  IBM X-Force ID:  282780.",
    "published": "2024-06-28T19:15:04.653",
    "keywords": "remote,command"
  },
  "CVE-2024-27629": {
    "url": "https://github.com/rordenlab/dcm2niix/pull/789",
    "cvss": "-",
    "description": "An issue in dc2niix before v.1.0.20240202 allows a local attacker to execute arbitrary code via the generated file name is not properly escaped and injected into a system call when certain types of compression are used.",
    "published": "2024-06-28T19:15:05.243"
  },
  "CVE-2024-35156": {
    "cvss": 6.5,
    "description": "IBM MQ 9.3 LTS and 9.3 CD could allow a remote attacker to obtain sensitive information when a detailed technical error message is returned in the browser.  This information could be used in further attacks against the system.  IBM X-Force ID:  292766.",
    "published": "2024-06-28T19:15:05.917",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-38528": {
    "cvss": 7.5,
    "description": "nptd-rs is a tool for synchronizing your computer's clock, implementing the NTP and NTS protocols. There is a missing limit for accepted NTS-KE connections. This allows an unauthenticated remote attacker to crash ntpd-rs when an NTS-KE server is configured. Non NTS-KE server configurations, such as the default ntpd-rs configuration, are unaffected. This vulnerability has been patched in version 1.1.3.\n",
    "published": "2024-06-28T20:15:02.533",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-5827": {
    "cvss": 9.8,
    "description": "Vanna v0.3.4 is vulnerable to SQL injection in its DuckDB integration exposed to its Flask Web APIs. Attackers can inject malicious SQL training data and generate corresponding queries to write arbitrary files on the victim's file system, such as backdoor.php with contents `<?php system($_GET[0]); ?>`. This can lead to command execution or the creation of backdoors.",
    "published": "2024-06-28T20:15:03.217",
    "keywords": "execution,command"
  },
  "CVE-2024-5598": {
    "cvss": 7.5,
    "description": "The Advanced File Manager plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 5.2.4 via the 'fma_local_file_system' function. This makes it possible for unauthenticated attackers to extract sensitive data including backups or other sensitive information if the files have been moved to the built-in Trash folder.",
    "published": "2024-06-29T05:15:02.960",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-6265": {
    "cvss": 9.8,
    "description": "The UsersWP – Front-end login form, User Registration, User Profile & Members Directory plugin for WordPress plugin for WordPress is vulnerable to time-based SQL Injection via the ‘uwp_sort_by’ parameter in all versions up to, and including, 1.2.10 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-06-29T05:15:03.560",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-25943": {
    "cvss": 7.6,
    "description": "iDRAC9, versions prior to 7.00.00.172 for 14th Generation and 7.10.50.00 for 15th and 16th Generations, contains a session hijacking vulnerability in IPMI. A remote attacker could potentially exploit this vulnerability, leading to arbitrary code execution on the vulnerable application.",
    "published": "2024-06-29T13:15:10.403",
    "keywords": "remote,execution"
  },
  "CVE-2024-39848": {
    "cvss": "-",
    "description": "Internet2 Grouper before 5.6 allows authentication bypass when LDAP authentication is used in certain ways. This is related to internet2.middleware.grouper.ws.security.WsGrouperLdapAuthentication and the use of the UyY29r password for the M3vwHr account. This also affects \"Grouper for Web Services\" before 4.13.1.",
    "published": "2024-06-29T22:15:02.263",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-35119": {
    "cvss": 5.3,
    "description": "IBM InfoSphere Information Server 11.7 could allow a remote attacker to obtain sensitive information when a detailed technical error message is returned in a stack trace.  This information could be used in further attacks against the system.  IBM X-Force ID:  290342.",
    "published": "2024-06-30T17:15:03.153",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-31898": {
    "cvss": 5.4,
    "description": "IBM InfoSphere Information Server 11.7 could allow an authenticated user to read or modify sensitive information by bypassing authentication using insecure direct object references.   IBM X-Force ID:  288182.",
    "published": "2024-06-30T18:15:03.693",
    "keywords": "authentication,sensitive,bypass"
  }
}