{
  "CVE-2024-34727": {
    "cvss": "-",
    "description": "In sdpu_compare_uuid_with_attr of sdp_utils.cc, there is a possible out of bounds read due to a heap buffer overflow. This could lead to remote information disclosure with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-08-15T22:15:06.190",
    "keywords": "remote,execution"
  },
  "CVE-2024-34734": {
    "cvss": 7.7,
    "description": "In onForegroundServiceButtonClicked of FooterActionsViewModel.kt, there is a possible way to disable the active VPN app from the lockscreen due to an insecure default value. This could lead to local escalation of privilege with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-08-15T22:15:06.337",
    "keywords": "execution,vpn"
  },
  "CVE-2024-7630": {
    "cvss": 5.3,
    "description": "The Relevanssi – A Better Search plugin for WordPress is vulnerable to Information Exposure in all versions up to, and including, 4.22.2 via the relevanssi_do_query() due to insufficient limitations on the posts that are returned when searching. This makes it possible for unauthenticated attackers to extract potentially sensitive information from password protected posts.",
    "published": "2024-08-16T03:15:10.093",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-7146": {
    "cvss": 8.8,
    "description": "The JetTabs for Elementor plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 2.2.3 via the 'switcher_preset' parameter. This makes it possible for authenticated attackers, with Contributor-level access and above, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-08-16T11:15:04.230",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-42462": {
    "cvss": "-",
    "description": "Improper Authentication vulnerability in upKeeper Solutions product upKeeper Manager allows Authentication Bypass.This issue affects upKeeper Manager: through 5.1.9.",
    "published": "2024-08-16T14:15:13.253",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-42463": {
    "cvss": "-",
    "description": "Authorization Bypass Through User-Controlled Key vulnerability in upKeeper Solutions product upKeeper Manager allows Utilizing REST's Trust in the System Resource to Obtain Sensitive Data.This issue affects upKeeper Manager: through 5.1.9.",
    "published": "2024-08-16T14:15:13.650",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-42464": {
    "cvss": "-",
    "description": "Authorization Bypass Through User-Controlled Key vulnerability in upKeeper Solutions product upKeeper Manager allows Utilizing REST's Trust in the System Resource to Obtain Sensitive Data.This issue affects upKeeper Manager: through 5.1.9.",
    "published": "2024-08-16T14:15:13.933",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-7145": {
    "cvss": 8.8,
    "description": "The JetElements plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 2.6.20 via the 'progress_type' parameter. This makes it possible for authenticated attackers, with Contributor-level access and above, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-08-16T14:15:15.187",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-43381": {
    "cvss": 5.0,
    "description": "reNgine is an automated reconnaissance framework for web applications. Versions 2.1.2 and prior are susceptible to Stored Cross-Site Scripting (XSS) attacks. This vulnerability occurs when scanning a domain, and if the target domain's DNS record contains an XSS payload, it leads to the execution of malicious scripts in the reNgine's dashboard view when any user views the scan results. The XSS payload is directly fetched from the DNS record of the remote target domain. Consequently, an attacker can execute the attack without requiring any additional input from the target or the reNgine user. A patch is available and expected to be part of version 2.1.3.",
    "published": "2024-08-16T15:15:29.000",
    "keywords": "remote,execution"
  },
  "CVE-2024-7646": {
    "cvss": 8.8,
    "description": "A security issue was discovered in ingress-nginx where an actor with permission to create Ingress objects (in the `networking.k8s.io` or `extensions` API group) can bypass annotation validation to inject arbitrary commands and obtain the credentials of the ingress-nginx controller. In the default configuration, that credential has access to all secrets in the cluster.",
    "published": "2024-08-16T18:15:10.970",
    "keywords": "command,bypass"
  },
  "CVE-2024-6459": {
    "cvss": "-",
    "description": "The News Element Elementor Blog Magazine WordPress plugin before 1.0.6 is vulnerable to Local File Inclusion via the template parameter. This makes it possible for unauthenticated attacker to include and execute PHP files on the server, allowing the execution of any PHP code in those files.",
    "published": "2024-08-17T06:15:03.973",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-7896": {
    "cvss": 6.3,
    "description": "A vulnerability was found in Tosei Online Store Management System ネット店舗管理システム 4.02/4.03/4.04. It has been rated as critical. Affected by this issue is some unknown functionality of the file /cgi-bin/p1_ftpserver.php. The manipulation of the argument adr_txt leads to command injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-08-17T14:15:12.303",
    "keywords": "remote,command"
  },
  "CVE-2024-7897": {
    "cvss": 6.3,
    "description": "A vulnerability classified as critical has been found in Tosei Online Store Management System ネット店舗管理システム 4.02/4.03/4.04. This affects an unknown part of the file /cgi-bin/tosei_kikai.php. The manipulation of the argument kikaibangou leads to command injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-08-17T15:15:11.597",
    "keywords": "remote,command"
  },
  "CVE-2024-7907": {
    "cvss": 6.3,
    "description": "A vulnerability, which was classified as critical, has been found in TOTOLINK X6000R 9.4.0cu.852_20230719. This issue affects the function setSyslogCfg of the file /cgi-bin/cstecgi.cgi. The manipulation of the argument rtLogServer leads to command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-08-18T16:15:04.193",
    "keywords": "remote,command"
  }
}