{
  "CVE-2024-4255": {
    "cvss": 4.7,
    "description": "A vulnerability, which was classified as critical, has been found in Ruijie RG-UAC up to 20240419. This issue affects some unknown processing of the file /view/network Config/GRE/gre_edit_commit.php. The manipulation of the argument name leads to os command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-262145 was assigned to this vulnerability.",
    "published": "2024-04-27T15:15:06.437",
    "keywords": "remote,command"
  },
  "CVE-2024-33891": {
    "cvss": 8.8,
    "description": "Delinea Secret Server before 11.7.000001 allows attackers to bypass authentication via the SOAP API in SecretServer/webservices/SSWebService.asmx. This is related to a hardcoded key, the use of the integer 2 for the Admin user, and removal of the oauthExpirationId attribute.",
    "published": "2024-04-28T23:15:07.200",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-33903": {
    "url": "https://github.com/carla-simulator/carla/pull/7445",
    "cvss": "-",
    "description": "In CARLA through 0.9.15.2, the collision sensor mishandles some situations involving pedestrians or bicycles, in part because the collision sensor function is not exposed to the Blueprint library.",
    "published": "2024-04-29T01:15:09.600"
  },
  "CVE-2024-4298": {
    "cvss": 7.2,
    "description": "The email search interface of HGiga iSherlock (including MailSherlock, SpamSherock, AuditSherlock) fails to filter special characters in certain function parameters, allowing remote attackers with administrative privileges to exploit this vulnerability for Command Injection attacks, enabling execution of arbitrary system commands.",
    "published": "2024-04-29T03:15:09.810",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-4299": {
    "cvss": 7.2,
    "description": "The system configuration interface of HGiga iSherlock (including MailSherlock, SpamSherock, AuditSherlock) fails to filter special characters in certain function parameters, allowing remote attackers with administrative privileges to exploit this vulnerability for Command Injection attacks, enabling execution of arbitrary system commands.",
    "published": "2024-04-29T04:15:08.623",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-4300": {
    "cvss": 9.8,
    "description": "E-WEBInformationCo. FS-EZViewer(Web) exposes sensitive information in the service. A remote attacker can obtain the database configuration file path through the webpage source code without login. Accessing this path allows attacker to obtain the database credential with the highest privilege and database host IP address. With this information, attackers can connect to the database and perform actions such as adding, modifying, or deleting database contents.",
    "published": "2024-04-29T04:15:08.887",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-4301": {
    "cvss": 8.8,
    "description": "N-Reporter and N-Cloud, products of the N-Partner, have an OS Command Injection vulnerability. Remote attackers with normal user privilege can execute arbitrary system commands by manipulating user inputs on a specific page.",
    "published": "2024-04-29T04:15:09.110",
    "keywords": "remote,command"
  },
  "CVE-2024-33904": {
    "url": "https://github.com/hyprwm/hyprland/commit/28c85619243e6320e75d7abcfe8244fa99d054dd",
    "cvss": "-",
    "description": "In plugins/HookSystem.cpp in Hyprland through 0.39.1 (before 28c8561), through a race condition, a local attacker can cause execution of arbitrary assembly code by writing to a predictable temporary file.",
    "published": "2024-04-29T06:15:17.320"
  },
  "CVE-2024-33905": {
    "url": "https://github.com/morethanwords/tweb/commit/2153ea9878668769faac8dd5931b7e0b96a9f129/src/components/popups/webapp.ts",
    "cvss": "-",
    "description": "In Telegram WebK before 2.0.0 (488), a crafted Mini Web App allows XSS via the postMessage web_app_open_link event type.",
    "published": "2024-04-29T06:15:17.667"
  },
  "CVE-2024-4302": {
    "cvss": 6.1,
    "description": "Super 8 Live Chat online customer service platform fails to properly filter user input, allowing unauthenticated remote attackers to insert JavaScript code into the chat box. When the message recipient views the message, they become susceptible to Cross-site Scripting (XSS) attacks.",
    "published": "2024-04-29T06:15:17.803",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-4303": {
    "cvss": 8.8,
    "description": "ArmorX Android APP's multi-factor authentication (MFA) for the login function is not properly implemented. Remote attackers who obtain user credentials can bypass MFA, allowing them to successfully log into the APP.",
    "published": "2024-04-29T06:15:18.457",
    "keywords": "remote,authentication,bypass"
  },
  "CVE-2024-3191": {
    "cvss": 9.8,
    "description": "A vulnerability, which was classified as critical, has been found in MailCleaner up to 2023.03.14. This issue affects some unknown processing of the component Email Handler. The manipulation leads to os command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. It is recommended to apply a patch to fix this issue. The associated identifier of this vulnerability is VDB-262307.",
    "published": "2024-04-29T07:15:07.080",
    "keywords": "remote,command"
  },
  "CVE-2024-3192": {
    "url": "https://github.com/mailcleaner/mailcleaner/pull/601",
    "cvss": 4.3,
    "description": "A vulnerability, which was classified as problematic, was found in MailCleaner up to 2023.03.14. Affected is an unknown function of the component Admin Interface. The manipulation as part of Mail Message leads to cross site scripting. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. It is recommended to apply a patch to fix this issue. The identifier of this vulnerability is VDB-262308.",
    "published": "2024-04-29T07:15:07.480"
  },
  "CVE-2024-3193": {
    "cvss": 8.8,
    "description": "A vulnerability has been found in MailCleaner up to 2023.03.14 and classified as critical. Affected by this vulnerability is an unknown functionality of the component Admin Endpoints. The manipulation leads to os command injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. It is recommended to apply a patch to fix this issue. The identifier VDB-262309 was assigned to this vulnerability.",
    "published": "2024-04-29T07:15:07.773",
    "keywords": "remote,command"
  },
  "CVE-2024-3194": {
    "url": "https://github.com/mailcleaner/mailcleaner/pull/601",
    "cvss": 4.3,
    "description": "A vulnerability was found in MailCleaner up to 2023.03.14 and classified as problematic. Affected by this issue is some unknown functionality of the component Log File Endpoint. The manipulation leads to cross site scripting. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. It is recommended to apply a patch to fix this issue. VDB-262310 is the identifier assigned to this vulnerability.",
    "published": "2024-04-29T07:15:08.070"
  },
  "CVE-2024-3195": {
    "url": "https://github.com/mailcleaner/mailcleaner/pull/601",
    "cvss": 4.7,
    "description": "A vulnerability was found in MailCleaner up to 2023.03.14. It has been classified as critical. This affects an unknown part of the component Admin Endpoints. The manipulation leads to path traversal. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. It is recommended to apply a patch to fix this issue. The associated identifier of this vulnerability is VDB-262311.",
    "published": "2024-04-29T07:15:08.400"
  },
  "CVE-2024-3196": {
    "url": "https://github.com/mailcleaner/mailcleaner/pull/601",
    "cvss": 6.7,
    "description": "A vulnerability was found in MailCleaner up to 2023.03.14. It has been declared as critical. This vulnerability affects the function getStats/Services_silentDump/Services_stopStartMTA/Config_saveDateTime/Config_hostid/Logs_StartGetStat/dumpConfiguration of the component SOAP Service. The manipulation leads to os command injection. Local access is required to approach this attack. The exploit has been disclosed to the public and may be used. It is recommended to apply a patch to fix this issue. The identifier of this vulnerability is VDB-262312.",
    "published": "2024-04-29T07:15:08.740"
  },
  "CVE-2024-33444": {
    "url": "https://github.com/liu21st/onethink/issues/39",
    "cvss": "-",
    "description": "SQL injection vulnerability in onethink v.1.1 allows a remote attacker to escalate privileges via a crafted script to the ModelModel.class.php component.",
    "published": "2024-04-29T17:15:19.357"
  },
  "CVE-2024-33445": {
    "url": "https://github.com/hisiphp/hisiphp/issues/11",
    "cvss": "-",
    "description": "An issue in hisiphp v2.0.111 allows a remote attacker to execute arbitrary code via a crafted script to the SystemPlugins::mkInfo parameter in the SystemPlugins.php component.",
    "published": "2024-04-29T17:15:19.410"
  },
  "CVE-2024-33449": {
    "cvss": "-",
    "description": "An SSRF issue in the PDFMyURL service allows a remote attacker to obtain sensitive information and execute arbitrary code via a POST request in the url parameter",
    "published": "2024-04-29T17:15:19.470",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-31820": {
    "url": "https://github.com/kirilkirkov/ecommerce-codeigniter-bootstrap/commit/d22b54e8915f167a135046ceb857caaf8479c4da",
    "cvss": "-",
    "description": "An issue in Ecommerce-CodeIgniter-Bootstrap commit v. d22b54e8915f167a135046ceb857caaf8479c4da allows a remote attacker to execute arbitrary code via the getLangFolderForEdit method of the Languages.php component.",
    "published": "2024-04-29T18:15:07.683"
  },
  "CVE-2024-31821": {
    "url": "https://github.com/kirilkirkov/ecommerce-codeigniter-bootstrap/commit/d22b54e8915f167a135046ceb857caaf8479c4da",
    "cvss": "-",
    "description": "SQL Injection vulnerability in Ecommerce-CodeIgniter-Bootstrap commit v. d22b54e8915f167a135046ceb857caaf8479c4da allows a remote attacker to execute arbitrary code via the manageQuantitiesAndProcurement method of the Orders_model.php component.",
    "published": "2024-04-29T18:15:07.747"
  },
  "CVE-2024-31822": {
    "url": "https://github.com/kirilkirkov/ecommerce-codeigniter-bootstrap/commit/d22b54e8915f167a135046ceb857caaf8479c4da",
    "cvss": "-",
    "description": "An issue in Ecommerce-CodeIgniter-Bootstrap commit v. d22b54e8915f167a135046ceb857caaf8479c4da allows a remote attacker to execute arbitrary code via the saveLanguageFiles method of the Languages.php component.",
    "published": "2024-04-29T18:15:07.817"
  },
  "CVE-2024-31823": {
    "url": "https://github.com/kirilkirkov/ecommerce-codeigniter-bootstrap/commit/d22b54e8915f167a135046ceb857caaf8479c4da",
    "cvss": "-",
    "description": "An issue in Ecommerce-CodeIgniter-Bootstrap commit v. d22b54e8915f167a135046ceb857caaf8479c4da allows a remote attacker to execute arbitrary code via the removeSecondaryImage method of the Publish.php component.",
    "published": "2024-04-29T18:15:07.880"
  },
  "CVE-2024-33338": {
    "cvss": "-",
    "description": "Cross Site Scripting vulnerability in jizhicms v.2.5.4 allows a remote attacker to obtain sensitive information via a crafted article publication request.",
    "published": "2024-04-29T18:15:07.937",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-33443": {
    "url": "https://github.com/liu21st/onethink/issues/40",
    "cvss": "-",
    "description": "An issue in onethink v.1.1 allows a remote attacker to execute arbitrary code via a crafted script to the AddonsController.class.php component.",
    "published": "2024-04-29T18:15:08.100"
  },
  "CVE-2024-0840": {
    "cvss": 8.8,
    "description": "The Grandstream UCM Series IP PBX before firmware version 1.0.20.52 is affected by a parameter injection vulnerability in the HTTP interface. A remote and authenticated attacker can execute arbitrary code by sending a crafted HTTP request. Authentication may be possible using a default user and password. Affected models are the UCM6202, UCM6204, UCM6208, and UCM6510.\n",
    "published": "2024-04-29T19:15:19.730",
    "keywords": "remote,authentication"
  },
  "CVE-2024-31801": {
    "cvss": "-",
    "description": "Directory Traversal vulnerability in NEXSYS-ONE before v.Rev.15320 allows a remote attacker to obtain sensitive information via a crafted request.",
    "published": "2024-04-29T20:15:08.453",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-33276": {
    "cvss": "-",
    "description": "SQL Injection vulnerability in FME Modules preorderandnotication v.3.1.0 and before allows a remote attacker to run arbitrary SQL commands via the PreorderModel::getIdProductAttributesByIdAttributes() method.",
    "published": "2024-04-29T20:15:08.753",
    "keywords": "remote,command"
  },
  "CVE-2024-33350": {
    "cvss": "-",
    "description": "Directory Traversal vulnerability in TaoCMS v.3.0.2 allows a remote attacker to execute arbitrary code and obtain sensitive information via the include/model/file.php component.",
    "published": "2024-04-29T21:15:47.960",
    "keywords": "remote,sensitive"
  }
}