{
  "CVE-2024-8448": {
    "cvss": 8.8,
    "description": "Certain switch models from PLANET Technology have a hard-coded credential in the specific command-line interface, allowing remote attackers with regular privilege to log in with this credential and obtain a Linux root shell.",
    "published": "2024-09-30T07:15:03.507",
    "keywords": "remote,command"
  },
  "CVE-2024-45200": {
    "cvss": 6.3,
    "description": "In Nintendo Mario Kart 8 Deluxe before 3.0.3, the LAN/LDN local multiplayer implementation allows a remote attacker to exploit a stack-based buffer overflow upon deserialization of session information via a malformed browse-reply packet, aka KartLANPwn. The victim is not required to join a game session with an attacker. The victim must open the \"Wireless Play\" (or \"LAN Play\") menu from the game's title screen, and an attacker nearby (LDN) or on the same LAN network as the victim can send a crafted reply packet to the victim's console. This enables a remote attacker to obtain complete denial-of-service on the game's process, or potentially, remote code execution on the victim's console. The issue is caused by incorrect use of the Nintendo Pia library,",
    "published": "2024-09-30T08:15:03.760",
    "keywords": "remote,execution"
  },
  "CVE-2024-8454": {
    "cvss": 5.3,
    "description": "The swctrl service is used to detect and remotely manage PLANET Technology devices. Certain switch models have a Denial-of-Service vulnerability in the swctrl service, allowing unauthenticated remote attackers to send crafted packets that can crash the service.",
    "published": "2024-09-30T08:15:04.340",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-8455": {
    "cvss": 8.1,
    "description": "The swctrl service is used to detect and remotely manage PLANET Technology devices. For certain switch models, the authentication tokens used during communication with this service are encoded user passwords. Due to insufficient strength, unauthorized remote attackers who intercept the packets can directly crack them to obtain plaintext passwords.",
    "published": "2024-09-30T08:15:04.570",
    "keywords": "remote,authentication"
  },
  "CVE-2024-8456": {
    "cvss": 9.8,
    "description": "Certain switch models from PLANET Technology lack proper access control in firmware upload and download functionality, allowing unauthenticated remote attackers to download and upload firmware and system configurations, ultimately gaining full control of the devices.",
    "published": "2024-09-30T08:15:04.797",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-8458": {
    "cvss": 8.8,
    "description": "Certain switch models from PLANET Technology have a web application that is vulnerable to Cross-Site Request Forgery (CSRF). An unauthenticated remote attacker can trick a user into visiting a malicious website, allowing the attacker to impersonate the user and perform actions on their behalf, such as creating accounts.",
    "published": "2024-09-30T08:15:05.223",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-46540": {
    "cvss": 6.3,
    "description": "A remote code execution (RCE) vulnerability in the component /admin/store.php of Emlog Pro before v2.3.15 allows attackers to use remote file downloads and self-extract fucntions to upload webshells to the target server, thereby obtaining system privileges.",
    "published": "2024-09-30T17:15:04.550",
    "keywords": "remote,execution"
  },
  "CVE-2024-42017": {
    "cvss": 10.0,
    "description": "An issue was discovered in Atos Eviden iCare 2.7.1 through 2.7.11. The application exposes a web interface locally. In the worst-case scenario, if the application is remotely accessible, it allows an attacker to execute arbitrary commands with system privilege on the endpoint hosting the application, without any authentication.",
    "published": "2024-09-30T18:15:05.827",
    "keywords": "remote,authentication,command"
  },
  "CVE-2024-47295": {
    "cvss": 8.1,
    "description": "Insecure initial password configuration issue in SEIKO EPSON Web Config allows a remote unauthenticated attacker to set an arbitrary password and operate the device with an administrative privilege. As for the details of the affected versions, see the information provided by the vendor under [References].",
    "published": "2024-10-01T04:15:18.040",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-9106": {
    "cvss": 9.8,
    "description": "The Wechat Social login plugin for WordPress is vulnerable to authentication bypass in versions up to, and including, 1.3.0. This is due to insufficient verification on the user being supplied during the social login. This makes it possible for unauthenticated attackers to log in as any existing user on the site, such as an administrator, if they have access to the user id. This is only exploitable if the app secret is not set, so it has a default empty value.",
    "published": "2024-10-01T08:15:05.267",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-9108": {
    "cvss": 9.8,
    "description": "The Wechat Social login plugin for WordPress is vulnerable to arbitrary file uploads due to insufficient file type validation in the 'convert_remoteimage_to_local' function in versions up to, and including, 1.3.0. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-10-01T08:15:05.480",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-9289": {
    "cvss": 9.8,
    "description": "The WordPress & WooCommerce Affiliate Program plugin for WordPress is vulnerable to authentication bypass in all versions up to, and including, 8.4.1. This is due to the rtwwwap_login_request_callback() function not properly validating a user's identity prior to authenticating them to the site. This makes it possible for unauthenticated attackers to log in as any user, including administrators, granted they have access to the administrator's email.",
    "published": "2024-10-01T09:15:09.320",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-9405": {
    "cvss": 5.3,
    "description": "An incorrect limitation of a path to a restricted directory (path traversal) has been detected in Pluck CMS, affecting version 4.7.18. An unauthenticated attacker could extract sensitive information from the server via the absolute path of a file located in the same directory or subdirectory as the module, but not from recursive directories.",
    "published": "2024-10-01T12:15:03.893",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-41276": {
    "cvss": 9.8,
    "description": "A vulnerability in Kaiten version 57.131.12 and earlier allows attackers to bypass the PIN code authentication mechanism. The application requires users to input a 6-digit PIN code sent to their email for authorization after entering their login credentials. However, the request limiting mechanism can be easily bypassed, enabling attackers to perform a brute force attack to guess the correct PIN and gain unauthorized access to the application.",
    "published": "2024-10-01T14:15:05.477",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-25660": {
    "cvss": 9.0,
    "description": "The WebDAV service in Infinera TNMS (Transcend Network Management System) 19.10.3 allows a low-privileged remote attacker to conduct unauthorized file operations, because of execution with unnecessary privileges.",
    "published": "2024-10-01T16:15:09.463",
    "keywords": "remote,execution"
  },
  "CVE-2024-47604": {
    "url": "https://github.com/nuget/nugetgallery/pull/10193",
    "cvss": 8.2,
    "description": "NuGet Gallery is a package repository that powers nuget.org. The NuGetGallery has a security vulnerability in its handling of HTML element attributes, which allows an attacker to execute arbitrary HTML or Javascript code in a victim's browser.",
    "published": "2024-10-01T16:15:10.003"
  },
  "CVE-2024-42514": {
    "cvss": 9.1,
    "description": "A vulnerability in the legacy chat component of Mitel MiContact Center Business through 10.1.0.4 could allow an unauthenticated attacker to conduct an unauthorized access attack due to inadequate access control checks. A successful exploit could allow an attacker to access sensitive information and send unauthorized messages.",
    "published": "2024-10-01T19:15:07.883",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-9341": {
    "cvss": 5.4,
    "description": "A flaw was found in Go. When FIPS mode is enabled on a system, container runtimes may incorrectly handle certain file paths due to improper validation in the containers/common Go library. This flaw allows an attacker to exploit symbolic links and trick the system into mounting sensitive host directories inside a container. This issue also allows attackers to access critical host files, bypassing the intended isolation between containers and the host system.",
    "published": "2024-10-01T19:15:09.500",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-46080": {
    "cvss": 8.0,
    "description": "Scriptcase v9.10.023 and before is vulnerable to Remote Code Execution (RCE) via the nm_zip function.",
    "published": "2024-10-01T21:15:06.767",
    "keywords": "remote,execution"
  },
  "CVE-2024-46084": {
    "cvss": 8.0,
    "description": "Scriptcase 9.10.023 and before is vulnerable to Remote Code Execution (RCE) via the nm_unzip function.",
    "published": "2024-10-01T21:15:06.950",
    "keywords": "remote,execution"
  },
  "CVE-2024-9407": {
    "cvss": 4.7,
    "description": "A vulnerability exists in the bind-propagation option of the Dockerfile RUN --mount instruction. The system does not properly validate the input passed to this option, allowing users to pass arbitrary parameters to the mount instruction. This issue can be exploited to mount sensitive directories from the host into a container during the build process and, in some cases, modify the contents of those mounted files. Even if SELinux is used, this vulnerability can bypass its protection by allowing the source directory to be relabeled to give the container access to host files.",
    "published": "2024-10-01T21:15:08.530",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-21530": {
    "url": "https://github.com/fadeevab/cocoon/commit/1b6392173ce35db4736a94b62b2d2973f9a71441",
    "cvss": 4.5,
    "description": "Versions of the package cocoon before 0.4.0 are vulnerable to Reusing a Nonce, Key Pair in Encryption when the encrypt, wrap, and dump functions are sequentially called. An attacker can generate the same ciphertext by creating a new encrypted message with the same cocoon object.\r\r**Note:**\rThe issue does NOT affect objects created with Cocoon::new which utilizes ThreadRng.",
    "published": "2024-10-02T05:15:11.300"
  },
  "CVE-2024-33662": {
    "url": "https://github.com/portainer/portainer/issues/11737",
    "cvss": "-",
    "description": "Portainer before 2.20.2 improperly uses an encryption algorithm in the AesEncrypt function.",
    "published": "2024-10-02T05:15:11.643"
  },
  "CVE-2024-7855": {
    "cvss": 8.8,
    "description": "The WP Hotel Booking plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the update_review() function in all versions up to, and including, 2.1.2. This makes it possible for authenticated attackers, with subscriber-level access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-10-02T05:15:11.843",
    "keywords": "remote,execution"
  },
  "CVE-2024-7315": {
    "cvss": 7.5,
    "description": "The Migration, Backup, Staging  WordPress plugin before 0.9.106 does not use sufficient randomness in the filename that is created when generating a backup, which could be bruteforced by attackers to leak sensitive information about said backups.",
    "published": "2024-10-02T06:15:09.963",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-35293": {
    "cvss": 9.1,
    "description": "An unauthenticated remote attacker may use a missing authentication for critical function vulnerability to reboot or erase the affected devices resulting in data loss and/or a DoS.",
    "published": "2024-10-02T10:15:03.160",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2024-35294": {
    "cvss": 6.5,
    "description": "An unauthenticated remote attacker may use the devices traffic capture without authentication to grab plaintext administrative credentials.",
    "published": "2024-10-02T11:15:10.780",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2024-20365": {
    "cvss": 6.5,
    "description": "A vulnerability in the Redfish API of Cisco UCS B-Series, Cisco UCS Managed C-Series, and Cisco UCS X-Series Servers could allow an authenticated, remote attacker with administrative privileges to perform command injection attacks on an affected system and elevate privileges to root.\r\n\r\nThis vulnerability is due to insufficient input validation. An attacker with administrative privileges could exploit this vulnerability by sending crafted commands through the Redfish API on an affected device. A successful exploit could allow the attacker to elevate privileges to root.",
    "published": "2024-10-02T17:15:14.863",
    "keywords": "remote,command"
  },
  "CVE-2024-20385": {
    "cvss": 5.9,
    "description": "A vulnerability in the SSL/TLS implementation of Cisco Nexus Dashboard Orchestrator (NDO) could allow an unauthenticated, remote attacker to intercept sensitive information from an affected device.&nbsp;\r\n\r\nThis vulnerability exists because the Cisco NDO Validate Peer Certificate site management feature validates the certificates for Cisco Application Policy Infrastructure Controller (APIC), Cisco Cloud Network Controller (CNC), and Cisco Nexus Dashboard only when a new site is added or an existing one is reregistered. An attacker could exploit this vulnerability by using machine-in-the-middle techniques to intercept the traffic between the affected device and Cisco NDO and then using a crafted certificate to impersonate the affected device. A successful exploit could allow the attacker to learn sensitive information during communications between these devices.",
    "published": "2024-10-02T17:15:15.110",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-20393": {
    "cvss": 8.8,
    "description": "A vulnerability in the web-based management interface of Cisco Small Business RV340, RV340W, RV345, and RV345P Dual WAN Gigabit VPN Routers could allow an authenticated, remote attacker to elevate privileges on an affected device.\r\n\r\nThis vulnerability exists because the web-based management interface discloses sensitive information. An attacker could exploit this vulnerability by sending crafted HTTP input to an affected device. A successful exploit could allow an attacker to elevate privileges from guest to admin.",
    "published": "2024-10-02T17:15:15.337",
    "keywords": "remote,sensitive,vpn"
  },
  "CVE-2024-20432": {
    "cvss": 9.9,
    "description": "A vulnerability in the REST API and web UI of Cisco Nexus Dashboard Fabric Controller (NDFC) could allow an authenticated, low-privileged, remote attacker to perform a command injection attack against an affected device.\r\n&nbsp;\r\nThis vulnerability is due to improper user authorization and insufficient validation of command arguments. An attacker could exploit this vulnerability by submitting crafted commands to an affected REST API endpoint or through the web UI. A successful exploit could allow the attacker to execute arbitrary commands on the CLI of a Cisco NDFC-managed device with network-admin privileges.\r\n&nbsp;\r\nNote: This vulnerability does not affect Cisco NDFC when it is configured for storage area network (SAN) controller deployment.",
    "published": "2024-10-02T17:15:15.550",
    "keywords": "remote,command"
  },
  "CVE-2024-20441": {
    "cvss": 5.7,
    "description": "A vulnerability in a specific REST API endpoint of Cisco NDFC could allow an authenticated, low-privileged, remote attacker to learn sensitive information on an affected device.\r\n\r\nThis vulnerability is due to insufficient authorization controls on the affected REST API endpoint. An attacker could exploit this vulnerability by sending crafted API requests to the&nbsp;affected endpoint. A successful exploit could allow the attacker to download config only or full backup files and learn sensitive configuration information. This vulnerability only affects a specific REST API endpoint and does not affect the web-based management interface.",
    "published": "2024-10-02T17:15:15.967",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-20444": {
    "cvss": 5.5,
    "description": "A vulnerability in Cisco Nexus Dashboard Fabric Controller (NDFC), formerly Cisco Data Center Network Manager (DCNM), could allow an authenticated, remote attacker with network-admin privileges to perform a command injection attack against an affected device.\r\n&nbsp;\r\nThis vulnerability is due to insufficient validation of command arguments. An attacker could exploit this vulnerability by submitting crafted command arguments to a specific REST API endpoint. A successful exploit could allow the attacker to overwrite sensitive files or crash a specific container, which would restart on its own, causing a low-impact denial of service (DoS) condition.",
    "published": "2024-10-02T17:15:16.390",
    "keywords": "remote,command,sensitive"
  },
  "CVE-2024-20470": {
    "cvss": 6.5,
    "description": "A vulnerability in the web-based management interface of Cisco Small Business RV340, RV340W, RV345, and RV345P Dual WAN Gigabit VPN Routers could allow an authenticated, remote attacker to execute arbitrary code on an affected device. In order to exploit this vulnerability, the attacker must have valid admin credentials.\r\n\r\nThis vulnerability exists because the web-based management interface does not sufficiently validate user-supplied input. An attacker could exploit this vulnerability by sending crafted HTTP input to an affected device. A successful exploit could allow the attacker to execute arbitrary code as the root user on the underlying operating system.",
    "published": "2024-10-02T17:15:17.027",
    "keywords": "remote,vpn"
  },
  "CVE-2024-20491": {
    "cvss": 6.3,
    "description": "A vulnerability in a logging function of Cisco Nexus Dashboard Insights could allow an attacker with access to a tech support file to view sensitive information.\r\n\r\nThis vulnerability exists because remote controller credentials are recorded in an internal log that is stored in the tech support file. An attacker could exploit this vulnerability by accessing a tech support file that is generated from an affected system. A successful exploit could allow the attacker to view remote controller admin credentials in clear text.\r\nNote: Best practice is to store debug logs and tech support files safely and to share them only with trusted parties because they may contain sensitive information.",
    "published": "2024-10-02T17:15:17.563",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-20515": {
    "cvss": 6.5,
    "description": "A vulnerability in the web-based management interface of Cisco Identity Services Engine (ISE) could allow an authenticated, remote attacker to obtain sensitive information from an affected device.\r\n\r\nThis vulnerability is due to a lack of proper data protection mechanisms for certain configuration settings. An attacker with Read-Only Administrator privileges could exploit this vulnerability by browsing to a page that contains sensitive data. A successful exploit could allow the attacker to view device credentials that are normally not visible to Read-Only Administrators.",
    "published": "2024-10-02T17:15:17.973",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-24122": {
    "cvss": "-",
    "description": "A remote code execution vulnerability in the project management of Wanxing Technology's Yitu project which allows an attacker to use the exp.adpx file as a zip compressed file to construct a special file name, which can be used to decompress the project file into the system startup folder, restart the system, and automatically execute the constructed attack script.",
    "published": "2024-10-02T18:15:04.957",
    "keywords": "remote,execution"
  },
  "CVE-2024-20498": {
    "cvss": 8.6,
    "description": "Multiple vulnerabilities in the Cisco AnyConnect VPN server of Cisco Meraki MX and Cisco Meraki Z Series Teleworker Gateway devices could allow an unauthenticated, remote attacker to cause a DoS condition in the AnyConnect service on an affected device.\r\n\r\nThese vulnerabilities are due to insufficient validation of client-supplied parameters while establishing an SSL VPN session. An attacker could exploit these vulnerabilities by sending a crafted HTTPS request to the VPN server of an affected device. A successful exploit could allow the attacker to cause the Cisco AnyConnect VPN server to restart, resulting in the failure of the established SSL VPN connections and forcing remote users to initiate a new VPN connection and reauthenticate. A sustained attack could prevent new SSL VPN connections from being established.\r\nNote: When the attack traffic stops, the Cisco AnyConnect VPN server recovers gracefully without requiring manual intervention.",
    "published": "2024-10-02T19:15:13.870",
    "keywords": "remote,unauthenticated,vpn"
  },
  "CVE-2024-20499": {
    "cvss": 8.6,
    "description": "Multiple vulnerabilities in the Cisco AnyConnect VPN server of Cisco Meraki MX and Cisco Meraki Z Series Teleworker Gateway devices could allow an unauthenticated, remote attacker to cause a DoS condition in the AnyConnect service on an affected device.\r\n\r\nThese vulnerabilities are due to insufficient validation of client-supplied parameters while establishing an SSL VPN session. An attacker could exploit these vulnerabilities by sending a crafted HTTPS request to the VPN server of an affected device. A successful exploit could allow the attacker to cause the Cisco AnyConnect VPN server to restart, resulting in the failure of the established SSL VPN connections and forcing remote users to initiate a new VPN connection and reauthenticate. A sustained attack could prevent new SSL VPN connections from being established.\r\nNote: When the attack traffic stops, the Cisco AnyConnect VPN server recovers gracefully without requiring manual intervention.",
    "published": "2024-10-02T19:15:14.143",
    "keywords": "remote,unauthenticated,vpn"
  },
  "CVE-2024-20500": {
    "cvss": 5.8,
    "description": "A vulnerability in the Cisco AnyConnect VPN server of Cisco Meraki MX and Cisco Meraki Z Series Teleworker Gateway devices could allow an unauthenticated, remote attacker to cause a DoS condition in the AnyConnect service on an affected device.\r\n\r\nThis vulnerability is due to insufficient resource management when establishing TLS/SSL sessions. An attacker could exploit this vulnerability by sending a series of crafted TLS/SSL messages to the VPN server of an affected device. A successful exploit could allow the attacker to cause the Cisco AnyConnect VPN server to stop accepting new connections, preventing new SSL VPN connections from being established. Existing SSL VPN sessions are not impacted.\r\nNote: When the attack traffic stops, the Cisco AnyConnect VPN server recovers gracefully without requiring manual intervention.",
    "published": "2024-10-02T19:15:14.350",
    "keywords": "remote,unauthenticated,vpn"
  },
  "CVE-2024-20501": {
    "cvss": 8.6,
    "description": "Multiple vulnerabilities in the Cisco AnyConnect VPN server of Cisco Meraki MX and Cisco Meraki Z Series Teleworker Gateway devices could allow an unauthenticated, remote attacker to cause a DoS condition in the AnyConnect service on an affected device.\r\n\r\nThese vulnerabilities are due to insufficient validation of client-supplied parameters while establishing an SSL VPN session. An attacker could exploit these vulnerabilities by sending a crafted HTTPS request to the VPN server of an affected device. A successful exploit could allow the attacker to cause the Cisco AnyConnect VPN server to restart, resulting in the failure of the established SSL VPN connections and forcing remote users to initiate a new VPN connection and reauthenticate. A sustained attack could prevent new SSL VPN connections from being established.\r\nNote: When the attack traffic stops, the Cisco AnyConnect VPN server recovers gracefully without requiring manual intervention.",
    "published": "2024-10-02T19:15:14.570",
    "keywords": "remote,unauthenticated,vpn"
  },
  "CVE-2024-20502": {
    "cvss": 5.8,
    "description": "A vulnerability in the Cisco AnyConnect VPN server of Cisco Meraki MX and Cisco Meraki Z Series Teleworker Gateway devices could allow an unauthenticated, remote attacker to cause a DoS condition on an affected device.\r\n\r\nThis vulnerability is due to insufficient resource management while establishing SSL VPN sessions. An attacker could exploit this vulnerability by sending a series of crafted HTTPS requests to the VPN server of an affected device. A successful exploit could allow the attacker to cause the Cisco AnyConnect VPN server to stop accepting new connections, preventing new SSL VPN connections from being established. Existing SSL VPN sessions are not impacted.\r\nNote: When the attack traffic stops, the Cisco AnyConnect VPN server recovers gracefully without requiring manual intervention.",
    "published": "2024-10-02T19:15:14.780",
    "keywords": "remote,unauthenticated,vpn"
  },
  "CVE-2024-20509": {
    "cvss": 5.8,
    "description": "A vulnerability in the Cisco AnyConnect VPN server of Cisco Meraki MX and Cisco Meraki Z Series Teleworker Gateway devices could allow an unauthenticated, remote attacker to hijack an AnyConnect VPN session or cause a denial of service (DoS) condition for individual users of the AnyConnect VPN service on an affected device.\r\n\r\nThis vulnerability is due to weak entropy for handlers that are used during the VPN authentication process as well as a race condition that exists in the same process. An attacker could exploit this vulnerability by correctly guessing an authentication handler and then sending crafted HTTPS requests to an affected device. A successful exploit could allow the attacker to take over the AnyConnect VPN session from a target user or prevent the target user from establishing an AnyConnect VPN session with the affected device.",
    "published": "2024-10-02T19:15:14.997",
    "keywords": "remote,unauthenticated,authentication,vpn"
  },
  "CVE-2024-20513": {
    "cvss": 5.8,
    "description": "A vulnerability in the Cisco AnyConnect VPN server of Cisco Meraki MX and Cisco Meraki Z Series Teleworker Gateway devices could allow an unauthenticated, remote attacker to cause a DoS condition for targeted users of the AnyConnect service on an affected device.\r\n\r\nThis vulnerability is due to insufficient entropy for handlers that are used during SSL VPN session establishment. An unauthenticated attacker could exploit this vulnerability by brute forcing valid session handlers. An authenticated attacker could exploit this vulnerability by connecting to the AnyConnect VPN service of an affected device to retrieve a valid session handler and, based on that handler, predict further valid session handlers. The attacker would then send a crafted HTTPS request using the brute-forced or predicted session handler to the AnyConnect VPN server of the device. A successful exploit could allow the attacker to terminate targeted SSL VPN sessions, forcing remote users to initiate new VPN connections and reauthenticate.",
    "published": "2024-10-02T19:15:15.210",
    "keywords": "remote,unauthenticated,vpn"
  },
  "CVE-2024-9440": {
    "url": "https://github.com/brianvoe/slim-select/issues/564",
    "cvss": 5.4,
    "description": "Slim Select 2.0 versions through 2.9.0 are affected by a potential cross-site scripting vulnerability. In select.ts:createOption(), the text variable from the user-provided Options object is assigned to an innerHTML without sanitation. Software that depends on this library to dynamically generate lists using unsanitized user-provided input may be vulnerable to cross-site scripting, resulting in attacker executed JavaScript. At this time, no patch is available.",
    "published": "2024-10-02T19:15:15.880"
  },
  "CVE-2024-9441": {
    "cvss": 9.8,
    "description": "The Linear eMerge e3-Series through version 1.00-07 is vulnerable to an OS command injection vulnerability. A remote and unauthenticated attacker can execute arbitrary OS commands via the login_id parameter when invoking the forgot_password functionality over HTTP.",
    "published": "2024-10-02T19:15:16.100",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-45519": {
    "cvss": 10.0,
    "description": "The postjournal service in Zimbra Collaboration (ZCS) before 8.8.15 Patch 46, 9 before 9.0.0 Patch 41, 10 before 10.0.9, and 10.1 before 10.1.1 sometimes allows unauthenticated users to execute commands.",
    "published": "2024-10-02T22:15:02.770",
    "keywords": "unauthenticated,command"
  },
  "CVE-2024-8352": {
    "cvss": 7.5,
    "description": "The Social Web Suite – Social Media Auto Post, Social Media Auto Publish plugin for WordPress is vulnerable to Directory Traversal in all versions up to, and including, 4.1.11 via the download_log function. This makes it possible for unauthenticated attackers to read the contents of arbitrary files on the server, which can contain sensitive information.",
    "published": "2024-10-03T04:15:04.613",
    "keywords": "unauthenticated,sensitive"
  }
}