{
  "CVE-2024-48195": {
    "cvss": 6.1,
    "description": "Cross Site Scripting vulnerability in eyouCMS v.1.6.7 allows a remote attacker to obtain sensitive information via a crafted script to the post parameter.",
    "published": "2024-10-28T20:15:05.903",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-48196": {
    "cvss": 7.5,
    "description": "An issue in eyouCMS v.1.6.7 allows a remote attacker to obtain sensitive information via a crafted script to the post parameter.",
    "published": "2024-10-28T20:15:05.960",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-48825": {
    "cvss": 8.0,
    "description": "Tenda AC7 v.15.03.06.44 ate_ifconfig_set has pre-authentication command injection allowing remote attackers to execute arbitrary code.",
    "published": "2024-10-28T20:15:06.173",
    "keywords": "remote,authentication,command"
  },
  "CVE-2024-48826": {
    "cvss": 8.0,
    "description": "Tenda AC7 v.15.03.06.44 ate_iwpriv_set has pre-authentication command injection allowing remote attackers to execute arbitrary code.",
    "published": "2024-10-28T20:15:06.237",
    "keywords": "remote,authentication,command"
  },
  "CVE-2024-49755": {
    "cvss": 3.1,
    "description": "Duende IdentityServer is an OpenID Connect and OAuth 2.x framework for ASP.NET Core. IdentityServer's local API authentication handler performs insufficient validation of the cnf claim in DPoP access tokens. This allows an attacker to use leaked DPoP access tokens at local api endpoints even without possessing the private key for signing proof tokens. Note that this only impacts custom endpoints within an IdentityServer implementation that have explicitly used the LocalApiAuthenticationHandler for authentication. This vulnerability is patched in IdentityServer 7.0.8. Version 6.3 and below are unaffected, as they do not support DPoP in Local APIs.",
    "published": "2024-10-28T20:15:06.297",
    "keywords": "authentication,leak"
  },
  "CVE-2024-44213": {
    "cvss": 7.5,
    "description": "An issue existed in the parsing of URLs. This issue was addressed with improved input validation. This issue is fixed in macOS Ventura 13.7.1, macOS Sonoma 14.7.1. An attacker in a privileged network position may be able to leak sensitive user information.",
    "published": "2024-10-28T21:15:06.110",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-44239": {
    "cvss": 5.5,
    "description": "An information disclosure issue was addressed with improved private data redaction for log entries. This issue is fixed in tvOS 18.1, iOS 18.1 and iPadOS 18.1, iOS 17.7.1 and iPadOS 17.7.1, macOS Ventura 13.7.1, macOS Sonoma 14.7.1, watchOS 11.1, visionOS 2.1. An app may be able to leak sensitive kernel state.",
    "published": "2024-10-28T21:15:06.580",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-44274": {
    "cvss": 4.6,
    "description": "The issue was addressed with improved authentication. This issue is fixed in iOS 17.7.1 and iPadOS 17.7.1, watchOS 11.1, iOS 18.1 and iPadOS 18.1. An attacker with physical access to a locked device may be able to view sensitive user information.",
    "published": "2024-10-28T21:15:07.807",
    "keywords": "authentication,sensitive"
  },
  "CVE-2024-10436": {
    "cvss": 8.8,
    "description": "The WPC Smart Messages for WooCommerce plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 4.2.1 via the get_condition_value function. This makes it possible for authenticated attackers, with Subscriber-level access and above, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-10-29T10:15:03.900",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-10360": {
    "cvss": 4.3,
    "description": "The Move Addons for Elementor plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 1.3.5 via the render function in includes/widgets/accordion/widget.php, includes/widgets/remote-template/widget.php, and other widget.php files. This makes it possible for authenticated attackers, with Contributor-level access and above, to extract sensitive private, pending, and draft template data.",
    "published": "2024-10-29T11:15:03.797",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-41153": {
    "cvss": 7.2,
    "description": "Command injection vulnerability in the Edge Computing UI for the\nTRO600 series radios that allows for the execution of arbitrary system commands. If exploited, an attacker with write access to the\nweb UI can execute commands on the device with root privileges,\nfar more extensive than what the write privilege intends.",
    "published": "2024-10-29T13:15:04.600",
    "keywords": "execution,command"
  },
  "CVE-2024-5982": {
    "cvss": 9.1,
    "description": "A path traversal vulnerability exists in the latest version of gaizhenbiao/chuanhuchatgpt. The vulnerability arises from unsanitized input handling in multiple features, including user upload, directory creation, and template loading. Specifically, the load_chat_history function in modules/models/base_model.py allows arbitrary file uploads, potentially leading to remote code execution (RCE). The get_history_names function in utils.py permits arbitrary directory creation. Additionally, the load_template function in utils.py can be exploited to leak the first column of CSV files. These issues stem from improper sanitization of user inputs concatenated with directory paths using os.path.join.",
    "published": "2024-10-29T13:15:07.637",
    "keywords": "remote,execution,leak"
  },
  "CVE-2024-6581": {
    "cvss": 6.5,
    "description": "A vulnerability in the discussion image upload function of the Lollms application, version v9.9, allows for the uploading of SVG files. Due to incomplete filtering in the sanitize_svg function, this can lead to cross-site scripting (XSS) vulnerabilities, which in turn pose a risk of remote code execution. The sanitize_svg function only removes script elements and 'on*' event attributes, but does not account for other potential vectors for XSS within SVG files. This vulnerability can be exploited when authorized users access a malicious URL containing the crafted SVG file.",
    "published": "2024-10-29T13:15:07.840",
    "keywords": "remote,execution"
  },
  "CVE-2024-6868": {
    "cvss": 8.1,
    "description": "mudler/LocalAI version 2.17.1 allows for arbitrary file write due to improper handling of automatic archive extraction. When model configurations specify additional files as archives (e.g., .tar), these archives are automatically extracted after downloading. This behavior can be exploited to perform a 'tarslip' attack, allowing files to be written to arbitrary locations on the server, bypassing checks that normally restrict files to the models directory. This vulnerability can lead to remote code execution (RCE) by overwriting backend assets used by the server.",
    "published": "2024-10-29T13:15:08.473",
    "keywords": "remote,execution,bypass"
  },
  "CVE-2024-7472": {
    "cvss": 5.3,
    "description": "lunary-ai/lunary v1.2.26 contains an email injection vulnerability in the Send email verification API (/v1/users/send-verification) and Sign up API (/auth/signup). An unauthenticated attacker can inject data into outgoing emails by bypassing the extractFirstName function using a different whitespace character (e.g., \\xa0). This vulnerability can be exploited to conduct phishing attacks, damage the application's brand, cause legal and compliance issues, and result in financial impact due to unauthorized email usage.",
    "published": "2024-10-29T13:15:09.093",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2024-50334": {
    "cvss": "-",
    "description": "Scoold is a Q&A and a knowledge sharing platform for teams. A semicolon path injection vulnerability was found on the /api;/config endpoint. By appending a semicolon in the URL, attackers can bypass authentication and gain unauthorised access to sensitive configuration data. Furthermore, PUT requests on the /api;/config endpoint while setting the Content-Type: application/hocon header allow unauthenticated attackers to file reading via HOCON file inclusion. This allows attackers to retrieve sensitive information such as configuration files from the server, which can be leveraged for further exploitation. The vulnerability has been fixed in Scoold 1.64.0. A workaround would be to disable the Scoold API with scoold.api_enabled = false.",
    "published": "2024-10-29T15:15:12.560",
    "keywords": "unauthenticated,authentication,sensitive,bypass"
  },
  "CVE-2024-7985": {
    "cvss": 7.5,
    "description": "The FileOrganizer – Manage WordPress and Website Files plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the \"fileorganizer_ajax_handler\" function in all versions up to, and including, 1.0.9. This makes it possible for authenticated attackers, with Subscriber-level access and above, and permissions granted by an administrator, to upload arbitrary files on the affected site's server which may make remote code execution possible. NOTE: The FileOrganizer Pro plugin must be installed and active to allow Subscriber+ users to upload files.",
    "published": "2024-10-29T16:15:06.180",
    "keywords": "remote,execution"
  },
  "CVE-2024-8923": {
    "cvss": 9.8,
    "description": "ServiceNow has addressed an input validation vulnerability that was identified in the Now Platform. This vulnerability could enable an unauthenticated user to remotely execute code within the context of the Now Platform. ServiceNow deployed an update to hosted instances and ServiceNow provided the update to our partners and self-hosted customers. Further, the vulnerability is addressed in the listed patches and hot fixes.",
    "published": "2024-10-29T16:15:06.417",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-9988": {
    "cvss": 9.8,
    "description": "The Crypto plugin for WordPress is vulnerable to authentication bypass in versions up to, and including, 2.15. This is due to missing validation on the user being supplied in the 'crypto_connect_ajax_process::register' function. This makes it possible for unauthenticated attackers to log in as any existing user on the site, such as an administrator, if they have access to the username.",
    "published": "2024-10-29T17:15:05.227",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-9989": {
    "cvss": 9.8,
    "description": "The Crypto plugin for WordPress is vulnerable to authentication bypass in versions up to, and including, 2.15. This is due a to limited arbitrary method call to 'crypto_connect_ajax_process::log_in' function in the 'crypto_connect_ajax_process' function. This makes it possible for unauthenticated attackers to log in as any existing user on the site, such as an administrator, if they have access to the username.",
    "published": "2024-10-29T17:15:05.463",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-48138": {
    "cvss": 9.8,
    "description": "A remote code execution (RCE) vulnerability in the component /PluXml/core/admin/parametres_edittpl.php of PluXml v5.8.16 and lower allows attackers to execute arbitrary code via injecting a crafted payload into a template.",
    "published": "2024-10-29T22:15:03.810",
    "keywords": "remote,execution"
  },
  "CVE-2024-50348": {
    "url": "https://github.com/instantsoft/icms2/commit/e02de2fa1850bb40c9b2050b9256c838a0ea7aa3",
    "cvss": 5.4,
    "description": "InstantCMS is a free and open source content management system. In photo upload function in the photo album page there is no input validation taking place. Due to this attackers are able to inject the XSS (Cross Site Scripting) payload and execute. This vulnerability is fixed in 2.16.3.",
    "published": "2024-10-29T23:15:03.863"
  },
  "CVE-2024-51378": {
    "cvss": 10.0,
    "description": "getresetstatus in dns/views.py and ftp/views.py in CyberPanel (aka Cyber Panel) before 1c0c6cb allows remote attackers to bypass authentication and execute arbitrary commands via /dns/getresetstatus or /ftp/getresetstatus by bypassing secMiddleware (which is only for a POST request) and using shell metacharacters in the statusfile property, as exploited in the wild in October 2024 by PSAUX. Versions through 2.3.6 and (unpatched) 2.3.7 are affected.",
    "published": "2024-10-29T23:15:04.083",
    "keywords": "remote,authentication,command,bypass"
  },
  "CVE-2024-51567": {
    "cvss": 10.0,
    "description": "upgrademysqlstatus in databases/views.py in CyberPanel (aka Cyber Panel) before 5b08cd6 allows remote attackers to bypass authentication and execute arbitrary commands via /dataBases/upgrademysqlstatus by bypassing secMiddleware (which is only for a POST request) and using shell metacharacters in the statusfile property, as exploited in the wild in October 2024 by PSAUX. Versions through 2.3.6 and (unpatched) 2.3.7 are affected.",
    "published": "2024-10-29T23:15:04.307",
    "keywords": "remote,authentication,command,bypass"
  },
  "CVE-2024-51568": {
    "cvss": 10.0,
    "description": "CyberPanel (aka Cyber Panel) before 2.3.5 allows Command Injection via completePath in the ProcessUtilities.outputExecutioner() sink. There is /filemanager/upload (aka File Manager upload) unauthenticated remote code execution via shell metacharacters.",
    "published": "2024-10-29T23:15:04.520",
    "keywords": "remote,execution,unauthenticated,command"
  },
  "CVE-2024-10505": {
    "url": "https://github.com/wuzhicms/wuzhicms/issues/209",
    "cvss": 6.3,
    "description": "A vulnerability was found in wuzhicms 4.1.0. It has been classified as critical. Affected is the function add/edit of the file www/coreframe/app/content/admin/block.php. The manipulation leads to code injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. Initially two separate issues were created by the researcher for the different function calls. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-10-30T02:15:02.430"
  },
  "CVE-2024-9846": {
    "cvss": 7.3,
    "description": "The The Enable Shortcodes inside Widgets,Comments and Experts plugin for WordPress is vulnerable to arbitrary shortcode execution in all versions up to, and including, 1.0.0. This is due to the software allowing users to execute an action that does not properly validate a value before running do_shortcode. This makes it possible for unauthenticated attackers to execute arbitrary shortcodes.",
    "published": "2024-10-30T03:15:04.820",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-50503": {
    "cvss": 9.8,
    "description": "Authentication Bypass Using an Alternate Path or Channel vulnerability in Deryck Oñate User Toolkit allows Authentication Bypass.This issue affects User Toolkit: from n/a through 1.2.3.",
    "published": "2024-10-30T08:15:02.813",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-8512": {
    "cvss": 9.1,
    "description": "The W3SPEEDSTER plugin for WordPress is vulnerable to Remote Code Execution in all versions up to, and including, 7.26 via the 'script' parameter of the hookBeforeStartOptimization() function. This is due to the plugin passing user supplied input to eval(). This makes it possible for authenticated attackers, with Administrator-level access and above, to execute code on the server.",
    "published": "2024-10-30T11:15:15.963",
    "keywords": "remote,execution"
  },
  "CVE-2024-23309": {
    "cvss": 9.0,
    "description": "The LevelOne WBR-6012 router with firmware R0.40e6 has an authentication bypass vulnerability in its web application due to reliance on client IP addresses for authentication. Attackers could spoof an IP address to gain unauthorized access without needing a session token.",
    "published": "2024-10-30T14:15:04.153",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-33603": {
    "cvss": 5.3,
    "description": "The LevelOne WBR-6012 router has an information disclosure vulnerability in its web application, which allows unauthenticated users to access a verbose system log page and obtain sensitive data, such as memory addresses and IP addresses for login attempts. This flaw could lead to session hijacking due to the device's reliance on IP address for authentication.",
    "published": "2024-10-30T14:15:06.330",
    "keywords": "unauthenticated,authentication,sensitive"
  },
  "CVE-2024-33626": {
    "cvss": 5.3,
    "description": "The LevelOne WBR-6012 router contains a vulnerability within its web application that allows unauthenticated disclosure of sensitive information, such as the WiFi WPS PIN, through a hidden page accessible by an HTTP request. Disclosure of this information could enable attackers to connect to the device's WiFi network.",
    "published": "2024-10-30T14:15:06.850",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-31972": {
    "cvss": 4.3,
    "description": "EnGenius ESR580 A8J-EMR5000 devices allow a remote attacker to conduct stored XSS attacks that could lead to arbitrary JavaScript code execution (under the context of the user's session) via the Wi-Fi SSID input fields. Web scripts embedded into the vulnerable fields this way are executed immediately when a user logs into the admin page. This affects /admin/wifi/wlan1 and /admin/wifi/wlan_guest.",
    "published": "2024-10-30T18:15:06.760",
    "keywords": "remote,execution"
  },
  "CVE-2024-48214": {
    "cvss": 8.4,
    "description": "KERUI HD 3MP 1080P Tuya Camera 1.0.4 has a command injection vulnerability in the module that connects to the local network via a QR code. This vulnerability allows an attacker to create a custom, unauthenticated QR code and abuse one of the parameters, either SSID or PASSWORD, in the JSON data contained within the QR code. By that, the attacker can execute arbitrary code on the camera.",
    "published": "2024-10-30T18:15:07.420",
    "keywords": "unauthenticated,command"
  },
  "CVE-2024-48647": {
    "cvss": "-",
    "description": "A file disclosure vulnerability exists in Sage 1000 v7.0.0. This vulnerability allows remote attackers to retrieve arbitrary files from the server's file system by manipulating the URL parameter in HTTP requests. The attacker can exploit this flaw to access sensitive information, including configuration files that may contain credentials and system settings, which could lead to further compromise of the server.",
    "published": "2024-10-30T18:15:07.743",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-9419": {
    "cvss": 7.8,
    "description": "Client / Server PCs with the HP Smart Universal Printing Driver installed are potentially vulnerable to Remote Code Execution and/or Elevation of Privilege. A client using the HP Smart Universal Printing Driver that sends a print job comprised of a malicious XPS file could potentially lead to Remote Code Execution and/or Elevation of Privilege on the PC.",
    "published": "2024-10-30T18:15:08.260",
    "keywords": "remote,execution"
  },
  "CVE-2024-48271": {
    "cvss": 8.8,
    "description": "D-Link DSL6740C v6.TR069.20211230 was discovered to use insecure default credentials for Administrator access, possibly allowing attackers to bypass authentication and escalate privileges on the device via a bruteforce attack.",
    "published": "2024-10-30T20:15:04.553",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-48093": {
    "cvss": 8.0,
    "description": "Unrestricted File Upload in the Discussions tab in Operately v.0.1.0 allows a privileged user to achieve Remote Code Execution via uploading and executing malicious files without validating file extensions or content types.",
    "published": "2024-10-30T21:15:14.337",
    "keywords": "remote,execution"
  },
  "CVE-2024-48346": {
    "url": "https://github.com/xtreme1-io/xtreme1/issues/284",
    "cvss": "-",
    "description": "xtreme1 <= v0.9.1 contains a Server-Side Request Forgery (SSRF) vulnerability in the /api/data/upload path. The vulnerability is triggered through the fileUrl parameter, which allows an attacker to make arbitrary requests to internal or external systems.",
    "published": "2024-10-30T21:15:14.450"
  },
  "CVE-2024-48733": {
    "cvss": "-",
    "description": "SQL injection vulnerability in /SASStudio/sasexec/sessions/{sessionID}/sql in SAS Studio 9.4 allows remote attacker to execute arbitrary SQL commands via the POST body request.",
    "published": "2024-10-30T21:15:14.507",
    "keywords": "remote,command"
  },
  "CVE-2024-51243": {
    "cvss": 7.2,
    "description": "The eladmin v2.7 and before contains a remote code execution (RCE) vulnerability that can control all application deployment servers of this management system via DeployController.java.",
    "published": "2024-10-30T21:15:14.860",
    "keywords": "remote,execution"
  },
  "CVE-2024-48307": {
    "url": "https://github.com/jeecgboot/jeecgboot/issues/7237",
    "cvss": "-",
    "description": "JeecgBoot v3.7.1 was discovered to contain a SQL injection vulnerability via the component /onlDragDatasetHead/getTotalData.",
    "published": "2024-10-31T01:15:14.803"
  },
  "CVE-2024-10544": {
    "cvss": 5.3,
    "description": "The Woo Manage Fraud Orders plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 6.1.7 through publicly exposed log files. This makes it possible for unauthenticated attackers to view potentially sensitive information about users contained in the exposed log files.",
    "published": "2024-10-31T02:15:03.080",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-10392": {
    "cvss": 9.8,
    "description": "The AI Power: Complete AI Pack plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the 'handle_image_upload' function in all versions up to, and including, 1.8.89. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-10-31T06:15:04.400",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-43383": {
    "cvss": 8.0,
    "description": "Deserialization of Untrusted Data vulnerability in Apache Lucene.Net.Replicator.\n\nThis issue affects Apache Lucene.NET's Replicator library: from 4.8.0-beta00005 through 4.8.0-beta00016.\n\nAn attacker that can intercept traffic between a replication client and server, or control the target replication node URL, can provide a specially-crafted JSON response that is deserialized as an attacker-provided exception type. This can result in remote code execution or other potential unauthorized access.\n\n\nUsers are recommended to upgrade to version 4.8.0-beta00017, which fixes the issue.",
    "published": "2024-10-31T10:15:04.293",
    "keywords": "remote,execution"
  },
  "CVE-2024-42835": {
    "cvss": "-",
    "description": "langflow v1.0.12 was discovered to contain a remote code execution (RCE) vulnerability via the PythonCodeTool component.",
    "published": "2024-10-31T14:15:05.610",
    "keywords": "remote,execution"
  },
  "CVE-2024-8553": {
    "cvss": 6.3,
    "description": "A vulnerability was found in Foreman's loader macros introduced with report templates. These macros may allow an authenticated user with permissions to view and create templates to read any field from Foreman's database. By using specific strings in the loader macros, users can bypass permissions and access sensitive information.",
    "published": "2024-10-31T15:15:17.243",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-50354": {
    "url": "https://github.com/consensys/gnark/pull/1307",
    "cvss": 5.5,
    "description": "gnark is a fast zk-SNARK library that offers a high-level API to design circuits. In gnark 0.11.0 and earlier, deserialization of Groth16 verification keys allocate excessive memory, consuming a lot of resources and triggering a crash with the error fatal error: runtime: out of memory.",
    "published": "2024-10-31T16:15:05.763"
  }
}