{
  "CVE-2025-46367": {
    "cvss": 7.8,
    "description": "Dell Alienware Command Center 6.x (AWCC), versions prior to 6.10.15.0, contain a Detection of Error Condition Without Action vulnerability. A low privileged attacker with local access could potentially exploit this vulnerability, leading to Arbitrary Code Execution.",
    "published": "2025-11-13T20:15:49.713",
    "keywords": "execution,command"
  },
  "CVE-2025-60699": {
    "cvss": 6.5,
    "description": "A buffer overflow vulnerability exists in the TOTOLINK A950RG Router firmware V5.9c.4592_B20191022_ALL within the `global.so` binary. The `getSaveConfig` function retrieves the `http_host` parameter from user input via `websGetVar` and copies it into a fixed-size stack buffer (`v13`) using `strcpy()` without performing any length checks. An unauthenticated remote attacker can exploit this vulnerability by sending a specially crafted HTTP request to the router's web interface, potentially leading to arbitrary code execution.",
    "published": "2025-11-13T20:15:52.773",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2025-60702": {
    "cvss": 6.5,
    "description": "A command injection vulnerability exists in the TOTOLINK A950RG Router firmware V5.9c.4592_B20191022_ALL within the `system.so` binary. The `setDiagnosisCfg` function retrieves the `ipDoamin` parameter from user input via `websGetVar` and concatenates it directly into a `ping` system command executed via `CsteSystem()` without any sanitization. An unauthenticated remote attacker can exploit this vulnerability to execute arbitrary commands on the device through specially crafted HTTP requests to the router's web interface.",
    "published": "2025-11-13T20:15:52.923",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2025-64726": {
    "cvss": "-",
    "description": "Socket Firewall is an HTTP/HTTPS proxy server that intercepts package manager requests and enforces security policies by blocking dangerous packages. Socket Firewall binary versions (separate from installers) prior to 0.15.5 are vulnerable to arbitrary code execution when run in untrusted project directories. The vulnerability allows an attacker to execute arbitrary code by placing a malicious `.sfw.config` file in a project directory. When a developer runs Socket Firewall commands (e.g., `sfw npm install`) in that directory, the tool loads the `.sfw.config` file and populates environment variables directly into the Node.js process. An attacker can exploit this by setting `NODE_OPTIONS` with a `--require` directive to execute malicious JavaScript code before Socket Firewall's security controls are initialized, effectively bypassing the tool's malicious package detection. The attack vector is indirect and requires a developer to install dependencies for an untrusted project and execute a command within the context of the untrusted project. The vulnerability has been patched in Socket Firewall version 0.15.5. Users should upgrade to version 0.15.5 or later. The fix isolates configuration file values from subprocess environments. Look at `sfw --version` for version information. If users rely on the recommended installation mechanism (e.g. global installation via `npm install -g sfw`) then no workaround is necessary. This wrapper package automatically ensures that users are running the latest version of Socket Firewall. Users who have manually installed the binary and cannot immediately upgrade should avoid running Socket Firewall in untrusted project directories. Before running Socket Firewall in any new project, inspect `.sfw.config` and `.env.local` files for suspicious `NODE_OPTIONS` or other environment variable definitions that reference local files.",
    "published": "2025-11-13T20:15:53.247",
    "keywords": "execution,command,bypass"
  },
  "CVE-2025-36250": {
    "cvss": 10.0,
    "description": "IBM AIX 7.2, and 7.3 and IBM VIOS 3.1, and 4.1 NIM server (formerly known as NIM master) service (nimesis) could allow a remote attacker to execute arbitrary commands due to improper process controls.  This addresses additional attack vectors for a vulnerability that was previously addressed in CVE-2024-56346.",
    "published": "2025-11-13T22:15:50.887",
    "keywords": "remote,command"
  },
  "CVE-2025-36251": {
    "cvss": 9.6,
    "description": "IBM AIX 7.2, and 7.3 and IBM VIOS 3.1, and 4.1 nimsh service SSL/TLS implementations could allow a remote attacker to execute arbitrary commands due to improper process controls. This addresses additional attack vectors for a vulnerability that was previously addressed in CVE-2024-56347.",
    "published": "2025-11-13T22:15:51.053",
    "keywords": "remote,command"
  },
  "CVE-2025-64747": {
    "cvss": 5.5,
    "description": "Directus is a real-time API and App dashboard for managing SQL database content. A stored cross-site scripting (XSS) vulnerability exists in versions prior to 11.13.0 that allows users with `upload files` and `edit item` permissions to inject malicious JavaScript through the Block Editor interface. Attackers can bypass Content Security Policy (CSP) restrictions by combining file uploads with iframe srcdoc attributes, resulting in persistent XSS execution. Version 11.13.0 fixes the issue.",
    "published": "2025-11-13T22:15:52.000",
    "keywords": "execution,bypass"
  },
  "CVE-2025-13160": {
    "cvss": 5.3,
    "description": "IQ-Support developed by IQ Service International has a Exposure of Sensitive Information vulnerability, allowing unauthenticated remote attackers to access specific APIs to obtain sensitive information from the internal network.",
    "published": "2025-11-14T04:15:54.650",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2025-13161": {
    "cvss": 7.5,
    "description": "IQ-Support developed by IQ Service International has an Arbitrary File Read vulnerability, allowing unauthenticated remote attackers to exploit Relative Path Traversal to download arbitrary system files.",
    "published": "2025-11-14T04:15:54.913",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-64444": {
    "cvss": 7.2,
    "description": "Improper neutralization of special elements used in an OS command ('OS Command Injection') issue exists in NCP-HG100 1.4.48.16 and earlier. If exploited, a remote attacker who has obtained the authentication information to log in to the management page of the product may execute an arbitrary OS command with root privileges.",
    "published": "2025-11-14T06:15:42.877",
    "keywords": "remote,authentication,command"
  },
  "CVE-2025-55070": {
    "cvss": 6.5,
    "description": "Mattermost versions <11 fail to enforce multi-factor authentication on WebSocket connections which allows unauthenticated users to access sensitive information via WebSocket events",
    "published": "2025-11-14T08:15:45.500",
    "keywords": "unauthenticated,authentication,sensitive"
  },
  "CVE-2025-8855": {
    "cvss": 8.1,
    "description": "Authorization Bypass Through User-Controlled Key, Weak Password Recovery Mechanism for Forgotten Password, Authentication Bypass by Assumed-Immutable Data vulnerability in Optimus Software Brokerage Automation allows Exploiting Trust in Client, Authentication Bypass, Manipulate Registry Information.This issue affects Brokerage Automation: before 1.1.71.",
    "published": "2025-11-14T13:15:45.337",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-9982": {
    "cvss": "-",
    "description": "A vulnerability exists in QuickCMS version 6.8 where sensitive admin credentials are hardcoded in a configuration file and stored in plaintext. This flaw allows attackers with access to the source code or the server file system to retrieve authentication details, potentially leading to privilege escalation.\n\nThe vendor was notified early about this vulnerability, but didn't respond with the details of vulnerability or vulnerable version range. Only version 6.8 was tested and confirmed as vulnerable, other versions were not tested and might also be vulnerable.",
    "published": "2025-11-14T14:15:47.113",
    "keywords": "authentication,sensitive"
  },
  "CVE-2025-13204": {
    "url": "https://github.com/silentmatt/expr-eval/pull/252/files",
    "cvss": 7.3,
    "description": "npm package `expr-eval` is vulnerable to Prototype Pollution. An attacker with access to express eval interface can use JavaScript prototype-based inheritance model to achieve arbitrary code execution. The npm expr-eval-fork package resolves this issue.",
    "published": "2025-11-14T17:16:01.603"
  },
  "CVE-2025-13033": {
    "cvss": 7.5,
    "description": "A vulnerability was identified in the email parsing library due to improper handling of specially formatted recipient email addresses. An attacker can exploit this flaw by crafting a recipient address that embeds an external address within quotes. This causes the application to misdirect the email to the attacker's external address instead of the intended internal recipient. This could lead to a significant data leak of sensitive information and allow an attacker to bypass security filters and access controls.",
    "published": "2025-11-14T20:15:45.957",
    "keywords": "sensitive,bypass,leak"
  },
  "CVE-2025-63744": {
    "url": "https://github.com/radareorg/radare2/commit/e37e15d10fd8a19c3e57b3d7735a2cfe0082ec79",
    "cvss": 5.3,
    "description": "A NULL pointer dereference vulnerability was discovered in radare2 6.0.5 and earlier within the load() function of bin_dyldcache.c. Processing a crafted file can cause a segmentation fault and crash the program.",
    "published": "2025-11-14T21:15:44.933"
  },
  "CVE-2025-63745": {
    "url": "https://github.com/radareorg/radare2/commit/6c5df3f8570d4f0c360681c08241ad8af3b919fd",
    "cvss": 5.5,
    "description": "A NULL pointer dereference vulnerability was discovered in radare2 6.0.5 and earlier within the info() function of bin_ne.c. A crafted binary input can trigger a segmentation fault, leading to a denial of service when the tool processes malformed data.",
    "published": "2025-11-14T21:15:45.083"
  },
  "CVE-2025-63891": {
    "cvss": 7.5,
    "description": "Information Disclosure in web-accessible backup file in SourceCodester Simple Online Book Store System allows a remote unauthenticated attacker to disclose full database contents (including schema and credential hashes) via an unauthenticated HTTP GET request to /obs/database/obs_db.sql.",
    "published": "2025-11-14T21:15:45.223",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-64084": {
    "cvss": 6.5,
    "description": "An authenticated SQL injection vulnerability exists in Cloudlog 2.7.5 and earlier. The vucc_details_ajax function in application/controllers/Awards.php does not properly sanitize the user-supplied Gridsquare POST parameter. This allows a remote, authenticated attacker to execute arbitrary SQL commands by injecting a malicious payload, which is then concatenated directly into a raw SQL query in the vucc_qso_details function.",
    "published": "2025-11-14T21:15:45.367",
    "keywords": "remote,command"
  },
  "CVE-2025-13188": {
    "cvss": 9.8,
    "description": "A vulnerability was detected in D-Link DIR-816L 2_06_b09_beta. Affected by this vulnerability is the function authenticationcgi_main of the file /authentication.cgi. Performing manipulation of the argument Password results in stack-based buffer overflow. Remote exploitation of the attack is possible. The exploit is now public and may be used. This vulnerability only affects products that are no longer supported by the maintainer.",
    "published": "2025-11-14T23:15:43.843",
    "keywords": "remote,authentication"
  },
  "CVE-2025-58083": {
    "cvss": 10.0,
    "description": "General Industrial Controls Lynx+ Gateway \n is missing critical authentication in the embedded web server which could allow an attacker to remotely reset the device.",
    "published": "2025-11-15T00:15:47.087",
    "keywords": "remote,authentication"
  },
  "CVE-2025-59780": {
    "cvss": 7.5,
    "description": "General Industrial Controls Lynx+ Gateway is missing critical authentication in the embedded web server which \ncould allow an attacker to send GET requests to obtain sensitive device \ninformation.",
    "published": "2025-11-15T00:15:47.313",
    "keywords": "authentication,sensitive"
  },
  "CVE-2025-12849": {
    "cvss": 5.3,
    "description": "The Contest Gallery plugin for WordPress is vulnerable to authorization bypass in all versions up to, and including, 28.0.2. This is due to the plugin registering the `cg_check_wp_admin_upload_v10` AJAX action for both authenticated and unauthenticated users without implementing capability checks or nonce verification. This makes it possible for unauthenticated attackers to inject arbitrary WordPress media attachments into galleries and manipulate gallery metadata via the `cg_check_wp_admin_upload_v10` action. It does not enable an attacker to move or upload files.",
    "published": "2025-11-15T07:15:42.640",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2025-6945": {
    "cvss": 3.5,
    "description": "GitLab has remediated an issue in GitLab EE affecting all versions from 17.8 before 18.3.6, 18.4 before 18.4.4, and 18.5 before 18.5.2 that could have allowed an authenticated attacker to leak sensitive information from confidential issues by injecting hidden prompts into merge request comments.",
    "published": "2025-11-15T08:15:46.280",
    "keywords": "sensitive,leak"
  },
  "CVE-2025-12482": {
    "cvss": 7.5,
    "description": "The Booking for Appointments and Events Calendar – Amelia plugin for WordPress is vulnerable to SQL Injection via the ‘search’ parameter in all versions up to, and including, 1.2.35 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2025-11-16T05:15:59.280",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-13246": {
    "cvss": 6.3,
    "description": "A vulnerability was identified in shsuishang ShopSuite ModulithShop up to 45a99398cec3b7ad7ff9383694f0b53339f2d35a. Impacted is the function JwtAuthenticationFilter of the file src/main/java/com/suisung/shopsuite/common/security/JwtAuthenticationFilter.java. The manipulation leads to path traversal. It is possible to initiate the attack remotely. The exploit is publicly available and might be used. This product is using a rolling release to provide continious delivery. Therefore, no version details for affected nor updated releases are available.",
    "published": "2025-11-16T10:15:54.827",
    "keywords": "remote,authentication"
  }
}