{
  "CVE-2024-8448": {
    "cvss": 8.8,
    "description": "Certain switch models from PLANET Technology have a hard-coded credential in the specific command-line interface, allowing remote attackers with regular privilege to log in with this credential and obtain a Linux root shell.",
    "published": "2024-09-30T07:15:03.507",
    "keywords": "remote,command"
  },
  "CVE-2024-45200": {
    "cvss": 6.3,
    "description": "In Nintendo Mario Kart 8 Deluxe before 3.0.3, the LAN/LDN local multiplayer implementation allows a remote attacker to exploit a stack-based buffer overflow upon deserialization of session information via a malformed browse-reply packet, aka KartLANPwn. The victim is not required to join a game session with an attacker. The victim must open the \"Wireless Play\" (or \"LAN Play\") menu from the game's title screen, and an attacker nearby (LDN) or on the same LAN network as the victim can send a crafted reply packet to the victim's console. This enables a remote attacker to obtain complete denial-of-service on the game's process, or potentially, remote code execution on the victim's console. The issue is caused by incorrect use of the Nintendo Pia library,",
    "published": "2024-09-30T08:15:03.760",
    "keywords": "remote,execution"
  },
  "CVE-2024-8454": {
    "cvss": 5.3,
    "description": "The swctrl service is used to detect and remotely manage PLANET Technology devices. Certain switch models have a Denial-of-Service vulnerability in the swctrl service, allowing unauthenticated remote attackers to send crafted packets that can crash the service.",
    "published": "2024-09-30T08:15:04.340",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-8455": {
    "cvss": 8.1,
    "description": "The swctrl service is used to detect and remotely manage PLANET Technology devices. For certain switch models, the authentication tokens used during communication with this service are encoded user passwords. Due to insufficient strength, unauthorized remote attackers who intercept the packets can directly crack them to obtain plaintext passwords.",
    "published": "2024-09-30T08:15:04.570",
    "keywords": "remote,authentication"
  },
  "CVE-2024-8456": {
    "cvss": 9.8,
    "description": "Certain switch models from PLANET Technology lack proper access control in firmware upload and download functionality, allowing unauthenticated remote attackers to download and upload firmware and system configurations, ultimately gaining full control of the devices.",
    "published": "2024-09-30T08:15:04.797",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-8458": {
    "cvss": 8.8,
    "description": "Certain switch models from PLANET Technology have a web application that is vulnerable to Cross-Site Request Forgery (CSRF). An unauthenticated remote attacker can trick a user into visiting a malicious website, allowing the attacker to impersonate the user and perform actions on their behalf, such as creating accounts.",
    "published": "2024-09-30T08:15:05.223",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-46540": {
    "cvss": 6.3,
    "description": "A remote code execution (RCE) vulnerability in the component /admin/store.php of Emlog Pro before v2.3.15 allows attackers to use remote file downloads and self-extract fucntions to upload webshells to the target server, thereby obtaining system privileges.",
    "published": "2024-09-30T17:15:04.550",
    "keywords": "remote,execution"
  },
  "CVE-2024-42017": {
    "cvss": 10.0,
    "description": "An issue was discovered in Atos Eviden iCare 2.7.1 through 2.7.11. The application exposes a web interface locally. In the worst-case scenario, if the application is remotely accessible, it allows an attacker to execute arbitrary commands with system privilege on the endpoint hosting the application, without any authentication.",
    "published": "2024-09-30T18:15:05.827",
    "keywords": "remote,authentication,command"
  },
  "CVE-2024-47295": {
    "cvss": 8.1,
    "description": "Insecure initial password configuration issue in SEIKO EPSON Web Config allows a remote unauthenticated attacker to set an arbitrary password and operate the device with an administrative privilege. As for the details of the affected versions, see the information provided by the vendor under [References].",
    "published": "2024-10-01T04:15:18.040",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-9106": {
    "cvss": 9.8,
    "description": "The Wechat Social login plugin for WordPress is vulnerable to authentication bypass in versions up to, and including, 1.3.0. This is due to insufficient verification on the user being supplied during the social login. This makes it possible for unauthenticated attackers to log in as any existing user on the site, such as an administrator, if they have access to the user id. This is only exploitable if the app secret is not set, so it has a default empty value.",
    "published": "2024-10-01T08:15:05.267",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-9108": {
    "cvss": 9.8,
    "description": "The Wechat Social login plugin for WordPress is vulnerable to arbitrary file uploads due to insufficient file type validation in the 'convert_remoteimage_to_local' function in versions up to, and including, 1.3.0. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-10-01T08:15:05.480",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-9289": {
    "cvss": 9.8,
    "description": "The WordPress & WooCommerce Affiliate Program plugin for WordPress is vulnerable to authentication bypass in all versions up to, and including, 8.4.1. This is due to the rtwwwap_login_request_callback() function not properly validating a user's identity prior to authenticating them to the site. This makes it possible for unauthenticated attackers to log in as any user, including administrators, granted they have access to the administrator's email.",
    "published": "2024-10-01T09:15:09.320",
    "keywords": "unauthenticated,authentication,bypass"
  }
}