{
  "CVE-2024-45489": {
    "cvss": 9.8,
    "description": "Arc before 2024-08-26 allows remote code execution in JavaScript boosts. Boosts that run JavaScript cannot be shared by default; however (because of misconfigured Firebase ACLs), it is possible to create or update a boost using another user's ID. This installs the boost in the victim's browser and runs arbitrary Javascript on that browser in a privileged context. NOTE: this is a no-action cloud vulnerability with zero affected users.",
    "published": "2024-09-20T17:15:15.060",
    "keywords": "remote,execution"
  },
  "CVE-2024-46654": {
    "url": "https://github.com/magicblack/maccms10/issues/1183",
    "cvss": 4.8,
    "description": "A stored cross-site scripting (XSS) vulnerability in the Add Scheduled Task module of Maccms10 v2024.1000.4040 allows attackers to execute arbitrary web scripts or HTML via a crafted payload.",
    "published": "2024-09-20T19:15:16.473"
  },
  "CVE-2024-46640": {
    "cvss": "-",
    "description": "SeaCMS 13.2 has a remote code execution vulnerability located in the file sql.class.chp. Although the system has a check function, the check function is not executed during execution, allowing remote code execution by writing to the file through the MySQL slow query method.",
    "published": "2024-09-20T21:15:12.700",
    "keywords": "remote,execution"
  },
  "CVE-2024-47218": {
    "cvss": "-",
    "description": "An issue was discovered in vesoft NebulaGraph through 3.8.0. It allows bypassing authentication.",
    "published": "2024-09-22T01:15:11.583",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-47219": {
    "url": "https://github.com/vesoft-inc/nebula/pull/5936",
    "cvss": "-",
    "description": "An issue was discovered in vesoft NebulaGraph through 3.8.0. It allows shell command injection.",
    "published": "2024-09-22T01:15:11.890"
  },
  "CVE-2024-47220": {
    "url": "https://github.com/ruby/webrick/pull/146/commits/d88321da45dcd230ac2b4585cad4833d6d5e8841",
    "cvss": "-",
    "description": "An issue was discovered in the WEBrick toolkit through 1.8.1 for Ruby. It allows HTTP request smuggling by providing both a Content-Length header and a Transfer-Encoding header, e.g., \"GET /admin HTTP/1.1\\r\\n\" inside of a \"POST /user HTTP/1.1\\r\\n\" request. NOTE: the supplier's position is \"Webrick should not be used in production.\"",
    "published": "2024-09-22T01:15:11.950"
  },
  "CVE-2024-47221": {
    "url": "https://github.com/rapidscada/scada/commit/b14cbdfa6cf3a205e57f2383c915365adc3859a7",
    "cvss": "-",
    "description": "CheckUser in ScadaServerEngine/MainLogic.cs in Rapid SCADA through 5.8.4 allows an empty password.",
    "published": "2024-09-22T01:15:12.013"
  },
  "CVE-2024-9076": {
    "cvss": 6.3,
    "description": "A vulnerability was found in DedeCMS up to 5.7.115. It has been rated as critical. This issue affects some unknown processing of the file article_string_mix.php. The manipulation leads to os command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-09-22T01:15:12.070",
    "keywords": "remote,command"
  },
  "CVE-2024-45453": {
    "cvss": 3.7,
    "description": "Authentication Bypass by Spoofing vulnerability in Peter Hardy-vanDoorn Maintenance Redirect allows Accessing Functionality Not Properly Constrained by ACLs.This issue affects Maintenance Redirect: from n/a through 2.0.1.",
    "published": "2024-09-23T01:15:11.923",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-8606": {
    "cvss": "-",
    "description": "Bypass of two factor authentication in RestAPI in Checkmk < 2.3.0p16 and < 2.2.0p34 allows authenticated users to bypass two factor authentication",
    "published": "2024-09-23T07:15:02.233",
    "keywords": "authentication,bypass"
  }
}