{
  "CVE-2025-22957": {
    "cvss": "-",
    "description": "A SQL injection vulnerability exists in the front-end of the website in ZZCMS <= 2023, which can be exploited without any authentication. This vulnerability could potentially allow attackers to gain unauthorized access to the database and extract sensitive information.",
    "published": "2025-01-31T17:15:16.583",
    "keywords": "authentication,sensitive"
  },
  "CVE-2025-0938": {
    "url": "https://github.com/python/cpython/pull/129418",
    "cvss": "-",
    "description": "The Python standard library functions `urllib.parse.urlsplit` and `urlparse` accepted domain names that included square brackets which isn't valid according to RFC 3986. Square brackets are only meant to be used as delimiters for specifying IPv6 and IPvFuture hosts in URLs. This could result in differential parsing across the Python URL parser and other specification-compliant URL parsers.",
    "published": "2025-01-31T18:15:38.053"
  },
  "CVE-2025-24891": {
    "url": "https://github.com/dumbwareio/dumbdrop/commit/cb586316648ccbfb21d27b84e90d72ccead9819d",
    "cvss": 9.6,
    "description": "Dumb Drop is a file upload application. Users with permission to upload to the service are able to exploit a path traversal vulnerability to overwrite arbitrary system files. As the container runs as root by default, there is no limit to what can be overwritten. With this, it's possible to inject malicious payloads into files ran on schedule or upon certain service actions. As the service is not required to run with authentication enabled, this may permit wholly unprivileged users root access. Otherwise, anybody with a PIN.",
    "published": "2025-01-31T23:15:08.457"
  },
  "CVE-2025-0366": {
    "cvss": 8.8,
    "description": "The Jupiter X Core plugin for WordPress is vulnerable to Local File Inclusion to Remote Code Execution in all versions up to, and including, 4.8.7 via the get_svg() function. This makes it possible for authenticated attackers, with Contributor-level access and above, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution. In this specific case,  an attacker can create a form that allows SVG uploads, upload an SVG file with malicious content and then include the SVG file in a post to achieve remote code execution. This means it is relatively easy to gain remote code execution as a contributor-level user and above by default.",
    "published": "2025-02-01T06:15:31.367",
    "keywords": "remote,execution,sensitive,bypass"
  },
  "CVE-2025-20633": {
    "cvss": "-",
    "description": "In wlan AP driver, there is a possible out of bounds write due to an incorrect bounds check. This could lead to remote (proximal/adjacent) code execution with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: WCNCR00400889; Issue ID: MSV-2491.",
    "published": "2025-02-03T04:15:08.307",
    "keywords": "remote,execution"
  },
  "CVE-2025-20634": {
    "cvss": "-",
    "description": "In Modem, there is a possible out of bounds write due to a missing bounds check. This could lead to remote code execution, if a UE has connected to a rogue base station controlled by the attacker, with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: MOLY01289384; Issue ID: MSV-2436.",
    "published": "2025-02-03T04:15:08.423",
    "keywords": "remote,execution"
  },
  "CVE-2025-20637": {
    "cvss": "-",
    "description": "In network HW, there is a possible system hang due to an uncaught exception. This could lead to remote denial of service with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: WCNCR00399035; Issue ID: MSV-2380.",
    "published": "2025-02-03T04:15:08.747",
    "keywords": "remote,execution"
  }
}