{
  "CVE-2024-22632": {
    "cvss": "-",
    "description": "Setor Informatica Sistema Inteligente para Laboratorios (S.I.L.) 388 was discovered to contain a remote code execution (RCE) vulnerability via the hmsg parameter. This vulnerability is triggered via a crafted POST request.",
    "published": "2024-04-26T04:15:08.830",
    "keywords": "remote,execution"
  },
  "CVE-2024-22633": {
    "cvss": "-",
    "description": "Setor Informatica Sistema Inteligente para Laboratorios (S.I.L.) 388 was discovered to contain a remote code execution (RCE) vulnerability via the hprinter parameter. This vulnerability is triggered via a crafted POST request.",
    "published": "2024-04-26T04:15:08.910",
    "keywords": "remote,execution"
  },
  "CVE-2024-2920": {
    "cvss": 5.3,
    "description": "The WP-Members Membership Plugin plugin for WordPress is vulnerable to Information Exposure in all versions up to, and including, 3.4.9.3 due to the plugin uploading user supplied files to a publicly accessible directory in wp-content without any restrictions. This makes it possible for unauthenticated attackers to view files uploaded by other users which may contain sensitive information.",
    "published": "2024-04-26T08:15:12.203",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-3678": {
    "cvss": 5.3,
    "description": "The Blog2Social: Social Media Auto Post & Scheduler plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 7.4.2. This makes it possible for unauthenticated attackers to view limited information from password protected posts.",
    "published": "2024-04-26T08:15:13.567",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-3962": {
    "cvss": 9.8,
    "description": "The Product Addons & Fields for WooCommerce plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the ppom_upload_file function in all versions up to, and including, 32.0.18. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected site's server which may make remote code execution possible. Successful exploitation requires the PPOM Pro plugin to be installed along with a WooCommerce product that contains a file upload field to retrieve the correct nonce.",
    "published": "2024-04-26T09:15:12.337",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-0740": {
    "cvss": 9.8,
    "description": "Eclipse Target Management: Terminal and Remote System Explorer (RSE) version <= 4.5.400 has a remote code execution vulnerability that does not require authentication. \n\n\n\n\n\nThe fixed version is included in Eclipse IDE 2024-03\n\n\n",
    "published": "2024-04-26T10:15:10.960",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2024-3682": {
    "cvss": 5.3,
    "description": "The WP STAGING and WP STAGING Pro plugins for WordPress are vulnerable to Sensitive Information Exposure in versions up to, and including, 3.4.3, and versions up to, and including, 5.4.3, respectively, via the ajaxSendReport function. This makes it possible for unauthenticated attackers to extract sensitive data from a log file, including system information and (in the Pro version) license keys. Successful exploitation requires an administrator to have used the 'Contact Us' functionality along with the \"Enable this option to automatically submit the log files.\" option.",
    "published": "2024-04-26T10:15:11.693",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-33255": {
    "url": "https://github.com/jerryscript-project/jerryscript/issues/5135",
    "cvss": "-",
    "description": "Jerryscript commit cefd391 was discovered to contain an Assertion Failure via ECMA_STRING_IS_REF_EQUALS_TO_ONE (string_p) in ecma_free_string_list.",
    "published": "2024-04-26T15:15:49.130"
  },
  "CVE-2024-33258": {
    "url": "https://github.com/jerryscript-project/jerryscript/issues/5114",
    "cvss": "-",
    "description": "Jerryscript commit ff9ff8f was discovered to contain a segmentation violation via the component vm_loop at jerry-core/vm/vm.c.",
    "published": "2024-04-26T15:15:49.180"
  },
  "CVE-2024-33259": {
    "url": "https://github.com/jerryscript-project/jerryscript/issues/5132",
    "cvss": "-",
    "description": "Jerryscript commit cefd391 was discovered to contain a segmentation violation via the component scanner_seek at jerry-core/parser/js/js-scanner-util.c.",
    "published": "2024-04-26T15:15:49.250"
  },
  "CVE-2024-33260": {
    "url": "https://github.com/jerryscript-project/jerryscript/issues/5133",
    "cvss": "-",
    "description": "Jerryscript commit cefd391 was discovered to contain a segmentation violation via the component parser_parse_class at jerry-core/parser/js/js-parser-expr.c",
    "published": "2024-04-26T15:15:49.303"
  },
  "CVE-2024-32880": {
    "cvss": 9.1,
    "description": "pyload is an open-source Download Manager written in pure Python. An authenticated user can change the download folder and upload a crafted template to the specified folder lead to remote code execution. There is no fix available at the time of publication.",
    "published": "2024-04-26T18:15:45.970",
    "keywords": "remote,execution"
  },
  "CVE-2024-33342": {
    "cvss": "-",
    "description": "D-Link DIR-822+ V1.0.5 was found to contain a command injection in SetPlcNetworkpwd function of prog.cgi, which allows remote attackers to execute arbitrary commands via shell.",
    "published": "2024-04-26T18:15:46.350",
    "keywords": "remote,command"
  },
  "CVE-2024-33343": {
    "cvss": "-",
    "description": "D-Link DIR-822+ V1.0.5 was found to contain a command injection in ChgSambaUserSettings function of prog.cgi, which allows remote attackers to execute arbitrary commands via shell.",
    "published": "2024-04-26T18:15:46.413",
    "keywords": "remote,command"
  },
  "CVE-2024-33344": {
    "cvss": "-",
    "description": "D-Link DIR-822+ V1.0.5 was found to contain a command injection in ftext function of upload_firmware.cgi, which allows remote attackers to execute arbitrary commands via shell.",
    "published": "2024-04-26T18:15:46.467",
    "keywords": "remote,command"
  },
  "CVE-2024-4235": {
    "cvss": 2.7,
    "description": "A vulnerability classified as problematic was found in Netgear DG834Gv5 1.6.01.34. This vulnerability affects unknown code of the component Web Management Interface. The manipulation leads to cleartext storage of sensitive information. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. VDB-262126 is the identifier assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-04-26T18:15:46.527",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-4237": {
    "cvss": 8.8,
    "description": "A vulnerability, which was classified as critical, was found in Tenda AX1806 1.0.0.1. Affected is the function R7WebsSecurityHandler of the file /goform/execCommand. The manipulation of the argument password leads to stack-based buffer overflow. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-262128. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-04-26T19:15:47.713",
    "keywords": "remote,command"
  },
  "CVE-2024-31741": {
    "url": "https://github.com/bg5sbk/minicms/issues/49",
    "cvss": "-",
    "description": "Cross Site Scripting vulnerability in MiniCMS v.1.11 allows a remote attacker to run arbitrary code via crafted string in the URL after login.",
    "published": "2024-04-26T22:15:08.137"
  },
  "CVE-2024-4255": {
    "cvss": 4.7,
    "description": "A vulnerability, which was classified as critical, has been found in Ruijie RG-UAC up to 20240419. This issue affects some unknown processing of the file /view/network Config/GRE/gre_edit_commit.php. The manipulation of the argument name leads to os command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-262145 was assigned to this vulnerability.",
    "published": "2024-04-27T15:15:06.437",
    "keywords": "remote,command"
  },
  "CVE-2024-33891": {
    "cvss": 8.8,
    "description": "Delinea Secret Server before 11.7.000001 allows attackers to bypass authentication via the SOAP API in SecretServer/webservices/SSWebService.asmx. This is related to a hardcoded key, the use of the integer 2 for the Admin user, and removal of the oauthExpirationId attribute.",
    "published": "2024-04-28T23:15:07.200",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-33903": {
    "url": "https://github.com/carla-simulator/carla/pull/7445",
    "cvss": "-",
    "description": "In CARLA through 0.9.15.2, the collision sensor mishandles some situations involving pedestrians or bicycles, in part because the collision sensor function is not exposed to the Blueprint library.",
    "published": "2024-04-29T01:15:09.600"
  },
  "CVE-2024-4298": {
    "cvss": 7.2,
    "description": "The email search interface of HGiga iSherlock (including MailSherlock, SpamSherock, AuditSherlock) fails to filter special characters in certain function parameters, allowing remote attackers with administrative privileges to exploit this vulnerability for Command Injection attacks, enabling execution of arbitrary system commands.",
    "published": "2024-04-29T03:15:09.810",
    "keywords": "remote,execution,command"
  }
}