{
  "CVE-2024-10200": {
    "cvss": 7.5,
    "description": "Administrative Management System from Wellchoose has a Path Traversal vulnerability, allowing unauthenticated remote attackers to exploit this vulnerability to download arbitrary files on the server.",
    "published": "2024-10-21T04:15:02.513",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-10202": {
    "cvss": 8.8,
    "description": "Administrative Management System from Wellchoose has an OS Command Injection vulnerability, allowing remote attackers with regular privileges to inject and execute arbitrary OS commands.",
    "published": "2024-10-21T04:15:03.900",
    "keywords": "remote,command"
  },
  "CVE-2024-48231": {
    "url": "https://github.com/funadmin/funadmin/issues/29",
    "cvss": 7.2,
    "description": "Funadmin 5.0.2 is vulnerable to SQL Injection via the selectFields parameter in the index method of \\backend\\controller\\auth\\Auth.php.",
    "published": "2024-10-21T12:15:08.380"
  },
  "CVE-2024-49851": {
    "cvss": 5.5,
    "description": "In the Linux kernel, the following vulnerability has been resolved:\n\ntpm: Clean up TPM space after command failure\n\ntpm_dev_transmit prepares the TPM space before attempting command\ntransmission. However if the command fails no rollback of this\npreparation is done. This can result in transient handles being leaked\nif the device is subsequently closed with no further commands performed.\n\nFix this by flushing the space in the event of command transmission\nfailure.",
    "published": "2024-10-21T13:15:05.883",
    "keywords": "command,leak"
  },
  "CVE-2024-49368": {
    "cvss": "-",
    "description": "Nginx UI is a web user interface for the Nginx web server. Prior to version 2.0.0-beta.36, when Nginx UI configures logrotate, it does not verify the input and directly passes it to exec.Command, causing arbitrary command execution. Version 2.0.0-beta.36 fixes this issue.",
    "published": "2024-10-21T17:15:03.960",
    "keywords": "execution,command"
  },
  "CVE-2024-49878": {
    "cvss": "-",
    "description": "In the Linux kernel, the following vulnerability has been resolved:\n\nresource: fix region_intersects() vs add_memory_driver_managed()\n\nOn a system with CXL memory, the resource tree (/proc/iomem) related to\nCXL memory may look like something as follows.\n\n490000000-50fffffff : CXL Window 0\n  490000000-50fffffff : region0\n    490000000-50fffffff : dax0.0\n      490000000-50fffffff : System RAM (kmem)\n\nBecause drivers/dax/kmem.c calls add_memory_driver_managed() during\nonlining CXL memory, which makes \"System RAM (kmem)\" a descendant of \"CXL\nWindow X\".  This confuses region_intersects(), which expects all \"System\nRAM\" resources to be at the top level of iomem_resource.  This can lead to\nbugs.\n\nFor example, when the following command line is executed to write some\nmemory in CXL memory range via /dev/mem,\n\n $ dd if=data of=/dev/mem bs=$((1 << 10)) seek=$((0x490000000 >> 10)) count=1\n dd: error writing '/dev/mem': Bad address\n 1+0 records in\n 0+0 records out\n 0 bytes copied, 0.0283507 s, 0.0 kB/s\n\nthe command fails as expected.  However, the error code is wrong.  It\nshould be \"Operation not permitted\" instead of \"Bad address\".  More\nseriously, the /dev/mem permission checking in devmem_is_allowed() passes\nincorrectly.  Although the accessing is prevented later because ioremap()\nisn't allowed to map system RAM, it is a potential security issue.  During\ncommand executing, the following warning is reported in the kernel log for\ncalling ioremap() on system RAM.\n\n ioremap on RAM at 0x0000000490000000 - 0x0000000490000fff\n WARNING: CPU: 2 PID: 416 at arch/x86/mm/ioremap.c:216 __ioremap_caller.constprop.0+0x131/0x35d\n Call Trace:\n  memremap+0xcb/0x184\n  xlate_dev_mem_ptr+0x25/0x2f\n  write_mem+0x94/0xfb\n  vfs_write+0x128/0x26d\n  ksys_write+0xac/0xfe\n  do_syscall_64+0x9a/0xfd\n  entry_SYSCALL_64_after_hwframe+0x4b/0x53\n\nThe details of command execution process are as follows.  In the above\nresource tree, \"System RAM\" is a descendant of \"CXL Window 0\" instead of a\ntop level resource.  So, region_intersects() will report no System RAM\nresources in the CXL memory region incorrectly, because it only checks the\ntop level resources.  Consequently, devmem_is_allowed() will return 1\n(allow access via /dev/mem) for CXL memory region incorrectly. \nFortunately, ioremap() doesn't allow to map System RAM and reject the\naccess.\n\nSo, region_intersects() needs to be fixed to work correctly with the\nresource tree with \"System RAM\" not at top level as above.  To fix it, if\nwe found a unmatched resource in the top level, we will continue to search\nmatched resources in its descendant resources.  So, we will not miss any\nmatched resources in resource tree anymore.\n\nIn the new implementation, an example resource tree\n\n|------------- \"CXL Window 0\" ------------|\n|-- \"System RAM\" --|\n\nwill behave similar as the following fake resource tree for\nregion_intersects(, IORESOURCE_SYSTEM_RAM, ),\n\n|-- \"System RAM\" --||-- \"CXL Window 0a\" --|\n\nWhere \"CXL Window 0a\" is part of the original \"CXL Window 0\" that\nisn't covered by \"System RAM\".",
    "published": "2024-10-21T18:15:09.863",
    "keywords": "execution,command"
  },
  "CVE-2024-46326": {
    "url": "https://github.com/pkp/pkp-lib/issues/10478",
    "cvss": 6.1,
    "description": "Public Knowledge Project pkp-lib 3.4.0-7 and earlier is vulnerable to Open redirect due to a lack of input sanitization in the logout function.",
    "published": "2024-10-21T20:15:14.637"
  },
  "CVE-2024-47189": {
    "cvss": "-",
    "description": "The API Interface of the AWV (Audio, Web and Video Conferencing) component of Mitel MiCollab through 9.8 SP1 FP2 (9.8.1.201) could allow an unauthenticated attacker to conduct SQL injection due to insufficient sanitization of user input. A successful exploit could allow an attacker with knowledge of specific details to access non-sensitive user provisioning information and execute arbitrary SQL database commands.",
    "published": "2024-10-21T20:15:14.697",
    "keywords": "unauthenticated,command,sensitive"
  },
  "CVE-2024-47223": {
    "cvss": 9.4,
    "description": "A vulnerability in the AWV (Audio, Web and Video Conferencing) component of Mitel MiCollab through 9.8 SP1 FP2 (9.8.1.201) could allow an unauthenticated attacker to conduct a SQL injection attack due to insufficient sanitization of user input. A successful exploit could allow an attacker to access non-sensitive user provisioning information and execute arbitrary SQL database commands.",
    "published": "2024-10-21T20:15:14.770",
    "keywords": "unauthenticated,command,sensitive"
  },
  "CVE-2024-47912": {
    "cvss": 8.2,
    "description": "A vulnerability in the AWV (Audio, Web, and Video) Conferencing component of Mitel MiCollab through 9.8 SP1 FP2 (9.8.1.201) could allow an unauthenticated attacker to perform unauthorized data-access attacks due to missing authentication mechanisms. A successful exploit could allow an attacker to access and delete sensitive information.",
    "published": "2024-10-21T20:15:14.877",
    "keywords": "unauthenticated,authentication,sensitive"
  },
  "CVE-2024-48509": {
    "cvss": 9.8,
    "description": "Learning with Texts (LWT) 2.0.3 is vulnerable to SQL Injection. This occurs when the application fails to properly sanitize user inputs, allowing attackers to manipulate SQL queries by injecting malicious SQL statements into URL parameters. By exploiting this vulnerability, an attacker could gain unauthorized access to the database, retrieve sensitive information, modify or delete data, and execute arbitrary commands.",
    "published": "2024-10-21T20:15:14.943",
    "keywords": "command,sensitive"
  },
  "CVE-2024-35285": {
    "cvss": 9.8,
    "description": "A vulnerability in NuPoint Messenger (NPM) of Mitel MiCollab through 9.8.0.33 allows an unauthenticated attacker to conduct a command injection attack due to insufficient parameter sanitization.",
    "published": "2024-10-21T21:15:05.307",
    "keywords": "unauthenticated,command"
  },
  "CVE-2024-35286": {
    "cvss": 9.8,
    "description": "A vulnerability in NuPoint Messenger (NPM) of Mitel MiCollab through 9.8.0.33 allows an unauthenticated attacker to conduct a SQL injection attack due to insufficient sanitization of user input. A successful exploit could allow an attacker to access sensitive information and execute arbitrary database and management operations.",
    "published": "2024-10-21T21:15:05.367",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-35287": {
    "cvss": 6.7,
    "description": "A vulnerability in the NuPoint Messenger (NPM) component of Mitel MiCollab through version 9.8 SP1 (9.8.1.5) could allow an authenticated attacker with administrative privilege to conduct a privilege escalation attack due to the execution of a resource with unnecessary privileges. A successful exploit could allow an attacker to execute arbitrary commands with elevated privileges.",
    "published": "2024-10-21T21:15:05.450",
    "keywords": "execution,command"
  },
  "CVE-2024-35314": {
    "cvss": 9.8,
    "description": "A vulnerability in the Desktop Client of Mitel MiCollab through 9.7.1.110, and MiVoice Business Solution Virtual Instance (MiVB SVI) 1.0.0.25, could allow an unauthenticated attacker to conduct a command injection attack due to insufficient parameter sanitization. A successful exploit could allow an attacker to execute arbitrary scripts.",
    "published": "2024-10-21T21:15:05.533",
    "keywords": "unauthenticated,command"
  },
  "CVE-2024-40083": {
    "cvss": 9.6,
    "description": "A Buffer Overflow vulnerabilty in the local_app_set_router_token function of Vilo 5 Mesh WiFi System <= 5.16.1.33 allows remote, unauthenticated attackers to execute arbitrary code via sscanf reading the token and timezone JSON fields into a fixed-length buffer.",
    "published": "2024-10-21T21:15:05.703",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-40084": {
    "cvss": 9.6,
    "description": "A Buffer Overflow in the Boa webserver of Vilo 5 Mesh WiFi System <= 5.16.1.33 allows remote, unauthenticated attackers to execute arbitrary code via exceptionally long HTTP methods or paths.",
    "published": "2024-10-21T21:15:05.770",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-40085": {
    "cvss": 9.6,
    "description": "A Buffer Overflow vulnerability in the local_app_set_router_wan function of Vilo 5 Mesh WiFi System <= 5.16.1.33 allows remote, unauthenticated attackers to execute arbitrary code via pppoe_username and pppoe_password fields being larger than 128 bytes in length.",
    "published": "2024-10-21T21:15:05.853",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-40086": {
    "cvss": 9.6,
    "description": "A Buffer Overflow vulnerability in the local_app_set_router_wifi_SSID_PWD function of Vilo 5 Mesh WiFi System <= 5.16.1.33 allows remote, unauthenticated attackers to execute arbitrary code via a password field larger than 64 bytes in length.",
    "published": "2024-10-21T21:15:05.923",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-40087": {
    "cvss": 9.6,
    "description": "Vilo 5 Mesh WiFi System <= 5.16.1.33 is vulnerable to Insecure Permissions. Lack of authentication in the custom TCP service on port 5432 allows remote, unauthenticated attackers to gain administrative access over the router.",
    "published": "2024-10-21T21:15:06.003",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2024-40088": {
    "cvss": 5.3,
    "description": "A Directory Traversal vulnerability in the Boa webserver of Vilo 5 Mesh WiFi System <= 5.16.1.33 allows remote, unauthenticated attackers to enumerate the existence and length of any file in the filesystem by placing malicious payloads in the path of any HTTP request.",
    "published": "2024-10-21T21:15:06.080",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-40089": {
    "cvss": 9.1,
    "description": "A Command Injection vulnerability in Vilo 5 Mesh WiFi System <= 5.16.1.33 allows remote, authenticated attackers to execute arbitrary code by injecting shell commands into the name of the Vilo device.",
    "published": "2024-10-21T21:15:06.150",
    "keywords": "remote,command"
  },
  "CVE-2024-40090": {
    "cvss": 4.3,
    "description": "Vilo 5 Mesh WiFi System <= 5.16.1.33 is vulnerable to Information Disclosure. An information leak in the Boa webserver allows remote, unauthenticated attackers to leak memory addresses of uClibc and the stack via sending a GET request to the index page.",
    "published": "2024-10-21T21:15:06.223",
    "keywords": "remote,unauthenticated,leak"
  },
  "CVE-2024-40091": {
    "cvss": 5.3,
    "description": "Vilo 5 Mesh WiFi System <= 5.16.1.33 lacks authentication in the Boa webserver, which allows remote, unauthenticated attackers to retrieve logs with sensitive system.",
    "published": "2024-10-21T21:15:06.313",
    "keywords": "remote,unauthenticated,authentication,sensitive"
  },
  "CVE-2024-8901": {
    "cvss": 7.5,
    "description": "The  AWS ALB Route Directive Adapter For Istio repo https://github.com/awslabs/aws-alb-route-directive-adapter-for-istio/tree/master  provides an OIDC authentication mechanism that was integrated into the open source Kubeflow project. The adapter uses JWT for authentication, but lacks proper signer and issuer validation. In uncommon deployments of ALB, wherein endpoints are exposed to internet traffic, an actor can provide a JWT signed by an untrusted entity in order to spoof OIDC-federated sessions and successfully bypass authentication.",
    "published": "2024-10-22T00:15:03.667",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-9677": {
    "cvss": 5.5,
    "description": "The insufficiently protected credentials vulnerability in the CLI command of the USG FLEX H series uOS firmware version V1.21 and earlier versions could allow an authenticated local attacker to gain privilege escalation by stealing the authentication token of a login administrator. Note that this attack could be successful only if the administrator has not logged out.",
    "published": "2024-10-22T02:15:04.380",
    "keywords": "authentication,command"
  },
  "CVE-2024-10002": {
    "cvss": 8.8,
    "description": "The Rover IDX plugin for WordPress is vulnerable to Authentication Bypass in versions up to, and including, 3.0.0.2905. This is due to insufficient validation and capability check on the 'rover_idx_refresh_social_callback' function. This makes it possible for authenticated attackers, with subscriber-level permissions and above, to log in to administrator. The vulnerability is partially patched in version 3.0.0.2905 and fully patched in version 3.0.0.2906.",
    "published": "2024-10-22T05:15:03.513",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-8852": {
    "cvss": 5.3,
    "description": "The All-in-One WP Migration and Backup plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 7.86 through publicly exposed log files. This makes it possible for unauthenticated attackers to view potentially sensitive information such as full paths contained in the exposed log files.",
    "published": "2024-10-22T06:15:04.890",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-9627": {
    "cvss": 8.6,
    "description": "The TeploBot - Telegram Bot for WP plugin for WordPress is vulnerable to sensitive information disclosure due to missing authorization checks on the 'service_process' function in all versions up to, and including, 1.3. This makes it possible for unauthenticated attackers to view the Telegram Bot Token, which is a secret token to control the bot.",
    "published": "2024-10-22T07:15:02.687",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-9050": {
    "cvss": 7.8,
    "description": "A flaw was found in the libreswan client plugin for NetworkManager (NetkworkManager-libreswan), where it fails to properly sanitize the VPN configuration from the local unprivileged user. In this configuration, composed by a key-value format, the plugin fails to escape special characters, leading the application to interpret values as keys. One of the most critical parameters that could be abused by a malicious user is the `leftupdown`key. This key takes an executable command as a value and is used to specify what executes as a callback in NetworkManager-libreswan to retrieve configuration settings back to NetworkManager. As NetworkManager uses Polkit to allow an unprivileged user to control the system's network configuration, a malicious actor could achieve local privilege escalation and potential code execution as root in the targeted machine by creating a malicious configuration.",
    "published": "2024-10-22T13:15:02.410",
    "keywords": "execution,command,vpn"
  },
  "CVE-2024-50312": {
    "url": "https://github.com/openshift/console/pull/14409/files",
    "cvss": 5.3,
    "description": "A vulnerability was found in GraphQL due to improper access controls on the GraphQL introspection query. This flaw allows unauthorized users to retrieve a comprehensive list of available queries and mutations. Exposure to this flaw increases the attack surface, as it can facilitate the discovery of flaws or errors specific to the application's GraphQL implementation.",
    "published": "2024-10-22T14:15:19.973"
  },
  "CVE-2024-48927": {
    "cvss": 4.6,
    "description": "Umbraco, a free and open source .NET content management system, has a remote code execution issue in versions on the 13.x branch prior to 13.5.2, 10.x prior to 10.8.7, and 8.x prior to 8.18.15. There is a potential risk of code execution for Backoffice users when they “preview” SVG files in full screen mode. Versions 13.5.2, 10.8,7, and 8.18.15 contain a patch for the issue. As a workaround, derver-side file validation is available to strip script tags from file's content during the file upload process.",
    "published": "2024-10-22T16:15:08.360",
    "keywords": "remote,execution"
  },
  "CVE-2024-45518": {
    "cvss": 7.5,
    "description": "An issue was discovered in Zimbra Collaboration (ZCS) 10.1.x before 10.1.1, 10.0.x before 10.0.9, 9.0.0 before Patch 41, and 8.8.15 before Patch 46. It allows authenticated users to exploit Server-Side Request Forgery (SSRF) due to improper input sanitization and misconfigured domain whitelisting. This issue permits unauthorized HTTP requests to be sent to internal services, which can lead to Remote Code Execution (RCE) by chaining Command Injection within the internal service. When combined with existing XSS vulnerabilities, this SSRF issue can further facilitate Remote Code Execution (RCE).",
    "published": "2024-10-22T17:15:03.837",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-49208": {
    "cvss": 5.9,
    "description": "Archer Platform 2024.03 before version 2024.08 is affected by an authorization bypass vulnerability related to supporting application files. A remote unprivileged attacker could potentially exploit this vulnerability to elevate their privileges and delete system icons.",
    "published": "2024-10-22T17:15:04.503",
    "keywords": "remote,bypass"
  },
  "CVE-2024-49209": {
    "cvss": 6.5,
    "description": "Archer Platform 2024.03 before version 2024.09 is affected by an API authorization bypass vulnerability related to supporting application files. A remote unprivileged attacker could potentially exploit this vulnerability to elevate their privileges and upload additional system icons.",
    "published": "2024-10-22T17:15:05.763",
    "keywords": "remote,bypass"
  },
  "CVE-2024-49210": {
    "cvss": 5.2,
    "description": "Reflected XSS was discovered in an iView List Archer Platform UX page in Archer Platform 6.x before version 2024.09. A remote unauthenticated attacker could potentially exploit this by tricking a victim application user into supplying malicious HTML or JavaScript code to the vulnerable web application; the malicious code is then reflected back to the victim and executed by the web browser in the context of the vulnerable web application.",
    "published": "2024-10-22T17:15:05.970",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-49211": {
    "cvss": 5.2,
    "description": "Reflected XSS was discovered in a Dashboard Listing Archer Platform UX page in Archer Platform 6.x before version 2024.08. A remote unauthenticated attacker could potentially exploit this by tricking a victim application user into supplying malicious HTML or JavaScript code to the vulnerable web application; the malicious code is then reflected back to the victim and executed by the web browser in the context of the vulnerable web application.",
    "published": "2024-10-22T17:15:06.193",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-9287": {
    "url": "https://github.com/python/cpython/pull/124712",
    "cvss": "-",
    "description": "A vulnerability has been found in the CPython `venv` module and CLI where path names provided when creating a virtual environment were not quoted properly, allowing the creator to inject commands into virtual environment \"activation\" scripts (ie \"source venv/bin/activate\"). This means that attacker-controlled virtual environments are able to run commands when the virtual environment is activated. Virtual environments which are not created by an attacker or which aren't activated before being used (ie \"./venv/bin/python\") are not affected.",
    "published": "2024-10-22T17:15:06.697"
  },
  "CVE-2024-48904": {
    "cvss": 9.8,
    "description": "An command injection vulnerability in Trend Micro Cloud Edge could allow a remote attacker to execute arbitrary code on affected appliances.\r\n\r\nPlease note: authentication is not required in order to exploit this vulnerability.",
    "published": "2024-10-22T19:15:06.763",
    "keywords": "remote,authentication,command"
  },
  "CVE-2024-48919": {
    "cvss": "-",
    "description": "Cursor is a code editor built for programming with AI. Prior to Sep 27, 2024, if a user generated a terminal command via Cursor's Terminal Cmd-K/Ctrl-K feature and if the user explicitly imported a malicious web page into the Terminal Cmd-K prompt, an attacker with control over the referenced web page could have a significant chance of influencing a language model to output arbitrary commands for execution in the user's terminal. This scenario would require the user explicitly opt-in to including the contents of a compromised webpage, and it would require that the attacker display prompt injection text in the the contents of the compromised webpage.\n\nA server-side patch to not stream back newlines or control characters was released on September 27, 2024, within two hours of the issue being reported. Additionally, Cursor 0.42 includes client-side mitigations to prevent any newline or control character from being streamed into the terminal directly. It also contains a new setting, `\"cursor.terminal.usePreviewBox\"`, which, if set to true, streams the response into a preview box whose contents then have to be manually accepted before being inserted into the terminal. This setting is useful if you're working in a shell environment where commands can be executed without pressing enter or any control character. The patch has been applied server-side, so no additional action is needed, even on older versions of Cursor. Separately, Cursor's maintainers also recommend, as best practice, to only include trusted pieces of context in prompts.",
    "published": "2024-10-22T21:15:06.813",
    "keywords": "execution,command"
  },
  "CVE-2024-10229": {
    "cvss": "-",
    "description": "Inappropriate implementation in Extensions in Google Chrome prior to 130.0.6723.69 allowed a remote attacker to bypass site isolation via a crafted Chrome Extension. (Chromium security severity: High)",
    "published": "2024-10-22T22:15:03.180",
    "keywords": "remote,bypass"
  },
  "CVE-2024-31029": {
    "url": "https://github.com/keith-cullen/freecoap/issues/36",
    "cvss": "-",
    "description": "An issue in the server_handle_regular function of the test_coap_server.c file within the FreeCoAP project allows remote attackers to cause a Denial of Service through specially crafted packets.",
    "published": "2024-10-22T22:15:04.313"
  },
  "CVE-2024-40493": {
    "url": "https://github.com/keith-cullen/freecoap/issues/37",
    "cvss": 5.3,
    "description": "Null Pointer Dereference in `coap_client_exchange_blockwise2` function in Keith Cullen FreeCoAP 1.0 allows remote attackers to cause a denial of service and potentially execute arbitrary code via a specially crafted CoAP packet that causes `coap_msg_get_payload(resp)` to return a null pointer, which is then dereferenced in a call to `memcpy`.",
    "published": "2024-10-22T22:15:04.407"
  },
  "CVE-2024-42643": {
    "url": "https://github.com/pymumu/smartdns/issues/1779",
    "cvss": "-",
    "description": "Integer Overflow in fast_ping.c in SmartDNS Release46 allows remote attackers to cause a Denial of Service via misaligned memory access.",
    "published": "2024-10-22T22:15:04.860"
  },
  "CVE-2024-9947": {
    "cvss": 8.1,
    "description": "The ProfilePress Pro plugin for WordPress is vulnerable to authentication bypass in all versions up to, and including, 4.11.1. This is due to insufficient verification on the user being returned by the social login token. This makes it possible for unauthenticated attackers to log in as any existing user on the site, such as an administrator, if they have access to the email and the user does not have an already-existing account for the service returning the token.",
    "published": "2024-10-23T07:15:04.560",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-10041": {
    "cvss": 4.7,
    "description": "A vulnerability was found in PAM. The secret information is stored in memory, where the attacker can trigger the victim program to execute by sending characters to its standard input (stdin). As this occurs, the attacker can train the branch predictor to execute an ROP chain speculatively. This flaw could result in leaked passwords, such as those found in /etc/shadow while performing authentications.",
    "published": "2024-10-23T14:15:03.970",
    "keywords": "authentication,leak"
  },
  "CVE-2024-50050": {
    "cvss": "-",
    "description": "Llama Stack prior to revision 7a8aa775e5a267cf8660d83140011a0b7f91e005 used pickle as a serialization format for socket communication, potentially allowing for remote code execution. Socket communication has been changed to use JSON instead.",
    "published": "2024-10-23T14:15:05.087",
    "keywords": "remote,execution"
  },
  "CVE-2024-47575": {
    "cvss": 9.8,
    "description": "A missing authentication for critical function in FortiManager 7.6.0, FortiManager 7.4.0 through 7.4.4, FortiManager 7.2.0 through 7.2.7, FortiManager 7.0.0 through 7.0.12, FortiManager 6.4.0 through 6.4.14, FortiManager 6.2.0 through 6.2.12, Fortinet FortiManager Cloud 7.4.1 through 7.4.4, FortiManager Cloud 7.2.1 through 7.2.7, FortiManager Cloud 7.0.1 through 7.0.13, FortiManager Cloud 6.4.1 through 6.4.7 allows attacker to execute arbitrary code or commands via specially crafted requests.",
    "published": "2024-10-23T15:15:30.707",
    "keywords": "authentication,command"
  },
  "CVE-2024-47901": {
    "cvss": 10.0,
    "description": "A vulnerability has been identified in InterMesh 7177 Hybrid 2.0 Subscriber (All versions < V8.2.12), InterMesh 7707 Fire Subscriber (All versions < V7.2.12 only if the IP interface is enabled (which is not the default configuration)). The web server of affected devices does not sanitize the input parameters in specific GET requests that allow for code execution on operating system level. In combination with other vulnerabilities (CVE-2024-47902, CVE-2024-47903, CVE-2024-47904) this could allow an unauthenticated remote attacker to execute arbitrary code with root privileges.",
    "published": "2024-10-23T15:15:30.930",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-49675": {
    "cvss": 8.8,
    "description": "Authentication Bypass Using an Alternate Path or Channel vulnerability in Vitalii Bryl iBryl Switch User allows Authentication Bypass.This issue affects iBryl Switch User: from n/a through 1.0.1.",
    "published": "2024-10-23T15:15:32.120",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-49751": {
    "url": "https://github.com/frappe/press/commit/5d118a902872d7941f099ad1fb918e2421e79ccd",
    "cvss": "-",
    "description": "Press, a Frappe custom app that runs Frappe Cloud, manages infrastructure, subscription, marketplace, and software-as-a-service (SaaS). Prior to commit 5d118a902872d7941f099ad1fb918e2421e79ccd, a user could inject HTML through SaaS signup inputs. The user who injected the unsafe HTML code would only affect themselves and would not affect other users. Commit 5d118a902872d7941f099ad1fb918e2421e79ccd patches this bug.",
    "published": "2024-10-23T16:15:10.310"
  }
}