{
  "CVE-2024-25297": {
    "cvss": "-",
    "description": "Cross Site Scripting (XSS) vulnerability in Bludit CMS version 3.15, allows remote attackers to execute arbitrary code and obtain sensitive information via edit-content.php.",
    "published": "2024-02-17T06:15:53.653",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-0610": {
    "cvss": 9.8,
    "description": "The Piraeus Bank WooCommerce Payment Gateway plugin for WordPress is vulnerable to time-based blind SQL Injection via the 'MerchantReference' parameter in all versions up to, and including, 1.6.5.1 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-02-17T08:15:07.680",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-1512": {
    "cvss": 9.8,
    "description": "The MasterStudy LMS WordPress Plugin – for Online Courses and Education plugin for WordPress is vulnerable to union based SQL Injection via the 'user' parameter of the /lms/stm-lms/order/items REST route in all versions up to, and including, 3.2.5 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-02-17T08:15:08.093",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-25626": {
    "cvss": 8.8,
    "description": "Yocto Project is an open source collaboration project that helps developers create custom Linux-based systems regardless of the hardware architecture. In Yocto Projects Bitbake before 2.6.2 (before and included Yocto Project 4.3.1), with the Toaster server (included in bitbake) running, missing input validation allows an attacker to perform a remote code execution in the server's shell via a crafted HTTP request. Authentication is not necessary. Toaster server execution has to be specifically run and is not the default for Bitbake command line builds, it is only used for the Toaster web based user interface to Bitbake. The fix has been backported to the bitbake included with Yocto Project 5.0, 3.1.31, 4.0.16, and 4.3.2.",
    "published": "2024-02-19T20:15:45.513",
    "keywords": "remote,execution,authentication,command"
  },
  "CVE-2024-26129": {
    "url": "https://github.com/prestashop/prestashop/commit/444bd0dea581659918fe2067541b9863cf099dd5",
    "cvss": 5.8,
    "description": "PrestaShop is an open-source e-commerce platform. Starting in version 8.1.0 and prior to version 8.1.4, PrestaShop is vulnerable to path disclosure in a JavaScript variable. A patch is available in version 8.1.4.",
    "published": "2024-02-19T22:15:49.013"
  }
}