{
  "CVE-2024-11178": {
    "cvss": 8.1,
    "description": "The Login With OTP plugin for WordPress is vulnerable to authentication bypass in versions up to, and including, 1.4.2. This is due to the plugin generating too weak OTP, and there’s no attempt or time limit. This makes it possible for unauthenticated attackers to generate and brute force the 6-digit numeric OTP that makes it possible to log in as any existing user on the site, such as an administrator, if they have access to the email.",
    "published": "2024-12-06T07:15:05.460",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-11292": {
    "cvss": 5.3,
    "description": "The WP Private Content Plus plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 3.6.1 via the WordPress core search feature. This makes it possible for unauthenticated attackers to extract sensitive data from posts that have been restricted to higher-level roles such as administrator.",
    "published": "2024-12-06T09:15:05.993",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-11289": {
    "cvss": 8.1,
    "description": "The Soledad theme for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 8.5.9 via several functions like penci_archive_more_post_ajax_func, penci_more_post_ajax_func, and penci_more_featured_post_ajax_func. This makes it possible for unauthenticated attackers to include and execute PHP files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where PHP files can be uploaded and included. The exploitability of this is limited to Windows.",
    "published": "2024-12-06T10:15:05.450",
    "keywords": "execution,unauthenticated,sensitive,bypass"
  },
  "CVE-2024-11460": {
    "cvss": 7.5,
    "description": "The Verowa Connect plugin for WordPress is vulnerable to SQL Injection via the 'search_string' parameter in all versions up to, and including, 3.0.1 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-12-06T10:15:05.647",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-11728": {
    "cvss": 7.5,
    "description": "The KiviCare – Clinic & Patient Management System (EHR) plugin for WordPress is vulnerable to SQL Injection via the 'visit_type[service_id]' parameter of the tax_calculated_data AJAX action in all versions up to, and including, 3.6.4 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-12-06T10:15:05.853",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-10771": {
    "cvss": 8.8,
    "description": "Due to missing input validation during one step of the firmware update process, the product\nis vulnerable to remote code execution. With network access and the user level ”Service”, an attacker\ncan execute arbitrary system commands in the root user’s contexts.",
    "published": "2024-12-06T13:15:04.797",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-10774": {
    "cvss": 7.3,
    "description": "Unauthenticated CROWN APIs allow access to critical functions. This leads to the accessibility of large parts of the web application without authentication.",
    "published": "2024-12-06T13:15:06.023",
    "keywords": "unauthenticated,authentication"
  },
  "CVE-2024-10516": {
    "cvss": 8.1,
    "description": "The Swift Performance Lite plugin for WordPress is vulnerable to Local PHP File Inclusion in all versions up to, and including, 2.3.7.1 via the 'ajaxify' function. This makes it possible for unauthenticated attackers to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-12-06T14:15:19.667",
    "keywords": "execution,unauthenticated,sensitive,bypass"
  },
  "CVE-2024-21571": {
    "cvss": 8.1,
    "description": "Snyk has identified a remote code execution (RCE) vulnerability in all versions of Code Agent. The vulnerability enables an attacker to execute arbitrary code within the Code Agent container. Exploiting this vulnerability would require an attacker to have network access to the Code Agent within the deployment environment. External exploitation of this vulnerability is unlikely and depends on both misconfigurations of the cluster and/or chaining with another vulnerability. However, internal exploitation (with a cluster misconfiguration) could still be possible.",
    "published": "2024-12-06T14:15:19.997",
    "keywords": "remote,execution"
  },
  "CVE-2024-11738": {
    "url": "https://github.com/rustls/rustls/issues/2227",
    "cvss": 5.3,
    "description": "A flaw was found in Rustls 0.23.13 and related APIs. This vulnerability allows denial of service (panic) via a fragmented TLS ClientHello message.",
    "published": "2024-12-06T15:15:07.723"
  },
  "CVE-2024-12254": {
    "url": "https://github.com/python/cpython/pull/127656",
    "cvss": "-",
    "description": "Starting in Python 3.12.0, the asyncio._SelectorSocketTransport.writelines()\n method would not \"pause\" writing and signal to the Protocol to drain \nthe buffer to the wire once the write buffer reached the \"high-water \nmark\". Because of this, Protocols would not periodically drain the write\n buffer potentially leading to memory exhaustion.\n\n\n\n\n\nThis\n vulnerability likely impacts a small number of users, you must be using\n Python 3.12.0 or later, on macOS or Linux, using the asyncio module \nwith protocols, and using .writelines() method which had new \nzero-copy-on-write behavior in Python 3.12.0 and later. If not all of \nthese factors are true then your usage of Python is unaffected.",
    "published": "2024-12-06T16:15:20.623"
  },
  "CVE-2024-54135": {
    "url": "https://github.com/macwarrior/clipbucket-v5/commit/76a829c088f0813ab3244a3bd0036111017409b0",
    "cvss": 9.8,
    "description": "ClipBucket V5 provides open source video hosting with PHP. ClipBucket-v5 Version 2.0 to Version 5.5.1 Revision 199 are vulnerable to PHP Deserialization vulnerability. The vulnerability exists in upload/photo_upload.php  within the decode_key function. User inputs were supplied to this function without sanitization via collection GET parameter and photoIDS POST parameter respectively. The decode_key function invokes PHP unserialize function as defined in upload/includes/classes/photos.class.php. As a result, it is possible for an adversary to inject maliciously crafted PHP serialized object and utilize gadget chains to cause unexpected behaviors of the application. This vulnerability is fixed in 5.5.1 Revision 200.",
    "published": "2024-12-06T16:15:22.340"
  },
  "CVE-2024-54136": {
    "url": "https://github.com/macwarrior/clipbucket-v5/commit/76a829c088f0813ab3244a3bd0036111017409b0",
    "cvss": 9.8,
    "description": "ClipBucket V5 provides open source video hosting with PHP. ClipBucket-v5 Version 5.5.1 Revision 199 and below is vulnerable to PHP Deserialization vulnerability. The vulnerability exists in upload/upload.php where the user supplied input via collection get parameter is directly provided to unserialize function. As a result, it is possible for an adversary to inject maliciously crafted PHP serialized object and utilize gadget chains to cause unexpected behaviors of the application. This vulnerability is fixed in 5.5.1 Revision 200.",
    "published": "2024-12-06T16:15:22.500"
  },
  "CVE-2024-48859": {
    "cvss": "-",
    "description": "An improper authentication vulnerability has been reported to affect several QNAP operating system versions. If exploited, the vulnerability could allow remote attackers to compromise the security of the system.\n\nWe have already fixed the vulnerability in the following versions:\nQTS 5.1.9.2954 build 20241120 and later\nQTS 5.2.2.2950 build 20241114 and later\nQuTS hero h5.1.9.2954 build 20241120 and later\nQuTS hero h5.2.2.2952 build 20241116 and later",
    "published": "2024-12-06T17:15:08.350",
    "keywords": "remote,authentication"
  },
  "CVE-2024-48863": {
    "cvss": "-",
    "description": "A command injection vulnerability has been reported to affect License Center. If exploited, the vulnerability could allow remote attackers to execute arbitrary commands.\n\nWe have already fixed the vulnerability in the following version:\nLicense Center 1.9.43 and later",
    "published": "2024-12-06T17:15:08.533",
    "keywords": "remote,command"
  },
  "CVE-2024-50388": {
    "cvss": "-",
    "description": "An OS command injection vulnerability has been reported to affect HBS 3 Hybrid Backup Sync. If exploited, the vulnerability could allow remote attackers to execute commands.\n\nWe have already fixed the vulnerability in the following version:\nHBS 3 Hybrid Backup Sync 25.1.1.673 and later",
    "published": "2024-12-06T17:15:09.373",
    "keywords": "remote,command"
  },
  "CVE-2024-50393": {
    "cvss": "-",
    "description": "A command injection vulnerability has been reported to affect several QNAP operating system versions. If exploited, the vulnerability could allow remote attackers to execute arbitrary commands.\n\nWe have already fixed the vulnerability in the following versions:\nQTS 5.1.9.2954 build 20241120 and later\nQTS 5.2.2.2950 build 20241114 and later\nQuTS hero h5.1.9.2954 build 20241120 and later\nQuTS hero h5.2.2.2952 build 20241116 and later",
    "published": "2024-12-06T17:15:09.637",
    "keywords": "remote,command"
  },
  "CVE-2024-54143": {
    "url": "https://github.com/openwrt/asu/commit/920c8a13d97b4d4095f0d939cf0aaae777e0f87e",
    "cvss": "-",
    "description": "openwrt/asu is an image on demand server for OpenWrt based distributions. The request hashing mechanism truncates SHA-256 hashes to only 12 characters. This significantly reduces entropy, making it feasible for an attacker to generate collisions. By exploiting this, a previously built malicious image can be served in place of a legitimate one, allowing the attacker to \"poison\" the artifact cache and deliver compromised images to unsuspecting users. This can be combined with other attacks, such as a command injection in Imagebuilder that allows malicious users to inject arbitrary commands into the build process, resulting in the production of malicious firmware images signed with the legitimate build key. This has been patched with 920c8a1.",
    "published": "2024-12-06T17:15:12.687"
  },
  "CVE-2024-48871": {
    "cvss": 9.8,
    "description": "The affected product is vulnerable to a stack-based buffer overflow. An unauthenticated attacker could send a malicious HTTP request that the webserver fails to properly check input size before copying data to the stack, potentially allowing remote code execution.",
    "published": "2024-12-06T18:15:25.267",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-52320": {
    "cvss": 9.8,
    "description": "The affected product is vulnerable to a command injection. An unauthenticated attacker could send commands through a malicious HTTP request which could result in remote code execution.",
    "published": "2024-12-06T18:15:25.737",
    "keywords": "remote,execution,unauthenticated,command"
  },
  "CVE-2024-11010": {
    "cvss": 7.2,
    "description": "The FileOrganizer – Manage WordPress and Website Files plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 1.1.4 via the 'default_lang' parameter. This makes it possible for authenticated attackers, with Administrator-level access and above, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-12-07T10:15:04.047",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-12270": {
    "cvss": 7.5,
    "description": "The Beautiful taxonomy filters plugin for WordPress is vulnerable to SQL Injection via the 'selects[0][term]' parameter in all versions up to, and including, 2.4.3 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-12-07T10:15:06.200",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-12209": {
    "cvss": 9.8,
    "description": "The WP Umbrella: Update Backup Restore & Monitoring plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 2.17.0 via the 'filename' parameter of the 'umbrella-restore' action. This makes it possible for unauthenticated attackers to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-12-08T06:15:04.823",
    "keywords": "execution,unauthenticated,sensitive,bypass"
  },
  "CVE-2024-12344": {
    "cvss": 6.3,
    "description": "A vulnerability, which was classified as critical, was found in TP-Link VN020 F3v(T) TT_V6.2.1021. This affects an unknown part of the component FTP USER Command Handler. The manipulation leads to memory corruption. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2024-12-08T23:15:04.980",
    "keywords": "remote,command"
  },
  "CVE-2024-55560": {
    "url": "https://github.com/mailcleaner/mailcleaner/commit/28d913eaa044b689eb114f72ebe92d48cb4aaca7",
    "cvss": "-",
    "description": "MailCleaner before 28d913e has default values of ssh_host_dsa_key, ssh_host_rsa_key, and ssh_host_ed25519_key that persist after installation.",
    "published": "2024-12-08T23:15:05.940"
  },
  "CVE-2024-12350": {
    "cvss": 6.3,
    "description": "A vulnerability was found in JFinalCMS 1.0. It has been rated as critical. Affected by this issue is the function update of the file \\src\\main\\java\\com\\cms\\controller\\admin\\TemplateController.java of the component Template Handler. The manipulation of the argument content leads to command injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2024-12-09T01:15:05.943",
    "keywords": "remote,command"
  },
  "CVE-2024-55580": {
    "cvss": 7.5,
    "description": "An issue was discovered in Qlik Sense Enterprise for Windows before November 2024 IR. Unprivileged users with network access may be able to execute remote commands that could cause high availability damages, including high integrity and confidentiality risks. This is fixed in November 2024 IR, May 2024 Patch 10, February 2024 Patch 14, November 2023 Patch 16, August 2023 Patch 16, May 2023 Patch 18, and February 2023 Patch 15.",
    "published": "2024-12-09T03:15:05.400",
    "keywords": "remote,command"
  }
}