{
  "CVE-2024-6635": {
    "cvss": 7.3,
    "description": "The WooCommerce - Social Login plugin for WordPress is vulnerable to authentication bypass in versions up to, and including, 2.7.3. This is due to insufficient controls in the 'woo_slg_login_email' function. This makes it possible for unauthenticated attackers to log in as any existing user on the site, excluding an administrator, if they know the email of user.",
    "published": "2024-07-20T08:15:16.177",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-6938": {
    "url": "https://github.com/siyuan-note/siyuan/issues/11949",
    "cvss": 3.5,
    "description": "A vulnerability has been found in SiYuan 3.1.0 and classified as problematic. Affected by this vulnerability is an unknown functionality of the file PDF.js of the component PDF Handler. The manipulation leads to cross site scripting. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-271993 was assigned to this vulnerability.",
    "published": "2024-07-21T05:15:03.077"
  },
  "CVE-2024-6939": {
    "url": "https://github.com/rainrocka/xinhu/issues/7",
    "cvss": 3.5,
    "description": "A vulnerability was found in Xinhu RockOA 2.6.3 and classified as problematic. Affected by this issue is the function okla of the file /webmain/public/upload/tpl_upload.html. The manipulation of the argument callback leads to cross site scripting. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. VDB-271994 is the identifier assigned to this vulnerability.",
    "published": "2024-07-21T05:15:04.310"
  },
  "CVE-2024-6941": {
    "url": "https://github.com/thinksaas/thinksaas/issues/36",
    "cvss": 3.5,
    "description": "A vulnerability, which was classified as problematic, has been found in ThinkSAAS 3.7.0. This issue affects some unknown processing of the file app/system/action/do.php. The manipulation of the argument site_title/site_subtitle/site_key/site_desc/site_url/site_email/site_icp leads to cross site scripting. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-272063.",
    "published": "2024-07-21T06:15:05.550"
  },
  "CVE-2024-6942": {
    "url": "https://github.com/thinksaas/thinksaas/issues/37",
    "cvss": 3.5,
    "description": "A vulnerability, which was classified as problematic, was found in ThinkSAAS 3.7.0. Affected is an unknown function of the file app/system/action/anti.php of the component Admin Panel Security Center. The manipulation of the argument ip/email/phone leads to cross site scripting. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-272064.",
    "published": "2024-07-21T07:15:05.887"
  },
  "CVE-2024-38437": {
    "cvss": 9.8,
    "description": "D-Link - CWE-288:Authentication Bypass Using an Alternate Path or Channel",
    "published": "2024-07-21T08:15:06.243",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-38438": {
    "cvss": 9.8,
    "description": "D-Link - \n\nCWE-294: Authentication Bypass by Capture-replay",
    "published": "2024-07-21T08:15:06.467",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-6963": {
    "cvss": 8.8,
    "description": "A vulnerability, which was classified as critical, has been found in Tenda O3 1.0.0.10. This issue affects the function formexeCommand. The manipulation of the argument cmdinput leads to stack-based buffer overflow. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-272117 was assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-07-22T00:15:02.777",
    "keywords": "remote,command"
  },
  "CVE-2024-41703": {
    "url": "https://github.com/danny-avila/librechat/pull/3363",
    "cvss": "-",
    "description": "LibreChat through 0.7.4-rc1 has incorrect access control for message updates. (Work on a fixed version release has started in PR 3363.)",
    "published": "2024-07-22T05:15:03.450"
  },
  "CVE-2024-41704": {
    "url": "https://github.com/danny-avila/librechat/pull/3363",
    "cvss": "-",
    "description": "LibreChat through 0.7.4-rc1 does not validate the normalized pathnames of images. (Work on a fixed version release has started in PR 3363.)",
    "published": "2024-07-22T05:15:03.537"
  },
  "CVE-2024-23321": {
    "cvss": "-",
    "description": "For RocketMQ versions 5.2.0 and below, under certain conditions, there is a risk of exposure of sensitive Information to an unauthorized actor even if RocketMQ is enabled with authentication and authorization functions.\n\nAn attacker, possessing regular user privileges or listed in the IP whitelist, could potentially acquire the administrator's account and password through specific interfaces. Such an action would grant them full control over RocketMQ, provided they have access to the broker IP address list.\n\nTo mitigate these security threats, it is strongly advised that users upgrade to version 5.3.0 or newer. Additionally, we recommend users to use RocketMQ ACL 2.0 instead of the original RocketMQ ACL when upgrading to version Apache RocketMQ 5.3.0.\n\n",
    "published": "2024-07-22T10:15:02.540",
    "keywords": "authentication,sensitive"
  },
  "CVE-2024-6542": {
    "cvss": 6.5,
    "description": "Improper neutralization of livestatus command delimiters in mknotifyd in Checkmk <= 2.0.0p39, < 2.1.0p47, < 2.2.0p32 and < 2.3.0p11 allows arbitrary livestatus command execution.",
    "published": "2024-07-22T10:15:08.827",
    "keywords": "execution,command"
  },
  "CVE-2024-39601": {
    "cvss": 6.5,
    "description": "A vulnerability has been identified in CPCI85 Central Processing/Communication (All versions < V5.40), SICORE Base system (All versions < V1.4.0). Affected devices allow a remote authenticated user or an unauthenticated user with physical access to downgrade the firmware of the device. This could allow an attacker to downgrade the device to older versions with known vulnerabilities.",
    "published": "2024-07-22T14:15:06.107",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-39685": {
    "cvss": 9.8,
    "description": "Bert-VITS2 is the VITS2 Backbone with multilingual bert. User input supplied to the data_dir variable is used directly in a command executed with subprocess.run(cmd, shell=True) in the resample function, which leads to arbitrary command execution. This affects fishaudio/Bert-VITS2 2.3 and earlier.",
    "published": "2024-07-22T16:15:03.417",
    "keywords": "execution,command"
  },
  "CVE-2024-39686": {
    "cvss": 9.8,
    "description": "Bert-VITS2 is the VITS2 Backbone with multilingual bert. User input supplied to the data_dir variable is used directly in a command executed with subprocess.run(cmd, shell=True) in the bert_gen function, which leads to arbitrary command execution. This affects fishaudio/Bert-VITS2 2.3 and earlier.",
    "published": "2024-07-22T16:15:03.657",
    "keywords": "execution,command"
  },
  "CVE-2024-6675": {
    "cvss": 7.8,
    "description": "A deserialization of untrusted data vulnerability exists in NI VeriStand that may result in remote code execution.  Successful exploitation requires an attacker to get a user to open a specially crafted project file.  This vulnerability affects VeriStand 2024 Q2 and prior versions.",
    "published": "2024-07-22T20:15:04.940",
    "keywords": "remote,execution"
  }
}