{
  "CVE-2024-5443": {
    "cvss": 9.8,
    "description": "CVE-2024-4320 describes a vulnerability in the parisneo/lollms software, specifically within the `ExtensionBuilder().build_extension()` function. The vulnerability arises from the `/mount_extension` endpoint, where a path traversal issue allows attackers to navigate beyond the intended directory structure. This is facilitated by the `data.category` and `data.folder` parameters accepting empty strings (`\"\"`), which, due to inadequate input sanitization, can lead to the construction of a `package_path` that points to the root directory. Consequently, if an attacker can create a `config.yaml` file in a controllable path, this path can be appended to the `extensions` list and trigger the execution of `__init__.py` in the current directory, leading to remote code execution. The vulnerability affects versions up to 5.9.0, and has been addressed in version 9.8.",
    "published": "2024-06-22T17:15:34.410",
    "keywords": "remote,execution"
  },
  "CVE-2024-39337": {
    "cvss": "-",
    "description": "Click Studios Passwordstate Core before 9.8 build 9858 allows Authentication Bypass.",
    "published": "2024-06-24T00:15:09.577",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-3121": {
    "cvss": 6.8,
    "description": "A remote code execution vulnerability exists in the create_conda_env function of the parisneo/lollms repository, version 5.9.0. The vulnerability arises from the use of shell=True in the subprocess.Popen function, which allows an attacker to inject arbitrary commands by manipulating the env_name and python_version parameters. This issue could lead to a serious security breach as demonstrated by the ability to execute the 'whoami' command among potentially other harmful commands.",
    "published": "2024-06-24T00:15:09.680",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-24552": {
    "cvss": "-",
    "description": "A session fixation vulnerability in Bludit allows an attacker to bypass the server's authentication if they can trick an administrator or any other user into authorizing a session ID of their choosing.",
    "published": "2024-06-24T07:15:14.903",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-4748": {
    "url": "https://github.com/jan-vandenberg/cruddiy/issues/67",
    "cvss": 8.8,
    "description": "The CRUDDIY project is vulnerable to shell command injection via sending a crafted POST request to the application server. \nThe exploitation risk is limited since CRUDDIY is meant to be launched locally. Nevertheless, a user with the project running on their computer might visit a website which would send such a malicious request to the locally launched server.",
    "published": "2024-06-24T14:15:13.030"
  },
  "CVE-2024-37759": {
    "url": "https://github.com/datageartech/datagear/issues/32",
    "cvss": "-",
    "description": "DataGear v5.0.0 and earlier was discovered to contain a SpEL (Spring Expression Language) expression injection vulnerability via the Data Viewing interface.",
    "published": "2024-06-24T21:15:25.940"
  },
  "CVE-2024-38892": {
    "cvss": "-",
    "description": "An issue in Wavlink WN551K1 allows a remote attacker to obtain sensitive information via the ExportAllSettings.sh component.",
    "published": "2024-06-24T21:15:26.050",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-33898": {
    "cvss": "-",
    "description": "Axiros AXESS Auto Configuration Server (ACS) 4.x and 5.0.0 has Incorrect Access Control. An authorization bypass allows remote attackers to achieve unauthenticated remote code execution.",
    "published": "2024-06-24T22:15:10.207",
    "keywords": "remote,execution,unauthenticated,bypass"
  },
  "CVE-2024-4196": {
    "cvss": 10.0,
    "description": "An improper input validation vulnerability  was discovered in Avaya IP Office that could allow remote command or code execution via a specially crafted web request to the Web Control component. Affected versions include all versions prior to 11.1.3.1.",
    "published": "2024-06-25T04:15:16.580",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-4197": {
    "cvss": 9.9,
    "description": "An unrestricted file upload vulnerability in Avaya IP Office was discovered that could allow remote command or code execution via the One-X component. Affected versions include all versions prior to 11.1.3.1.",
    "published": "2024-06-25T04:15:17.007",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-5431": {
    "cvss": 8.8,
    "description": "The WPCafe – Online Food Ordering, Restaurant Menu, Delivery, and Reservations for WooCommerce plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 2.2.25 via the reservation_extra_field shortcode parameter. This makes it possible for authenticated attackers, with Contributor-level access and above, to include remote files on the server, potentially resulting in code execution",
    "published": "2024-06-25T06:15:11.800",
    "keywords": "remote,execution"
  },
  "CVE-2024-6028": {
    "cvss": 9.8,
    "description": "The Quiz Maker plugin for WordPress is vulnerable to time-based SQL Injection via the 'ays_questions' parameter in all versions up to, and including, 6.5.8.3 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-06-25T09:15:57.760",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-5216": {
    "url": "https://github.com/mintplex-labs/anything-llm/commit/3ef009de73c837f9025df8bba62572885c70c72f",
    "cvss": 7.5,
    "description": "A vulnerability in mintplex-labs/anything-llm allows for a Denial of Service (DoS) condition due to uncontrolled resource consumption. Specifically, the issue arises from the application's failure to limit the size of usernames, enabling attackers to create users with excessively bulky texts in the username field. This exploit results in the user management panel becoming unresponsive, preventing administrators from performing critical user management actions such as editing, suspending, or deleting users. The impact of this vulnerability includes administrative paralysis, compromised security, and operational disruption, as it allows malicious users to perpetuate their presence within the system indefinitely, undermines the system's security posture, and degrades overall system performance.",
    "published": "2024-06-25T11:15:50.193"
  }
}