{
  "CVE-2024-22425": {
    "cvss": 6.5,
    "description": "\nDell RecoverPoint for Virtual Machines 5.3.x contains a brute force/dictionary attack vulnerability. An unauthenticated remote attacker could potentially exploit this vulnerability, leading to launch a brute force attack or a dictionary attack against the RecoverPoint login form. This allows attackers to brute-force the password of valid users in an automated manner.\n\n",
    "published": "2024-02-16T12:15:07.757",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-22426": {
    "cvss": 7.2,
    "description": "\nDell RecoverPoint for Virtual Machines 5.3.x contains an OS Command injection vulnerability. An unauthenticated remote\nattacker could potentially exploit this vulnerability, leading to execute arbitrary operating system commands, which will get executed in the context of the root user, resulting in a complete system compromise.\n\n",
    "published": "2024-02-16T12:15:08.537",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-0017": {
    "cvss": "-",
    "description": "In shouldUseNoOpLocation of CameraActivity.java, there is a possible confused deputy due to a permissions bypass. This could lead to local information disclosure with no additional execution privileges needed. User interaction is needed for exploitation.",
    "published": "2024-02-16T20:15:47.513",
    "keywords": "execution,bypass"
  },
  "CVE-2024-21492": {
    "url": "https://github.com/greenpau/caddy-security/issues/272",
    "cvss": 4.8,
    "description": "All versions of the package github.com/greenpau/caddy-security are vulnerable to Insufficient Session Expiration due to improper user session invalidation upon clicking the \"Sign Out\" button. User sessions remain valid even after requests are sent to /logout and /oauth2/google/logout. Attackers who gain access to an active but supposedly logged-out session can perform unauthorized actions on behalf of the user.",
    "published": "2024-02-17T05:15:08.223"
  },
  "CVE-2024-21493": {
    "url": "https://github.com/greenpau/caddy-security/issues/263",
    "cvss": 5.3,
    "description": "All versions of the package github.com/greenpau/caddy-security are vulnerable to Improper Validation of Array Index when parsing a Caddyfile. Multiple parsing functions in the affected library do not validate whether their input values are nil before attempting to access elements, which can lead to a panic (index out of range). Panics during the parsing of a configuration file may introduce ambiguity and vulnerabilities, hindering the correct interpretation and configuration of the web server.",
    "published": "2024-02-17T05:15:08.747"
  },
  "CVE-2024-21494": {
    "cvss": 5.4,
    "description": "All versions of the package github.com/greenpau/caddy-security are vulnerable to Authentication Bypass by Spoofing via the X-Forwarded-For header due to improper input sanitization. An attacker can spoof an IP address used in the user identity module (/whoami API endpoint). This could lead to unauthorized access if the system trusts this spoofed IP address.",
    "published": "2024-02-17T05:15:09.077",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-21496": {
    "url": "https://github.com/greenpau/caddy-security/issues/267",
    "cvss": 6.1,
    "description": "All versions of the package github.com/greenpau/caddy-security are vulnerable to Cross-site Scripting (XSS) via the Referer header, due to improper input sanitization. Although the Referer header is sanitized by escaping some characters that can allow XSS (e.g., [&], [<], [>], [\"], [']), it does not account for the attack based on the JavaScript URL scheme (e.g., javascript:alert(document.domain)// payload). Exploiting this vulnerability may not be trivial, but it could lead to the execution of malicious scripts in the context of the target user’s browser, compromising user sessions.",
    "published": "2024-02-17T05:15:09.603"
  },
  "CVE-2024-21497": {
    "url": "https://github.com/greenpau/caddy-security/issues/268",
    "cvss": 5.4,
    "description": "All versions of the package github.com/greenpau/caddy-security are vulnerable to Open Redirect via the redirect_url parameter. An attacker could perform a phishing attack and trick users into visiting a malicious website by crafting a convincing URL with this parameter. To exploit this vulnerability, the user must take an action, such as clicking on a portal button or using the browser’s back button, to trigger the redirection.",
    "published": "2024-02-17T05:15:09.863"
  },
  "CVE-2024-21498": {
    "url": "https://github.com/greenpau/caddy-security/issues/269",
    "cvss": 5.3,
    "description": "All versions of the package github.com/greenpau/caddy-security are vulnerable to Server-side Request Forgery (SSRF) via X-Forwarded-Host header manipulation. An attacker can expose sensitive information, interact with internal services, or exploit other vulnerabilities within the network by exploiting this vulnerability.",
    "published": "2024-02-17T05:15:10.087"
  },
  "CVE-2024-21499": {
    "url": "https://github.com/greenpau/caddy-security/issues/270",
    "cvss": 4.3,
    "description": "All versions of the package github.com/greenpau/caddy-security are vulnerable to HTTP Header Injection via the X-Forwarded-Proto header due to redirecting to the injected protocol.Exploiting this vulnerability could lead to bypass of security mechanisms or confusion in handling TLS.",
    "published": "2024-02-17T05:15:10.400"
  },
  "CVE-2024-21500": {
    "cvss": 4.8,
    "description": "All versions of the package github.com/greenpau/caddy-security are vulnerable to Improper Restriction of Excessive Authentication Attempts via the two-factor authentication (2FA). Although the application blocks the user after several failed attempts to provide 2FA codes, attackers can bypass this blocking mechanism by automating the application’s full multistep 2FA process.",
    "published": "2024-02-17T05:15:10.697",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-25297": {
    "cvss": "-",
    "description": "Cross Site Scripting (XSS) vulnerability in Bludit CMS version 3.15, allows remote attackers to execute arbitrary code and obtain sensitive information via edit-content.php.",
    "published": "2024-02-17T06:15:53.653",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-0610": {
    "cvss": 9.8,
    "description": "The Piraeus Bank WooCommerce Payment Gateway plugin for WordPress is vulnerable to time-based blind SQL Injection via the 'MerchantReference' parameter in all versions up to, and including, 1.6.5.1 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-02-17T08:15:07.680",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-1512": {
    "cvss": 9.8,
    "description": "The MasterStudy LMS WordPress Plugin – for Online Courses and Education plugin for WordPress is vulnerable to union based SQL Injection via the 'user' parameter of the /lms/stm-lms/order/items REST route in all versions up to, and including, 3.2.5 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-02-17T08:15:08.093",
    "keywords": "unauthenticated,sensitive"
  }
}