{
  "CVE-2024-46640": {
    "cvss": 9.8,
    "description": "SeaCMS 13.2 has a remote code execution vulnerability located in the file sql.class.chp. Although the system has a check function, the check function is not executed during execution, allowing remote code execution by writing to the file through the MySQL slow query method.",
    "published": "2024-09-20T21:15:12.700",
    "keywords": "remote,execution"
  },
  "CVE-2024-47218": {
    "cvss": 9.8,
    "description": "An issue was discovered in vesoft NebulaGraph through 3.8.0. It allows bypassing authentication.",
    "published": "2024-09-22T01:15:11.583",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-47219": {
    "url": "https://github.com/vesoft-inc/nebula/pull/5936",
    "cvss": "-",
    "description": "An issue was discovered in vesoft NebulaGraph through 3.8.0. It allows shell command injection.",
    "published": "2024-09-22T01:15:11.890"
  },
  "CVE-2024-47220": {
    "url": "https://github.com/ruby/webrick/pull/146/commits/d88321da45dcd230ac2b4585cad4833d6d5e8841",
    "cvss": 7.5,
    "description": "An issue was discovered in the WEBrick toolkit through 1.8.1 for Ruby. It allows HTTP request smuggling by providing both a Content-Length header and a Transfer-Encoding header, e.g., \"GET /admin HTTP/1.1\\r\\n\" inside of a \"POST /user HTTP/1.1\\r\\n\" request. NOTE: the supplier's position is \"Webrick should not be used in production.\"",
    "published": "2024-09-22T01:15:11.950"
  },
  "CVE-2024-47221": {
    "url": "https://github.com/rapidscada/scada/commit/b14cbdfa6cf3a205e57f2383c915365adc3859a7",
    "cvss": "-",
    "description": "CheckUser in ScadaServerEngine/MainLogic.cs in Rapid SCADA through 5.8.4 allows an empty password.",
    "published": "2024-09-22T01:15:12.013"
  },
  "CVE-2024-9076": {
    "cvss": 6.3,
    "description": "A vulnerability was found in DedeCMS up to 5.7.115. It has been rated as critical. This issue affects some unknown processing of the file article_string_mix.php. The manipulation leads to os command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-09-22T01:15:12.070",
    "keywords": "remote,command"
  },
  "CVE-2024-45453": {
    "cvss": 3.7,
    "description": "Authentication Bypass by Spoofing vulnerability in Peter Hardy-vanDoorn Maintenance Redirect allows Accessing Functionality Not Properly Constrained by ACLs.This issue affects Maintenance Redirect: from n/a through 2.0.1.",
    "published": "2024-09-23T01:15:11.923",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-8606": {
    "cvss": "-",
    "description": "Bypass of two factor authentication in RestAPI in Checkmk < 2.3.0p16 and < 2.2.0p34 allows authenticated users to bypass two factor authentication",
    "published": "2024-09-23T07:15:02.233",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-23922": {
    "cvss": 6.8,
    "description": "Sony XAV-AX5500 Insufficient Firmware Update Validation Remote Code Execution Vulnerability. This vulnerability allows physically present attackers to execute arbitrary code on affected installations of Sony XAV-AX5500 devices. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the handling of software updates. The issue results from the lack of proper validation of software update packages. An attacker can leverage this vulnerability to execute code in the context of the device.\n\nWas ZDI-CAN-22939",
    "published": "2024-09-23T15:15:13.010",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2024-23933": {
    "cvss": 6.8,
    "description": "Sony XAV-AX5500 CarPlay TLV Stack-based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows physically present attackers to execute arbitrary code on affected installations of \tSony XAV-AX5500 devices. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the implementation of the Apple CarPlay protocol. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a fixed-length stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of the device.\n\nWas ZDI-CAN-23238",
    "published": "2024-09-23T15:15:13.297",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2024-23934": {
    "cvss": 8.8,
    "description": "Sony XAV-AX5500 WMV/ASF Parsing Stack-based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Sony XAV-AX5500 devices. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of WMV/ASF files. A crafted Extended Content Description Object in a WMV media file can trigger an overflow of a fixed-length stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of the device.\n\n. Was ZDI-CAN-22994.",
    "published": "2024-09-23T15:15:13.500",
    "keywords": "remote,execution"
  },
  "CVE-2024-23972": {
    "cvss": 6.8,
    "description": "Sony XAV-AX5500 USB Configuration Descriptor Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows physically present attackers to execute arbitrary code on affected installations of Sony XAV-AX5500 devices. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the USB host driver. A crafted USB configuration descriptor can trigger an overflow of a fixed-length buffer. An attacker can leverage this vulnerability to execute code in the context of the device.\n\nWas ZDI-CAN-23185",
    "published": "2024-09-23T15:15:13.703",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2024-46997": {
    "cvss": 9.8,
    "description": "DataEase is an open source data visualization analysis tool. Prior to version 2.10.1, an attacker can achieve remote command execution by adding a carefully constructed h2 data source connection string. The vulnerability has been fixed in v2.10.1.",
    "published": "2024-09-23T16:15:06.387",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-9014": {
    "url": "https://github.com/pgadmin-org/pgadmin4/issues/7945",
    "cvss": 9.9,
    "description": "pgAdmin versions 8.11 and earlier are vulnerable to a security flaw in OAuth2 authentication. This vulnerability allows an attacker to potentially obtain the client ID and secret, leading to unauthorized access to user data.",
    "published": "2024-09-23T17:15:14.000"
  },
  "CVE-2024-0004": {
    "cvss": 9.1,
    "description": "A condition exists in FlashArray Purity whereby an user with array admin role can execute arbitrary commands remotely to escalate privilege on the array.",
    "published": "2024-09-23T18:15:04.973",
    "keywords": "remote,command"
  },
  "CVE-2024-0005": {
    "cvss": 9.1,
    "description": "A condition exists in FlashArray and FlashBlade Purity whereby a malicious user could execute arbitrary commands remotely through a specifically crafted SNMP configuration.",
    "published": "2024-09-23T18:15:05.233",
    "keywords": "remote,command"
  },
  "CVE-2024-39341": {
    "cvss": "-",
    "description": "Entrust Instant Financial Issuance (On Premise) Software (formerly known as Cardwizard) 6.10.0, 6.9.0, 6.9.1, 6.9.2, and 6.8.x and earlier leaves behind a configuration file (i.e. WebAPI.cfg.xml) after the installation process. This file can be accessed without authentication on HTTP port 80 by guessing the correct IIS webroot path. It includes system configuration parameter names and values with sensitive configuration values encrypted.",
    "published": "2024-09-23T18:15:05.507",
    "keywords": "authentication,sensitive"
  },
  "CVE-2024-39842": {
    "cvss": 7.2,
    "description": "A SQL injection vulnerability in Centreon 24.04.2 allows a remote high-privileged attacker to execute arbitrary SQL command via user massive changes inputs.",
    "published": "2024-09-23T19:15:13.437",
    "keywords": "remote,command"
  },
  "CVE-2024-39843": {
    "cvss": "-",
    "description": "A SQL injection vulnerability in Centreon 24.04.2 allows a remote high-privileged attacker to execute arbitrary SQL command via create user form inputs.",
    "published": "2024-09-23T19:15:13.510",
    "keywords": "remote,command"
  }
}