{
  "CVE-2024-24771": {
    "cvss": 7.7,
    "description": "Open Forms allows users create and publish smart forms. Versions prior to 2.2.9, 2.3.7, 2.4.5, and 2.5.2 contain a non-exploitable multi-factor authentication weakness. Superusers who have their credentials (username + password) compromised could potentially have the second-factor authentication bypassed if an attacker somehow managed to authenticate to Open Forms. The maintainers of Open Forms do not believe it is or has been possible to perform this login. However, if this were possible, the victim's account may be abused to view (potentially sensitive) submission data or have been used to impersonate other staff accounts to view and/or modify data. Three mitigating factors to help prevent exploitation include: the usual login page (at `/admin/login/`) does not fully log in the user until the second factor was succesfully provided; the additional non-MFA protected login page at `/api/v2/api-authlogin/` was misconfigured and could not be used to log in; and there are no additional ways to log in. This also requires credentials of a superuser to be compromised to be exploitable. Versions 2.2.9, 2.3.7, 2.4.5, and 2.5.2 contain the following patches to address these weaknesses: Move and only enable the API auth endpoints (`/api/v2/api-auth/login/`) with `settings.DEBUG = True`. `settings.DEBUG = True` is insecure and should never be applied in production settings. Additionally, apply a custom permission check to the hijack flow to only allow second-factor-verified superusers to perform user hijacking.",
    "published": "2024-02-07T15:15:08.283",
    "keywords": "authentication,sensitive,bypass"
  },
  "CVE-2024-20252": {
    "cvss": 9.6,
    "description": "Multiple vulnerabilities in Cisco Expressway Series and Cisco TelePresence Video Communication Server (VCS) could allow an unauthenticated, remote attacker to conduct cross-site request forgery (CSRF) attacks that perform arbitrary actions on an affected device. \r\n\r Note: \"Cisco Expressway Series\" refers to Cisco Expressway Control (Expressway-C) devices and Cisco Expressway Edge (Expressway-E) devices.\r\n\r For more information about these vulnerabilities, see the Details [\"#details\"] section of this advisory.",
    "published": "2024-02-07T17:15:09.913",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20254": {
    "cvss": 9.6,
    "description": "Multiple vulnerabilities in Cisco Expressway Series and Cisco TelePresence Video Communication Server (VCS) could allow an unauthenticated, remote attacker to conduct cross-site request forgery (CSRF) attacks that perform arbitrary actions on an affected device. \r\n\r Note: \"Cisco Expressway Series\" refers to Cisco Expressway Control (Expressway-C) devices and Cisco Expressway Edge (Expressway-E) devices.\r\n\r For more information about these vulnerabilities, see the Details [\"#details\"] section of this advisory.",
    "published": "2024-02-07T17:15:10.130",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20255": {
    "cvss": 8.2,
    "description": "A vulnerability in the SOAP API of Cisco Expressway Series and Cisco TelePresence Video Communication Server could allow an unauthenticated, remote attacker to conduct a cross-site request forgery (CSRF) attack on an affected system.\r\n\r This vulnerability is due to insufficient CSRF protections for the web-based management interface of an affected system. An attacker could exploit this vulnerability by persuading a user of the REST API to follow a crafted link. A successful exploit could allow the attacker to cause the affected system to reload.",
    "published": "2024-02-07T17:15:10.327",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20290": {
    "cvss": 7.5,
    "description": "A vulnerability in the OLE2 file format parser of ClamAV could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition on an affected device.\r\n\r This vulnerability is due to an incorrect check for end-of-string values during scanning, which may result in a heap buffer over-read. An attacker could exploit this vulnerability by submitting a crafted file containing OLE2 content to be scanned by ClamAV on an affected device. A successful exploit could allow the attacker to cause the ClamAV scanning process to terminate, resulting in a DoS condition on the affected software and consuming available system resources.\r\n\r For a description of this vulnerability, see the ClamAV blog .",
    "published": "2024-02-07T17:15:10.517",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-22394": {
    "cvss": "-",
    "description": "An improper authentication vulnerability has been identified in SonicWall SonicOS SSL-VPN feature, which in specific conditions could allow a remote attacker to bypass authentication. \n\nThis issue affects only firmware version SonicOS 7.1.1-7040.\n\n",
    "published": "2024-02-08T02:15:07.620",
    "keywords": "remote,authentication,vpn,bypass"
  },
  "CVE-2024-24003": {
    "url": "https://github.com/jishenghua/jsherp/issues/99",
    "cvss": 9.8,
    "description": "jshERP v3.3 is vulnerable to SQL Injection. The com.jsh.erp.controller.DepotHeadController: com.jsh.erp.utils.BaseResponseInfo findInOutMaterialCount() function of jshERP does not filter `column` and `order` parameters well enough, and an attacker can construct malicious payload to bypass jshERP's protection mechanism in `safeSqlParse` method for sql injection.",
    "published": "2024-02-08T02:15:07.763"
  },
  "CVE-2024-25148": {
    "cvss": 5.4,
    "description": "In Liferay Portal 7.2.0 through 7.4.1, and older unsupported versions, and Liferay DXP 7.3 before service pack 3, 7.2 before fix pack 15, and older unsupported versions the `doAsUserId` URL parameter may get leaked when creating linked content using the WYSIWYG editor and while impersonating a user. This may allow remote authenticated users to impersonate a user after accessing the linked content.",
    "published": "2024-02-08T04:15:08.240",
    "keywords": "remote,leak"
  },
  "CVE-2024-24216": {
    "cvss": "-",
    "description": "Zentao v18.0 to v18.10 was discovered to contain a remote code execution (RCE) vulnerability via the checkConnection method of /app/zentao/module/repo/model.php.",
    "published": "2024-02-08T06:15:51.750",
    "keywords": "remote,execution"
  },
  "CVE-2024-0965": {
    "cvss": 5.3,
    "description": "The Simple Page Access Restriction plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 1.0.21 via the REST API. This makes it possible for unauthenticated attackers to bypass the plugin's page restriction and view page content.",
    "published": "2024-02-08T09:15:46.047",
    "keywords": "unauthenticated,sensitive,bypass"
  },
  "CVE-2024-1207": {
    "cvss": 9.8,
    "description": "The WP Booking Calendar plugin for WordPress is vulnerable to SQL Injection via the 'calendar_request_params[dates_ddmmyy_csv]' parameter in all versions up to, and including, 9.9 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-02-08T09:15:46.253",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-22464": {
    "cvss": 6.2,
    "description": "\nDell EMC AppSync, versions from 4.2.0.0 to 4.6.0.0 including all Service Pack releases, contain an exposure of sensitive information vulnerability in AppSync server logs. A high privileged remote attacker could potentially exploit this vulnerability, leading to the disclosure of certain user credentials. The attacker may be able to use the exposed credentials to access the vulnerable system with privileges of the compromised account.\n\n",
    "published": "2024-02-08T10:15:14.183",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-24113": {
    "url": "https://github.com/xuxueli/xxl-job/issues/3375",
    "cvss": "-",
    "description": "xxl-job =< 2.4.1 has a Server-Side Request Forgery (SSRF) vulnerability, which causes low-privileged users to control executor to RCE.",
    "published": "2024-02-08T13:15:09.807"
  },
  "CVE-2024-25189": {
    "cvss": "-",
    "description": "libjwt 1.15.3 uses strcmp (which is not constant time) to verify authentication, which makes it easier to bypass authentication via a timing side channel.",
    "published": "2024-02-08T17:15:10.960",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-25190": {
    "cvss": "-",
    "description": "l8w8jwt 2.2.1 uses memcmp (which is not constant time) to verify authentication, which makes it easier to bypass authentication via a timing side channel.",
    "published": "2024-02-08T17:15:11.013",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-25191": {
    "cvss": "-",
    "description": "php-jwt 1.0.0 uses strcmp (which is not constant time) to verify authentication, which makes it easier to bypass authentication via a timing side channel.",
    "published": "2024-02-08T17:15:11.067",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-24497": {
    "cvss": "-",
    "description": "SQL Injection vulnerability in Employee Management System v.1.0 allows a remote attacker to execute arbitrary SQL commands via the txtusername and txtpassword parameters in the login.php components.",
    "published": "2024-02-08T21:15:08.590",
    "keywords": "remote,command"
  },
  "CVE-2024-24499": {
    "cvss": "-",
    "description": "SQL Injection vulnerability in Employee Management System v.1.0 allows a remote attacker to execute arbitrary SQL commands via the txtfullname and txtphone parameters in the edit_profile.php component.",
    "published": "2024-02-08T21:15:08.693",
    "keywords": "remote,command"
  },
  "CVE-2024-24393": {
    "url": "https://github.com/zyx0814/pichome/issues/24",
    "cvss": "-",
    "description": "File Upload vulnerability index.php in Pichome v.1.1.01 allows a remote attacker to execute arbitrary code via crafted POST request.",
    "published": "2024-02-08T22:15:09.130"
  },
  "CVE-2024-24821": {
    "cvss": 8.8,
    "description": "Composer is a dependency Manager for the PHP language. In affected versions several files within the local working directory are included during the invocation of Composer and in the context of the executing user. As such, under certain conditions arbitrary code execution may lead to local privilege escalation, provide lateral user movement or malicious code execution when Composer is invoked within a directory with tampered files. All Composer CLI commands are affected, including composer.phar's self-update. The following scenarios are of high risk: Composer being run with sudo, Pipelines which may execute Composer on untrusted projects, Shared environments with developers who run Composer individually on the same project. This vulnerability has been addressed in versions 2.7.0 and 2.2.23. It is advised that the patched versions are applied at the earliest convenience. Where not possible, the following should be addressed: Remove all sudo composer privileges for all users to mitigate root privilege escalation, and avoid running Composer within an untrusted directory, or if needed, verify that the contents of `vendor/composer/InstalledVersions.php` and `vendor/composer/installed.php` do not include untrusted code.  A reset can also be done on these files by the following:```sh\nrm vendor/composer/installed.php vendor/composer/InstalledVersions.php\ncomposer install --no-scripts --no-plugins\n```",
    "published": "2024-02-09T00:15:08.680",
    "keywords": "execution,command"
  },
  "CVE-2024-0229": {
    "cvss": 7.8,
    "description": "An out-of-bounds memory access flaw was found in the X.Org server. This issue can be triggered when a device frozen by a sync grab is reattached to a different master device. This issue may lead to an application crash, local privilege escalation (if the server runs with extended privileges), or remote code execution in SSH X11 forwarding environments.",
    "published": "2024-02-09T07:16:00.107",
    "keywords": "remote,execution"
  },
  "CVE-2024-23749": {
    "cvss": "-",
    "description": "KiTTY versions 0.76.1.13 and before is vulnerable to command injection via the filename variable, occurs due to insufficient input sanitization and validation, failure to escape special characters, and insecure system calls (at lines 2369-2390). This allows an attacker to add inputs inside the filename variable, leading to arbitrary code execution.",
    "published": "2024-02-09T08:15:08.530",
    "keywords": "execution,command"
  },
  "CVE-2024-24308": {
    "cvss": "-",
    "description": "SQL Injection vulnerability in Boostmyshop (boostmyshopagent) module for Prestashop versions 1.1.9 and before, allows remote attackers to escalate privileges and obtain sensitive information via changeOrderCarrier.php, relayPoint.php, and shippingConfirmation.php.",
    "published": "2024-02-09T08:15:08.707",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-25679": {
    "url": "https://github.com/p-quic/pquic/pull/39",
    "cvss": "-",
    "description": "In PQUIC before 5bde5bb, retention of unused initial encryption keys allows attackers to disrupt a connection with a PSK configuration by sending a CONNECTION_CLOSE frame that is encrypted via the initial key computed. Network traffic sniffing is needed as part of exploitation.",
    "published": "2024-02-09T10:15:08.740"
  },
  "CVE-2024-25305": {
    "cvss": "-",
    "description": "Code-projects Simple School Managment System 1.0 allows Authentication Bypass via the username and password parameters at School/index.php.",
    "published": "2024-02-09T13:15:41.987",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-25313": {
    "cvss": "-",
    "description": "Code-projects Simple School Managment System 1.0 allows Authentication Bypass via the username and password parameters at School/teacher_login.php.",
    "published": "2024-02-09T13:15:42.227",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-25447": {
    "url": "https://github.com/derf/feh/issues/709",
    "cvss": "-",
    "description": "An issue in the imlib_load_image_with_error_return function of imlib2 v1.9.1 allows attackers to cause a heap buffer overflow via parsing a crafted image.",
    "published": "2024-02-09T15:15:08.967"
  },
  "CVE-2024-25448": {
    "url": "https://github.com/derf/feh/issues/711",
    "cvss": "-",
    "description": "An issue in the imlib_free_image_and_decache function of imlib2 v1.9.1 allows attackers to cause a heap buffer overflow via parsing a crafted image.",
    "published": "2024-02-09T15:15:09.027"
  },
  "CVE-2024-25450": {
    "url": "https://github.com/derf/feh/issues/712",
    "cvss": "-",
    "description": "imlib2 v1.9.1 was discovered to mishandle memory allocation in the function init_imlib_fonts().",
    "published": "2024-02-09T15:15:09.087"
  },
  "CVE-2024-25451": {
    "url": "https://github.com/axiomatic-systems/bento4/issues/872",
    "cvss": "-",
    "description": "Bento4 v1.6.0-640 was discovered to contain an out-of-memory bug via the AP4_DataBuffer::ReallocateBuffer() function.",
    "published": "2024-02-09T15:15:09.143"
  },
  "CVE-2024-25452": {
    "url": "https://github.com/axiomatic-systems/bento4/issues/873",
    "cvss": "-",
    "description": "Bento4 v1.6.0-640 was discovered to contain an out-of-memory bug via the AP4_UrlAtom::AP4_UrlAtom() function.",
    "published": "2024-02-09T15:15:09.193"
  },
  "CVE-2024-25453": {
    "url": "https://github.com/axiomatic-systems/bento4/issues/874",
    "cvss": "-",
    "description": "Bento4 v1.6.0-640 was discovered to contain a NULL pointer dereference via the AP4_StszAtom::GetSampleSize() function.",
    "published": "2024-02-09T15:15:09.240"
  },
  "CVE-2024-25454": {
    "url": "https://github.com/axiomatic-systems/bento4/issues/875",
    "cvss": "-",
    "description": "Bento4 v1.6.0-640 was discovered to contain a NULL pointer dereference via the AP4_DescriptorFinder::Test() function.",
    "published": "2024-02-09T15:15:09.293"
  },
  "CVE-2024-23324": {
    "cvss": 8.6,
    "description": "Envoy is a high-performance edge/middle/service proxy. External authentication can be bypassed by downstream connections. Downstream clients can force invalid gRPC requests to be sent to ext_authz, circumventing ext_authz checks when failure_mode_allow is set to true. This issue has been addressed in released 1.29.1, 1.28.1, 1.27.3, and 1.26.7. Users are advised to upgrade. There are no known workarounds for this vulnerability.\n",
    "published": "2024-02-09T23:15:09.223",
    "keywords": "authentication,bypass"
  }
}