{
  "CVE-2024-12896": {
    "cvss": 5.3,
    "description": "A vulnerability was found in Intelbras VIP S3020 G2, VIP S4020 G2, VIP S4020 G3 and VIP S4320 G2 up to 20241222 and classified as problematic. Affected by this issue is some unknown functionality of the file /web_caps/webCapsConfig of the component Web Interface. The manipulation leads to information disclosure. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The vendor assesses that \"the information disclosed in the URL is not sensitive or poses any risk to the user\".",
    "published": "2024-12-22T23:15:05.677",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-46873": {
    "cvss": 9.8,
    "description": "Multiple SHARP routers leave the hidden debug function enabled. An arbitrary OS command may be executed with the root privilege by a remote unauthenticated attacker.",
    "published": "2024-12-23T01:15:07.403",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-47864": {
    "cvss": 5.3,
    "description": "home 5G HR02, Wi-Fi STATION SH-52B, and Wi-Fi STATION SH-54C contain a buffer overflow vulnerability in the hidden debug function. A remote unauthenticated attacker may get the web console of the product down.",
    "published": "2024-12-23T01:15:07.553",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-52321": {
    "cvss": 5.9,
    "description": "Multiple SHARP routers contain an improper authentication vulnerability in the configuration backup function. The product's backup files containing sensitive information may be retrieved by a remote unauthenticated attacker.",
    "published": "2024-12-23T01:15:07.700",
    "keywords": "remote,unauthenticated,authentication,sensitive"
  },
  "CVE-2024-41882": {
    "cvss": "-",
    "description": "Team ENVY, a Security Research TEAM has found a flaw that allows for a remote code execution on the NVR. An attacker can cause a stack overflow by entering large data into URL parameters, which will result in a system reboot. The manufacturer has released patch firmware for the flaw, please refer to the manufacturer's report for details and workarounds.",
    "published": "2024-12-24T06:15:33.810",
    "keywords": "remote,execution"
  },
  "CVE-2024-41883": {
    "cvss": "-",
    "description": "Team ENVY, a Security Research TEAM has found a flaw that allows for a remote code execution on the \n\nNVR\n\n. An attacker enters a special value for a specific URL parameter, resulting in a NULL pointer reference and a reboot of the NVR. The manufacturer has released patch firmware for the flaw, please refer to the manufacturer's report for details and workarounds.",
    "published": "2024-12-24T06:15:33.943",
    "keywords": "remote,execution"
  },
  "CVE-2024-41884": {
    "cvss": "-",
    "description": "Team ENVY, a Security Research TEAM has found a flaw that allows for a remote code execution on the NVR. If an attacker does not enter any value for a specific URL parameter, NULL pointer references will occur and the NVR will reboot. The manufacturer has released patch firmware for the flaw, please refer to the manufacturer's report for details and workarounds.",
    "published": "2024-12-24T06:15:34.060",
    "keywords": "remote,execution"
  },
  "CVE-2024-41885": {
    "cvss": "-",
    "description": "Team ENVY, a Security Research TEAM has found a flaw that allows for a remote code execution on the NVR. The seed string for the encrypt key was hardcoding. The manufacturer has released patch firmware for the flaw, please refer to the manufacturer's report for details and workarounds.",
    "published": "2024-12-24T06:15:34.190",
    "keywords": "remote,execution"
  },
  "CVE-2024-41886": {
    "cvss": "-",
    "description": "Team ENVY, a Security Research TEAM has found a flaw that allows for a remote code execution on the NVR. An attacker could inject malformed data into url input parameters to reboot the NVR. The manufacturer has released patch firmware for the flaw, please refer to the manufacturer's report for details and workarounds.",
    "published": "2024-12-24T06:15:34.360",
    "keywords": "remote,execution"
  },
  "CVE-2024-41887": {
    "cvss": "-",
    "description": "Team ENVY, a Security Research TEAM has found a flaw that allows for a remote code execution on the NVR. An attacker can create an NVR log file in a directory one level higher on the system, which can be used to corrupt files in the directory. The manufacturer has released patch firmware for the flaw, please refer to the manufacturer's report for details and workarounds.",
    "published": "2024-12-24T06:15:34.473",
    "keywords": "remote,execution"
  },
  "CVE-2024-43441": {
    "cvss": "-",
    "description": "Authentication Bypass by Assumed-Immutable Data vulnerability in Apache HugeGraph-Server.\n\nThis issue affects Apache HugeGraph-Server: from 1.0.0 before 1.5.0.\n\nUsers are recommended to upgrade to version 1.5.0, which fixes the issue.",
    "published": "2024-12-24T12:15:21.697",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-12272": {
    "cvss": 8.8,
    "description": "The WP Travel Engine – Elementor Widgets | Create Travel Booking Website Using WordPress and Elementor plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 1.3.7 via several widgets. This makes it possible for authenticated attackers, with Contributor-level access and above, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-12-25T04:15:06.457",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-12428": {
    "cvss": 7.5,
    "description": "The WP Data Access – App, Table, Form and Chart Builder plugin plugin for WordPress is vulnerable to SQL Injection via the 'order[user_login][dir]' parameter in all versions up to, and including, 5.5.22 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-12-25T05:15:06.920",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-10862": {
    "cvss": 4.9,
    "description": "The NEX-Forms – Ultimate Form Builder – Contact forms and much more plugin for WordPress is vulnerable to SQL Injection via the 'search_params' parameter in all versions up to, and including, 8.7.13 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database. This can be exploited via CSRF due to a lack of nonce validation on the get_table_records AJAX action.",
    "published": "2024-12-25T07:15:11.190",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-52046": {
    "cvss": "-",
    "description": "The ObjectSerializationDecoder in Apache MINA uses Java’s native deserialization protocol to process\nincoming serialized data but lacks the necessary security checks and defenses. This vulnerability allows\nattackers to exploit the deserialization process by sending specially crafted malicious serialized data,\npotentially leading to remote code execution (RCE) attacks.\n\n\n\n\t\t\t\t\t\n\n\n\t\t\t\t\n\n\n\t\t\t\n\n\n\t\t\n\n\n\t\nThis issue affects MINA core versions 2.0.X, 2.1.X and 2.2.X, and will be fixed by the releases 2.0.27, 2.1.10 and 2.2.4.\n\n\n\n\n\nIt's also important to note that an application using MINA core library will only be affected if the IoBuffer#getObject() method is called, and this specific method is potentially called when adding a ProtocolCodecFilter instance using the ObjectSerializationCodecFactory class in the filter chain. If your application is specifically using those classes, you have to upgrade to the latest version of MINA core library.\n\n\n\n\nUpgrading will  not be enough: you also need to explicitly allow the classes the decoder will accept in the ObjectSerializationDecoder instance, using one of the three new methods:\n\n\n\n\n    /**\n\n     * Accept class names where the supplied ClassNameMatcher matches for\n\n     * deserialization, unless they are otherwise rejected.\n\n     *\n\n     * @param classNameMatcher the matcher to use\n\n     */\n\n    public void accept(ClassNameMatcher classNameMatcher)\n\n\n\n\n    /**\n\n     * Accept class names that match the supplied pattern for\n\n     * deserialization, unless they are otherwise rejected.\n\n     *\n\n     * @param pattern standard Java regexp\n\n     */\n\n    public void accept(Pattern pattern) \n\n\n\n\n\n    /**\n\n     * Accept the wildcard specified classes for deserialization,\n\n     * unless they are otherwise rejected.\n\n     *\n\n     * @param patterns Wildcard file name patterns as defined by\n\n     *                  {@link org.apache.commons.io.FilenameUtils#wildcardMatch(String, String) FilenameUtils.wildcardMatch}\n\n     */\n\n    public void accept(String... patterns)\n\n\n\n\n\n\n\nBy default, the decoder will reject *all* classes that will be present in the incoming data.\n\n\n\n\n\n\n\nNote: The FtpServer, SSHd and Vysper sub-project are not affected by this issue.",
    "published": "2024-12-25T10:15:05.437",
    "keywords": "remote,execution"
  },
  "CVE-2024-39725": {
    "cvss": 5.3,
    "description": "IBM Engineering Lifecycle Optimization - Engineering Insights 7.0.2 and 7.0.3 could allow a remote attacker to obtain sensitive information when a detailed technical error message is returned in the browser. This information could be used in further attacks against the system.",
    "published": "2024-12-25T14:15:21.660",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-39727": {
    "cvss": 6.1,
    "description": "IBM Engineering Lifecycle Optimization - Engineering Insights 7.0.2 and 7.0.3 uses a web link with untrusted references to an external site. A remote attacker could exploit this vulnerability to expose sensitive information or perform unauthorized actions on the victims’ web browser.",
    "published": "2024-12-25T14:15:22.610",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-53291": {
    "cvss": 7.5,
    "description": "Dell NativeEdge, version(s) 2.1.0.0, contain(s) an Exposure of Sensitive Information Through Metadata vulnerability. An unauthenticated attacker with remote access could potentially exploit this vulnerability, leading to Information disclosure.",
    "published": "2024-12-25T15:15:07.673",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-52534": {
    "cvss": 5.4,
    "description": "Dell ECS, version(s) prior to ECS 3.8.1.3, contain(s) an Authentication Bypass by Capture-replay vulnerability. A low privileged attacker with remote access could potentially exploit this vulnerability, leading to Session theft.",
    "published": "2024-12-25T16:15:21.997",
    "keywords": "remote,authentication,bypass"
  },
  "CVE-2024-56431": {
    "url": "https://github.com/xiph/theora/issues/17#issuecomment-2480630603",
    "cvss": "-",
    "description": "oc_huff_tree_unpack in huffdec.c in libtheora in Theora through 1.0 7180717 has an invalid negative left shift.",
    "published": "2024-12-25T17:15:05.510"
  }
}