{
  "CVE-2024-22851": {
    "cvss": "-",
    "description": "Directory Traversal Vulnerability in LiveConfig before v.2.5.2 allows a remote attacker to obtain sensitive information via a crafted request to the /static/ endpoint.",
    "published": "2024-02-02T09:15:37.473",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-24388": {
    "cvss": "-",
    "description": "Cross-site scripting (XSS) vulnerability in XunRuiCMS versions v4.6.2 and before, allows remote attackers to obtain sensitive information via crafted malicious requests to the background login.",
    "published": "2024-02-02T10:15:08.870",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-0844": {
    "cvss": 4.7,
    "description": "The Popup More Popups, Lightboxes, and more popup modules plugin for WordPress is vulnerable to Local File Inclusion in version 2.1.6 via the ycfChangeElementData() function. This makes it possible for authenticated attackers, with administrator-level access and above, to include and execute arbitrary files ending with \"Form.php\" on the server , allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-02-02T12:15:49.000",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-1064": {
    "cvss": 7.5,
    "description": "A host header injection vulnerability in the HTTP handler component of Crafty Controller allows a remote, unauthenticated attacker to trigger a Denial of Service (DoS) condition via a modified host header",
    "published": "2024-02-03T09:15:11.250",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20003": {
    "cvss": "-",
    "description": "In Modem NL1, there is a possible system crash due to an improper input validation. This could lead to remote denial of service, if NW sent invalid NR RRC Connection Setup message, with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: MOLY01191612; Issue ID: MOLY01191612 (MSV-981).",
    "published": "2024-02-05T06:15:47.130",
    "keywords": "remote,execution"
  },
  "CVE-2024-20004": {
    "cvss": "-",
    "description": "In Modem NL1, there is a possible system crash due to an improper input validation. This could lead to remote denial of service, if NW sent invalid NR RRC Connection Setup message, with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: MOLY01191612; Issue ID: MOLY01195812 (MSV-985).",
    "published": "2024-02-05T06:15:47.190",
    "keywords": "remote,execution"
  },
  "CVE-2024-20007": {
    "cvss": "-",
    "description": "In mp3 decoder, there is a possible out of bounds write due to a race condition. This could lead to remote escalation of privilege with no additional execution privileges needed. User interaction is needed for exploitation. Patch ID: ALPS08441369; Issue ID: ALPS08441369.",
    "published": "2024-02-05T06:15:47.283",
    "keywords": "remote,execution"
  },
  "CVE-2024-20009": {
    "cvss": "-",
    "description": "In alac decoder, there is a possible out of bounds write due to an incorrect error handling. This could lead to remote escalation of privilege with no additional execution privileges needed. User interaction is needed for exploitation. Patch ID: ALPS08441150; Issue ID: ALPS08441150.",
    "published": "2024-02-05T06:15:47.330",
    "keywords": "remote,execution"
  },
  "CVE-2024-20011": {
    "cvss": "-",
    "description": "In alac decoder, there is a possible information disclosure due to an incorrect bounds check. This could lead to remote code execution with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: ALPS08441146; Issue ID: ALPS08441146.",
    "published": "2024-02-05T06:15:47.447",
    "keywords": "remote,execution"
  },
  "CVE-2024-20015": {
    "cvss": "-",
    "description": "In telephony, there is a possible escalation of privilege due to a permissions bypass. This could lead to local escalation of privilege with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: ALPS08441419; Issue ID: ALPS08441419.",
    "published": "2024-02-05T06:15:47.580",
    "keywords": "execution,bypass"
  }
}