{
  "CVE-2025-6495": {
    "cvss": 7.5,
    "description": "The Bricks theme for WordPress is vulnerable to blind SQL Injection via the ‘p’ parameter in all versions up to, and including, 1.12.4 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2025-07-29T05:15:32.550",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-8264": {
    "cvss": 9.0,
    "description": "Versions of the package z-push/z-push-dev before 2.7.6 are vulnerable to SQL Injection due to unparameterized queries in the IMAP backend. An attacker can inject malicious commands by manipulating the username field in basic authentication. This allows the attacker to access and potentially modify or delete sensitive data from a linked third-party database. \r\r**Note:** This vulnerability affects Z-Push installations that utilize the IMAP backend and have the IMAP_FROM_SQL_QUERY option configured. \r\r Mitigation\rChange configuration to use the default or LDAP in backend/imap/config.php\r\rphp\rdefine('IMAP_DEFAULTFROM', '');\r\ror\rphp\rdefine('IMAP_DEFAULTFROM', 'ldap');",
    "published": "2025-07-29T05:15:32.760",
    "keywords": "authentication,command,sensitive"
  },
  "CVE-2025-54422": {
    "cvss": "-",
    "description": "Sandboxie is a sandbox-based isolation software for 32-bit and 64-bit Windows NT-based operating systems. In versions 1.16.1 and below, a critical security vulnerability exists in password handling mechanisms. During encrypted sandbox creation, user passwords are transmitted via shared memory, exposing them to potential interception. The vulnerability is particularly severe during password modification operations, where both old and new passwords are passed as plaintext command-line arguments to the Imbox process without any encryption or obfuscation. This implementation flaw allows any process within the user session, including unprivileged processes, to retrieve these sensitive credentials by reading the command-line arguments, thereby bypassing standard privilege requirements and creating a significant security risk. This is fixed in version 1.16.2.",
    "published": "2025-07-29T13:15:27.823",
    "keywords": "command,sensitive,bypass"
  },
  "CVE-2025-46059": {
    "url": "https://github.com/langchain-ai/langchain/issues/30833",
    "cvss": 9.8,
    "description": "langchain-ai v0.3.51 was discovered to contain an indirect prompt injection vulnerability in the GmailToolkit component. This vulnerability allows attackers to execute arbitrary code and compromise the application via a crafted email message.",
    "published": "2025-07-29T15:15:35.003"
  },
  "CVE-2025-50738": {
    "url": "https://github.com/usememos/memos/issues/4707#issuecomment-2898504237",
    "cvss": 9.8,
    "description": "The Memos application, up to version v0.24.3, allows for the embedding of markdown images with arbitrary URLs. When a user views a memo containing such an image, their browser automatically fetches the image URL without explicit user consent or interaction beyond viewing the memo. This can be exploited by an attacker to disclose the viewing user's IP address, browser User-Agent string, and potentially other request-specific information to the attacker-controlled server, leading to information disclosure and user tracking.",
    "published": "2025-07-29T15:15:35.543"
  },
  "CVE-2025-28171": {
    "cvss": 6.5,
    "description": "An issue in Grandstream UCM6510 v.1.0.20.52 and before allows a remote attacker to obtain sensitive information via the Login function at /cgi and /webrtccgi.",
    "published": "2025-07-29T16:15:24.287",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-44136": {
    "url": "https://github.com/maptiler/tileserver-php/issues/167",
    "cvss": 9.8,
    "description": "MapTiler Tileserver-php v2.0 is vulnerable to Cross Site Scripting (XSS). The GET parameter \"layer\" is reflected in an error message without html encoding. This leads to XSS and allows an unauthenticated attacker to execute arbitrary HTML or JavaScript code on a victim's browser.",
    "published": "2025-07-29T17:15:33.327"
  },
  "CVE-2025-44137": {
    "url": "https://github.com/maptiler/tileserver-php/issues/167",
    "cvss": 8.2,
    "description": "MapTiler Tileserver-php v2.0 is vulnerable to Directory Traversal. The renderTile function within tileserver.php is responsible for delivering tiles that are stored as files on the server via web request. Creating the path to a file allows the insertion of \"../\" and thus read any file on the web server. Affected GET parameters are \"TileMatrix\", \"TileRow\", \"TileCol\" and \"Format\"",
    "published": "2025-07-29T17:15:33.493"
  },
  "CVE-2025-52284": {
    "cvss": 6.5,
    "description": "Totolink X6000R V9.4.0cu.1360_B20241207 was found to contain a command injection vulnerability in the sub_4184C0 function via the tz parameter. This vulnerability allows unauthenticated attackers to execute arbitrary commands via a crafted request.",
    "published": "2025-07-29T18:15:30.433",
    "keywords": "unauthenticated,command"
  },
  "CVE-2025-53102": {
    "url": "https://github.com/discourse/discourse/commit/8bc0cee2c00a514ea60f33ea6172da2ce5a05beb",
    "cvss": "-",
    "description": "Discourse is an open-source community discussion platform. Prior to version 3.4.7 on the `stable` branch and version 3.5.0.beta.8 on the `tests-passed` branch, upon issuing a physical security key for 2FA, the server generates a WebAuthn challenge, which the client signs. The challenge is not cleared from the user’s session after authentication, potentially allowing reuse and increasing security risk. This is fixed in versions 3.4.7 and 3.5.0.beta.8.",
    "published": "2025-07-29T20:15:28.327"
  },
  "CVE-2025-40600": {
    "cvss": 9.8,
    "description": "Use of Externally-Controlled Format String vulnerability in the SonicOS SSL VPN interface allows a remote unauthenticated attacker to cause service disruption.",
    "published": "2025-07-29T22:15:24.927",
    "keywords": "remote,unauthenticated,vpn"
  },
  "CVE-2025-54126": {
    "cvss": "-",
    "description": "The WebAssembly Micro Runtime's (WAMR) iwasm package is the executable binary built with WAMR VMcore which supports WebAssembly System Interface (WASI) and command line interface. In versions 2.4.0 and below, iwasm uses --addr-pool with an IPv4 address that lacks a subnet mask, allowing the system to accept all IP addresses. This can unintentionally expose the service to all incoming connections and bypass intended access restrictions. Services relying on --addr-pool for restricting access by IP may unintentionally become open to all external connections. This may lead to unauthorized access in production deployments, especially when users assume that specifying an IP without a subnet mask implies a default secure configuration. This is fixed in version 2.4.1.",
    "published": "2025-07-29T22:15:25.503",
    "keywords": "command,bypass"
  },
  "CVE-2025-54381": {
    "cvss": 9.9,
    "description": "BentoML is a Python library for building online serving systems optimized for AI apps and model inference. In versions 1.4.0 until 1.4.19, the file upload processing system contains an SSRF vulnerability that allows unauthenticated remote attackers to force the server to make arbitrary HTTP requests. The vulnerability stems from the multipart form data and JSON request handlers, which automatically download files from user-provided URLs without validating whether those URLs point to internal network addresses, cloud metadata endpoints, or other restricted resources. The documentation explicitly promotes this URL-based file upload feature, making it an intended design that exposes all deployed services to SSRF attacks by default. Version 1.4.19 contains a patch for the issue.",
    "published": "2025-07-29T23:15:32.947",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-43184": {
    "cvss": 9.8,
    "description": "This issue was addressed by adding an additional prompt for user consent. This issue is fixed in macOS Sonoma 14.7.7, macOS Ventura 13.7.7, macOS Sequoia 15.4. A shortcut may be able to bypass sensitive Shortcuts app settings.",
    "published": "2025-07-30T00:15:31.383",
    "keywords": "sensitive,bypass"
  },
  "CVE-2025-8320": {
    "cvss": 8.8,
    "description": "Tesla Wall Connector Content-Length Header Improper Input Validation Remote Code Execution Vulnerability. This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of Tesla Wall Connector devices. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the parsing of the HTTP Content-Length header. The issue results from the lack of proper validation of user-supplied data, which can result in memory access past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the device. Was ZDI-CAN-26300.",
    "published": "2025-07-30T01:15:26.077",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2025-8323": {
    "cvss": 8.8,
    "description": "The e-School from Ventem has a Arbitrary File Upload vulnerability, allowing unauthenticated remote attackers to upload and execute web shell backdoors, thereby enabling arbitrary code execution on the server.",
    "published": "2025-07-30T04:16:14.363",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2025-54430": {
    "url": "https://github.com/dedupeio/dedupe/commit/3f61e79102910bd355e920a2df7e44c14c9cb247",
    "cvss": 9.1,
    "description": "dedupe is a python library that uses machine learning to perform fuzzy matching, deduplication and entity resolution quickly on structured data. Before commit 3f61e79, a critical severity vulnerability has been identified within the .github/workflows/benchmark-bot.yml workflow, where a issue_comment can be triggered using the @benchmark body. This workflow is susceptible to exploitation as it checkout the ${{ github.event.issue.number }}, which correspond to the branch of the PR manipulated by potentially malicious actors, and where untrusted code may be executed. Running untrusted code may lead to the exfiltration of GITHUB_TOKEN, which in this workflow has write permissions on most of the scopes - in particular the contents one - and could lead to potential repository takeover. This is fixed by commit 3f61e79.",
    "published": "2025-07-30T14:15:29.257"
  },
  "CVE-2025-54572": {
    "url": "https://github.com/saml-toolkits/ruby-saml/pull/770",
    "cvss": "-",
    "description": "The Ruby SAML library is for implementing the client side of a SAML authorization. In versions 1.18.0 and below, a denial-of-service vulnerability exists in ruby-saml even with the message_max_bytesize setting configured. The vulnerability occurs because the SAML response is validated for Base64 format prior to checking the message size, leading to potential resource exhaustion. This is fixed in version 1.18.1.",
    "published": "2025-07-30T14:15:29.433"
  },
  "CVE-2025-46811": {
    "cvss": 9.8,
    "description": "A Missing Authentication for Critical Function vulnerability in SUSE Manager allows anyone with access to the websocket at /rhn/websocket/minion/remote-commands to execute arbitrary commands as root.\n\n\n\n\nThis issue affects Container suse/manager/5.0/x86_64/server:5.0.5.7.30.1: from ? before 0.3.7-150600.3.6.2; Container suse/manager/5.0/x86_64/server:5.0.5.7.30.1: from ? before 5.0.14-150600.4.17.1; Container suse/manager/5.0/x86_64/server:5.0.5.7.30.1: from ? before 5.0.14-150600.4.17.1; Image SLES15-SP4-Manager-Server-4-3-BYOS: from ? before 4.3.33-150400.3.55.2; Image SLES15-SP4-Manager-Server-4-3-BYOS: from ? before 4.3.33-150400.3.55.2; Image SLES15-SP4-Manager-Server-4-3-BYOS-Azure: from ? before 4.3.33-150400.3.55.2; Image SLES15-SP4-Manager-Server-4-3-BYOS-Azure: from ? before 4.3.33-150400.3.55.2; Image SLES15-SP4-Manager-Server-4-3-BYOS-EC2: from ? before 4.3.33-150400.3.55.2; Image SLES15-SP4-Manager-Server-4-3-BYOS-EC2: from ? before 4.3.33-150400.3.55.2; Image SLES15-SP4-Manager-Server-4-3-BYOS-GCE: from ? before 4.3.33-150400.3.55.2; Image SLES15-SP4-Manager-Server-4-3-BYOS-GCE: from ? before 4.3.33-150400.3.55.2; SUSE Manager Server Module 4.3: from ? before 0.3.7-150400.3.39.4; SUSE Manager Server Module 4.3: from ? before 4.3.33-150400.3.55.2; SUSE Manager Server Module 4.3: from ? before 4.3.33-150400.3.55.2.",
    "published": "2025-07-30T15:15:33.737",
    "keywords": "remote,authentication,command"
  },
  "CVE-2025-53944": {
    "cvss": 7.7,
    "description": "AutoGPT is a platform that allows users to create, deploy, and manage continuous artificial intelligence agents. In v0.6.15 and below, the external API's get_graph_execution_results endpoint has an authorization bypass vulnerability. While it correctly validates user access to the graph_id, it fails to verify ownership of the graph_exec_id parameter, allowing authenticated users to access any execution results by providing arbitrary execution IDs. The internal API implements proper validation for both parameters. This is fixed in v0.6.16.",
    "published": "2025-07-30T15:15:35.210",
    "keywords": "execution,bypass"
  },
  "CVE-2025-50578": {
    "cvss": 9.8,
    "description": "LinuxServer.io heimdall 2.6.3-ls307 contains a vulnerability in how it handles user-supplied HTTP headers, specifically `X-Forwarded-Host` and `Referer`. An unauthenticated remote attacker can manipulate these headers to perform Host Header Injection and Open Redirect attacks. This allows the loading of external resources from attacker-controlled domains and unintended redirection of users, potentially enabling phishing, UI redress, and session theft. The vulnerability exists due to insufficient validation and trust of untrusted input, affecting the integrity and trustworthiness of the application.",
    "published": "2025-07-30T16:15:28.177",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-45620": {
    "cvss": 8.1,
    "description": "An issue in Aver PTC310UV2 v.0.1.0000.59 allows a remote attacker to obtain sensitive information via a crafted request",
    "published": "2025-07-30T17:15:27.727",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-54576": {
    "cvss": 9.1,
    "description": "OAuth2-Proxy is an open-source tool that can act as either a standalone reverse proxy or a middleware component integrated into existing reverse proxy or load balancer setups. In versions 7.10.0 and below, oauth2-proxy deployments are vulnerable when using the skip_auth_routes configuration option with regex patterns. Attackers can bypass authentication by crafting URLs with query parameters that satisfy configured regex patterns, allowing unauthorized access to protected resources. The issue stems from skip_auth_routes matching against the full request URI. Deployments using skip_auth_routes with regex patterns containing wildcards or broad matching patterns are most at risk. This issue is fixed in version 7.11.0. Workarounds include: auditing all skip_auth_routes configurations for overly permissive patterns, replacing wildcard patterns with exact path matches where possible, ensuring regex patterns are properly anchored (starting with ^ and ending with $), or implementing custom validation that strips query parameters before regex matching.",
    "published": "2025-07-30T20:15:37.677",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-54583": {
    "cvss": "-",
    "description": "GitProxy is an application that stands between developers and a Git remote endpoint (e.g., github.com). Versions 1.19.1 and below allow users to push to remote repositories while bypassing policies and explicit approvals. Since checks and plugins are skipped, code containing secrets or unwanted changes could be pushed into a repository. This is fixed in version 1.19.2.",
    "published": "2025-07-30T20:15:38.177",
    "keywords": "remote,bypass"
  },
  "CVE-2025-54584": {
    "cvss": "-",
    "description": "GitProxy is an application that stands between developers and a Git remote endpoint (e.g., github.com). In versions 1.19.1 and below, an attacker can craft a malicious Git packfile to exploit the PACK signature detection in the parsePush.ts file. By embedding a misleading PACK signature within commit content and carefully constructing the packet structure, the attacker can trick the parser into treating invalid or unintended data as the packfile. Potentially, this would allow bypassing approval or hiding commits. This issue is fixed in version 1.19.2.",
    "published": "2025-07-30T20:15:38.357",
    "keywords": "remote,bypass"
  },
  "CVE-2025-54585": {
    "cvss": "-",
    "description": "GitProxy is an application that stands between developers and a Git remote endpoint. In versions 1.19.1 and below, attackers can exploit the way GitProxy handles new branch creation to bypass the approval of prior commits on the parent branch. The vulnerability impacts all users or organizations relying on GitProxy to enforce policy and prevent unapproved changes. It requires no elevated privileges beyond regular push access, and no extra user interaction. It does however, require a GitProxy administrator or designated user (canUserApproveRejectPush) to approve pushes to the child branch. This is fixed in version 1.19.2.",
    "published": "2025-07-30T21:15:26.310",
    "keywords": "remote,bypass"
  },
  "CVE-2025-54586": {
    "cvss": 7.1,
    "description": "GitProxy is an application that stands between developers and a Git remote endpoint. In versions 1.19.1 and below,   attackers can inject extra commits into the pack sent to GitHub, commits that aren’t pointed to by any branch. Although these “hidden” commits never show up in the repository’s visible history, GitHub still serves them at their direct commit URLs. This lets an attacker exfiltrate sensitive data without ever leaving a trace in the branch view. We rate this a High‑impact vulnerability because it completely compromises repository confidentiality. This is fixed in version 1.19.2.",
    "published": "2025-07-30T22:15:25.120",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-8343": {
    "url": "https://github.com/openviglet/shio/issues/1028",
    "cvss": 4.3,
    "description": "A vulnerability was found in openviglet shio up to 0.3.8. It has been rated as critical. This issue affects the function shStaticFilePreUpload of the file shio-app/src/main/java/com/viglet/shio/api/staticfile/ShStaticFileAPI.java. The manipulation of the argument fileName leads to path traversal. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2025-07-31T01:15:25.860"
  },
  "CVE-2025-8344": {
    "url": "https://github.com/openviglet/shio/issues/1029",
    "cvss": 6.3,
    "description": "A vulnerability classified as critical has been found in openviglet shio up to 0.3.8. Affected is the function shStaticFileUpload of the file shio-app/src/main/java/com/viglet/shio/api/staticfile/ShStaticFileAPI.java. The manipulation of the argument filename leads to unrestricted upload. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2025-07-31T02:15:27.800"
  },
  "CVE-2025-8348": {
    "cvss": 7.3,
    "description": "A vulnerability has been found in Kehua Charging Pile Cloud Platform 1.0 and classified as critical. This vulnerability affects unknown code of the file /home. The manipulation leads to improper authentication. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2025-07-31T04:16:07.580",
    "keywords": "remote,authentication"
  },
  "CVE-2025-7847": {
    "cvss": 8.8,
    "description": "The AI Engine plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the rest_simpleFileUpload() function in versions 2.9.3 and 2.9.4. This makes it possible for authenticated attackers, with Subscriber-level access and above, to upload arbitrary files on the affected site's server when the REST API is enabled, which may make remote code execution possible.",
    "published": "2025-07-31T05:15:26.227",
    "keywords": "remote,execution"
  },
  "CVE-2025-2813": {
    "cvss": 7.5,
    "description": "An unauthenticated remote attacker can cause a Denial of Service by sending a large number of requests to the http service on port 80.",
    "published": "2025-07-31T10:15:25.913",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-41688": {
    "cvss": 7.2,
    "description": "A high privileged remote attacker can execute arbitrary OS commands using an undocumented method allowing to escape the implemented LUA sandbox.",
    "published": "2025-07-31T10:15:26.763",
    "keywords": "remote,command"
  },
  "CVE-2025-7738": {
    "cvss": 4.4,
    "description": "A flaw was found in Ansible Automation Platform (AAP) where the Gateway API returns the client secret for certain GitHub Enterprise authenticators in clear text. This vulnerability affects administrators or auditors accessing authenticator configurations. While access is limited to privileged users, the clear text exposure of sensitive credentials increases the risk of accidental leaks or misuse.",
    "published": "2025-07-31T14:15:35.177",
    "keywords": "sensitive,leak"
  },
  "CVE-2025-34146": {
    "url": "https://github.com/nyariv/sandboxjs/issues/31",
    "cvss": "-",
    "description": "A prototype pollution vulnerability exists in @nyariv/sandboxjs versions <= 0.8.23, allowing attackers to inject arbitrary properties into Object.prototype via crafted JavaScript code. This can result in a denial-of-service (DoS) condition or, under certain conditions, escape the sandboxed environment intended to restrict code execution. The vulnerability stems from insufficient prototype access checks in the sandbox’s executor logic, particularly in the handling of JavaScript function objects returned.",
    "published": "2025-07-31T15:15:36.260"
  },
  "CVE-2025-50270": {
    "url": "https://github.com/fesiong/anqicms/issues/80",
    "cvss": 6.1,
    "description": "A stored Cross Site Scripting (xss) vulnerability in the \"content management\" feature in AnQiCMS v.3.4.11 allows a remote attacker to execute arbitrary code via a crafted script to the title, categoryTitle, and tmpTag parameters.",
    "published": "2025-07-31T15:15:36.687"
  },
  "CVE-2025-50475": {
    "cvss": 9.8,
    "description": "An OS command injection vulnerability exists in Russound MBX-PRE-D67F firmware version 3.1.6, allowing unauthenticated attackers to execute arbitrary commands as root via crafted input to the hostname parameter in network configuration requests. This vulnerability stems from improper neutralization of special elements used in an OS command within the network configuration handler, enabling remote code execution with the highest privileges.",
    "published": "2025-07-31T15:15:36.830",
    "keywords": "remote,execution,unauthenticated,command"
  },
  "CVE-2025-52289": {
    "url": "https://github.com/magnussolution/magnusbilling7/commit/f886330e9e9216a3830775610a4a83f970c08e8d",
    "cvss": 8.0,
    "description": "A Broken Access Control vulnerability in MagnusBilling v7.8.5.3 allows newly registered users to gain escalated privileges by sending a crafted request to /mbilling/index.php/user/save to set their account status fom \"pending\" to \"active\" without requiring administrator approval.",
    "published": "2025-07-31T15:15:37.263"
  },
  "CVE-2025-54833": {
    "cvss": 5.3,
    "description": "OPEXUS FOIAXpress Public Access Link (PAL) version v11.1.0 allows attackers to bypass account-lockout and CAPTCHA protections. Unauthenticated remote attackers can more easily brute force passwords.",
    "published": "2025-07-31T18:15:43.067",
    "keywords": "remote,unauthenticated,bypass"
  },
  "CVE-2025-54834": {
    "cvss": 5.3,
    "description": "OPEXUS FOIAXpress Public Access Link (PAL) version v11.1.0 allows an unauthenticated, remote attacker to query the /App/CreateRequest.aspx endpoint to check for the existence of valid usernames. There are no rate-limiting mechanisms in place.",
    "published": "2025-07-31T18:15:43.250",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-8426": {
    "cvss": 9.4,
    "description": "Marvell QConvergeConsole compressConfigFiles Directory Traversal Information Disclosure and Denial-of-Service Vulnerability. This vulnerability allows remote attackers to disclose sensitive information or to create a denial-of-service condition on affected installations of Marvell QConvergeConsole. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the implementation of the compressConfigFiles method. The issue results from the lack of proper validation of a user-supplied path prior to using it in file operations. An attacker can leverage this vulnerability to disclose sensitive information or to create a denial-of-service condition on the system. Was ZDI-CAN-24915.",
    "published": "2025-07-31T18:15:44.030",
    "keywords": "remote,authentication,sensitive"
  },
  "CVE-2025-26062": {
    "cvss": 9.8,
    "description": "An access control issue in Intelbras RX1500 v2.2.9 and RX3000 v1.0.11 allows unauthenticated attackers to access the router's settings file and obtain potentially sensitive information from the current settings.",
    "published": "2025-07-31T19:15:28.610",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-37111": {
    "cvss": 6.0,
    "description": "A vulnerability was discovered in the storage policy for certain sets of authentication keys in the HPE Telco Network Function Virtual Orchestrator. Successful Exploitation could lead to unauthorized parties gaining access to sensitive system information.",
    "published": "2025-07-31T20:15:32.823",
    "keywords": "authentication,sensitive"
  },
  "CVE-2025-8286": {
    "cvss": 9.8,
    "description": "Güralp FMUS series seismic monitoring devices expose an unauthenticated Telnet-based command line interface that \ncould allow an attacker to modify hardware configurations, manipulate \ndata, or factory reset the device.",
    "published": "2025-07-31T20:15:46.350",
    "keywords": "unauthenticated,command"
  },
  "CVE-2025-5947": {
    "cvss": 9.8,
    "description": "The Service Finder Bookings plugin for WordPress is vulnerable to privilege escalation via authentication bypass in all versions up to, and including, 6.0. This is due to the plugin not properly validating a user's cookie value prior to logging them in through the service_finder_switch_back() function. This makes it possible for unauthenticated attackers to login as any user including admins.",
    "published": "2025-08-01T04:16:21.693",
    "keywords": "unauthenticated,authentication,bypass"
  }
}