{
  "CVE-2025-25055": {
    "cvss": 5.3,
    "description": "Authentication bypass by spoofing issue exists in FileMegane versions above 1.0.0.0 prior to 3.4.0.0, which may lead to user impersonation. If exploited, restricted file contents may be accessed.",
    "published": "2025-02-18T00:15:21.277",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-0422": {
    "cvss": "-",
    "description": "An authenticated user in the \"bestinformed Web\" application can execute commands on the underlying server running the application. (Remote Code Execution) For this, the user must be able to create \"ScriptVars\" with the type „script\" and preview them by, for example, creating a new \"Info\". By default, admin users have those permissions, but with the granular permission system, those permissions may be assigned to other users. An attacker is able to execute commands on the server running the \"bestinformed Web\" application if an account with the correct permissions was compromised before.",
    "published": "2025-02-18T08:15:10.147",
    "keywords": "remote,execution,command"
  },
  "CVE-2025-0981": {
    "url": "https://github.com/churchcrm/crm/issues/7245",
    "cvss": "-",
    "description": "A vulnerability exists in ChurchCRM 5.13.0 and prior that allows an attacker to hijack a user's session by exploiting a Stored Cross Site Scripting (XSS) vulnerability in the Group Editor page. This allows admin users to inject malicious JavaScript in the description field, which captures the session cookie of authenticated users. The cookie can then be sent to an external server, enabling session hijacking. It can also lead to information disclosure, as exposed session cookies can be used to impersonate users and gain unauthorised access to sensitive information.",
    "published": "2025-02-18T10:15:10.333"
  },
  "CVE-2025-1023": {
    "url": "https://github.com/churchcrm/crm/issues/7246",
    "cvss": "-",
    "description": "A vulnerability exists in ChurchCRM 5.13.0 and prior that allows an attacker to execute arbitrary SQL queries by exploiting a time-based blind SQL Injection vulnerability in the EditEventTypes functionality. The newCountName parameter is directly concatenated into an SQL query without proper sanitization, allowing an attacker to manipulate database queries and execute arbitrary commands, potentially leading to data exfiltration, modification, or deletion.",
    "published": "2025-02-18T10:15:10.500"
  },
  "CVE-2025-26058": {
    "cvss": 4.2,
    "description": "Webkul QloApps v1.6.1 exposes authentication tokens in URLs during redirection. When users access the admin panel or other protected areas, the application appends sensitive authentication tokens directly to the URL.",
    "published": "2025-02-18T18:15:35.653",
    "keywords": "authentication,sensitive"
  },
  "CVE-2025-24894": {
    "cvss": 9.1,
    "description": "SPID.AspNetCore.Authentication is an AspNetCore Remote Authenticator for SPID. Authentication using Spid and CIE is based on the SAML2 standard which provides two entities: Identity Provider (IDP): the system that authenticates users and provides identity information (SAML affirmation) to the Service Provider, in essence, is responsible for the management of the credentials and identity of users; Service Provider (SP): the system that provides a service to the user and relies on the Identity Provider to authenticate the user, receives SAML assertions from the IdP to grant access to resources. The validation logic of the signature is central as it ensures that you cannot create a SAML response with arbitrary assertions and then impersonate other users. There is no guarantee that the first signature refers to the root object, it follows that if an attacker injects an item signed as the first element, all other signatures will not be verified. The only requirement is to have an XML element legitimately signed by the IdP, a condition that is easily met using the IdP's public metadata. An attacker could create an arbitrary SAML response that would be accepted by SPs using vulnerable SDKs, allowing him to impersonate any Spid and/or CIE user. This vulnerability has been addressed in version 3.4.0 and all users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2025-02-18T19:15:28.090",
    "keywords": "remote,authentication"
  },
  "CVE-2025-24895": {
    "cvss": 9.1,
    "description": "CIE.AspNetCore.Authentication is an AspNetCore Remote Authenticator for CIE 3.0. Authentication using Spid and CIE is based on the SAML2 standard which provides two entities: 1. Identity Provider (IDP): the system that authenticates users and provides identity information (SAML affirmation) to the Service Provider, in essence, is responsible for the management of the credentials and identity of users; 2. Service Provider (SP): the system that provides a service to the user and relies on the Identity Provider to authenticate the user, receives SAML assertions from the IdP to grant access to resources. The library cie-aspnetcore refers to the second entity, the SP, and implements the validation logic of SAML assertions within SAML responses. In affected versions there is no guarantee that the first signature refers to the root object, it follows that if an attacker injects an item signed as the first element, all other signatures will not be verified. The only requirement is to have an XML element legitimately signed by the IdP, a condition that is easily met using the IdP's public metadata. An attacker could create an arbitrary SAML response that would be accepted by SPs using vulnerable SDKs, allowing him to impersonate any Spid and/or CIE user. This issue has been addressed in version 2.1.0 and all users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2025-02-18T19:15:28.240",
    "keywords": "remote,authentication"
  },
  "CVE-2025-0622": {
    "cvss": 6.4,
    "description": "A flaw was found in command/gpg. In some scenarios, hooks created by loaded modules are not removed when the related module is unloaded. This flaw allows an attacker to force grub2 to call the hooks once the module that registered it was unloaded, leading to a use-after-free vulnerability. If correctly exploited, this vulnerability may result in arbitrary code execution, eventually allowing the attacker to bypass secure boot protections.",
    "published": "2025-02-18T20:15:23.570",
    "keywords": "execution,command,bypass"
  },
  "CVE-2025-26623": {
    "cvss": "-",
    "description": "Exiv2 is a C++ library and a command-line utility to read, write, delete and modify Exif, IPTC, XMP and ICC image metadata. A heap buffer overflow was found in Exiv2 versions v0.28.0 to v0.28.4. Versions prior to v0.28.0, such as v0.27.7, are **not** affected. Exiv2 is a command-line utility and C++ library for reading, writing, deleting, and modifying the metadata of image files. The heap overflow is triggered when Exiv2 is used to write metadata into a crafted image file. An attacker could potentially exploit the vulnerability to gain code execution, if they can trick the victim into running Exiv2 on a crafted image file. Note that this bug is only triggered when writing the metadata, which is a less frequently used Exiv2 operation than reading the metadata. For example, to trigger the bug in the Exiv2 command-line application, you need to add an extra command-line argument such as `fixiso`. The bug is fixed in version v0.28.5. Users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2025-02-18T20:15:33.153",
    "keywords": "execution,command"
  },
  "CVE-2025-26613": {
    "cvss": "-",
    "description": "WeGIA is an open source Web Manager for Institutions with a focus on Portuguese language users. An OS Command Injection vulnerability was discovered in the WeGIA application, `gerenciar_backup.php` endpoint. This vulnerability could allow an attacker to execute arbitrary code remotely. This issue has been addressed in version 3.2.14 and all users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2025-02-18T21:15:29.607",
    "keywords": "remote,command"
  },
  "CVE-2025-1024": {
    "url": "https://github.com/churchcrm/crm/issues/7250",
    "cvss": "-",
    "description": "A vulnerability exists in ChurchCRM 5.13.0 that allows an attacker to execute arbitrary JavaScript in a victim's browser via Reflected Cross-Site Scripting (XSS) in the EditEventAttendees.php page. This requires Administration privileges and affects the EID parameter. The flaw allows an attacker to steal session cookies, perform actions on behalf of an authenticated user, and gain unauthorized access to the application.",
    "published": "2025-02-19T09:15:10.280"
  },
  "CVE-2025-1132": {
    "cvss": "-",
    "description": "A time-based blind SQL Injection vulnerability exists in the ChurchCRM 5.13.0 and prior EditEventAttendees.php within the EN_tyid parameter. The parameter is directly inserted into an SQL query without proper sanitization, allowing attackers to inject malicious SQL commands. Please note that the vulnerability requires Administrator permissions. This flaw can potentially allow attackers to delay the response, indicating the presence of an SQL injection vulnerability. While it is a time-based blind injection, it can be exploited to gain insights into the underlying database, and with further exploitation, sensitive data could be retrieved.",
    "published": "2025-02-19T09:15:10.417",
    "keywords": "command,sensitive"
  },
  "CVE-2025-1133": {
    "url": "https://github.com/churchcrm/crm/issues/7252",
    "cvss": "-",
    "description": "A vulnerability exists in ChurchCRM 5.13.0 and prior that allows an attacker to execute arbitrary SQL queries by exploiting a boolean-based blind SQL Injection vulnerability in the EditEventAttendees functionality. The EID parameter is directly concatenated into an SQL query without proper sanitization, making it susceptible to SQL injection attacks. An attacker can manipulate the query, potentially leading to data exfiltration, modification, or deletion.  Please note that this vulnerability requires Administrator privileges.",
    "published": "2025-02-19T09:15:10.550"
  },
  "CVE-2025-1134": {
    "url": "https://github.com/churchcrm/crm/issues/7253",
    "cvss": "-",
    "description": "A vulnerability exists in ChurchCRM 5.13.0 and prior that allows an attacker to execute arbitrary SQL queries by exploiting a boolean-based and time-based blind SQL Injection vulnerability in the DonatedItemEditor functionality. The CurrentFundraiser parameter is directly concatenated into an SQL query without sufficient sanitization, allowing an attacker to manipulate database queries and execute arbitrary commands, potentially leading to data exfiltration, modification, or deletion. Please note that this vulnerability requires Administrator privileges.",
    "published": "2025-02-19T09:15:10.687"
  },
  "CVE-2025-1135": {
    "url": "https://github.com/churchcrm/crm/issues/7254",
    "cvss": "-",
    "description": "A vulnerability exists in ChurchCRM 5.13.0. and prior that allows an attacker to execute arbitrary SQL queries by exploiting a boolean-based and time-based blind SQL Injection vulnerability in the BatchWinnerEntry functionality. The CurrentFundraiser parameter is directly concatenated into an SQL query without sufficient sanitization, allowing an attacker to manipulate database queries and execute arbitrary commands, potentially leading to data exfiltration, modification, or deletion. Please note the vulnerability requires Administrator privileges.",
    "published": "2025-02-19T09:15:10.823"
  },
  "CVE-2025-0968": {
    "cvss": 5.3,
    "description": "The ElementsKit Elementor addons plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 3.4.0  due to a missing capability checks on the get_megamenu_content() function. This makes it possible for unauthenticated attackers to view any item created in Elementor, such as posts, pages and templates including drafts, trashed and private items.",
    "published": "2025-02-19T12:15:31.770",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-20153": {
    "cvss": 5.8,
    "description": "A vulnerability in the email filtering mechanism of Cisco Secure Email Gateway could allow an unauthenticated, remote attacker to bypass the configured rules and allow emails that should have been denied to flow through an affected device. &nbsp;\r\n\r\nThis vulnerability is due to improper handling of email that passes through an affected device. An attacker could exploit this vulnerability by sending a crafted email through the affected device. A successful exploit could allow the attacker to bypass email filters on the affected device.",
    "published": "2025-02-19T16:15:40.860",
    "keywords": "remote,unauthenticated,bypass"
  },
  "CVE-2025-20158": {
    "cvss": 4.4,
    "description": "A vulnerability in the debug shell of Cisco Video Phone 8875 and Cisco Desk Phone 9800 Series could allow an authenticated, local attacker to access sensitive information on an affected device. To exploit this vulnerability, the attacker must have valid administrative credentials with SSH access on the affected device. SSH access is disabled by default.\r\n\r\nThis vulnerability is due to insufficient validation of user-supplied input by the debug shell of an affected device. An attacker could exploit this vulnerability by sending a crafted SSH client command to the CLI. A successful exploit could allow the attacker to access sensitive information on the underlying operating system.",
    "published": "2025-02-19T16:15:41.017",
    "keywords": "command,sensitive"
  },
  "CVE-2025-20211": {
    "cvss": 6.1,
    "description": "A vulnerability in the web-based management interface of Cisco BroadWorks Application Delivery Platform could allow an unauthenticated, remote attacker to conduct a cross-site scripting attack against a user of the interface.\r\n\r\nThis vulnerability exists because the web-based management interface does not properly validate user-supplied input. An attacker could exploit this vulnerability by persuading a user of the interface to click a crafted link. A successful exploit could allow the attacker to execute arbitrary script code in the context of the affected interface or access sensitive, browser-based information.",
    "published": "2025-02-19T16:15:41.163",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2025-1118": {
    "cvss": 4.4,
    "description": "A flaw was found in grub2. Grub's dump command is not blocked when grub is in lockdown mode, which allows the user to read any memory information, and an attacker may leverage this in order to extract signatures, salts, and other sensitive information from the memory.",
    "published": "2025-02-19T18:15:24.280",
    "keywords": "command,sensitive"
  },
  "CVE-2025-0624": {
    "cvss": 7.6,
    "description": "A flaw was found in grub2. During the network boot process, when trying to search for the configuration file, grub copies data from a user controlled environment variable into an internal buffer using the grub_strcpy() function. During this step, it fails to consider the environment variable length when allocating the internal buffer, resulting in an out-of-bounds write. If correctly exploited, this issue may result in remote code execution through the same network segment grub is searching for the boot information, which can be used to by-pass secure boot protections.",
    "published": "2025-02-19T19:15:15.120",
    "keywords": "remote,execution"
  },
  "CVE-2025-25942": {
    "url": "https://github.com/axiomatic-systems/bento4/issues/993",
    "cvss": "-",
    "description": "An issue in Bento4 v1.6.0-641 allows an attacker to obtain sensitive information via the the mp4fragment tool when processing invalid files. Specifically, memory allocated in SampleArray::SampleArray in Mp4Fragment.cpp is not properly released.",
    "published": "2025-02-19T23:15:15.310"
  },
  "CVE-2025-25943": {
    "url": "https://github.com/axiomatic-systems/bento4/issues/993",
    "cvss": "-",
    "description": "Buffer Overflow vulnerability in Bento4 v.1.6.0-641 allows a local attacker to execute arbitrary code via the AP4_Stz2Atom::AP4_Stz2Atom component located in Ap4Stz2Atom.cpp.",
    "published": "2025-02-19T23:15:15.417"
  },
  "CVE-2025-25944": {
    "url": "https://github.com/axiomatic-systems/bento4/issues/993",
    "cvss": "-",
    "description": "Buffer Overflow vulnerability in Bento4 v.1.6.0-641 allows a local attacker to execute arbitrary code via the Ap4RtpAtom.cpp, specifically in AP4_RtpAtom::AP4_RtpAtom, during the execution of mp4fragment with a crafted MP4 input file.",
    "published": "2025-02-19T23:15:15.530"
  },
  "CVE-2025-25945": {
    "url": "https://github.com/axiomatic-systems/bento4/issues/993",
    "cvss": "-",
    "description": "An issue in Bento4 v1.6.0-641 allows an attacker to obtain sensitive information via the the Mp4Fragment.cpp and in AP4_DescriptorFactory::CreateDescriptorFromStream at Ap4DescriptorFactory.cpp.",
    "published": "2025-02-19T23:15:15.630"
  },
  "CVE-2025-25946": {
    "cvss": "-",
    "description": "An issue in Bento4 v1.6.0-641 allows an attacker to cause a memory leak via Ap4Marlin.cpp and Ap4Processor.cpp, specifically in AP4_MarlinIpmpEncryptingProcessor::Initialize and AP4_Processor::Process, during the execution of mp4encrypt with a specially crafted MP4 input file.",
    "published": "2025-02-19T23:15:15.743",
    "keywords": "execution,leak"
  },
  "CVE-2025-25947": {
    "url": "https://github.com/axiomatic-systems/bento4/issues/994",
    "cvss": "-",
    "description": "An issue in Bento4 v1.6.0-641 allows an attacker to trigger a segmentation fault via Ap4Atom.cpp, specifically in AP4_AtomParent::RemoveChild, during the execution of mp4encrypt with a specially crafted MP4 input file.",
    "published": "2025-02-19T23:15:15.850"
  },
  "CVE-2025-1293": {
    "cvss": 8.2,
    "description": "Hermes versions up to 0.4.0 improperly validated the JWT provided when using the AWS ALB authentication mode, potentially allowing for authentication bypass. This vulnerability, CVE-2025-1293, was fixed in Hermes 0.5.0.",
    "published": "2025-02-20T01:15:09.950",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-27218": {
    "cvss": "-",
    "description": "Sitecore Experience Manager (XM) and Experience Platform (XP) 10.4 before KB1002844 allow remote code execution through insecure deserialization.",
    "published": "2025-02-20T05:15:15.270",
    "keywords": "remote,execution"
  }
}