{
  "CVE-2024-28815": {
    "cvss": "-",
    "description": "A vulnerability in the BluStar component of Mitel InAttend 2.6 SP4 through 2.7 and CMG 8.5 SP4 through 8.6 could allow access to sensitive information, changes to the system configuration, or execution of arbitrary commands within the context of the system.",
    "published": "2024-03-27T07:15:49.493",
    "keywords": "execution,command,sensitive"
  },
  "CVE-2024-2976": {
    "cvss": 8.8,
    "description": "A vulnerability was found in Tenda F1203 2.0.1.6. It has been declared as critical. Affected by this vulnerability is the function R7WebsSecurityHandler of the file /goform/execCommand. The manipulation of the argument password leads to stack-based buffer overflow. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-258145 was assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-03-27T14:15:12.743",
    "keywords": "remote,command"
  },
  "CVE-2024-2980": {
    "cvss": 8.8,
    "description": "A vulnerability, which was classified as critical, has been found in Tenda FH1202 1.2.0.14(408). This issue affects the function formexeCommand of the file /goform/execCommand. The manipulation of the argument cmdinput leads to stack-based buffer overflow. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-258149 was assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-03-27T15:15:48.420",
    "keywords": "remote,command"
  },
  "CVE-2024-20259": {
    "cvss": 8.6,
    "description": "A vulnerability in the DHCP snooping feature of Cisco IOS XE Software could allow an unauthenticated, remote attacker to cause an affected device to reload unexpectedly, resulting in a denial of service (DoS) condition.\r\n\r This vulnerability is due to a crafted IPv4 DHCP request packet being mishandled when endpoint analytics are enabled. An attacker could exploit this vulnerability by sending a crafted DHCP request through an affected device. A successful exploit could allow the attacker to cause the device to reload, resulting in a DoS condition.\r\n\r Note: The attack vector is listed as network because a DHCP relay anywhere on the network could allow exploits from networks other than the adjacent one.",
    "published": "2024-03-27T17:15:50.913",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20265": {
    "cvss": 5.9,
    "description": "A vulnerability in the boot process of Cisco Access Point (AP) Software could allow an unauthenticated, physical attacker to bypass the Cisco Secure Boot functionality and load a software image that has been tampered with on an affected device.\r\n\r This vulnerability exists because unnecessary commands are available during boot time at the physical console. An attacker could exploit this vulnerability by interrupting the boot process and executing specific commands to bypass the Cisco Secure Boot validation checks and load an image that has been tampered with. This image would have been previously downloaded onto the targeted device. A successful exploit could allow the attacker to load the image once. The Cisco Secure Boot functionality is not permanently compromised.",
    "published": "2024-03-27T17:15:51.113",
    "keywords": "unauthenticated,command,bypass"
  },
  "CVE-2024-20271": {
    "cvss": 8.6,
    "description": "A vulnerability in the IP packet processing of Cisco Access Point (AP) Software could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition on an affected device.\r\n\r This vulnerability is due to insufficient input validation of certain IPv4 packets. An attacker could exploit this vulnerability by sending a crafted IPv4 packet either to or through an affected device. A successful exploit could allow the attacker to cause an affected device to reload unexpectedly, resulting in a DoS condition. To successfully exploit this vulnerability, the attacker does not need to be associated with the affected AP. This vulnerability cannot be exploited by sending IPv6 packets.",
    "published": "2024-03-27T17:15:51.320",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20311": {
    "cvss": 8.6,
    "description": "A vulnerability in the Locator ID Separation Protocol (LISP) feature of Cisco IOS Software and Cisco IOS XE Software could allow an unauthenticated, remote attacker to cause an affected device to reload.\r\n\r This vulnerability is due to the incorrect handling of LISP packets. An attacker could exploit this vulnerability by sending a crafted LISP packet to an affected device. A successful exploit could allow the attacker to cause the device to reload, resulting in a denial of service (DoS) condition.\r\n\r Note: This vulnerability could be exploited over either IPv4 or IPv6 transport.",
    "published": "2024-03-27T17:15:52.463",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20314": {
    "cvss": 8.6,
    "description": "A vulnerability in the IPv4 Software-Defined Access (SD-Access) fabric edge node feature of Cisco IOS XE Software could allow an unauthenticated, remote attacker to cause high CPU utilization and stop all traffic processing, resulting in a denial of service (DoS) condition on an affected device.\r\n\r This vulnerability is due to improper handling of certain IPv4 packets. An attacker could exploit this vulnerability by sending certain IPv4 packets to an affected device. A successful exploit could allow the attacker to cause the device to exhaust CPU resources and stop processing traffic, resulting in a DoS condition.",
    "published": "2024-03-27T17:15:52.920",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20316": {
    "cvss": 5.8,
    "description": "A vulnerability in the data model interface (DMI) services of Cisco IOS XE Software could allow an unauthenticated, remote attacker to access resources that should have been protected by a configured IPv4 access control list (ACL).\r\n\r This vulnerability is due to improper handling of error conditions when a successfully authorized device administrator updates an IPv4 ACL using the NETCONF or RESTCONF protocol, and the update would reorder access control entries (ACEs) in the updated ACL. An attacker could exploit this vulnerability by accessing resources that should have been protected across an affected device.",
    "published": "2024-03-27T17:15:53.110",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-29946": {
    "cvss": 8.1,
    "description": "In Splunk Enterprise versions below 9.2.1, 9.1.4, and 9.0.9, the Dashboard Examples Hub in the Splunk Dashboard Studio app lacks protections for risky SPL commands. This could let attackers bypass SPL safeguards for risky commands in the Hub. The vulnerability would require the attacker to phish the victim by tricking them into initiating a request within their browser.",
    "published": "2024-03-27T17:15:54.273",
    "keywords": "command,bypass"
  },
  "CVE-2024-20307": {
    "cvss": 6.8,
    "description": "A vulnerability in the IKEv1 fragmentation code of Cisco IOS Software and Cisco IOS XE Software could allow an unauthenticated, remote attacker to cause a heap overflow, resulting in an affected device reloading.\r\n\r This vulnerability exists because crafted, fragmented IKEv1 packets are not properly reassembled. An attacker could exploit this vulnerability by sending crafted UDP packets to an affected system. A successful exploit could allow the attacker to cause the affected device to reload, resulting in a DoS condition.\r\n\r Note: Only traffic that is directed to the affected system can be used to exploit this vulnerability. This vulnerability can be triggered by IPv4 and IPv6 traffic.",
    "published": "2024-03-27T18:15:09.357",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20308": {
    "cvss": 8.6,
    "description": "A vulnerability in the IKEv1 fragmentation code of Cisco IOS Software and Cisco IOS XE Software could allow an unauthenticated, remote attacker to cause a heap underflow, resulting in an affected device reloading.\r\n\r This vulnerability exists because crafted, fragmented IKEv1 packets are not properly reassembled. An attacker could exploit this vulnerability by sending crafted UDP packets to an affected system. A successful exploit could allow the attacker to cause the affected device to reload, resulting in a denial of service (DoS) condition.\r\n\r Note: Only traffic that is directed to the affected system can be used to exploit this vulnerability. This vulnerability can be triggered by IPv4 and IPv6 traffic..",
    "published": "2024-03-27T18:15:09.853",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-28860": {
    "url": "https://github.com/cilium/cilium/commit/a652c123331852cca90c74202f993d4170fd37fa",
    "cvss": 8.0,
    "description": "Cilium is a networking, observability, and security solution with an eBPF-based dataplane. Users of IPsec transparent encryption in Cilium may be vulnerable to cryptographic attacks that render the transparent encryption ineffective. In particular, Cilium is vulnerable to chosen plaintext, key recovery, replay attacks by a man-in-the-middle attacker. These attacks are possible due to an ESP sequence number collision when multiple nodes are configured with the same key. Fixed versions of Cilium use unique keys for each IPsec tunnel established between nodes, resolving all of the above attacks. This vulnerability is fixed in 1.13.13, 1.14.9, and 1.15.3.",
    "published": "2024-03-27T19:15:48.827"
  },
  "CVE-2024-2990": {
    "cvss": 8.8,
    "description": "A vulnerability, which was classified as critical, was found in Tenda FH1203 2.0.1.6. This affects the function formexeCommand of the file /goform/execCommand. The manipulation of the argument cmdinput leads to stack-based buffer overflow. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-258159. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-03-27T19:15:49.710",
    "keywords": "remote,command"
  },
  "CVE-2024-2991": {
    "cvss": 6.3,
    "description": "A vulnerability has been found in Tenda FH1203 2.0.1.6 and classified as critical. This vulnerability affects the function formWriteFacMac of the file /goform/WriteFacMac. The manipulation of the argument mac leads to command injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-258160. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-03-27T19:15:49.940",
    "keywords": "remote,command"
  },
  "CVE-2024-3008": {
    "cvss": 8.8,
    "description": "A vulnerability, which was classified as critical, was found in Tenda FH1205 2.0.0.7(775). Affected is the function formexeCommand of the file /goform/execCommand. The manipulation of the argument cmdinput leads to stack-based buffer overflow. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. VDB-258294 is the identifier assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-03-27T23:15:47.340",
    "keywords": "remote,command"
  },
  "CVE-2024-3009": {
    "cvss": 6.3,
    "description": "A vulnerability has been found in Tenda FH1205 2.0.0.7(775) and classified as critical. Affected by this vulnerability is the function formWriteFacMac of the file /goform/WriteFacMac. The manipulation of the argument mac leads to command injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-258295. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-03-28T00:15:07.993",
    "keywords": "remote,command"
  },
  "CVE-2024-28007": {
    "cvss": "-",
    "description": "Improper authentication vulnerability in NEC Corporation Aterm WG1800HP4, WG1200HS3, WG1900HP2, WG1200HP3, WG1800HP3, WG1200HS2, WG1900HP, WG1200HP2, W1200EX(-MS), WG1200HS, WG1200HP, WF300HP2, W300P, WF800HP, WR8165N, WG2200HP, WF1200HP2, WG1800HP2, WF1200HP, WG600HP, WG300HP, WF300HP, WG1800HP, WG1400HP, WR8175N, WR9300N, WR8750N, WR8160N, WR9500N, WR8600N, WR8370N, WR8170N, WR8700N, WR8300N, WR8150N, WR4100N, WR4500N, WR8100N, WR8500N, CR2500P, WR8400N, WR8200N, WR1200H, WR7870S, WR6670S, WR7850S, WR6650S, WR6600H, WR7800H, WM3400RN, WM3450RN, WM3500R, WM3600R, WM3800R, WR8166N, MR01LN and MR02LN all versions allows a attacker to execute an arbitrary command with the root privilege via the internet.",
    "published": "2024-03-28T01:15:47.250",
    "keywords": "authentication,command"
  },
  "CVE-2024-28009": {
    "cvss": "-",
    "description": "Improper authentication vulnerability in NEC Corporation Aterm WG1800HP4, WG1200HS3, WG1900HP2, WG1200HP3, WG1800HP3, WG1200HS2, WG1900HP, WG1200HP2, W1200EX(-MS), WG1200HS, WG1200HP, WF300HP2, W300P, WF800HP, WR8165N, WG2200HP, WF1200HP2, WG1800HP2, WF1200HP, WG600HP, WG300HP, WF300HP, WG1800HP, WG1400HP, WR8175N, WR9300N, WR8750N, WR8160N, WR9500N, WR8600N, WR8370N, WR8170N, WR8700N, WR8300N, WR8150N, WR4100N, WR4500N, WR8100N, WR8500N, CR2500P, WR8400N, WR8200N, WR1200H, WR7870S, WR6670S, WR7850S, WR6650S, WR6600H, WR7800H, WM3400RN, WM3450RN, WM3500R, WM3600R, WM3800R, WR8166N, MR01LN and MR02LN all versions allows a attacker to execute an arbitrary command with the root privilege via the internet.",
    "published": "2024-03-28T01:15:47.400",
    "keywords": "authentication,command"
  },
  "CVE-2024-28012": {
    "cvss": "-",
    "description": "Improper authentication vulnerability in NEC Corporation Aterm WG1800HP4, WG1200HS3, WG1900HP2, WG1200HP3, WG1800HP3, WG1200HS2, WG1900HP, WG1200HP2, W1200EX(-MS), WG1200HS, WG1200HP, WF300HP2, W300P, WF800HP, WR8165N, WG2200HP, WF1200HP2, WG1800HP2, WF1200HP, WG600HP, WG300HP, WF300HP, WG1800HP, WG1400HP, WR8175N, WR9300N, WR8750N, WR8160N, WR9500N, WR8600N, WR8370N, WR8170N, WR8700N, WR8300N, WR8150N, WR4100N, WR4500N, WR8100N, WR8500N, CR2500P, WR8400N, WR8200N, WR1200H, WR7870S, WR6670S, WR7850S, WR6650S, WR6600H, WR7800H, WM3400RN, WM3450RN, WM3500R, WM3600R, WM3800R, WR8166N, MR01LN and MR02LN all versions allows a attacker to execute an arbitrary command with the root privilege via the internet.",
    "published": "2024-03-28T01:15:47.620",
    "keywords": "authentication,command"
  },
  "CVE-2024-29227": {
    "cvss": 5.4,
    "description": "Improper neutralization of special elements used in an SQL command ('SQL Injection') vulnerability in Layout.LayoutSave webapi component in Synology Surveillance Station before 9.2.0-9289 and 9.2.0-11289 allows remote authenticated users to inject SQL commands via unspecified vectors.",
    "published": "2024-03-28T07:15:59.770",
    "keywords": "remote,command"
  },
  "CVE-2024-29228": {
    "cvss": 7.7,
    "description": "Missing authorization vulnerability in GetStmUrlPath webapi component in Synology Surveillance Station before 9.2.0-9289 and 9.2.0-11289 allows remote authenticated users to obtain sensitive information via unspecified vectors.",
    "published": "2024-03-28T07:16:00.733",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-29229": {
    "cvss": 7.7,
    "description": "Missing authorization vulnerability in GetLiveViewPath webapi component in Synology Surveillance Station before 9.2.0-9289 and 9.2.0-11289 allows remote authenticated users to obtain sensitive information via unspecified vectors.",
    "published": "2024-03-28T07:16:02.680",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-29230": {
    "cvss": 5.4,
    "description": "Improper neutralization of special elements used in an SQL command ('SQL Injection') vulnerability in SnapShot.CountByCategory webapi component in Synology Surveillance Station before 9.2.0-9289 and 9.2.0-11289 allows remote authenticated users to inject SQL commands via unspecified vectors.",
    "published": "2024-03-28T07:16:03.380",
    "keywords": "remote,command"
  },
  "CVE-2024-29231": {
    "cvss": 5.4,
    "description": "Improper validation of array index vulnerability in UserPrivilege.Enum webapi component in Synology Surveillance Station before 9.2.0-9289 and 9.2.0-11289 allows remote authenticated users to bypass security constraints via unspecified vectors.",
    "published": "2024-03-28T07:16:04.170",
    "keywords": "remote,bypass"
  },
  "CVE-2024-29232": {
    "cvss": 5.4,
    "description": "Improper neutralization of special elements used in an SQL command ('SQL Injection') vulnerability in Alert.Enum webapi component in Synology Surveillance Station before 9.2.0-11289 and 9.2.0-9289 allows remote authenticated users to inject SQL commands via unspecified vectors.",
    "published": "2024-03-28T07:16:05.133",
    "keywords": "remote,command"
  },
  "CVE-2024-29233": {
    "cvss": 5.4,
    "description": "Improper neutralization of special elements used in an SQL command ('SQL Injection') vulnerability in Emap.Delete webapi component in Synology Surveillance Station before 9.2.0-9289 and 9.2.0-11289 allows remote authenticated users to inject SQL commands via unspecified vectors.",
    "published": "2024-03-28T07:16:06.060",
    "keywords": "remote,command"
  },
  "CVE-2024-29234": {
    "cvss": 5.4,
    "description": "Improper neutralization of special elements used in an SQL command ('SQL Injection') vulnerability in Group.Save webapi component in Synology Surveillance Station before 9.2.0-11289 and 9.2.0-9289 allows remote authenticated users to inject SQL commands via unspecified vectors.",
    "published": "2024-03-28T07:16:06.830",
    "keywords": "remote,command"
  },
  "CVE-2024-29235": {
    "cvss": 5.4,
    "description": "Improper neutralization of special elements used in an SQL command ('SQL Injection') vulnerability in IOModule.EnumLog webapi component in Synology Surveillance Station before 9.2.0-11289 and 9.2.0-9289 allows remote authenticated users to inject SQL commands via unspecified vectors.",
    "published": "2024-03-28T07:16:07.657",
    "keywords": "remote,command"
  },
  "CVE-2024-29236": {
    "cvss": 5.4,
    "description": "Improper neutralization of special elements used in an SQL command ('SQL Injection') vulnerability in AudioPattern.Delete webapi component in Synology Surveillance Station before 9.2.0-9289 and 9.2.0-11289 allows remote authenticated users to inject SQL commands via unspecified vectors.",
    "published": "2024-03-28T07:16:08.340",
    "keywords": "remote,command"
  },
  "CVE-2024-29237": {
    "cvss": 5.4,
    "description": "Improper neutralization of special elements used in an SQL command ('SQL Injection') vulnerability in ActionRule.Delete webapi component in Synology Surveillance Station before 9.2.0-11289 and 9.2.0-9289 allows remote authenticated users to inject SQL commands via unspecified vectors.",
    "published": "2024-03-28T07:16:09.077",
    "keywords": "remote,command"
  },
  "CVE-2024-29238": {
    "cvss": 5.4,
    "description": "Improper neutralization of special elements used in an SQL command ('SQL Injection') vulnerability in Log.CountByCategory webapi component in Synology Surveillance Station before 9.2.0-9289 and 9.2.0-11289 allows remote authenticated users to inject SQL commands via unspecified vectors.",
    "published": "2024-03-28T07:16:09.570",
    "keywords": "remote,command"
  },
  "CVE-2024-29239": {
    "cvss": 5.4,
    "description": "Improper neutralization of special elements used in an SQL command ('SQL Injection') vulnerability in Recording.CountByCategory webapi component in Synology Surveillance Station before 9.2.0-11289 and 9.2.0-9289 allows remote authenticated users to inject SQL commands via unspecified vectors.",
    "published": "2024-03-28T07:16:10.293",
    "keywords": "remote,command"
  },
  "CVE-2024-29241": {
    "cvss": 9.9,
    "description": "Missing authorization vulnerability in System webapi component in Synology Surveillance Station before 9.2.0-9289 and 9.2.0-11289 allows remote authenticated users to bypass security constraints via unspecified vectors.",
    "published": "2024-03-28T07:16:12.177",
    "keywords": "remote,bypass"
  },
  "CVE-2024-28109": {
    "cvss": 8.1,
    "description": "veraPDF-library is a PDF/A validation library. Executing policy checks using custom schematron files invokes an XSL transformation that could lead to a remote code execution (RCE) vulnerability. This vulnerability is fixed in 1.24.2.",
    "published": "2024-03-28T14:15:13.863",
    "keywords": "remote,execution"
  },
  "CVE-2024-29882": {
    "url": "https://github.com/ossrs/srs/commit/244ce7bc013a0b805274a65132a2980680ba6b9d",
    "cvss": 7.2,
    "description": "SRS is a simple, high-efficiency, real-time video server. SRS's `/api/v1/vhosts/vid-<id>?callback=<payload>` endpoint didn't filter the callback function name which led to injecting malicious javascript payloads and executing XSS ( Cross-Site Scripting). This vulnerability is fixed in 5.0.210 and 6.0.121.",
    "published": "2024-03-28T14:15:14.337"
  },
  "CVE-2024-29897": {
    "url": "https://github.com/miraheze/mw-config/commit/fb3e68bcef459e9cf2a415241b28042a6c9727e8",
    "cvss": 4.9,
    "description": "CreateWiki is Miraheze's MediaWiki extension for requesting & creating wikis. It is possible for users with (delete) or (suppressrevision) on any wiki in the farm to access suppressed wiki requests by going to the request's entry on Special:RequestWikiQueue on the wiki where they have these rights. The same vulnerability was present briefly on the REST API before being quickly corrected in commit `6bc0685`. To our knowledge, the vulnerable commits of the REST API are not running in production anywhere. This vulnerability is fixed in 23415c17ffb4832667c06abcf1eadadefd4c8937.",
    "published": "2024-03-28T14:15:14.557"
  },
  "CVE-2024-25946": {
    "cvss": 7.2,
    "description": "Dell vApp Manager, versions prior to 9.2.4.9 contain a Command Injection Vulnerability. An authorized attacker could potentially exploit this vulnerability leading to an execution of an inserted command. Dell recommends customers to upgrade at the earliest opportunity.",
    "published": "2024-03-28T19:15:47.010",
    "keywords": "execution,command"
  },
  "CVE-2024-25954": {
    "cvss": 5.3,
    "description": "Dell PowerScale OneFS, versions 9.5.0.x through 9.7.0.x, contain an insufficient session expiration vulnerability. A remote unauthenticated attacker could potentially exploit this vulnerability, leading to denial of service.",
    "published": "2024-03-28T19:15:47.587",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-25955": {
    "cvss": 7.2,
    "description": "Dell vApp Manager, versions prior to 9.2.4.9 contain a Command Injection Vulnerability. An authorized attacker could potentially exploit this vulnerability leading to an execution of an inserted command. Dell recommends customers to upgrade at the earliest opportunity.",
    "published": "2024-03-28T19:15:47.790",
    "keywords": "execution,command"
  },
  "CVE-2024-25963": {
    "cvss": 5.9,
    "description": "Dell PowerScale OneFS, versions 8.2.2.x through 9.5.0.x contains a use of a broken cryptographic algorithm vulnerability. A remote unauthenticated attacker could potentially exploit this vulnerability, leading to information disclosure.",
    "published": "2024-03-28T19:15:48.173",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-27719": {
    "cvss": "-",
    "description": "A cross site scripting (XSS) vulnerability in rems FAQ Management System v.1.0 allows a remote attacker to obtain sensitive information via a crafted payload to the Frequently Asked Question field in the Add FAQ function.",
    "published": "2024-03-28T19:15:48.570",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-3019": {
    "cvss": 8.8,
    "description": "A flaw was found in PCP. The default pmproxy configuration exposes the Redis server backend to the local network, allowing remote command execution with the privileges of the Redis user. This issue can only be exploited when pmproxy is running. By default, pmproxy is not running and needs to be started manually. The pmproxy service is usually started from the 'Metrics settings' page of the Cockpit web interface. This flaw affects PCP versions 4.3.4 and newer.",
    "published": "2024-03-28T19:15:49.160",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-24407": {
    "cvss": "-",
    "description": "SQL Injection vulnerability in Best Courier management system v.1.0 allows a remote attacker to obtain sensitive information via print_pdets.php component.",
    "published": "2024-03-28T23:15:46.283",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-29489": {
    "url": "https://github.com/jerryscript-project/jerryscript/pull/5129",
    "cvss": "-",
    "description": "Jerryscript 2.4.0 has SEGV at ./jerry-core/ecma/base/ecma-helpers.c:238:58 in ecma_get_object_type.",
    "published": "2024-03-28T23:15:46.527"
  },
  "CVE-2024-2411": {
    "cvss": 9.8,
    "description": "The MasterStudy LMS plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 3.3.0 via the 'modal' parameter. This makes it possible for unauthenticated attackers to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-03-29T09:15:07.943",
    "keywords": "execution,unauthenticated,sensitive,bypass"
  },
  "CVE-2024-3061": {
    "cvss": 7.2,
    "description": "The HUSKY – Products Filter Professional for WooCommerce plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 1.3.5.2 via the 'type' parameter. This makes it possible for authenticated attackers, with administrator-level access and above, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-03-29T10:15:09.403",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-29201": {
    "cvss": 9.9,
    "description": "JumpServer is an open source bastion host and an operation and maintenance security audit system. Attackers can bypass the input validation mechanism in JumpServer's Ansible to execute arbitrary code within the Celery container. Since the Celery container runs with root privileges and has database access, attackers could steal sensitive information from all hosts or manipulate the database. This vulnerability is fixed in v3.10.7.",
    "published": "2024-03-29T15:15:11.963",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-29900": {
    "cvss": 7.5,
    "description": "Electron Packager bundles Electron-based application source code with a renamed Electron executable and supporting files into folders ready for distribution. A random segment of ~1-10kb of Node.js heap memory allocated either side of a known buffer will be leaked into the final executable. This memory _could_ contain sensitive information such as environment variables, secrets files, etc. This issue is patched in 18.3.1.\n",
    "published": "2024-03-29T16:15:08.103",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-30246": {
    "url": "https://github.com/enalean/tuleap/commit/a0ba0ae82a29eb8bfacef286778e5e49954f5316",
    "cvss": 7.6,
    "description": "Tuleap is an Open Source Suite to improve management of software developments and collaboration. A malicious user could exploit this issue on purpose to delete information on the instance or possibly gain access to restricted artifacts. It is however not possible to control exactly which information is deleted. Information from theDate, File, Float, Int, List, OpenList, Text, and Permissions on artifact (this one can lead to the disclosure of restricted information) fields can be impacted.  This vulnerability is fixed in Tuleap Community Edition version 15.7.99.6 and Tuleap Enterprise Edition 15.7-2, 15.6-5, 15.5-6, 15.4-8, 15.3-6, 15.2-5, 15.1-9, 15.0-9, and 14.12-6.",
    "published": "2024-03-29T16:15:08.860"
  },
  "CVE-2024-30247": {
    "cvss": 10.0,
    "description": "NextcloudPi is a ready to use image for Virtual Machines, Raspberry Pi, Odroid HC1, Rock64 and other boards. A command injection vulnerability in NextCloudPi allows command execution as the root user via the NextCloudPi web-panel. Due to a security misconfiguration this can be used by anyone with access to NextCloudPi web-panel, no authentication is required. It is recommended that the NextCloudPi is upgraded to 1.53.1.",
    "published": "2024-03-29T16:15:09.130",
    "keywords": "execution,authentication,command"
  },
  "CVE-2024-25944": {
    "cvss": 5.7,
    "description": "Dell OpenManage Enterprise, v4.0 and prior, contain(s) a path traversal vulnerability. An unauthenticated remote attacker could potentially exploit this vulnerability, to gain unauthorized access to the files stored on the server filesystem, with the privileges of the running web application.",
    "published": "2024-03-29T17:15:11.837",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-29667": {
    "cvss": "-",
    "description": "SQL Injection vulnerability in Tongtianxing Technology Co., Ltd CMSV6 v.7.31.0.2 through v.7.31.0.3 allows a remote attacker to escalate privileges and obtain sensitive information via the ids parameter.",
    "published": "2024-03-29T18:15:08.057",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-29278": {
    "url": "https://github.com/funson86/funboot/issues/2",
    "cvss": "-",
    "description": "funboot v1.1 is vulnerable to Cross Site Scripting (XSS) via the title field in \"create a message .\"",
    "published": "2024-03-30T01:15:47.063"
  }
}