{
  "CVE-2024-23473": {
    "cvss": 8.6,
    "description": "The SolarWinds Access Rights Manager was found to contain a hard-coded credential authentication bypass vulnerability. If exploited, this vulnerability allows access to the RabbitMQ management console. \n\nWe thank Trend Micro Zero Day Initiative (ZDI) for its ongoing partnership in coordinating with SolarWinds on responsible disclosure of this and other potential vulnerabilities. ",
    "published": "2024-05-14T14:59:29.340",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-24157": {
    "url": "https://github.com/gnuboard/g6/issues/314",
    "cvss": "-",
    "description": "Gnuboard g6 / https://github.com/gnuboard/g6 commit c2cc1f5069e00491ea48618d957332d90f6d40e4 is vulnerable to Cross Site Scripting (XSS) via board.py.",
    "published": "2024-05-14T15:01:53.100"
  },
  "CVE-2024-26517": {
    "cvss": "-",
    "description": "SQL Injection vulnerability in School Task Manager v.1.0 allows a remote attacker to obtain sensitive information via a crafted payload to the delete-task.php component.",
    "published": "2024-05-14T15:09:08.060",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-27281": {
    "cvss": "-",
    "description": "An issue was discovered in RDoc 6.3.3 through 6.6.2, as distributed in Ruby 3.x through 3.3.0. When parsing .rdoc_options (used for configuration in RDoc) as a YAML file, object injection and resultant remote code execution are possible because there are no restrictions on the classes that can be restored. (When loading the documentation cache, object injection and resultant remote code execution are also possible if there were a crafted cache.) The main fixed version is 6.6.3.1. For Ruby 3.0 users, a fixed version is rdoc 6.3.4.1. For Ruby 3.1 users, a fixed version is rdoc 6.4.1.1. For Ruby 3.2 users, a fixed version is rdoc 6.5.1.1.",
    "published": "2024-05-14T15:11:57.250",
    "keywords": "remote,execution"
  },
  "CVE-2024-27834": {
    "cvss": "-",
    "description": "The issue was addressed with improved checks. This issue is fixed in iOS 17.5 and iPadOS 17.5, tvOS 17.5, Safari 17.5, watchOS 10.5, macOS Sonoma 14.5. An attacker with arbitrary read and write capability may be able to bypass Pointer Authentication.",
    "published": "2024-05-14T15:13:06.953",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-28075": {
    "cvss": 9.0,
    "description": "The SolarWinds Access Rights Manager was susceptible to Remote Code Execution Vulnerability. This vulnerability allows an authenticated user to abuse SolarWinds service resulting in remote code execution. \n\nWe thank Trend Micro Zero Day Initiative (ZDI) for its ongoing partnership in coordinating with SolarWinds on responsible disclosure of this and other potential vulnerabilities.   ",
    "published": "2024-05-14T15:13:53.397",
    "keywords": "remote,execution"
  },
  "CVE-2024-29212": {
    "cvss": 9.9,
    "description": "Due to an  unsafe de-serialization method used by the Veeam Service Provider Console(VSPC) server in communication between the management agent and its components, under certain conditions, it is possible to perform Remote Code Execution (RCE) on the VSPC server machine.",
    "published": "2024-05-14T15:15:43.623",
    "keywords": "remote,execution"
  },
  "CVE-2024-29895": {
    "cvss": 10.0,
    "description": "Cacti provides an operational monitoring and fault management framework. A command injection vulnerability on the 1.3.x DEV branch allows any unauthenticated user to execute arbitrary command on the server when `register_argc_argv` option of PHP is `On`. In `cmd_realtime.php` line 119, the `$poller_id` used as part of the command execution is sourced from `$_SERVER['argv']`, which can be controlled by URL when `register_argc_argv` option of PHP is `On`. And this option is `On` by default in many environments such as the main PHP Docker image for PHP. Commit 53e8014d1f082034e0646edc6286cde3800c683d contains a patch for the issue, but this commit was reverted in commit 99633903cad0de5ace636249de16f77e57a3c8fc.",
    "published": "2024-05-14T15:17:15.593",
    "keywords": "execution,unauthenticated,command"
  },
  "CVE-2024-2299": {
    "cvss": 7.4,
    "description": "A stored Cross-Site Scripting (XSS) vulnerability exists in the parisneo/lollms-webui application due to improper validation of uploaded files in the profile picture upload functionality. Attackers can exploit this vulnerability by uploading malicious HTML files containing JavaScript code, which is executed when the file is accessed. This vulnerability is remotely exploitable via Cross-Site Request Forgery (CSRF), allowing attackers to perform actions on behalf of authenticated users and potentially leading to unauthorized access to sensitive information within the Lollms-webui application.",
    "published": "2024-05-14T15:18:47.760",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-31445": {
    "cvss": 8.8,
    "description": "Cacti provides an operational monitoring and fault management framework. Prior to version 1.2.27, a SQL injection vulnerability in `automation_get_new_graphs_sql` function of `api_automation.php` allows authenticated users to exploit these SQL injection vulnerabilities to perform privilege escalation and remote code execution. In `api_automation.php` line 856, the `get_request_var('filter')` is being concatenated into the SQL statement without any sanitization. In `api_automation.php` line 717, The filter of `'filter'` is `FILTER_DEFAULT`, which means there is no filter for it. Version 1.2.27 contains a patch for the issue.",
    "published": "2024-05-14T15:25:21.567",
    "keywords": "remote,execution"
  },
  "CVE-2024-31459": {
    "cvss": 8.0,
    "description": "Cacti provides an operational monitoring and fault management framework. Prior to version 1.2.27, there is a file inclusion issue in the `lib/plugin.php` file. Combined with SQL injection vulnerabilities, remote code execution can be implemented. There is a file inclusion issue with the `api_plugin_hook()` function in the `lib/plugin.php` file, which reads the plugin_hooks and plugin_config tables in database. The read data is directly used to concatenate the file path which is used for file inclusion. Version 1.2.27 contains a patch for the issue.",
    "published": "2024-05-14T15:25:26.110",
    "keywords": "remote,execution"
  },
  "CVE-2024-31460": {
    "cvss": 6.5,
    "description": "Cacti provides an operational monitoring and fault management framework. Prior to version 1.2.27, some of the data stored in `automation_tree_rules.php` is not thoroughly checked and is used to concatenate the SQL statement in `create_all_header_nodes()`  function from `lib/api_automation.php` , finally resulting in SQL injection. Using SQL based secondary injection technology, attackers can modify the contents of the Cacti database, and based on the modified content, it may be possible to achieve further impact, such as arbitrary file reading, and even remote code execution through arbitrary file writing. Version 1.2.27 contains a patch for the issue.",
    "published": "2024-05-14T15:25:26.897",
    "keywords": "remote,execution"
  },
  "CVE-2024-31803": {
    "url": "https://github.com/emp-toolkit/emp-ot/issues/89",
    "cvss": "-",
    "description": "Buffer Overflow vulnerability in emp-ot v.0.2.4 allows a remote attacker to execute arbitrary code via the FerretCOT<T>::read_pre_data128_from_file function.",
    "published": "2024-05-14T15:25:43.390"
  },
  "CVE-2024-32735": {
    "cvss": 9.8,
    "description": "An issue regarding missing authentication for certain utilities exists in CyberPower PowerPanel Enterprise prior to v2.8.3. An unauthenticated remote attacker can access the PDNU REST APIs, which may result in compromise of the application.",
    "published": "2024-05-14T15:37:03.527",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2024-32736": {
    "cvss": 7.5,
    "description": "A sql injection vulnerability exists in CyberPower PowerPanel Enterprise prior to v2.8.3. An unauthenticated remote attacker can leak sensitive information via the \"query_utask_verbose\" function within MCUDBHelper.\n",
    "published": "2024-05-14T15:37:03.870",
    "keywords": "remote,unauthenticated,sensitive,leak"
  },
  "CVE-2024-32737": {
    "cvss": 7.5,
    "description": "A sql injection vulnerability exists in CyberPower PowerPanel Enterprise prior to v2.8.3. An unauthenticated remote attacker can leak sensitive information via the \"query_contract_result\" function within MCUDBHelper.\n",
    "published": "2024-05-14T15:37:04.270",
    "keywords": "remote,unauthenticated,sensitive,leak"
  },
  "CVE-2024-32738": {
    "cvss": 7.5,
    "description": "A sql injection vulnerability exists in CyberPower PowerPanel Enterprise prior to v2.8.3. An unauthenticated remote attacker can leak sensitive information via the \"query_ptask_lean\" function within MCUDBHelper.\n",
    "published": "2024-05-14T15:37:04.597",
    "keywords": "remote,unauthenticated,sensitive,leak"
  },
  "CVE-2024-32739": {
    "cvss": 7.5,
    "description": "A sql injection vulnerability exists in CyberPower PowerPanel Enterprise prior to v2.8.3. An unauthenticated remote attacker can leak sensitive information via the \"query_ptask_verbose\" function within MCUDBHelper.\n",
    "published": "2024-05-14T15:37:04.897",
    "keywords": "remote,unauthenticated,sensitive,leak"
  },
  "CVE-2024-32874": {
    "url": "https://github.com/blakeblackshear/frigate/commit/cc851555e4029647986dccc8b8ecf54afee31442",
    "cvss": 6.8,
    "description": "Frigate is a network video recorder (NVR) with realtime local object detection for IP cameras. Below 0.13.2 Release, when uploading a file or retrieving the filename, a user may intentionally use a large Unicode filename which would lead to a application-level denial of service. This is due to no limitation set on the length of the filename and the costy use of the Unicode normalization with the form NFKD under the hood of `secure_filename()`.",
    "published": "2024-05-14T15:37:13.483"
  },
  "CVE-2024-32964": {
    "cvss": 9.0,
    "description": "Lobe Chat is a chatbot framework that supports speech synthesis, multimodal, and extensible Function Call plugin system. Prior to 0.150.6, lobe-chat had an unauthorized Server-Side Request Forgery vulnerability in the /api/proxy endpoint. An attacker can construct malicious requests to cause Server-Side Request Forgery without logging in, attack intranet services, and leak sensitive information.",
    "published": "2024-05-14T15:37:18.180",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-33263": {
    "url": "https://github.com/bellard/quickjs/issues/277",
    "cvss": "-",
    "description": "QuickJS commit 3b45d15 was discovered to contain an Assertion Failure via JS_FreeRuntime(JSRuntime *) at quickjs.c.",
    "published": "2024-05-14T15:37:31.263"
  },
  "CVE-2024-34196": {
    "cvss": "-",
    "description": "Totolink AC1200 Wireless Dual Band Gigabit Router A3002RU_V3 Firmware V3.0.0-B20230809.1615 is vulnerable to Buffer Overflow. The \"boa\" program allows attackers to modify the value of the \"vwlan_idx\" field via \"formMultiAP\". This can lead to a stack overflow through the \"formWlEncrypt\" CGI function by constructing malicious HTTP requests and passing a WLAN SSID value exceeding the expected length, potentially resulting in command execution or denial of service attacks.",
    "published": "2024-05-14T15:38:32.730",
    "keywords": "execution,command"
  },
  "CVE-2024-34199": {
    "cvss": "-",
    "description": "TinyWeb 1.94 and below allows unauthenticated remote attackers to cause a denial of service (Buffer Overflow) when sending excessively large elements in the request line.",
    "published": "2024-05-14T15:38:32.970",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-34338": {
    "cvss": "-",
    "description": "A Blind command injection vulnerability in Tenda O3V2 V1.0.0.12 and earlier allows remote attackers to execute operating system commands via dest parameter in /goform/getTraceroute",
    "published": "2024-05-14T15:38:39.337",
    "keywords": "remote,command"
  },
  "CVE-2024-34354": {
    "url": "https://github.com/criticalmoments/cmsaasstarter/pull/65",
    "cvss": 6.5,
    "description": "CMSaaSStarter is a SaaS template/boilerplate built with SvelteKit, Tailwind, and Supabase. Any forks of the CMSaaSStarter template before commit 7904d416d2c72ec75f42fbf51e9e64fa74062ee6 are impacted. The issue is the user JWT Token is not verified on server session. You should take the patch 7904d416d2c72ec75f42fbf51e9e64fa74062ee6 into your fork.\n",
    "published": "2024-05-14T15:38:44.480"
  },
  "CVE-2024-34359": {
    "cvss": 9.6,
    "description": "llama-cpp-python is the Python bindings for llama.cpp. `llama-cpp-python` depends on class `Llama` in `llama.py` to load `.gguf` llama.cpp or Latency Machine Learning Models. The `__init__` constructor built in the `Llama` takes several parameters to configure the loading and running of the model. Other than `NUMA, LoRa settings`, `loading tokenizers,` and `hardware settings`, `__init__` also loads the `chat template` from targeted `.gguf` 's Metadata and furtherly parses it to `llama_chat_format.Jinja2ChatFormatter.to_chat_handler()` to construct the `self.chat_handler` for this model. Nevertheless, `Jinja2ChatFormatter` parse the `chat template` within the Metadate with sandbox-less `jinja2.Environment`, which is furthermore rendered in `__call__` to construct the `prompt` of interaction. This allows `jinja2` Server Side Template Injection which leads to remote code execution by a carefully constructed payload.",
    "published": "2024-05-14T15:38:45.093",
    "keywords": "remote,execution"
  },
  "CVE-2024-34360": {
    "url": "https://github.com/spacemeshos/go-spacemesh/commit/9aff88d54be809ac43d60e8a8b4d65359c356b87",
    "cvss": 8.2,
    "description": "go-spacemesh is a Go implementation of the Spacemesh protocol full node. Nodes can publish activations transactions (ATXs) which reference the incorrect previous ATX of the Smesher that created the ATX. ATXs are expected to form a single chain from the newest to the first ATX ever published by an identity. Allowing Smeshers to reference an earlier (but not the latest) ATX as previous breaks this protocol rule and can serve as an attack vector where Nodes are rewarded for holding their PoST data for less than one epoch but still being eligible for rewards. This vulnerability is fixed in go-spacemesh 1.5.2-hotfix1 and Spacemesh API 1.37.1.",
    "published": "2024-05-14T15:38:45.830"
  },
  "CVE-2024-34701": {
    "url": "https://github.com/miraheze/mw-config/commit/e5664995fbb8644f9a80b450b4326194f20f9ddc",
    "cvss": 5.9,
    "description": "CreateWiki is Miraheze's MediaWiki extension for requesting & creating wikis. It is possible for users to be considered as the requester of a specific wiki request if their local user ID on any wiki in a wiki farm matches the local ID of the requester at the wiki where the wiki request was made. This allows them to go to that request entry's on Special:RequestWikiQueue on the wiki where their local user ID matches and take any actions that the wiki requester is allowed to take from there.\n\nCommit 02e0f298f8d35155c39aa74193cb7b867432c5b8 fixes the issue. Important note about the fix: This vulnerability has been fixed by disabling access to the REST API and special pages outside of the wiki configured as the \"global wiki\" in `$wgCreateWikiGlobalWiki` in a user's MediaWiki settings.\n\nAs a workaround, it is possible to disable the special pages outside of one's own global wiki by doing something similar to `miraheze/mw-config` commit e5664995fbb8644f9a80b450b4326194f20f9ddc that is adapted to one's own setup. As for the REST API, before the fix, there wasn't any REST endpoint that allowed one to make writes. Regardless, it is possible to also disable it outside of the global wiki by using `$wgCreateWikiDisableRESTAPI` and `$wgConf` in the configuration for one's own wiki farm..",
    "published": "2024-05-14T15:39:28.940"
  },
  "CVE-2024-34749": {
    "cvss": "-",
    "description": "Phormer prior to version 3.35 contains a cross-site scripting vulnerability. If this vulnerability is exploited, a remote unauthenticated attacker may execute an arbitrary script on the web browser of the user.",
    "published": "2024-05-14T15:39:32.140",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-34921": {
    "cvss": "-",
    "description": "TOTOLINK X5000R v9.1.0cu.2350_B20230313 was discovered to contain a command injection via the disconnectVPN function.",
    "published": "2024-05-14T15:39:37.937",
    "keywords": "command,vpn"
  },
  "CVE-2024-35048": {
    "url": "https://github.com/javahuang/surveyking/issues/56",
    "cvss": "-",
    "description": "An issue in SurveyKing v1.3.1 allows attackers to execute a session replay attack after a user changes their password.",
    "published": "2024-05-14T15:39:38.973"
  },
  "CVE-2024-35049": {
    "url": "https://github.com/javahuang/surveyking/issues/55",
    "cvss": "-",
    "description": "SurveyKing v1.3.1 was discovered to keep users' sessions active after logout. Related to an incomplete fix for CVE-2022-25590.",
    "published": "2024-05-14T15:39:39.080"
  },
  "CVE-2024-35050": {
    "url": "https://github.com/javahuang/surveyking/issues/57",
    "cvss": "-",
    "description": "An issue in SurveyKing v1.3.1 allows attackers to escalate privileges via re-using the session ID of a user that was deleted by an Admin.",
    "published": "2024-05-14T15:39:39.180"
  },
  "CVE-2024-35205": {
    "cvss": "-",
    "description": "The WPS Office (aka cn.wps.moffice_eng) application before 17.0.0 for Android fails to properly sanitize file names before processing them through external application interactions, leading to a form of path traversal. This potentially enables any application to dispatch a crafted library file, aiming to overwrite an existing native library utilized by WPS Office. Successful exploitation could result in the execution of arbitrary commands under the guise of WPS Office's application ID.",
    "published": "2024-05-14T15:39:43.030",
    "keywords": "execution,command"
  },
  "CVE-2024-3070": {
    "cvss": 9.8,
    "description": "The Last Viewed Posts by WPBeginner plugin for WordPress is vulnerable to PHP Object Injection in all versions up to, and including, 1.0.0 via deserialization of untrusted input from the LastViewedPosts Cookie. This makes it possible for unauthenticated attackers to inject a PHP Object. No known POP chain is present in the vulnerable plugin. If a POP chain is present via an additional plugin or theme installed on the target system, it could allow the attacker to delete arbitrary files, retrieve sensitive data, or execute code.",
    "published": "2024-05-14T15:39:52.800",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-3263": {
    "cvss": 9.8,
    "description": "YMS VIS Pro is an information system for veterinary and food administration, veterinarians and farm. Due to a combination of improper method for system credentials generation and weak password policy, passwords can be easily guessed and enumerated through brute force attacks. Successful attacks can lead to unauthorised access and execution of operations based on assigned user permissions. This vulnerability affects VIS Pro in versions <= 3.3.0.6. This vulnerability has been mitigated by changes in authentication mechanisms and implementation of additional authentication layer and strong password policies.\n\n\n\n\n\n\n\n",
    "published": "2024-05-14T15:40:35.000",
    "keywords": "execution,authentication"
  },
  "CVE-2024-3792": {
    "cvss": 4.8,
    "description": "Vulnerability in WBSAirback 21.02.04, which consists of a stored Cross-Site Scripting (XSS) through /admin/DeviceReplication, execution range field, all parameters. Exploitation of this vulnerability could allow a remote user to send a specially crafted URL to the victim and steal their session data.",
    "published": "2024-05-14T15:42:18.567",
    "keywords": "remote,execution"
  },
  "CVE-2024-3806": {
    "cvss": 9.8,
    "description": "The Porto theme for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 7.1.0 via the 'porto_ajax_posts' function. This makes it possible for unauthenticated attackers to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where php file type can be uploaded and included.",
    "published": "2024-05-14T15:42:22.107",
    "keywords": "execution,unauthenticated,sensitive,bypass"
  },
  "CVE-2024-3807": {
    "cvss": 8.8,
    "description": "The Porto theme for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 7.1.0 via 'porto_page_header_shortcode_type', 'slideshow_type' and 'post_layout' post meta. This makes it possible for authenticated attackers, with contributor-level and above permissions, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where php file type can be uploaded and included. This was partially patched in version 7.1.0 and fully patched in version 7.1.1.",
    "published": "2024-05-14T15:42:22.653",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-3808": {
    "cvss": 8.8,
    "description": "The Porto Theme - Functionality plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 3.1.0 via the 'porto_portfolios' shortcode 'portfolio_layout' attribute. This makes it possible for authenticated attackers, with contributor-level and above permissions, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where php file type can be uploaded and included.",
    "published": "2024-05-14T15:42:22.943",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-3809": {
    "cvss": 8.8,
    "description": "The Porto Theme - Functionality plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 3.0.9 via the 'slideshow_type' post meta. This makes it possible for authenticated attackers, with contributor-level and above permissions, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where php file type can be uploaded and included.",
    "published": "2024-05-14T15:42:23.270",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-4038": {
    "cvss": 6.5,
    "description": "The The Back In Stock Notifier for WooCommerce | WooCommerce Waitlist Pro plugin for WordPress for WordPress is vulnerable to arbitrary shortcode execution in all versions up to, and including, 5.3.1. This is due to the plugin for WordPress allowing users to execute an action that does not properly validate a value before running do_shortcode. This makes it possible for unauthenticated attackers to execute arbitrary shortcodes.",
    "published": "2024-05-14T15:42:44.400",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-4039": {
    "cvss": 6.5,
    "description": "The The Orders Tracking for WooCommerce plugin for WordPress for WordPress is vulnerable to arbitrary shortcode execution in all versions up to, and including, 1.2.10. This is due to the plugin allowing users to execute an action that does not properly validate a value before running do_shortcode. This makes it possible for unauthenticated attackers to execute arbitrary shortcodes. A partial patch was released in 1.2.10, and a complete patch was released in 1.2.11.",
    "published": "2024-05-14T15:42:44.707",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-4044": {
    "cvss": 7.8,
    "description": "A deserialization of untrusted data vulnerability exists in common code used by FlexLogger and InstrumentStudio that may result in remote code execution.  Successful exploitation requires an attacker to get a user to open a specially crafted project file.  This vulnerability affects NI FlexLogger 2024 Q1 and prior versions as well as NI InstrumentStudio 2024 Q1 and prior versions.\n",
    "published": "2024-05-14T15:42:45.640",
    "keywords": "remote,execution"
  },
  "CVE-2024-4067": {
    "url": "https://github.com/micromatch/micromatch/pull/247",
    "cvss": 7.5,
    "description": "The NPM package `micromatch` is vulnerable to Regular Expression Denial of Service (ReDoS). The vulnerability occurs in `micromatch.braces()` in `index.js` because the pattern `.*` will greedily match anything. By passing a malicious payload, the pattern matching will keep backtracking to the input while it doesn't find the closing bracket. As the input size increases, the consumption time will also increase until it causes the application to hang or slow down. There was a merged fix but further testing shows the issue persists. This issue should be mitigated by using a safe pattern that won't start backtracking the regular expression due to greedy matching.\n",
    "published": "2024-05-14T15:42:47.947"
  },
  "CVE-2024-4068": {
    "url": "https://github.com/micromatch/braces/issues/35",
    "cvss": 7.5,
    "description": "The NPM package `braces` fails to limit the number of characters it can handle, which could lead to Memory Exhaustion. In `lib/parse.js,` if a malicious user sends \"imbalanced braces\" as input, the parsing will enter a loop, which will cause the program to start allocating heap memory without freeing it at any moment of the loop. Eventually, the JavaScript heap limit is reached, and the program will crash.\n",
    "published": "2024-05-14T15:42:48.660"
  },
  "CVE-2024-4129": {
    "cvss": 8.8,
    "description": "Improper Authentication vulnerability in Snow Software AB Snow License Manager on Windows allows a networked attacker to perform an Authentication Bypass if Active Directory Authentication is enabled.This issue affects Snow License Manager: from 9.33.2 through 9.34.0.\n\n",
    "published": "2024-05-14T15:42:57.983",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-4213": {
    "cvss": 5.3,
    "description": "The Shopping Cart & eCommerce Store plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 5.6.4 via the order report functionality. This makes it possible for unauthenticated attackers to extract sensitive data including order details such as payment details, addresses and other PII.",
    "published": "2024-05-14T15:43:06.810",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-4397": {
    "cvss": 8.8,
    "description": "The LearnPress – WordPress LMS Plugin plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the 'save_post_materials' function in versions up to, and including, 4.2.6.5. This makes it possible for authenticated attackers, with Instructor-level permissions and above, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-05-14T15:43:31.793",
    "keywords": "remote,execution"
  },
  "CVE-2024-4413": {
    "cvss": 9.8,
    "description": "The Hotel Booking Lite plugin for WordPress is vulnerable to PHP Object Injection in all versions up to, and including, 4.11.1 via deserialization of untrusted input. This makes it possible for unauthenticated attackers to inject a PHP Object. No known POP chain is present in the vulnerable plugin. If a POP chain is present via an additional plugin or theme installed on the target system, it could allow the attacker to delete arbitrary files, retrieve sensitive data, or execute code.",
    "published": "2024-05-14T15:43:36.710",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-4423": {
    "cvss": "-",
    "description": "The access control in CemiPark software does not properly validate user-entered data, which allows the authentication bypass. An attacker who has network access to the login panel can log in with administrator rights to the application.This issue affects CemiPark software: 4.5, 4.7, 5.03 and potentially others. The vendor refused to provide the specific range of affected products.\n\n",
    "published": "2024-05-14T15:43:40.150",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-4434": {
    "cvss": 9.8,
    "description": "The LearnPress – WordPress LMS Plugin plugin for WordPress is vulnerable to time-based SQL Injection via the ‘term_id’ parameter in versions up to, and including, 4.2.6.5 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-05-14T15:43:44.537",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-4441": {
    "cvss": 8.1,
    "description": "The XML Sitemap & Google News plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 5.4.8 via the 'feed' parameter. This makes it possible for unauthenticated attackers to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-05-14T15:43:46.220",
    "keywords": "execution,unauthenticated,sensitive,bypass"
  },
  "CVE-2024-4444": {
    "cvss": 5.3,
    "description": "The LearnPress – WordPress LMS Plugin plugin for WordPress is vulnerable to bypass to user registration in versions up to, and including, 4.2.6.5. This is due to missing checks in the 'create_account' function in the checkout. This makes it possible for unauthenticated attackers to register as the default role on the site, even if registration is disabled.",
    "published": "2024-05-14T15:43:46.507",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2024-4560": {
    "cvss": 9.8,
    "description": "The Kognetiks Chatbot for WordPress plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the chatbot_chatgpt_upload_file_to_assistant function in all versions up to, and including, 1.9.9. This makes it possible for unauthenticated attackers, with to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-05-14T15:44:04.037",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-4605": {
    "cvss": 8.8,
    "description": "The Breakdance plugin for WordPress is vulnerable to Remote Code Execution in all versions up to, and including, 1.7.1 via post meta data. This is due to the plugin storing custom data in metadata without an underscore prefix. This makes it possible for lower privileged users, such as contributors, to edit this data via UI. As a result they can escalate their privileges or execute arbitrary code.",
    "published": "2024-05-14T15:44:11.683",
    "keywords": "remote,execution"
  },
  "CVE-2024-4701": {
    "cvss": 9.9,
    "description": "A path traversal issue potentially leading to remote code execution in Genie for all versions prior to 4.3.18",
    "published": "2024-05-14T15:44:27.123",
    "keywords": "remote,execution"
  },
  "CVE-2024-4813": {
    "cvss": 6.3,
    "description": "A vulnerability classified as critical has been found in Ruijie RG-UAC up to 20240506. Affected is an unknown function of the file /view/networkConfig/physicalInterface/interface_commit.php. The manipulation of the argument name leads to os command injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. It is recommended to apply a patch to fix this issue. VDB-263934 is the identifier assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-05-14T15:45:02.627",
    "keywords": "remote,command"
  },
  "CVE-2024-4814": {
    "cvss": 6.3,
    "description": "A vulnerability classified as critical was found in Ruijie RG-UAC up to 20240506. Affected by this vulnerability is an unknown functionality of the file /view/networkConfig/RouteConfig/StaticRoute/static_route_edit_commit.php. The manipulation of the argument oldipmask/oldgateway leads to os command injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-263935. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-05-14T15:45:03.913",
    "keywords": "remote,command"
  },
  "CVE-2024-4815": {
    "cvss": 6.3,
    "description": "A vulnerability, which was classified as critical, has been found in Ruijie RG-UAC up to 20240506. Affected by this issue is some unknown functionality of the file /view/bugSolve/viewData/detail.php. The manipulation of the argument filename leads to os command injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-263936. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-05-14T15:45:05.653",
    "keywords": "remote,command"
  },
  "CVE-2024-4816": {
    "cvss": 6.3,
    "description": "A vulnerability, which was classified as critical, was found in Ruijie RG-UAC up to 20240506. This affects an unknown part of the file /view/networkConfig/GRE/gre_add_commit.php. The manipulation of the argument name/remote/local/IP leads to os command injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-263937 was assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-05-14T15:45:07.320",
    "keywords": "remote,command"
  },
  "CVE-2024-25966": {
    "cvss": 5.3,
    "description": "Dell PowerScale OneFS versions 8.2.x through 9.7.0.2 contains an improper handling of unexpected data type vulnerability. A remote unauthenticated attacker could potentially exploit this vulnerability, leading to denial of service.",
    "published": "2024-05-14T16:16:15.943",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-25968": {
    "cvss": 5.9,
    "description": "Dell PowerScale OneFS versions 8.2.x through 9.7.0.2 contains a use of a broken or risky cryptographic algorithm vulnerability. A remote unauthenticated attacker could potentially exploit this vulnerability, leading to information disclosure.",
    "published": "2024-05-14T16:16:18.523",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-27939": {
    "cvss": 9.8,
    "description": "A vulnerability has been identified in RUGGEDCOM CROSSBOW (All versions < V5.5). The affected systems allow the upload of arbitrary files of any unauthenticated user. An attacker could leverage this vulnerability and achieve arbitrary code execution with system privileges.",
    "published": "2024-05-14T16:16:23.443",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-27943": {
    "cvss": 7.2,
    "description": "A vulnerability has been identified in RUGGEDCOM CROSSBOW (All versions < V5.5). The affected systems allow a privileged user to upload generic files to the root installation directory of the system. By replacing specific files, an attacker could tamper specific files or even achieve remote code execution.",
    "published": "2024-05-14T16:16:28.537",
    "keywords": "remote,execution"
  },
  "CVE-2024-27944": {
    "cvss": 7.2,
    "description": "A vulnerability has been identified in RUGGEDCOM CROSSBOW (All versions < V5.5). The affected systems allow a privileged user to upload firmware files to the root installation directory of the system. By replacing specific files, an attacker could tamper specific files or even achieve remote code execution.",
    "published": "2024-05-14T16:16:31.260",
    "keywords": "remote,execution"
  },
  "CVE-2024-27945": {
    "cvss": 7.2,
    "description": "A vulnerability has been identified in RUGGEDCOM CROSSBOW (All versions < V5.5). The bulk import feature of the affected systems allow a privileged user to upload files to the root installation directory of the system. By replacing specific files, an attacker could tamper specific files or even achieve remote code execution.",
    "published": "2024-05-14T16:16:32.503",
    "keywords": "remote,execution"
  },
  "CVE-2024-28134": {
    "cvss": 7.0,
    "description": "\n\t\n\t\t\n\t\t\n\t\n\t\n\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\t\t\n\n\t\n\t\t\n\t\t\n\t\n\t\n\t\t\n\n\n\t\t\t\n\t\t\t\t\n\t\t\t\t\tAn unauthenticated remote attacker can extract a session token with a MitM attack and gain web-based\nmanagement access with the privileges of the currently logged in user due to cleartext transmission of sensitive information. No additional user interaction is required. The access is limited as only non-sensitive information can be obtained but the availability can be seriously affected. \n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\n\n\n\t\t\n\n\n\t\n",
    "published": "2024-05-14T16:16:37.623",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-28135": {
    "cvss": 5.0,
    "description": "\n\t\n\t\t\n\t\t\n\t\n\t\n\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\t\t\n\n\t\n\t\t\n\t\t\n\t\n\t\n\t\t\n\n\n\t\t\t\n\t\t\t\t\n\t\t\t\t\tA low privileged remote attacker can use a command injection vulnerability in the API which performs\nremote code execution as the user-app user due to improper input validation. The confidentiality is partly affected.\n\n\n\n\n\n\n\n\n\n\t\t\t\t\n\n\n\t\t\t\n\n\n\t\t\n\n\n\t\n",
    "published": "2024-05-14T16:16:39.033",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-28136": {
    "cvss": 7.8,
    "description": "\n\t\n\t\t\n\t\t\n\t\n\t\n\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\t\t\n\n\t\n\t\t\n\t\t\n\t\n\t\n\t\t\n\n\n\t\t\t\n\t\t\t\t\n\t\t\t\t\tA local attacker with low privileges can use a command injection vulnerability to gain root\nprivileges due to improper input validation using the OCPP Remote service.\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\n\n\n\t\t\n\n\n\t\n",
    "published": "2024-05-14T16:16:40.613",
    "keywords": "remote,command"
  },
  "CVE-2024-30206": {
    "cvss": 8.8,
    "description": "A vulnerability has been identified in SIMATIC RTLS Locating Manager (6GT2780-0DA00) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-0DA10) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-0DA20) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-0DA30) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-1EA10) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-1EA20) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-1EA30) (All versions < V3.0.1.1). Affected SIMATIC RTLS Locating Manager Clients do not properly check the integrity of update files. This could allow an unauthenticated remote attacker to alter update files in transit and trick an authorized user into installing malicious code. \r\nA successful exploit requires the attacker to be able to modify the communication between server and client on the network.",
    "published": "2024-05-14T16:16:45.767",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-30207": {
    "cvss": 10.0,
    "description": "A vulnerability has been identified in SIMATIC RTLS Locating Manager (6GT2780-0DA00) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-0DA10) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-0DA20) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-0DA30) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-1EA10) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-1EA20) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-1EA30) (All versions < V3.0.1.1). The affected systems use symmetric cryptography with a hard-coded key to protect the communication between client and server. This could allow an unauthenticated remote attacker to compromise confidentiality and integrity of the communication and, subsequently, availability of the system.\r\nA successful exploit requires the attacker to gain knowledge of the hard-coded key and to be able to intercept the communication between client and server on the network.",
    "published": "2024-05-14T16:16:47.020",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-31485": {
    "cvss": 7.2,
    "description": "A vulnerability has been identified in CPCI85 Central Processing/Communication (All versions < V5.30), SICORE Base system (All versions < V1.3.0). The web interface of affected devices is vulnerable to command injection due to missing server side input sanitation. This could allow an authenticated privileged remote attacker to execute arbitrary code with root privileges.",
    "published": "2024-05-14T16:16:51.033",
    "keywords": "remote,command"
  },
  "CVE-2024-32349": {
    "cvss": "-",
    "description": "TOTOLINK X5000R V9.1.0cu.2350_B20230313 was discovered to contain an authenticated remote command execution (RCE) vulnerability via the \"mtu\" parameters in the \"cstecgi.cgi\" binary.",
    "published": "2024-05-14T16:17:02.243",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-32350": {
    "cvss": "-",
    "description": "TOTOLINK X5000R V9.1.0cu.2350_B20230313 was discovered to contain an authenticated remote command execution (RCE) vulnerability via the \"ipsecPsk\" parameter in the \"cstecgi.cgi\" binary.",
    "published": "2024-05-14T16:17:02.543",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-32351": {
    "cvss": "-",
    "description": "TOTOLINK X5000R V9.1.0cu.2350_B20230313 was discovered to contain an authenticated remote command execution (RCE) vulnerability via the \"mru\" parameter in the \"cstecgi.cgi\" binary.",
    "published": "2024-05-14T16:17:02.800",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-32352": {
    "cvss": "-",
    "description": "TOTOLINK X5000R V9.1.0cu.2350_B20230313 was discovered to contain an authenticated remote command execution (RCE) vulnerability via the \"ipsecL2tpEnable\" parameter in the \"cstecgi.cgi\" binary.",
    "published": "2024-05-14T16:17:03.113",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-32733": {
    "cvss": 6.1,
    "description": "\nDue to missing input validation and output encoding of untrusted data, SAP NetWeaver Application Server ABAP and ABAP Platform allows an unauthenticated attacker to inject malicious JavaScript code into the dynamically crafted web page. On successful exploitation the attacker can access or modify sensitive information with no impact on availability of the application\n\n",
    "published": "2024-05-14T16:17:10.490",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-32977": {
    "cvss": 7.1,
    "description": "OctoPrint provides a web interface for controlling consumer 3D printers. OctoPrint versions up until and including 1.10.0 contain a vulnerability that allows an unauthenticated attacker to completely bypass the authentication if the `autologinLocal` option is enabled within `config.yaml`, even if they come from networks that are not configured as `localNetworks`, spoofing their IP via the `X-Forwarded-For` header. If autologin is not enabled, this vulnerability does not have any impact. The vulnerability has been patched in version 1.10.1. Until the patch has been applied, OctoPrint administrators who have autologin enabled on their instances should disable it and/or to make the instance inaccessible from potentially hostile networks like the internet.",
    "published": "2024-05-14T16:17:12.590",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-33494": {
    "cvss": 6.5,
    "description": "A vulnerability has been identified in SIMATIC RTLS Locating Manager (6GT2780-0DA00) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-0DA10) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-0DA20) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-0DA30) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-1EA10) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-1EA20) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-1EA30) (All versions < V3.0.1.1). Affected components do not properly authenticate heartbeat messages. This could allow an unauthenticated remote attacker to affected the availability of secondary RTLS systems configured using a TeeRevProxy service and potentially cause loss of data generated during the time the attack is ongoing.",
    "published": "2024-05-14T16:17:17.983",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-33495": {
    "cvss": 6.5,
    "description": "A vulnerability has been identified in SIMATIC RTLS Locating Manager (6GT2780-0DA00) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-0DA10) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-0DA20) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-0DA30) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-1EA10) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-1EA20) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-1EA30) (All versions < V3.0.1.1). The affected application does not properly limit the size of specific logs. This could allow an unauthenticated remote attacker to exhaust system resources by creating a great number of log entries which could potentially lead to a denial of service condition. A successful exploitation requires the attacker to have access to specific SIMATIC RTLS Locating Manager Clients in the deployment.",
    "published": "2024-05-14T16:17:18.490",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-33498": {
    "cvss": 5.3,
    "description": "A vulnerability has been identified in SIMATIC RTLS Locating Manager (6GT2780-0DA00) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-0DA10) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-0DA20) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-0DA30) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-1EA10) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-1EA20) (All versions < V3.0.1.1), SIMATIC RTLS Locating Manager (6GT2780-1EA30) (All versions < V3.0.1.1). Affected applications do not properly release memory that is allocated when handling specifically crafted incoming packets. This could allow an unauthenticated remote attacker to cause a denial of service condition by crashing the service when it runs out of memory. The service is restarted automatically after a short time.",
    "published": "2024-05-14T16:17:19.793",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-34713": {
    "url": "https://github.com/cea-hpc/sshproxy/commit/f7eabd05d5f0f951e160293692327cad9a7d9580",
    "cvss": 3.5,
    "description": "sshproxy is used on a gateway to transparently proxy a user SSH connection on the gateway to an internal host via SSH. Prior to version 1.6.3, any user authorized to connect to a ssh server using `sshproxy` can inject options to the `ssh` command executed by `sshproxy`. All versions of `sshproxy` are impacted. The problem is patched starting in version 1.6.3. The only workaround is to use the `force_command` option in `sshproxy.yaml`, but it's rarely relevant.",
    "published": "2024-05-14T16:17:27.147"
  },
  "CVE-2024-34714": {
    "url": "https://github.com/hoppscotch/hoppscotch-extension/commit/d4e8e4830326f46ba17acd1307977ecd32a85b58",
    "cvss": 7.6,
    "description": "The Hoppscotch Browser Extension is a browser extension for Hoppscotch, a community-driven end-to-end open-source API development ecosystem. Due to an oversight during a change made to the extension in the commit d4e8e4830326f46ba17acd1307977ecd32a85b58, a critical check for the origin list was missed and allowed for messages to be sent to the extension which the extension gladly processed and responded back with the results of, while this wasn't supposed to happen and be blocked by the origin not being present in the origin list.\n\nThis vulnerability exposes Hoppscotch Extension users to sites which call into Hoppscotch Extension APIs internally. This fundamentally allows any site running on the browser with the extension installed to bypass CORS restrictions if the user is running extensions with the given version. This security hole was patched in the commit 7e364b928ab722dc682d0fcad713a96cc38477d6 which was released along with the extension version `0.35`. As a workaround, Chrome users can use the Extensions Settings to disable the extension access to only the origins that you want. Firefox doesn't have an alternative to upgrading to a fixed version.",
    "published": "2024-05-14T16:17:27.623"
  },
  "CVE-2024-4144": {
    "cvss": 6.5,
    "description": "The Simple Basic Contact Form plugin for WordPress for WordPress is vulnerable to arbitrary shortcode execution in all versions up to, and including, 20240502. This allows unauthenticated attackers to execute arbitrary shortcodes. The severity and exploitability depends on the functionality of other plugins installed in the environment.",
    "published": "2024-05-14T16:17:33.483",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-4871": {
    "cvss": 6.8,
    "description": "A vulnerability was found in Satellite. When running a remote execution job on a host, the host's SSH key is not being checked. When the key changes, the Satellite still connects it because it uses \"-o StrictHostKeyChecking=no\". This flaw can lead to a man-in-the-middle attack (MITM), denial of service, leaking of secrets the remote execution job contains, or other issues that may arise from the attacker's ability to forge an SSH key. This issue does not directly allow unauthorized remote execution on the Satellite, although it can leak secrets that may lead to it.",
    "published": "2024-05-14T16:17:37.163",
    "keywords": "remote,execution,leak"
  },
  "CVE-2024-23105": {
    "cvss": 7.5,
    "description": "A Use Of Less Trusted Source [CWE-348] vulnerability in Fortinet FortiPortal version 7.0.0 through 7.0.6 and version 7.2.0 through 7.2.1 allows an unauthenticated attack to bypass IP protection through crafted HTTP or HTTPS packets.",
    "published": "2024-05-14T17:15:38.967",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2024-29997": {
    "cvss": 6.8,
    "description": "Windows Mobile Broadband Driver Remote Code Execution Vulnerability",
    "published": "2024-05-14T17:16:21.450",
    "keywords": "remote,execution"
  },
  "CVE-2024-29998": {
    "cvss": 6.8,
    "description": "Windows Mobile Broadband Driver Remote Code Execution Vulnerability",
    "published": "2024-05-14T17:16:23.233",
    "keywords": "remote,execution"
  },
  "CVE-2024-29999": {
    "cvss": 6.8,
    "description": "Windows Mobile Broadband Driver Remote Code Execution Vulnerability",
    "published": "2024-05-14T17:16:25.200",
    "keywords": "remote,execution"
  },
  "CVE-2024-30000": {
    "cvss": 6.8,
    "description": "Windows Mobile Broadband Driver Remote Code Execution Vulnerability",
    "published": "2024-05-14T17:16:26.977",
    "keywords": "remote,execution"
  },
  "CVE-2024-30001": {
    "cvss": 6.8,
    "description": "Windows Mobile Broadband Driver Remote Code Execution Vulnerability",
    "published": "2024-05-14T17:16:28.200",
    "keywords": "remote,execution"
  },
  "CVE-2024-30002": {
    "cvss": 6.8,
    "description": "Windows Mobile Broadband Driver Remote Code Execution Vulnerability",
    "published": "2024-05-14T17:16:29.683",
    "keywords": "remote,execution"
  },
  "CVE-2024-30003": {
    "cvss": 6.8,
    "description": "Windows Mobile Broadband Driver Remote Code Execution Vulnerability",
    "published": "2024-05-14T17:16:31.567",
    "keywords": "remote,execution"
  },
  "CVE-2024-30004": {
    "cvss": 6.8,
    "description": "Windows Mobile Broadband Driver Remote Code Execution Vulnerability",
    "published": "2024-05-14T17:16:32.987",
    "keywords": "remote,execution"
  },
  "CVE-2024-30005": {
    "cvss": 6.8,
    "description": "Windows Mobile Broadband Driver Remote Code Execution Vulnerability",
    "published": "2024-05-14T17:16:34.533",
    "keywords": "remote,execution"
  },
  "CVE-2024-30006": {
    "cvss": 8.8,
    "description": "Microsoft WDAC OLE DB provider for SQL Server Remote Code Execution Vulnerability",
    "published": "2024-05-14T17:16:35.757",
    "keywords": "remote,execution"
  },
  "CVE-2024-30009": {
    "cvss": 8.8,
    "description": "Windows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability",
    "published": "2024-05-14T17:16:39.597",
    "keywords": "remote,execution"
  },
  "CVE-2024-30010": {
    "cvss": 8.8,
    "description": "Windows Hyper-V Remote Code Execution Vulnerability",
    "published": "2024-05-14T17:16:40.937",
    "keywords": "remote,execution"
  },
  "CVE-2024-30012": {
    "cvss": 6.8,
    "description": "Windows Mobile Broadband Driver Remote Code Execution Vulnerability",
    "published": "2024-05-14T17:16:43.317",
    "keywords": "remote,execution"
  },
  "CVE-2024-30014": {
    "cvss": 7.5,
    "description": "Windows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability",
    "published": "2024-05-14T17:16:44.540",
    "keywords": "remote,execution"
  },
  "CVE-2024-30015": {
    "cvss": 7.5,
    "description": "Windows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability",
    "published": "2024-05-14T17:16:45.747",
    "keywords": "remote,execution"
  },
  "CVE-2024-30017": {
    "cvss": 8.8,
    "description": "Windows Hyper-V Remote Code Execution Vulnerability",
    "published": "2024-05-14T17:16:48.240",
    "keywords": "remote,execution"
  },
  "CVE-2024-30020": {
    "cvss": 8.1,
    "description": "Windows Cryptographic Services Remote Code Execution Vulnerability",
    "published": "2024-05-14T17:16:52.823",
    "keywords": "remote,execution"
  },
  "CVE-2024-30021": {
    "cvss": 6.8,
    "description": "Windows Mobile Broadband Driver Remote Code Execution Vulnerability",
    "published": "2024-05-14T17:16:54.090",
    "keywords": "remote,execution"
  },
  "CVE-2024-30022": {
    "cvss": 7.5,
    "description": "Windows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability",
    "published": "2024-05-14T17:16:55.400",
    "keywords": "remote,execution"
  },
  "CVE-2024-30023": {
    "cvss": 7.5,
    "description": "Windows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability",
    "published": "2024-05-14T17:16:56.520",
    "keywords": "remote,execution"
  },
  "CVE-2024-30024": {
    "cvss": 7.5,
    "description": "Windows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability",
    "published": "2024-05-14T17:16:57.523",
    "keywords": "remote,execution"
  },
  "CVE-2024-30029": {
    "cvss": 7.5,
    "description": "Windows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability",
    "published": "2024-05-14T17:17:01.497",
    "keywords": "remote,execution"
  },
  "CVE-2024-30042": {
    "cvss": 7.8,
    "description": "Microsoft Excel Remote Code Execution Vulnerability",
    "published": "2024-05-14T17:17:14.283",
    "keywords": "remote,execution"
  },
  "CVE-2024-30044": {
    "cvss": 7.2,
    "description": "Microsoft SharePoint Server Remote Code Execution Vulnerability",
    "published": "2024-05-14T17:17:16.107",
    "keywords": "remote,execution"
  },
  "CVE-2024-30045": {
    "cvss": 6.3,
    "description": ".NET and Visual Studio Remote Code Execution Vulnerability",
    "published": "2024-05-14T17:17:17.023",
    "keywords": "remote,execution"
  },
  "CVE-2024-3676": {
    "cvss": 7.5,
    "description": "The Proofpoint Encryption endpoint of Proofpoint Enterprise Protection contains an Improper Input Validation vulnerability that allows an unauthenticated remote attacker with a specially crafted HTTP request to create additional Encryption user accounts under the attacker's control.  These accounts are able to send spoofed email to any users within the domains configured by the Administrator.",
    "published": "2024-05-14T19:15:12.970",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-31556": {
    "url": "https://github.com/reportico-web/reportico/issues/53",
    "cvss": "-",
    "description": "An issue in Reportico Web before v.8.1.0 allows a local attacker to execute arbitrary code and obtain sensitive information via the sessionid function.",
    "published": "2024-05-14T21:15:12.060"
  },
  "CVE-2024-31466": {
    "cvss": 9.8,
    "description": "There are buffer overflow vulnerabilities in the underlying CLI service that could lead to unauthenticated remote code execution by sending specially crafted packets destined to the PAPI (Aruba's Access Point management protocol) UDP port (8211). Successful exploitation of these vulnerabilities result in the ability to execute arbitrary code as a privileged user on the underlying operating system.\n\n",
    "published": "2024-05-14T22:15:09.777",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-31467": {
    "cvss": 9.8,
    "description": "There are buffer overflow vulnerabilities in the underlying CLI service that could lead to unauthenticated remote code execution by sending specially crafted packets destined to the PAPI (Aruba's Access Point management protocol) UDP port (8211). Successful exploitation of these vulnerabilities result in the ability to execute arbitrary code as a privileged user on the underlying operating system.\n\n",
    "published": "2024-05-14T23:15:08.250",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-31468": {
    "cvss": 9.8,
    "description": "There are buffer overflow vulnerabilities in the underlying Central Communications service that could lead to unauthenticated remote code execution by sending specially crafted packets destined to the PAPI (Aruba's Access Point management protocol) UDP port (8211). Successful exploitation of these vulnerabilities result in the ability to execute arbitrary code as a privileged user on the underlying operating system.\n\n \n\n",
    "published": "2024-05-14T23:15:08.870",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-31469": {
    "cvss": 9.8,
    "description": "There are buffer overflow vulnerabilities in the underlying Central Communications service that could lead to unauthenticated remote code execution by sending specially crafted packets destined to the PAPI (Aruba's Access Point management protocol) UDP port (8211). Successful exploitation of these vulnerabilities result in the ability to execute arbitrary code as a privileged user on the underlying operating system.\n\n \n\n",
    "published": "2024-05-14T23:15:09.153",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-31470": {
    "cvss": 9.8,
    "description": "There is a buffer overflow vulnerability in the underlying SAE (Simultaneous Authentication of Equals) service that could lead to unauthenticated remote code execution by sending specially crafted packets destined to the PAPI (Aruba's Access Point management protocol) UDP port (8211). Successful exploitation of this vulnerability results in the ability to execute arbitrary code as a privileged user on the underlying operating system.\n\n",
    "published": "2024-05-14T23:15:09.443",
    "keywords": "remote,execution,unauthenticated,authentication"
  },
  "CVE-2024-31471": {
    "cvss": 9.8,
    "description": "There is a command injection vulnerability in the underlying Central Communications service that could lead to unauthenticated remote code execution by sending specially crafted packets destined to the PAPI (Aruba's Access Point management protocol) UDP port (8211). Successful exploitation of this vulnerability results in the ability to execute arbitrary code as a privileged user on the underlying operating system.\n\n",
    "published": "2024-05-14T23:15:09.753",
    "keywords": "remote,execution,unauthenticated,command"
  },
  "CVE-2024-31472": {
    "cvss": 9.8,
    "description": "There are command injection vulnerabilities in the underlying Soft AP Daemon service that could lead to unauthenticated remote code execution by sending specially crafted packets destined to the PAPI (Aruba's Access Point management protocol) UDP port (8211). Successful exploitation of these vulnerabilities result in the ability to execute arbitrary code as a privileged user on the underlying operating system.\n\n",
    "published": "2024-05-14T23:15:10.020",
    "keywords": "remote,execution,unauthenticated,command"
  },
  "CVE-2024-31473": {
    "cvss": 9.8,
    "description": "There is a command injection vulnerability in the underlying deauthentication service that could lead to unauthenticated remote code execution by sending specially crafted packets destined to the PAPI (Aruba's Access Point management protocol) UDP port (8211). Successful exploitation of this vulnerability results in the ability to execute arbitrary code as a privileged user on the underlying operating system.\n\n",
    "published": "2024-05-14T23:15:10.290",
    "keywords": "remote,execution,unauthenticated,authentication,command"
  },
  "CVE-2024-0437": {
    "cvss": 4.3,
    "description": "The Password Protected – Ultimate Plugin to Password Protect Your WordPress Content with Ease plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 2.6.6 via the API. This makes it possible for authenticated attackers, with subscriber access or higher, to extract post titles and content, thus bypassing the plugin's password protection.",
    "published": "2024-05-15T00:15:08.320",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-3744": {
    "url": "https://github.com/kubernetes/kubernetes/issues/124759",
    "cvss": 6.5,
    "description": "A security issue was discovered in azure-file-csi-driver where an actor with access to the driver logs could observe service account tokens. These tokens could then potentially be exchanged with external cloud providers to access secrets stored in cloud vault solutions. Tokens are only logged when TokenRequests is configured in the CSIDriver object and the driver is set to run at log level 2 or greater via the -v flag.\n\n",
    "published": "2024-05-15T01:15:07.843"
  },
  "CVE-2024-4893": {
    "cvss": 9.8,
    "description": "DigiWin EasyFlow .NET lacks validation for certain input parameters, allowing remote attackers to inject arbitrary SQL commands. This vulnerability enables unauthorized access to read, modify, and delete database records, as well as execute system commands.",
    "published": "2024-05-15T03:15:14.493",
    "keywords": "remote,command"
  },
  "CVE-2024-4894": {
    "cvss": 5.3,
    "description": "ITPison OMICARD EDM  fails to properly filter specific URL parameter, allowing unauthenticated remote attackers to modify the parameters and conduct Server-Side Request Forgery (SSRF) attacks. This vulnerability enables attackers to probe internal network information.",
    "published": "2024-05-15T03:15:14.887",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-30311": {
    "cvss": 5.5,
    "description": "Acrobat Reader versions 20.005.30574, 24.002.20736 and earlier Answer: are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-05-15T10:15:10.640",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-30312": {
    "cvss": 5.5,
    "description": "Acrobat Reader versions 20.005.30574, 24.002.20736 and earlier Answer: are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-05-15T10:15:11.087",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-34101": {
    "cvss": 5.5,
    "description": "Acrobat Reader versions 20.005.30574, 24.002.20736 and earlier Answer: are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-05-15T10:15:14.827",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-4670": {
    "cvss": 8.8,
    "description": "The All-in-One Video Gallery plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 3.6.5 via the aiovg_search_form shortcode. This makes it possible for authenticated attackers, with contributor-level access and above, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-05-15T13:15:26.503",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-3319": {
    "cvss": 9.1,
    "description": "An issue was identified in the Identity Security Cloud (ISC) Transform preview and IdentityProfile preview API endpoints that allowed an authenticated administrator to execute user-defined templates as part of attribute transforms which could allow remote code execution on the host.",
    "published": "2024-05-15T16:15:11.170",
    "keywords": "remote,execution"
  },
  "CVE-2024-3483": {
    "cvss": 7.8,
    "description": "Remote Code\nExecution has been discovered in\nOpenText™ iManager 3.2.6.0200. The vulnerability can\ntrigger command injection and insecure deserialization issues.\n\n",
    "published": "2024-05-15T17:15:12.943",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-3486": {
    "cvss": 7.8,
    "description": "XML External Entity injection vulnerability found in OpenText™ iManager 3.2.6.0200. This could lead to information disclosure and remote code execution.\n\n",
    "published": "2024-05-15T17:15:13.773",
    "keywords": "remote,execution"
  },
  "CVE-2024-3487": {
    "cvss": 3.5,
    "description": "Broken Authentication vulnerability discovered in OpenText™ iManager 3.2.6.0200. This\nvulnerability allows an attacker to manipulate certain parameters to bypass\nauthentication.\n\n",
    "published": "2024-05-15T17:15:14.003",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-3488": {
    "cvss": 5.6,
    "description": "File Upload vulnerability in unauthenticated\nsession found in OpenText™ iManager 3.2.6.0200. The vulnerability could allow ant attacker to upload a\nfile without authentication.\n\n",
    "published": "2024-05-15T17:15:14.250",
    "keywords": "unauthenticated,authentication"
  },
  "CVE-2024-3967": {
    "cvss": 7.6,
    "description": "Remote Code\nExecution has been discovered in\nOpenText™ iManager 3.2.6.0200. The vulnerability can\ntrigger remote code execution unisng unsafe java object deserialization.\n\n",
    "published": "2024-05-15T17:15:14.703",
    "keywords": "remote,execution"
  },
  "CVE-2024-3968": {
    "cvss": 7.8,
    "description": "Remote Code\nExecution has been discovered in\nOpenText™ iManager 3.2.6.0200. The vulnerability can\ntrigger remote code execution using custom file upload task.",
    "published": "2024-05-15T17:15:14.910",
    "keywords": "remote,execution"
  },
  "CVE-2024-20256": {
    "cvss": 4.8,
    "description": "A vulnerability in the web-based management interface of Cisco AsyncOS Software for Cisco Secure Email and Web Manager and Secure Web Appliance could allow an authenticated, remote attacker to conduct an XSS attack against a user of the interface.\r\n\rThis vulnerability is due to insufficient validation of user input. An attacker could exploit this vulnerability by persuading a user of an affected interface to click a crafted link. A successful exploit could allow the attacker to execute arbitrary script code in the context of the affected interface or access sensitive, browser-based information.",
    "published": "2024-05-15T18:15:08.720",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-20257": {
    "cvss": 4.8,
    "description": "A vulnerability in the web-based management interface of Cisco AsyncOS Software for Cisco Secure Email Gateway could allow an authenticated, remote attacker to conduct an XSS attack against a user of the interface.r\n\r This vulnerability is due to insufficient validation of user input. An attacker could exploit this vulnerability by persuading a user of an affected interface to click a crafted link. A successful exploit could allow the attacker to execute arbitrary script code in the context of the affected interface or access sensitive, browser-based information.",
    "published": "2024-05-15T18:15:08.967",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-20258": {
    "cvss": 6.1,
    "description": "A vulnerability in the web-based management interface of Cisco AsyncOS Software for Cisco Secure Email and Web Manager and Secure Email Gateway could allow an unauthenticated, remote attacker to conduct an XSS attack against a user of the interface.\r\n\r This vulnerability is due to insufficient validation of user input. An attacker could exploit this vulnerability by persuading a user of an affected interface to click a crafted link. A successful exploit could allow the attacker to execute arbitrary script code in the context of the affected interface or access sensitive, browser-based information.",
    "published": "2024-05-15T18:15:09.193",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-20369": {
    "cvss": 4.7,
    "description": "A vulnerability in the web-based management interface of Cisco Crosswork Network Services Orchestrator (NSO) could allow an unauthenticated, remote attacker to redirect a user to a malicious web page.\r\n\r\n\r This vulnerability is due to improper input validation of a parameter in an HTTP request. An attacker could exploit this vulnerability by persuading a user to click a crafted link. A successful exploit could allow the attacker to redirect a user to a malicious website.",
    "published": "2024-05-15T18:15:09.673",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20391": {
    "cvss": 6.8,
    "description": "A vulnerability in the Network Access Manager (NAM) module of Cisco Secure Client could allow an unauthenticated attacker with physical access to an affected device to elevate privileges to SYSTEM.\r\n\r This vulnerability is due to a lack of authentication on a specific function. A successful exploit could allow the attacker to execute arbitrary code with SYSTEM privileges on an affected device.",
    "published": "2024-05-15T18:15:10.153",
    "keywords": "unauthenticated,authentication"
  },
  "CVE-2024-20392": {
    "cvss": 6.1,
    "description": "A vulnerability in the web-based management API of Cisco AsyncOS Software for Cisco Secure Email Gateway could allow an unauthenticated, remote attacker to conduct an HTTP response splitting attack. \r\n\r This vulnerability is due to insufficient input validation of some parameters that are passed to the web-based management API of the affected system. An attacker could exploit this vulnerability by persuading a user of an affected interface to click a crafted link. A successful exploit could allow the attacker to perform cross-site scripting (XSS) attacks, resulting in the execution of arbitrary script code in the browser of the targeted user, or could allow the attacker to access sensitive, browser-based information.",
    "published": "2024-05-15T18:15:10.390",
    "keywords": "remote,execution,unauthenticated,sensitive"
  },
  "CVE-2024-33615": {
    "cvss": 8.8,
    "description": "A specially crafted Zip file containing path traversal characters can be\n imported to the \nCyberPower PowerPanel \n\nserver, which allows file writing to the server outside\n the intended scope, and could allow an attacker to achieve remote code \nexecution.",
    "published": "2024-05-15T20:15:12.687",
    "keywords": "remote,execution"
  },
  "CVE-2024-33625": {
    "cvss": 9.8,
    "description": "CyberPower PowerPanel business \napplication code contains a hard-coded JWT signing key. This could \nresult in an attacker forging JWT tokens to bypass authentication.",
    "published": "2024-05-15T20:15:12.927",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-34025": {
    "cvss": 9.8,
    "description": "CyberPower PowerPanel business application code contains a hard-coded set of authentication \ncredentials. This could result in an attacker bypassing authentication \nand gaining administrator privileges.",
    "published": "2024-05-15T20:15:13.190",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-34906": {
    "url": "https://github.com/kuaifan/dootask/issues/210",
    "cvss": "-",
    "description": "An arbitrary file upload vulnerability in dootask v0.30.13 allows attackers to execute arbitrary code via uploading a crafted PDF file.",
    "published": "2024-05-15T20:15:13.460"
  },
  "CVE-2024-35184": {
    "cvss": 5.5,
    "description": "Paperless-ngx is a document management system that transforms physical documents into a searchable online archive. Starting in version 2.5.0 and prior to version 2.8.6, remote user authentication allows API access even if API access is explicitly disabled. Version 2.8.6 contains a patchc for the issue.",
    "published": "2024-05-15T22:15:08.867",
    "keywords": "remote,authentication"
  },
  "CVE-2024-4965": {
    "cvss": 6.3,
    "description": "** UNSUPPORTED WHEN ASSIGNED ** A vulnerability was found in D-Link DAR-7000-40 V31R02B1413C and classified as critical. This issue affects some unknown processing of the file /useratte/resmanage.php. The manipulation of the argument load leads to os command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-264533 was assigned to this vulnerability. NOTE: This vulnerability only affects products that are no longer supported by the maintainer. NOTE: Vendor was contacted early and confirmed immediately that the product is end-of-life. It should be retired and replaced.",
    "published": "2024-05-16T08:15:39.030",
    "keywords": "remote,command"
  },
  "CVE-2024-20793": {
    "cvss": 5.5,
    "description": "Illustrator versions 28.4, 27.9.3 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-05-16T09:15:09.560",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-2358": {
    "cvss": 9.8,
    "description": "A path traversal vulnerability in the '/apply_settings' endpoint of parisneo/lollms-webui allows attackers to execute arbitrary code. The vulnerability arises due to insufficient sanitization of user-supplied input in the configuration settings, specifically within the 'extensions' parameter. Attackers can exploit this by crafting a payload that includes relative path traversal sequences ('../../../'), enabling them to navigate to arbitrary directories. This flaw subsequently allows the server to load and execute a malicious '__init__.py' file, leading to remote code execution. The issue affects the latest version of parisneo/lollms-webui.",
    "published": "2024-05-16T09:15:09.800",
    "keywords": "remote,execution"
  },
  "CVE-2024-2366": {
    "cvss": 9.0,
    "description": "A remote code execution vulnerability exists in the parisneo/lollms-webui application, specifically within the reinstall_binding functionality in lollms_core/lollms/server/endpoints/lollms_binding_infos.py of the latest version. The vulnerability arises due to insufficient path sanitization, allowing an attacker to exploit path traversal to navigate to arbitrary directories. By manipulating the binding_path to point to a controlled directory and uploading a malicious __init__.py file, an attacker can execute arbitrary code on the server.",
    "published": "2024-05-16T09:15:10.287",
    "keywords": "remote,execution"
  },
  "CVE-2024-30281": {
    "cvss": 5.5,
    "description": "Substance3D - Designer versions 13.1.1 and earlier Answer: are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-05-16T09:15:11.007",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-30298": {
    "cvss": 5.5,
    "description": "Animate versions 24.0.2, 23.0.5 and earlier Answer: are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-05-16T09:15:12.680",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-30308": {
    "cvss": 5.5,
    "description": "Substance3D - Painter versions 9.1.2 and earlier Answer: are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-05-16T09:15:13.137",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-30309": {
    "cvss": 5.5,
    "description": "Substance3D - Painter versions 9.1.2 and earlier Answer: are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-05-16T09:15:13.377",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-3126": {
    "cvss": 8.4,
    "description": "A command injection vulnerability exists in the 'run_xtts_api_server' function of the parisneo/lollms-webui application, specifically within the 'lollms_xtts.py' script. The vulnerability arises due to the improper neutralization of special elements used in an OS command. The affected function utilizes 'subprocess.Popen' to execute a command constructed with a Python f-string, without adequately sanitizing the 'xtts_base_url' input. This flaw allows attackers to execute arbitrary commands remotely by manipulating the 'xtts_base_url' parameter. The vulnerability affects versions up to and including the latest version before 9.5. Successful exploitation could lead to arbitrary remote code execution (RCE) on the system where the application is deployed.",
    "published": "2024-05-16T09:15:13.840",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-3403": {
    "cvss": 7.5,
    "description": "imartinez/privategpt version 0.2.0 is vulnerable to a local file inclusion vulnerability that allows attackers to read arbitrary files from the filesystem. By manipulating file upload functionality to ingest arbitrary local files, attackers can exploit the 'Search in Docs' feature or query the AI to retrieve or disclose the contents of any file on the system. This vulnerability could lead to various impacts, including but not limited to remote code execution by obtaining private SSH keys, unauthorized access to private files, source code disclosure facilitating further attacks, and exposure of configuration files.",
    "published": "2024-05-16T09:15:14.053",
    "keywords": "remote,execution"
  },
  "CVE-2024-3435": {
    "cvss": 8.4,
    "description": "A path traversal vulnerability exists in the 'save_settings' endpoint of the parisneo/lollms-webui application, affecting versions up to the latest release before 9.5. The vulnerability arises due to insufficient sanitization of the 'config' parameter in the 'apply_settings' function, allowing an attacker to manipulate the application's configuration by sending specially crafted JSON payloads. This could lead to remote code execution (RCE) by bypassing existing patches designed to mitigate such vulnerabilities.",
    "published": "2024-05-16T09:15:14.290",
    "keywords": "remote,execution,bypass"
  },
  "CVE-2024-3848": {
    "cvss": 7.5,
    "description": "A path traversal vulnerability exists in mlflow/mlflow version 2.11.0, identified as a bypass for the previously addressed CVE-2023-6909. The vulnerability arises from the application's handling of artifact URLs, where a '#' character can be used to insert a path into the fragment, effectively skipping validation. This allows an attacker to construct a URL that, when processed, ignores the protocol scheme and uses the provided path for filesystem access. As a result, an attacker can read arbitrary files, including sensitive information such as SSH and cloud keys, by exploiting the way the application converts the URL into a filesystem path. The issue stems from insufficient validation of the fragment portion of the URL, leading to arbitrary file read through path traversal.",
    "published": "2024-05-16T09:15:14.543",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-4078": {
    "cvss": 9.8,
    "description": "A vulnerability in the parisneo/lollms, specifically in the `/unInstall_binding` endpoint, allows for arbitrary code execution due to insufficient sanitization of user input. The issue arises from the lack of path sanitization when handling the `name` parameter in the `unInstall_binding` function, allowing an attacker to traverse directories and execute arbitrary code by loading a malicious `__init__.py` file. This vulnerability affects the latest version of the software. The exploitation of this vulnerability could lead to remote code execution on the system where parisneo/lollms is deployed.",
    "published": "2024-05-16T09:15:15.313",
    "keywords": "remote,execution"
  },
  "CVE-2024-4321": {
    "cvss": 7.5,
    "description": "A Local File Inclusion (LFI) vulnerability exists in the gaizhenbiao/chuanhuchatgpt application, specifically within the functionality for uploading chat history. The vulnerability arises due to improper input validation when handling file paths during the chat history upload process. An attacker can exploit this vulnerability by intercepting requests and manipulating the 'name' parameter to specify arbitrary file paths. This allows the attacker to read sensitive files on the server, leading to information leakage, including API keys and private information. The issue affects version 20240310 of the application.",
    "published": "2024-05-16T09:15:16.327",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-4326": {
    "cvss": 9.8,
    "description": "A vulnerability in parisneo/lollms-webui versions up to 9.3 allows remote attackers to execute arbitrary code. The vulnerability stems from insufficient protection of the `/apply_settings` and `/execute_code` endpoints. Attackers can bypass protections by setting the host to localhost, enabling code execution, and disabling code validation through the `/apply_settings` endpoint. Subsequently, arbitrary commands can be executed remotely via the `/execute_code` endpoint, exploiting the delay in settings enforcement. This issue was addressed in version 9.5.",
    "published": "2024-05-16T09:15:16.887",
    "keywords": "remote,execution,command,bypass"
  },
  "CVE-2024-4642": {
    "cvss": 7.7,
    "description": "A Server-Side Request Forgery (SSRF) vulnerability exists in the wandb/wandb repository due to improper handling of HTTP 302 redirects. This issue allows team members with access to the 'User settings -> Webhooks' function to exploit this vulnerability to access internal HTTP(s) servers. In severe cases, such as on AWS instances, this could potentially be abused to achieve remote code execution on the victim's machine. The vulnerability is present in the latest version of the repository.",
    "published": "2024-05-16T09:15:17.360",
    "keywords": "remote,execution"
  },
  "CVE-2024-30283": {
    "cvss": 5.5,
    "description": "Adobe Framemaker versions 2020.5, 2022.3 and earlier Answer: are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-05-16T12:15:08.407",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-30286": {
    "cvss": 5.5,
    "description": "Adobe Framemaker versions 2020.5, 2022.3 and earlier Answer: are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-05-16T12:15:09.097",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-30287": {
    "cvss": 5.5,
    "description": "Adobe Framemaker versions 2020.5, 2022.3 and earlier Answer: are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-05-16T12:15:09.700",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-30314": {
    "cvss": 9.3,
    "description": "Dreamweaver Desktop versions 21.3 and earlier are affected by an Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection') vulnerability that could lead in arbitrary code execution by an attacker. Exploitation of this issue does require user interaction.",
    "published": "2024-05-16T12:15:13.280",
    "keywords": "execution,command"
  },
  "CVE-2024-4999": {
    "cvss": "-",
    "description": "A vulnerability in the web-based management interface of multiple Ligowave devices could allow an authenticated remote attacker to execute arbitrary commands with elevated privileges.This issue affects UNITY: through 6.95-2; PRO: through 6.95-1.Rt3883; MIMO: through 6.95-1.Rt2880; APC Propeller: through 2-5.95-4.Rt3352.",
    "published": "2024-05-16T13:15:48.357",
    "keywords": "remote,command"
  }
}