{
  "CVE-2024-38770": {
    "cvss": 9.8,
    "description": "Improper Privilege Management vulnerability in Revmakx Backup and Staging by WP Time Capsule allows Privilege Escalation, Authentication Bypass.This issue affects Backup and Staging by WP Time Capsule: from n/a through 1.22.20.",
    "published": "2024-08-01T21:15:27.880",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-7093": {
    "cvss": "-",
    "description": "Dispatch's notification service uses Jinja templates to generate messages to users. Jinja permits code execution within blocks, which were neither properly sanitized nor sandboxed. This vulnerability enables users to construct command line scripts in their custom message templates, which are then executed whenever these notifications are rendered and sent out.",
    "published": "2024-08-01T21:16:05.100",
    "keywords": "execution,command"
  },
  "CVE-2024-41956": {
    "cvss": 8.1,
    "description": "Soft Serve is a self-hostable Git server for the command line. Prior to 0.7.5, it is possible for a user who can commit files to a repository hosted by Soft Serve to execute arbitrary code via environment manipulation and Git. The issue is that Soft Serve passes all environment variables given by the client to git subprocesses. This includes environment variables that control program execution, such as LD_PRELOAD. This vulnerability is fixed in 0.7.5.",
    "published": "2024-08-01T22:15:29.153",
    "keywords": "execution,command"
  },
  "CVE-2024-38482": {
    "cvss": 6.6,
    "description": "CloudLink, versions 7.1.x and 8.x, contain an Improper check or handling of Exceptional Conditions Vulnerability in Cluster Component. A highly privileged malicious user with remote access could potentially exploit this vulnerability, leading to execute unauthorized actions and retrieve sensitive information from the database.",
    "published": "2024-08-02T04:17:27.750",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-7389": {
    "cvss": 7.5,
    "description": "The Forminator plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 1.29.1 via class-forminator-addon-hubspot-wp-api.php. This makes it possible for unauthenticated attackers to extract the HubSpot integration developer API key and make unauthorized changes to the plugin's HubSpot integration or expose personally identifiable information from plugin users using the HubSpot integration.",
    "published": "2024-08-02T05:15:51.510",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-39396": {
    "cvss": 5.5,
    "description": "InDesign Desktop versions ID18.5.2, ID19.3 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-08-02T07:16:09.270",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-42459": {
    "url": "https://github.com/indutny/elliptic/pull/317",
    "cvss": 5.3,
    "description": "In the Elliptic package 6.5.6 for Node.js, EDDSA signature malleability occurs because there is a missing signature length check, and thus zero-valued bytes can be removed or appended.",
    "published": "2024-08-02T07:16:10.003"
  },
  "CVE-2024-42460": {
    "url": "https://github.com/indutny/elliptic/pull/317",
    "cvss": 5.3,
    "description": "In the Elliptic package 6.5.6 for Node.js, ECDSA signature malleability occurs because there is a missing check for whether the leading bit of r and s is zero.",
    "published": "2024-08-02T07:16:10.120"
  },
  "CVE-2024-42461": {
    "url": "https://github.com/indutny/elliptic/pull/317",
    "cvss": "-",
    "description": "In the Elliptic package 6.5.6 for Node.js, ECDSA signature malleability occurs because BER-encoded signatures are allowed.",
    "published": "2024-08-02T07:16:10.230"
  },
  "CVE-2024-36268": {
    "cvss": "-",
    "description": "Improper Control of Generation of Code ('Code Injection') vulnerability in Apache InLong.\n\nThis issue affects Apache InLong: from 1.10.0 through 1.12.0, which could lead to Remote Code Execution. Users are advised to upgrade to Apache InLong's 1.13.0 or cherry-pick [1] to solve it.\n\n[1]  https://github.com/apache/inlong/pull/10251",
    "published": "2024-08-02T10:16:00.367",
    "keywords": "remote,execution"
  },
  "CVE-2024-40720": {
    "cvss": 8.8,
    "description": "The specific API in TCBServiSign Windows Version from CHANGING Information Technology does not properly validate server-side input. When a user visits a spoofed website, unauthenticated remote attackers can modify the `HKEY_CURRENT_USER` registry to execute arbitrary commands.",
    "published": "2024-08-02T11:16:42.763",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-40721": {
    "cvss": 8.8,
    "description": "The specific API in TCBServiSign Windows Version from CHANGING Information Technology does not properly validate server-side input. When a user visits a spoofed website, unauthenticated remote attackers can cause the TCBServiSign to load a DLL from an arbitrary path.",
    "published": "2024-08-02T11:16:43.020",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-40722": {
    "cvss": 4.3,
    "description": "The specific API in TCBServiSign Windows Version from CHANGING Information Technology does does not properly validate the length of server-side input. When a user visits a spoofed website, unauthenticated remote attackers can cause a stack-based buffer overflow in the TCBServiSign, temporarily disrupting its service.",
    "published": "2024-08-02T11:16:43.283",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-40723": {
    "cvss": 4.3,
    "description": "The specific API in HWATAIServiSign Windows Version from CHANGING Information Technology does not properly validate the length of server-side inputs. When a user visits a spoofed website, unauthenticated remote attackers can cause a stack-based buffer overflow in the HWATAIServiSign, temporarily disrupting its service.",
    "published": "2024-08-02T11:16:43.520",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-7204": {
    "cvss": 6.1,
    "description": "Ai3 QbiBot does not properly filter user input, allowing unauthenticated remote attackers to insert JavaScript code into the chat box. Once the recipient views the message, they will be subject to a Stored XSS attack.",
    "published": "2024-08-02T11:16:43.987",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-38890": {
    "cvss": 8.4,
    "description": "An issue in Horizon Business Services Inc. Caterease Software 16.0.1.1663 through 24.0.1.2405 and possibly later versions allows a local attacker to perform an Authentication Bypass by Capture-replay attack due to insufficient protection against capture-replay attacks.",
    "published": "2024-08-02T15:16:35.320",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-7029": {
    "cvss": 8.8,
    "description": "Commands can be injected over the network and executed without authentication.",
    "published": "2024-08-02T15:16:37.163",
    "keywords": "authentication,command"
  },
  "CVE-2024-7314": {
    "cvss": 9.8,
    "description": "anji-plus AJ-Report is affected by an authentication bypass vulnerability. A remote and unauthenticated attacker can append \";swagger-ui\" to HTTP requests to bypass authentication and execute arbitrary Java on the victim server.",
    "published": "2024-08-02T17:16:41.400",
    "keywords": "remote,unauthenticated,authentication,bypass"
  },
  "CVE-2024-38882": {
    "cvss": 9.8,
    "description": "An issue in Horizon Business Services Inc. Caterease 16.0.1.1663 through 24.0.1.2405 and possibly later versions, allows a remote attacker to perform command line execution through SQL Injection due to improper neutralization of special elements used in an OS command.",
    "published": "2024-08-02T18:16:19.300",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-38884": {
    "cvss": "-",
    "description": "An issue in Horizon Business Services Inc. Caterease 16.0.1.1663 through 24.0.1.2405 and possibly later versions, allows a local attacker to perform an Authentication Bypass attack due to improperly implemented security checks for standard authentication mechanisms",
    "published": "2024-08-02T18:16:19.487",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-38889": {
    "cvss": "-",
    "description": "An issue in Horizon Business Services Inc. Caterease 16.0.1.1663 through 24.0.1.2405 and possibly later versions, allows a remote attacker to perform SQL Injection due to improper neutralization of special elements used in an SQL command.",
    "published": "2024-08-02T20:17:00.407",
    "keywords": "remote,command"
  },
  "CVE-2024-38887": {
    "cvss": "-",
    "description": "An issue in Horizon Business Services Inc. Caterease 16.0.1.1663 through 24.0.1.2405 and possibly later versions, allows a remote attacker to expand control over the operating system from the database due to the execution of commands with unnecessary privileges.",
    "published": "2024-08-02T21:16:30.760",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-38891": {
    "cvss": "-",
    "description": "An issue in Horizon Business Services Inc. Caterease 16.0.1.1663 through 24.0.1.2405 and possibly later versions, allows a remote attacker to perform a Sniffing Network Traffic attack due to the cleartext transmission of sensitive information.",
    "published": "2024-08-02T21:16:30.853",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-7319": {
    "cvss": 7.4,
    "description": "An incomplete fix for CVE-2023-1625 was found in openstack-heat. Sensitive information may possibly be disclosed through the OpenStack stack abandon command with the hidden feature set to True and the CVE-2023-1625 fix applied.",
    "published": "2024-08-02T21:16:31.180",
    "keywords": "command,sensitive"
  },
  "CVE-2024-6477": {
    "cvss": "-",
    "description": "The UsersWP  WordPress plugin before 1.2.12 uses predictable filenames when an admin generates an export, which could allow unauthenticated attackers to download them and retrieve sensitive information such as IP, username, and email address",
    "published": "2024-08-03T06:16:29.427",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-7257": {
    "cvss": 9.8,
    "description": "The YayExtra – WooCommerce Extra Product Options plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the handle_upload_file function in all versions up to, and including, 1.3.7. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-08-03T10:15:50.710",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-7436": {
    "cvss": 6.3,
    "description": "A vulnerability, which was classified as critical, has been found in D-Link DI-8100 16.07. This issue affects the function msp_info_htm of the file msp_info.htm. The manipulation of the argument cmd leads to command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-273521 was assigned to this vulnerability.",
    "published": "2024-08-03T14:15:48.247",
    "keywords": "remote,command"
  },
  "CVE-2024-7440": {
    "cvss": 6.3,
    "description": "** UNSUPPORTED WHEN ASSIGNED ** A vulnerability was found in Vivotek CC8160 VVTK-0100d. It has been classified as critical. This affects the function getenv of the file upload_file.cgi. The manipulation of the argument QUERY_STRING leads to command injection. It is possible to initiate the attack remotely. The identifier VDB-273525 was assigned to this vulnerability. NOTE: This vulnerability only affects products that are no longer supported by the maintainer. NOTE: Vendor was contacted early and confirmed that the affected release tree is end-of-life.",
    "published": "2024-08-03T17:15:49.667",
    "keywords": "remote,command"
  },
  "CVE-2024-7442": {
    "cvss": 6.3,
    "description": "** UNSUPPORTED WHEN ASSIGNED ** A vulnerability was found in Vivotek SD9364 VVTK-0103f. It has been rated as critical. This issue affects the function getenv of the file upload_file.cgi. The manipulation of the argument QUERY_STRING leads to command injection. The attack may be initiated remotely. The associated identifier of this vulnerability is VDB-273527. NOTE: This vulnerability only affects products that are no longer supported by the maintainer. NOTE: Vendor was contacted early and confirmed that the affected release tree is end-of-life.",
    "published": "2024-08-03T18:15:35.793",
    "keywords": "remote,command"
  },
  "CVE-2024-7443": {
    "cvss": 6.3,
    "description": "** UNSUPPORTED WHEN ASSIGNED ** A vulnerability classified as critical has been found in Vivotek IB8367A VVTK-0100b. Affected is the function getenv of the file upload_file.cgi. The manipulation of the argument QUERY_STRING leads to command injection. It is possible to launch the attack remotely. The identifier of this vulnerability is VDB-273528. NOTE: This vulnerability only affects products that are no longer supported by the maintainer. NOTE: Vendor was contacted early and confirmed that the affected release tree is end-of-life.",
    "published": "2024-08-03T19:15:42.590",
    "keywords": "remote,command"
  },
  "CVE-2024-6331": {
    "cvss": 7.5,
    "description": "stitionai/devika main branch as of commit cdfb782b0e634b773b10963c8034dc9207ba1f9f is vulnerable to Local File Read (LFI) by Prompt Injection. The integration of Google Gimini 1.0 Pro with `HarmBlockThreshold.BLOCK_NONE` for `HarmCategory.HARM_CATEGORY_HATE_SPEECH` and `HarmCategory.HARM_CATEGORY_HARASSMENT` in `safety_settings` disables content protection. This allows malicious commands to be executed, such as reading sensitive file contents like `/etc/passwd`.",
    "published": "2024-08-04T00:15:47.863",
    "keywords": "command,sensitive"
  },
  "CVE-2024-35143": {
    "cvss": 6.7,
    "description": "IBM Planning Analytics Local 2.0 and 2.1 connects to a MongoDB server. MongoDB, a document-oriented database system, is listening on the remote port, and it is configured to allow connections without password authentication. A remote attacker can gain unauthorized access to the database.  IBM X-Force ID:  292420.",
    "published": "2024-08-04T13:15:57.480",
    "keywords": "remote,authentication"
  }
}