{
  "CVE-2025-24628": {
    "cvss": 5.3,
    "description": "Authentication Bypass by Spoofing vulnerability in BestWebSoft Google Captcha allows Identity Spoofing. This issue affects Google Captcha: from n/a through 1.78.",
    "published": "2025-01-27T15:15:14.923",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-0730": {
    "cvss": 3.7,
    "description": "A vulnerability classified as problematic has been found in TP-Link TL-SG108E 1.0.0 Build 20201208 Rel. 40304. Affected is an unknown function of the file /usr_account_set.cgi of the component HTTP GET Request Handler. The manipulation of the argument username/password leads to use of get request method with sensitive query strings. It is possible to launch the attack remotely. The complexity of an attack is rather high. The exploitability is told to be difficult. The exploit has been disclosed to the public and may be used. Upgrading to version 1.0.0 Build 20250124 Rel. 54920(Beta) is able to address this issue. It is recommended to upgrade the affected component. The vendor was contacted early. They reacted very professional and provided a pre-fix version for their customers.",
    "published": "2025-01-27T17:15:17.133",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-22604": {
    "cvss": 9.1,
    "description": "Cacti is an open source performance and fault management framework. Due to a flaw in multi-line SNMP result parser, authenticated users can inject malformed OIDs in the response. When processed by ss_net_snmp_disk_io() or ss_net_snmp_disk_bytes(), a part of each OID will be used as a key in an array that is used as part of a system command, causing a command execution vulnerability. This vulnerability is fixed in 1.2.29.",
    "published": "2025-01-27T17:15:17.307",
    "keywords": "execution,command"
  },
  "CVE-2025-24367": {
    "cvss": "-",
    "description": "Cacti is an open source performance and fault management framework. An authenticated Cacti user can abuse graph creation and graph template functionality to create arbitrary PHP scripts in the web root of the application, leading to remote code execution on the server. This vulnerability is fixed in 1.2.29.",
    "published": "2025-01-27T18:15:42.003",
    "keywords": "remote,execution"
  },
  "CVE-2025-24368": {
    "url": "https://github.com/cacti/cacti/commit/c7e4ee798d263a3209ae6e7ba182c7b65284d8f0",
    "cvss": "-",
    "description": "Cacti is an open source performance and fault management framework. Some of the data stored in automation_tree_rules.php is not thoroughly checked and is used to concatenate the SQL statement in build_rule_item_filter() function from lib/api_automation.php, resulting in SQL injection. This vulnerability is fixed in 1.2.29.",
    "published": "2025-01-27T18:15:42.157"
  },
  "CVE-2025-0751": {
    "url": "https://github.com/axiomatic-systems/bento4/issues/991",
    "cvss": 6.3,
    "description": "A vulnerability classified as critical has been found in Axiomatic Bento4 up to 1.6.0. This affects the function AP4_BitReader::ReadBits of the component mp42aac. The manipulation leads to heap-based buffer overflow. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2025-01-27T20:15:34.587"
  },
  "CVE-2025-0753": {
    "url": "https://github.com/axiomatic-systems/bento4/issues/991",
    "cvss": 6.3,
    "description": "A vulnerability classified as critical was found in Axiomatic Bento4 up to 1.6.0. This vulnerability affects the function AP4_StdcFileByteStream::ReadPartial of the component mp42aac. The manipulation leads to heap-based buffer overflow. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2025-01-27T21:15:13.653"
  },
  "CVE-2025-24137": {
    "cvss": 8.0,
    "description": "A type confusion issue was addressed with improved checks. This issue is fixed in iPadOS 17.7.4, macOS Sonoma 14.7.3, visionOS 2.3, iOS 18.3 and iPadOS 18.3, macOS Sequoia 15.3, watchOS 11.3, tvOS 18.3. A remote attacker may cause an unexpected application termination or arbitrary code execution.",
    "published": "2025-01-27T22:15:18.433",
    "keywords": "remote,execution"
  },
  "CVE-2025-24138": {
    "cvss": 5.5,
    "description": "This issue was addressed through improved state management. This issue is fixed in macOS Ventura 13.7.3, macOS Sequoia 15.3, macOS Sonoma 14.7.3. A malicious application may be able to leak sensitive user information.",
    "published": "2025-01-27T22:15:18.530",
    "keywords": "sensitive,leak"
  },
  "CVE-2025-24169": {
    "cvss": "-",
    "description": "A logging issue was addressed with improved data redaction. This issue is fixed in macOS Sequoia 15.3, Safari 18.3. A malicious app may be able to bypass browser extension authentication.",
    "published": "2025-01-27T22:15:20.460",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-24369": {
    "url": "https://github.com/xe/x/commit/e09d0226a628f04b1d80fd83bee777894a45cd02",
    "cvss": "-",
    "description": "Anubis is a tool that allows administrators to protect bots against AI scrapers through bot-checking heuristics and a proof-of-work challenge to discourage scraping from multiple IP addresses. Anubis allows attackers to bypass the bot protection by requesting a challenge, formulates any nonce (such as 42069), and then passes the challenge with difficulty zero. Commit e09d0226a628f04b1d80fd83bee777894a45cd02 fixes this behavior by not using a client-specified difficulty value.",
    "published": "2025-01-27T23:15:11.310"
  },
  "CVE-2025-24800": {
    "url": "https://github.com/polytope-labs/hyperbridge/pull/372/commits/f0e85db718f5165b06585a49b14a66f8ad643aea",
    "cvss": "-",
    "description": "Hyperbridge is a hyper-scalable coprocessor for verifiable, cross-chain interoperability. A critical vulnerability was discovered in the ismp-grandpa crate, that allowed a malicious prover easily convince the verifier of the finality of arbitrary headers. This could be used to steal funds or compromise other kinds of cross-chain applications. This vulnerability is fixed in 15.0.1.",
    "published": "2025-01-28T16:15:45.063"
  },
  "CVE-2025-24479": {
    "cvss": "-",
    "description": "A Local Code Execution Vulnerability exists in the product and version listed above. The vulnerability is due to a default setting in Windows and allows access to the Command Prompt as a higher privileged user.",
    "published": "2025-01-28T19:15:14.910",
    "keywords": "execution,command"
  },
  "CVE-2025-24480": {
    "cvss": "-",
    "description": "A Remote Code Execution Vulnerability exists in the product and version listed above. The vulnerability is due to lack of input sanitation and could allow a remote attacker to run commands or code as a high privileged user.",
    "published": "2025-01-28T19:15:15.033",
    "keywords": "remote,execution,command"
  },
  "CVE-2025-0784": {
    "cvss": 3.7,
    "description": "A vulnerability has been found in Intelbras InControl up to 2.21.58 and classified as problematic. This vulnerability affects unknown code of the file /v1/usuario/ of the component Registered User Handler. The manipulation leads to cleartext transmission of sensitive information. The attack can be initiated remotely. The complexity of an attack is rather high. The exploitation appears to be difficult. The exploit has been disclosed to the public and may be used. Upgrading to version 2.21.59 is able to address this issue. It is recommended to upgrade the affected component.",
    "published": "2025-01-28T20:15:56.230",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-24481": {
    "cvss": "-",
    "description": "An Incorrect Permission Assignment Vulnerability exists in the product and version listed above. The vulnerability is due to incorrect permissions being assigned to the remote debugger port and can allow for unauthenticated access to the system configuration.",
    "published": "2025-01-28T21:15:18.520",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-0798": {
    "cvss": 8.1,
    "description": "A vulnerability was found in MicroWorld eScan Antivirus 7.0.32 on Linux. It has been rated as critical. This issue affects some unknown processing of the file rtscanner of the component Quarantine Handler. The manipulation leads to os command injection. The attack may be initiated remotely. The complexity of an attack is rather high. The exploitation is known to be difficult. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2025-01-29T02:15:27.190",
    "keywords": "remote,command"
  }
}