{
  "CVE-2024-25197": {
    "url": "https://github.com/ros-planning/navigation2/issues/3972",
    "cvss": "-",
    "description": "Open Robotics Robotic Operating Sytstem 2 (ROS2) and Nav2 humble versions were discovered to contain a NULL pointer dereference via the isCurrent() function at /src/layered_costmap.cpp.",
    "published": "2024-02-20T14:15:09.213"
  },
  "CVE-2024-25198": {
    "url": "https://github.com/ros-planning/navigation2/pull/4068",
    "cvss": "-",
    "description": "Inappropriate pointer order of laser_scan_filter_.reset() and tf_listener_.reset() (amcl_node.cpp) in Open Robotics Robotic Operating Sytstem 2 (ROS2) and Nav2 humble versions leads to a use-after-free.",
    "published": "2024-02-20T14:15:09.260"
  },
  "CVE-2024-25199": {
    "url": "https://github.com/ros-planning/navigation2/pull/4078",
    "cvss": "-",
    "description": "Inappropriate pointer order of map_sub_ and map_free(map_) (amcl_node.cpp) in Open Robotics Robotic Operating Sytstem 2 (ROS2) and Nav2 humble versions leads to a use-after-free.",
    "published": "2024-02-20T14:15:09.300"
  },
  "CVE-2024-22824": {
    "url": "https://github.com/auntvt/timo/issues/6",
    "cvss": "-",
    "description": "An issue in Timo v.2.0.3 allows a remote attacker to execute arbitrary code via the filetype restrictions in the UploadController.java component.",
    "published": "2024-02-20T15:15:10.270"
  },
  "CVE-2024-25366": {
    "url": "https://github.com/mz-automation/libiec61850/issues/492",
    "cvss": "-",
    "description": "Buffer Overflow vulnerability in mz-automation.de libiec61859 v.1.4.0 allows a remote attacker to cause a denial of service via the mmsServer_handleGetNameListRequest function to the mms_getnamelist_service component.",
    "published": "2024-02-20T16:15:10.283"
  },
  "CVE-2024-0794": {
    "cvss": "-",
    "description": "Certain HP LaserJet Pro, HP Enterprise LaserJet, and HP LaserJet Managed Printers are potentially vulnerable to Remote Code Execution due to buffer overflow when rendering fonts embedded in a PDF file.",
    "published": "2024-02-20T18:15:50.840",
    "keywords": "remote,execution"
  },
  "CVE-2024-25428": {
    "url": "https://github.com/wuweiit/mushroom/issues/19",
    "cvss": "-",
    "description": "SQL Injection vulnerability in MRCMS v3.1.2 allows attackers to run arbitrary system commands via the status parameter.",
    "published": "2024-02-20T22:15:08.727"
  },
  "CVE-2024-1671": {
    "cvss": "-",
    "description": "Inappropriate implementation in Site Isolation in Google Chrome prior to 122.0.6261.57 allowed a remote attacker to bypass content security policy via a crafted HTML page. (Chromium security severity: Medium)",
    "published": "2024-02-21T04:15:08.257",
    "keywords": "remote,bypass"
  },
  "CVE-2024-1672": {
    "cvss": "-",
    "description": "Inappropriate implementation in Content Security Policy in Google Chrome prior to 122.0.6261.57 allowed a remote attacker to bypass content security policy via a crafted HTML page. (Chromium security severity: Medium)",
    "published": "2024-02-21T04:15:08.297",
    "keywords": "remote,bypass"
  },
  "CVE-2024-1674": {
    "cvss": "-",
    "description": "Inappropriate implementation in Navigation in Google Chrome prior to 122.0.6261.57 allowed a remote attacker to bypass navigation restrictions via a crafted HTML page. (Chromium security severity: Medium)",
    "published": "2024-02-21T04:15:08.430",
    "keywords": "remote,bypass"
  },
  "CVE-2024-1675": {
    "cvss": "-",
    "description": "Insufficient policy enforcement in Download in Google Chrome prior to 122.0.6261.57 allowed a remote attacker to bypass filesystem restrictions via a crafted HTML page. (Chromium security severity: Medium)",
    "published": "2024-02-21T04:15:08.540",
    "keywords": "remote,bypass"
  },
  "CVE-2024-0593": {
    "cvss": 5.3,
    "description": "The Simple Job Board plugin for WordPress is vulnerable to unauthorized access of data| due to insufficient authorization checking on the fetch_quick_job() function in all versions up to, and including, 2.10.8. This makes it possible for unauthenticated attackers to fetch arbitrary posts, which can be password protected or private and contain sensitive information.",
    "published": "2024-02-21T07:15:52.520",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-22778": {
    "url": "https://github.com/hackmdio/codimd/issues/1846",
    "cvss": "-",
    "description": "HackMD CodiMD <2.5.2 is vulnerable to Denial of Service.",
    "published": "2024-02-21T15:15:09.270"
  },
  "CVE-2024-1709": {
    "cvss": 10.0,
    "description": "ConnectWise ScreenConnect 23.9.7 and prior are affected by an Authentication Bypass Using an Alternate Path or Channel\n\n vulnerability, which may allow an attacker direct access to confidential information or \n\ncritical systems.\n\n",
    "published": "2024-02-21T16:15:50.420",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-25117": {
    "cvss": 6.8,
    "description": "php-svg-lib is a scalable vector graphics (SVG) file parsing/rendering library. Prior to version 0.5.2, php-svg-lib fails to validate that font-family doesn't contain a PHAR url, which might leads to RCE on PHP < 8.0, and doesn't validate if external references are allowed. This might leads to bypass of restrictions or RCE on projects that are using it, if they do not strictly revalidate the fontName that is passed by php-svg-lib. The `Style::fromAttributes(`), or the `Style::parseCssStyle()` should check the content of the `font-family` and prevents it to use a PHAR url, to avoid passing an invalid and dangerous `fontName` value to other libraries. The same check as done in the `Style::fromStyleSheets` might be reused. Libraries using this library as a dependency might be vulnerable to some bypass of restrictions, or even remote code execution, if they do not double check the value of the `fontName` that is passed by php-svg-lib. Version 0.5.2 contains a fix for this issue.",
    "published": "2024-02-21T17:15:09.617",
    "keywords": "remote,execution,bypass"
  },
  "CVE-2024-25288": {
    "url": "https://github.com/slims/slims9_bulian/issues/229",
    "cvss": "-",
    "description": "SLIMS (Senayan Library Management Systems) 9 Bulian v9.6.1 is vulnerable to SQL Injection via pop-scope-vocabolary.php.",
    "published": "2024-02-21T17:15:09.817"
  },
  "CVE-2024-1212": {
    "cvss": 10.0,
    "description": "Unauthenticated remote attackers can access the system through the LoadMaster management interface, enabling arbitrary system command execution.\n\n\n",
    "published": "2024-02-21T18:15:50.417",
    "keywords": "remote,execution,unauthenticated,command"
  },
  "CVE-2024-25891": {
    "url": "https://github.com/churchcrm/crm/issues/6856",
    "cvss": "-",
    "description": "ChurchCRM 5.5.0 FRBidSheets.php is vulnerable to Blind SQL Injection (Time-based) via the CurrentFundraiser GET parameter.",
    "published": "2024-02-21T18:15:51.493"
  },
  "CVE-2024-25892": {
    "url": "https://github.com/churchcrm/crm/issues/6858",
    "cvss": "-",
    "description": "ChurchCRM 5.5.0 ConfirmReport.php is vulnerable to Blind SQL Injection (Time-based) via the familyId GET parameter.",
    "published": "2024-02-21T18:15:51.540"
  },
  "CVE-2024-25893": {
    "url": "https://github.com/churchcrm/crm/issues/6856",
    "cvss": "-",
    "description": "ChurchCRM 5.5.0 FRCertificates.php is vulnerable to Blind SQL Injection (Time-based) via the CurrentFundraiser GET parameter.",
    "published": "2024-02-21T18:15:51.580"
  },
  "CVE-2024-25894": {
    "url": "https://github.com/churchcrm/crm/issues/6849",
    "cvss": "-",
    "description": "ChurchCRM 5.5.0 /EventEditor.php is vulnerable to Blind SQL Injection (Time-based) via the EventCount POST parameter.",
    "published": "2024-02-21T18:15:51.623"
  },
  "CVE-2024-25895": {
    "url": "https://github.com/churchcrm/crm/issues/6853",
    "cvss": "-",
    "description": "A reflected cross-site scripting (XSS) vulnerability in ChurchCRM 5.5.0 allows remote attackers to inject arbitrary web script or HTML via the type parameter of /EventAttendance.php",
    "published": "2024-02-21T18:15:51.680"
  },
  "CVE-2024-25896": {
    "url": "https://github.com/churchcrm/crm/issues/6854",
    "cvss": "-",
    "description": "ChurchCRM 5.5.0 EventEditor.php is vulnerable to Blind SQL Injection (Time-based) via the EID POST parameter.",
    "published": "2024-02-21T18:15:51.727"
  },
  "CVE-2024-25897": {
    "url": "https://github.com/churchcrm/crm/issues/6856",
    "cvss": "-",
    "description": "ChurchCRM 5.5.0 FRCatalog.php is vulnerable to Blind SQL Injection (Time-based) via the CurrentFundraiser GET parameter.",
    "published": "2024-02-21T18:15:51.777"
  },
  "CVE-2024-25898": {
    "url": "https://github.com/churchcrm/crm/issues/6851",
    "cvss": "-",
    "description": "A XSS vulnerability was found in the ChurchCRM v.5.5.0 functionality, edit your event, where malicious JS or HTML code can be inserted in the Event Sermon field in EventEditor.php.",
    "published": "2024-02-21T18:15:51.820"
  },
  "CVE-2024-26145": {
    "url": "https://github.com/discourse/discourse-calendar/commit/dfc4fa15f340189f177a1d1ab2cc94ffed3c1190",
    "cvss": 6.5,
    "description": "Discourse Calendar adds the ability to create a dynamic calendar in the first post of a topic on Discourse. Uninvited users are able to gain access to private events by crafting a request to update their attendance. This problem is resolved in commit dfc4fa15f340189f177a1d1ab2cc94ffed3c1190. As a workaround, one may use post visibility to limit access.",
    "published": "2024-02-21T18:15:51.870"
  },
  "CVE-2024-25381": {
    "url": "https://github.com/emlog/emlog/issues/285",
    "cvss": "-",
    "description": "There is a Stored XSS Vulnerability in Emlog Pro 2.2.8 Article Publishing, due to non-filtering of quoted content.",
    "published": "2024-02-21T19:15:09.123"
  },
  "CVE-2024-25461": {
    "cvss": "-",
    "description": "Directory Traversal vulnerability in Terrasoft, Creatio Terrasoft CRM v.7.18.4.1532 allows a remote attacker to obtain sensitive information via a crafted request to the terrasoft.axd component.",
    "published": "2024-02-21T20:15:46.727",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-25124": {
    "url": "https://github.com/gofiber/fiber/commit/f0cd3b44b086544a37886232d0530601f2406c23",
    "cvss": 9.4,
    "description": "Fiber is a web framework written in go. Prior to version 2.52.1, the CORS middleware allows for insecure configurations that could potentially expose the application to multiple CORS-related vulnerabilities. Specifically, it allows setting the Access-Control-Allow-Origin header to a wildcard (`*`) while also having the Access-Control-Allow-Credentials set to true, which goes against recommended security best practices. The impact of this misconfiguration is high as it can lead to unauthorized access to sensitive user data and expose the system to various types of attacks listed in the PortSwigger article linked in the references. Version 2.52.1 contains a patch for this issue. As a workaround, users may manually validate the CORS configurations in their implementation to ensure that they do not allow a wildcard origin when credentials are enabled. The browser fetch api, as well as browsers and utilities that enforce CORS policies, are not affected by this.",
    "published": "2024-02-21T21:15:09.250"
  },
  "CVE-2024-1525": {
    "cvss": 5.3,
    "description": "An issue has been discovered in GitLab CE/EE affecting all versions starting from 16.1 before 16.7.6, all versions starting from 16.8 before 16.8.3, all versions starting from 16.9 before 16.9.1. Under some specialized conditions, an LDAP user may be able to reset their password using their verified secondary email address and sign-in using direct authentication with the reset password, bypassing LDAP.",
    "published": "2024-02-22T00:15:52.327",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-0903": {
    "cvss": 5.4,
    "description": "The User Feedback – Create Interactive Feedback Form, User Surveys, and Polls in Seconds plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the 'page_submitted' 'link' value in all versions up to, and including, 1.0.13 due to insufficient input sanitization and output escaping. This makes it possible for unauthenticated attackers to inject arbitrary web scripts in the feedback submission page that will execute when a user clicks the link, while also pressing the command key.",
    "published": "2024-02-22T06:15:57.453",
    "keywords": "unauthenticated,command"
  },
  "CVE-2024-1104": {
    "cvss": 7.5,
    "description": "An unauthenticated remote attacker can bypass the brute force prevention mechanism and disturb the webservice for all users.",
    "published": "2024-02-22T12:15:46.033",
    "keywords": "remote,unauthenticated,bypass"
  },
  "CVE-2024-24817": {
    "url": "https://github.com/discourse/discourse-calendar/commit/84ef46a38cf02748ecacad16c5d9c6fec12dc8da",
    "cvss": 4.3,
    "description": "Discourse Calendar adds the ability to create a dynamic calendar in the first post of a topic on the open-source discussion platform Discourse. Prior to version 0.4, event invitees created in topics in private categories or PMs (private messages) can be retrieved by anyone, even if they're not logged in. This problem is resolved in version 0.4 of the discourse-calendar plugin. While no known workaround is available, putting the site behind `login_required` will disallow this endpoint to be used by anonymous users, but logged in users can still get the list of invitees in the private topics.",
    "published": "2024-02-22T18:15:48.587"
  },
  "CVE-2024-25130": {
    "url": "https://github.com/enalean/tuleap/commit/57978a32508f5c6d0365419b6eaeb368aee20667",
    "cvss": 5.4,
    "description": "Tuleap is an open source suite to improve management of software developments and collaboration. Prior to version 15.5.99.76 of Tuleap Community Edition and prior to versions 15.5-4 and 15.4-7 of Tuleap Enterprise Edition, users with a read access to a tracker where the mass update feature is used might get access to restricted information. Tuleap Community Edition 15.5.99.76, Tuleap Enterprise Edition 15.5-4, and Tuleap Enterprise Edition 15.4-7 contain a patch for this issue.",
    "published": "2024-02-22T19:15:08.823"
  },
  "CVE-2024-25385": {
    "url": "https://github.com/noirotm/flvmeta/issues/23",
    "cvss": "-",
    "description": "An issue in flvmeta v.1.2.2 allows a local attacker to cause a denial of service via the flvmeta/src/flv.c:375:21 function in flv_close.",
    "published": "2024-02-22T19:15:09.037"
  }
}