{
  "CVE-2024-54664": {
    "cvss": 7.8,
    "description": "An issue was discovered in Veritas NetBackup before 10.5. This only applies to NetBackup components running on a Windows Operating System. If a user executes specific NetBackup commands or an attacker uses social engineering techniques to impel the user to execute the commands, a malicious DLL could be loaded, resulting in execution of the attacker's code in the user's security context, a different vulnerability than CVE-2024-52945.",
    "published": "2024-12-04T06:15:08.357",
    "keywords": "execution,command"
  },
  "CVE-2024-11293": {
    "cvss": 8.1,
    "description": "The  Registration Forms – User Registration Forms, Invitation-Based Registrations, Front-end User Profile, Login Form & Content Restriction Social Sites Login plugin for WordPress is vulnerable to authentication bypass in all versions up to, and including, 1.7.9. This is due to insufficient verification on the user being returned by the social login token. This makes it possible for unauthenticated attackers to log in as any existing user on the site, such as an administrator, if they have access to the email and the user does not have an already-existing account for the service returning the token.",
    "published": "2024-12-04T08:15:06.343",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-11952": {
    "cvss": 7.5,
    "description": "The Classic Addons – WPBakery Page Builder plugin for WordPress is vulnerable to Limited Local PHP File Inclusion in all versions up to, and including, 3.0 via the 'style' parameter. This makes it possible for authenticated attackers, with Contributor-level access and above, and permissions granted by an Administrator, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included. The vulnerability is limited to PHP files in a Windows environment.",
    "published": "2024-12-04T09:15:04.637",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-51465": {
    "cvss": 8.8,
    "description": "IBM App Connect Enterprise Certified Container 11.4, 11.5, 11.6, 12.0, 12.1, 12.2, and 12.3 could allow a remote authenticated attacker to execute arbitrary commands on the system by sending a specially crafted request.",
    "published": "2024-12-04T14:15:20.223",
    "keywords": "remote,command"
  },
  "CVE-2024-53614": {
    "cvss": 6.5,
    "description": "A hardcoded decryption key in Thinkware Cloud APK v4.3.46 allows attackers to access sensitive data and execute arbitrary commands with elevated privileges.",
    "published": "2024-12-04T16:15:26.413",
    "keywords": "command,sensitive"
  },
  "CVE-2024-20397": {
    "cvss": 5.2,
    "description": "A vulnerability in the bootloader of Cisco NX-OS Software could allow an unauthenticated attacker with physical access to an affected device, or an authenticated, local attacker with administrative credentials, to bypass NX-OS image signature verification.\r\n\r\nThis vulnerability is due to insecure bootloader settings. An attacker could exploit this vulnerability by executing a series of bootloader commands. A successful exploit could allow the attacker to bypass NX-OS image signature verification and load unverified software.",
    "published": "2024-12-04T17:15:11.913",
    "keywords": "unauthenticated,command,bypass"
  },
  "CVE-2024-54674": {
    "url": "https://github.com/misp/misp/commit/d0330989e235a8a9f43c90817896de87a589ef7d",
    "cvss": 6.1,
    "description": "app/View/GalaxyClusters/cluster_export_misp_galaxy.ctp in MISP through 2.5.2 has stored XSS when exporting custom clusters into the misp-galaxy format.",
    "published": "2024-12-04T21:15:25.130"
  },
  "CVE-2024-54675": {
    "url": "https://github.com/misp/misp/commit/e02c2b864a85d14d64adf9f878f9c7b2bdd15173",
    "cvss": 6.1,
    "description": "app/webroot/js/workflows-editor/workflows-editor.js in MISP through 2.5.2 has stored XSS in the editor interface for an ad-hoc workflow.",
    "published": "2024-12-04T21:15:25.263"
  },
  "CVE-2024-11429": {
    "cvss": 8.8,
    "description": "The Free Responsive Testimonials, Social Proof Reviews, and Customer Reviews – Stars Testimonials plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 3.3.3 via the 'stars-testimonials-with-slider-and-masonry-grid' shortcode. This makes it possible for authenticated attackers, with contributor-level access and above, to include and execute arbitrary PHP files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where PHP files can be uploaded and included.",
    "published": "2024-12-05T06:15:19.090",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-10937": {
    "cvss": 5.3,
    "description": "The Related Posts, Inline Related Posts, Contextual Related Posts, Related Content By PickPlugins plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 2.0.58 via the wp_ajax_nopriv_related_post_ajax_get_post_ids AJAX action. This makes it possible for unauthenticated attackers to extract sensitive data including titles of posts in draft status.",
    "published": "2024-12-05T09:15:04.377",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-47133": {
    "cvss": 7.2,
    "description": "UD-LT1 firmware Ver.2.1.8 and earlier and UD-LT1/EX firmware Ver.2.1.8 and earlier allow a remote authenticated attacker with an administrative account to execute arbitrary OS commands.",
    "published": "2024-12-05T10:31:40.430",
    "keywords": "remote,command"
  },
  "CVE-2024-52564": {
    "cvss": 7.5,
    "description": "Inclusion of undocumented features or chicken bits issue exists in UD-LT1 firmware Ver.2.1.8 and earlier and UD-LT1/EX firmware Ver.2.1.8 and earlier. A remote attacker may disable the firewall function of the affected products. As a result, an arbitrary OS command may be executed and/or configuration settings of the device may be altered.",
    "published": "2024-12-05T10:31:40.663",
    "keywords": "remote,command"
  },
  "CVE-2024-48839": {
    "cvss": 10.0,
    "description": "Improper Input Validation vulnerability allows Remote Code Execution. \nAffected products:\n\n\nABB ASPECT - Enterprise v3.08.02; \nNEXUS Series v3.08.02; \nMATRIX Series v3.08.02",
    "published": "2024-12-05T13:15:06.123",
    "keywords": "remote,execution"
  },
  "CVE-2024-48840": {
    "cvss": 10.0,
    "description": "Unauthorized Access vulnerabilities allow Remote Code Execution. \nAffected products:\n\n\nABB ASPECT - Enterprise v3.08.02; \nNEXUS Series v3.08.02; \nMATRIX Series v3.08.02",
    "published": "2024-12-05T13:15:06.343",
    "keywords": "remote,execution"
  },
  "CVE-2024-40763": {
    "cvss": 7.5,
    "description": "Heap-based buffer overflow vulnerability in the SonicWall SMA100 SSLVPN due to the use of strcpy. This allows remote authenticated attackers to cause Heap-based buffer overflow and potentially lead to code execution.",
    "published": "2024-12-05T14:15:20.850",
    "keywords": "remote,execution,vpn"
  },
  "CVE-2024-45318": {
    "cvss": 8.1,
    "description": "A vulnerability in the SonicWall SMA100 SSLVPN web management interface allows remote attackers to cause Stack-based buffer overflow and potentially lead to code execution.",
    "published": "2024-12-05T14:15:21.000",
    "keywords": "remote,execution,vpn"
  },
  "CVE-2024-45319": {
    "cvss": 6.3,
    "description": "A vulnerability in the SonicWall SMA100 SSLVPN \n\nfirmware 10.2.1.13-72sv and earlier versions allows a remote authenticated attacker can circumvent the certificate requirement during authentication.",
    "published": "2024-12-05T14:15:21.127",
    "keywords": "remote,authentication,vpn"
  },
  "CVE-2024-52271": {
    "url": "https://github.com/documenso/documenso/issues/1512",
    "cvss": "-",
    "description": "User Interface (UI) Misrepresentation of Critical Information vulnerability in Documenso allows Content Spoofing.Displayed version does not show the layer flattened version, once download, If printed (e.g. via Google Chrome -> Examine the print preview): Will render the vulnerability only, not all layers are flattened.\n\n\nThis issue affects Documenso: through 1.8.0, >1.8.0 and Documenso SaaS (Hosted) as of 2024-12-05.",
    "published": "2024-12-05T14:15:21.417"
  },
  "CVE-2024-53703": {
    "cvss": 8.1,
    "description": "A vulnerability in the SonicWall SMA100 SSLVPN firmware 10.2.1.13-72sv and earlier versions mod_httprp library loaded by the Apache web server allows remote attackers to cause Stack-based buffer overflow and potentially lead to code execution.",
    "published": "2024-12-05T14:15:22.020",
    "keywords": "remote,execution,vpn"
  },
  "CVE-2024-54679": {
    "url": "https://github.com/usmannasir/cyberpanel/commit/6778ad1eaae41f72365da8fd021f9a60369600dc",
    "cvss": 4.3,
    "description": "CyberPanel (aka Cyber Panel) before 6778ad1 does not require the FilemanagerAdmin capability for restartMySQL actions.",
    "published": "2024-12-05T14:15:22.157"
  },
  "CVE-2024-41579": {
    "url": "https://github.com/dtstack/taier/issues/1184",
    "cvss": "-",
    "description": "DTStack Taier 1.4.0 allows remote attackers to specify the jobName parameter in the console listNames function to cause a SQL injection vulnerability",
    "published": "2024-12-05T20:15:22.057"
  },
  "CVE-2024-53523": {
    "url": "https://github.com/threezh1/jsfinder/issues/33",
    "cvss": "-",
    "description": "JSFinder commit d70ab9bc5221e016c08cffaf0d9ac79646c90645 is vulnerable to Directory Traversal in the find_by_file function.",
    "published": "2024-12-05T21:15:08.573"
  },
  "CVE-2024-30962": {
    "url": "https://github.com/ros-planning/navigation2/pull/4206",
    "cvss": "-",
    "description": "Buffer Overflow vulnerability in Open Robotics Robotic Operating System 2 (ROS2) navigation2- ROS2-humble and navigation 2-humble allows a local attacker to execute arbitrary code via the nav2_amcl process",
    "published": "2024-12-05T23:15:05.147"
  },
  "CVE-2024-30963": {
    "url": "https://github.com/ros-planning/navigation2/issues/4157",
    "cvss": 7.8,
    "description": "Buffer Overflow vulnerability in Open Robotics Robotic Operating System 2 (ROS2) navigation2- ROS2-humble and navigation 2-humble allows a local attacker to execute arbitrary code via a crafted script.",
    "published": "2024-12-05T23:15:05.267"
  },
  "CVE-2024-37860": {
    "url": "https://github.com/ros-navigation/navigation2/issues/4339",
    "cvss": 7.3,
    "description": "Buffer Overflow vulnerability in Open Robotic Operating System 2 ROS2 navigation2- ROS2-humble&& navigation2-humble allows a local attacker to execute arbitrary code via a crafted .yaml file to the nav2_amcl process",
    "published": "2024-12-05T23:15:05.510"
  },
  "CVE-2024-37861": {
    "url": "https://github.com/ros-navigation/navigation2/issues/4338",
    "cvss": 9.8,
    "description": "Open Robotics Robotic Operating System 2 (ROS2) and Nav2 humble versions were discovered to contain a buffer overflow via the nav2_amcl process. This vulnerability is triggered via sending a crafted .yaml file.",
    "published": "2024-12-05T23:15:05.633"
  },
  "CVE-2024-37862": {
    "url": "https://github.com/ros-navigation/navigation2/issues/4062",
    "cvss": 7.3,
    "description": "Buffer Overflow vulnerability in Open Robotic Robotic Operating System 2 ROS2 navigation2- ROS2-humble&& navigation2-humble allows a local attacker to execute arbitrary code via a crafted .yaml file to the nav2_planner process.",
    "published": "2024-12-05T23:15:05.767"
  },
  "CVE-2024-37863": {
    "url": "https://github.com/ros-navigation/navigation2/issues/4337",
    "cvss": 9.8,
    "description": "Open Robotics Robotic Operating System 2 (ROS2) and Nav2 humble versions were discovered to contain a buffer overflow via the nav2_amcl process. This vulnerability is triggered via sending a crafted .yaml file.",
    "published": "2024-12-05T23:15:05.903"
  },
  "CVE-2024-11178": {
    "cvss": 8.1,
    "description": "The Login With OTP plugin for WordPress is vulnerable to authentication bypass in versions up to, and including, 1.4.2. This is due to the plugin generating too weak OTP, and there’s no attempt or time limit. This makes it possible for unauthenticated attackers to generate and brute force the 6-digit numeric OTP that makes it possible to log in as any existing user on the site, such as an administrator, if they have access to the email.",
    "published": "2024-12-06T07:15:05.460",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-11292": {
    "cvss": 5.3,
    "description": "The WP Private Content Plus plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 3.6.1 via the WordPress core search feature. This makes it possible for unauthenticated attackers to extract sensitive data from posts that have been restricted to higher-level roles such as administrator.",
    "published": "2024-12-06T09:15:05.993",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-11289": {
    "cvss": 8.1,
    "description": "The Soledad theme for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 8.5.9 via several functions like penci_archive_more_post_ajax_func, penci_more_post_ajax_func, and penci_more_featured_post_ajax_func. This makes it possible for unauthenticated attackers to include and execute PHP files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where PHP files can be uploaded and included. The exploitability of this is limited to Windows.",
    "published": "2024-12-06T10:15:05.450",
    "keywords": "execution,unauthenticated,sensitive,bypass"
  },
  "CVE-2024-11460": {
    "cvss": 7.5,
    "description": "The Verowa Connect plugin for WordPress is vulnerable to SQL Injection via the 'search_string' parameter in all versions up to, and including, 3.0.1 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-12-06T10:15:05.647",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-11728": {
    "cvss": 7.5,
    "description": "The KiviCare – Clinic & Patient Management System (EHR) plugin for WordPress is vulnerable to SQL Injection via the 'visit_type[service_id]' parameter of the tax_calculated_data AJAX action in all versions up to, and including, 3.6.4 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-12-06T10:15:05.853",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-10771": {
    "cvss": 8.8,
    "description": "Due to missing input validation during one step of the firmware update process, the product\nis vulnerable to remote code execution. With network access and the user level ”Service”, an attacker\ncan execute arbitrary system commands in the root user’s contexts.",
    "published": "2024-12-06T13:15:04.797",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-10774": {
    "cvss": 7.3,
    "description": "Unauthenticated CROWN APIs allow access to critical functions. This leads to the accessibility of large parts of the web application without authentication.",
    "published": "2024-12-06T13:15:06.023",
    "keywords": "unauthenticated,authentication"
  },
  "CVE-2024-10516": {
    "cvss": 8.1,
    "description": "The Swift Performance Lite plugin for WordPress is vulnerable to Local PHP File Inclusion in all versions up to, and including, 2.3.7.1 via the 'ajaxify' function. This makes it possible for unauthenticated attackers to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-12-06T14:15:19.667",
    "keywords": "execution,unauthenticated,sensitive,bypass"
  },
  "CVE-2024-21571": {
    "cvss": 8.1,
    "description": "Snyk has identified a remote code execution (RCE) vulnerability in all versions of Code Agent. The vulnerability enables an attacker to execute arbitrary code within the Code Agent container. Exploiting this vulnerability would require an attacker to have network access to the Code Agent within the deployment environment. External exploitation of this vulnerability is unlikely and depends on both misconfigurations of the cluster and/or chaining with another vulnerability. However, internal exploitation (with a cluster misconfiguration) could still be possible.",
    "published": "2024-12-06T14:15:19.997",
    "keywords": "remote,execution"
  },
  "CVE-2024-11738": {
    "url": "https://github.com/rustls/rustls/issues/2227",
    "cvss": 5.3,
    "description": "A flaw was found in Rustls 0.23.13 and related APIs. This vulnerability allows denial of service (panic) via a fragmented TLS ClientHello message.",
    "published": "2024-12-06T15:15:07.723"
  },
  "CVE-2024-12254": {
    "url": "https://github.com/python/cpython/pull/127656",
    "cvss": "-",
    "description": "Starting in Python 3.12.0, the asyncio._SelectorSocketTransport.writelines()\n method would not \"pause\" writing and signal to the Protocol to drain \nthe buffer to the wire once the write buffer reached the \"high-water \nmark\". Because of this, Protocols would not periodically drain the write\n buffer potentially leading to memory exhaustion.\n\n\n\n\n\nThis\n vulnerability likely impacts a small number of users, you must be using\n Python 3.12.0 or later, on macOS or Linux, using the asyncio module \nwith protocols, and using .writelines() method which had new \nzero-copy-on-write behavior in Python 3.12.0 and later. If not all of \nthese factors are true then your usage of Python is unaffected.",
    "published": "2024-12-06T16:15:20.623"
  },
  "CVE-2024-54135": {
    "url": "https://github.com/macwarrior/clipbucket-v5/commit/76a829c088f0813ab3244a3bd0036111017409b0",
    "cvss": 9.8,
    "description": "ClipBucket V5 provides open source video hosting with PHP. ClipBucket-v5 Version 2.0 to Version 5.5.1 Revision 199 are vulnerable to PHP Deserialization vulnerability. The vulnerability exists in upload/photo_upload.php  within the decode_key function. User inputs were supplied to this function without sanitization via collection GET parameter and photoIDS POST parameter respectively. The decode_key function invokes PHP unserialize function as defined in upload/includes/classes/photos.class.php. As a result, it is possible for an adversary to inject maliciously crafted PHP serialized object and utilize gadget chains to cause unexpected behaviors of the application. This vulnerability is fixed in 5.5.1 Revision 200.",
    "published": "2024-12-06T16:15:22.340"
  },
  "CVE-2024-54136": {
    "url": "https://github.com/macwarrior/clipbucket-v5/commit/76a829c088f0813ab3244a3bd0036111017409b0",
    "cvss": 9.8,
    "description": "ClipBucket V5 provides open source video hosting with PHP. ClipBucket-v5 Version 5.5.1 Revision 199 and below is vulnerable to PHP Deserialization vulnerability. The vulnerability exists in upload/upload.php where the user supplied input via collection get parameter is directly provided to unserialize function. As a result, it is possible for an adversary to inject maliciously crafted PHP serialized object and utilize gadget chains to cause unexpected behaviors of the application. This vulnerability is fixed in 5.5.1 Revision 200.",
    "published": "2024-12-06T16:15:22.500"
  },
  "CVE-2024-48859": {
    "cvss": "-",
    "description": "An improper authentication vulnerability has been reported to affect several QNAP operating system versions. If exploited, the vulnerability could allow remote attackers to compromise the security of the system.\n\nWe have already fixed the vulnerability in the following versions:\nQTS 5.1.9.2954 build 20241120 and later\nQTS 5.2.2.2950 build 20241114 and later\nQuTS hero h5.1.9.2954 build 20241120 and later\nQuTS hero h5.2.2.2952 build 20241116 and later",
    "published": "2024-12-06T17:15:08.350",
    "keywords": "remote,authentication"
  },
  "CVE-2024-48863": {
    "cvss": "-",
    "description": "A command injection vulnerability has been reported to affect License Center. If exploited, the vulnerability could allow remote attackers to execute arbitrary commands.\n\nWe have already fixed the vulnerability in the following version:\nLicense Center 1.9.43 and later",
    "published": "2024-12-06T17:15:08.533",
    "keywords": "remote,command"
  },
  "CVE-2024-50388": {
    "cvss": "-",
    "description": "An OS command injection vulnerability has been reported to affect HBS 3 Hybrid Backup Sync. If exploited, the vulnerability could allow remote attackers to execute commands.\n\nWe have already fixed the vulnerability in the following version:\nHBS 3 Hybrid Backup Sync 25.1.1.673 and later",
    "published": "2024-12-06T17:15:09.373",
    "keywords": "remote,command"
  },
  "CVE-2024-50393": {
    "cvss": "-",
    "description": "A command injection vulnerability has been reported to affect several QNAP operating system versions. If exploited, the vulnerability could allow remote attackers to execute arbitrary commands.\n\nWe have already fixed the vulnerability in the following versions:\nQTS 5.1.9.2954 build 20241120 and later\nQTS 5.2.2.2950 build 20241114 and later\nQuTS hero h5.1.9.2954 build 20241120 and later\nQuTS hero h5.2.2.2952 build 20241116 and later",
    "published": "2024-12-06T17:15:09.637",
    "keywords": "remote,command"
  },
  "CVE-2024-54143": {
    "url": "https://github.com/openwrt/asu/commit/920c8a13d97b4d4095f0d939cf0aaae777e0f87e",
    "cvss": "-",
    "description": "openwrt/asu is an image on demand server for OpenWrt based distributions. The request hashing mechanism truncates SHA-256 hashes to only 12 characters. This significantly reduces entropy, making it feasible for an attacker to generate collisions. By exploiting this, a previously built malicious image can be served in place of a legitimate one, allowing the attacker to \"poison\" the artifact cache and deliver compromised images to unsuspecting users. This can be combined with other attacks, such as a command injection in Imagebuilder that allows malicious users to inject arbitrary commands into the build process, resulting in the production of malicious firmware images signed with the legitimate build key. This has been patched with 920c8a1.",
    "published": "2024-12-06T17:15:12.687"
  },
  "CVE-2024-48871": {
    "cvss": 9.8,
    "description": "The affected product is vulnerable to a stack-based buffer overflow. An unauthenticated attacker could send a malicious HTTP request that the webserver fails to properly check input size before copying data to the stack, potentially allowing remote code execution.",
    "published": "2024-12-06T18:15:25.267",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-52320": {
    "cvss": 9.8,
    "description": "The affected product is vulnerable to a command injection. An unauthenticated attacker could send commands through a malicious HTTP request which could result in remote code execution.",
    "published": "2024-12-06T18:15:25.737",
    "keywords": "remote,execution,unauthenticated,command"
  }
}