{
  "CVE-2024-22026": {
    "cvss": 6.7,
    "description": "A local privilege escalation vulnerability in EPMM before 12.1.0.0 allows an authenticated local user to bypass shell restriction and execute arbitrary commands on the appliance.",
    "published": "2024-05-22T23:15:08.520",
    "keywords": "command,bypass"
  },
  "CVE-2024-29853": {
    "cvss": 7.8,
    "description": "An authentication bypass vulnerability in Veeam Agent for Microsoft Windows allows for local privilege escalation.",
    "published": "2024-05-22T23:15:09.367",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-3708": {
    "cvss": "-",
    "description": "A condition exists in lighttpd version prior to 1.4.51 whereby a remote attacker can craft an http request which could result in multiple outcomes:\n1.) cause lighttpd to access freed memory in which case the process lighttpd is running in could be terminated or other non-deterministic behavior could result\n2.) a memory information disclosure event could result which could be used to determine the state of memory which could then be used to theoretically bypass ALSR protections\n\nThis CVE will be updated with more details on July 9th, 2024 after affected parties have had time to remediate.",
    "published": "2024-05-23T01:15:47.413",
    "keywords": "remote,bypass"
  },
  "CVE-2024-4978": {
    "cvss": 8.4,
    "description": "Justice AV Solutions Viewer Setup 8.3.7.250-1 contains a malicious binary when executed and is signed with an unexpected authenticode signature. A remote, privileged threat actor may exploit this vulnerability to execute of unauthorized PowerShell commands.",
    "published": "2024-05-23T02:15:09.257",
    "keywords": "remote,command"
  },
  "CVE-2024-4662": {
    "cvss": 8.8,
    "description": "The Oxygen Builder plugin for WordPress is vulnerable to Remote Code Execution in all versions up to, and including, 4.8.2 via post metadata. This is due to the plugin storing custom data in post metadata without an underscore prefix. This makes it possible for lower privileged users, such as contributors, to inject arbitrary PHP code via the WordPress user interface and gain elevated privileges.",
    "published": "2024-05-23T05:15:49.140",
    "keywords": "remote,execution"
  },
  "CVE-2024-5241": {
    "cvss": 4.7,
    "description": "A vulnerability was found in Huashi Private Cloud CDN Live Streaming Acceleration Server up to 20240520. It has been classified as critical. Affected is an unknown function of the file /manager/ipconfig_new.php. The manipulation of the argument dev leads to os command injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-265992.",
    "published": "2024-05-23T07:15:10.803",
    "keywords": "remote,command"
  },
  "CVE-2024-35223": {
    "cvss": 5.3,
    "description": "Dapr is a portable, event-driven, runtime for building distributed applications across cloud and edge. Dapr sends the app token of the invoker app instead of the app token of the invoked app. This causes of a leak of the application token of the invoker app to the invoked app when using Dapr as a gRPC proxy for remote service invocation. This vulnerability impacts Dapr users who use Dapr as a gRPC proxy for remote service invocation as well as the Dapr App API token functionality. An attacker could exploit this vulnerability to gain access to the app token of the invoker app, potentially compromising security and authentication mechanisms. This vulnerability was patched in version 1.13.3.\n",
    "published": "2024-05-23T09:15:09.890",
    "keywords": "remote,authentication,leak"
  },
  "CVE-2024-5168": {
    "cvss": 9.8,
    "description": "Improper access control vulnerability in Prodys' Quantum Audio codec affecting versions 2.3.4t and below. This vulnerability could allow an unauthenticated user to bypass authentication entirely and execute arbitrary API requests against the web application.",
    "published": "2024-05-23T13:15:09.810",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-35222": {
    "cvss": 5.9,
    "description": "Tauri is a framework for building binaries for all major desktop platforms. Remote origin iFrames in Tauri applications can access the Tauri IPC endpoints without being explicitly allowed in the `dangerousRemoteDomainIpcAccess` in v1 and in the `capabilities` in v2. Valid commands with potentially unwanted consequences (\"delete project\", \"transfer credits\", etc.) could be invoked by an attacker that controls the content of an iframe running inside a Tauri app. This vulnerability has been patched in versions 1.6.7 and 2.0.0-beta.19.",
    "published": "2024-05-23T14:15:09.603",
    "keywords": "remote,command"
  },
  "CVE-2024-5084": {
    "cvss": 9.8,
    "description": "The Hash Form – Drag & Drop Form Builder plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the 'file_upload_action' function in all versions up to, and including, 1.1.0. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-05-23T15:15:15.970",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-5085": {
    "cvss": 8.1,
    "description": "The Hash Form – Drag & Drop Form Builder plugin for WordPress is vulnerable to PHP Object Injection in all versions up to, and including, 1.1.0 via deserialization of untrusted input in the 'process_entry' function. This makes it possible for unauthenticated attackers to inject a PHP Object. No known POP chain is present in the vulnerable software. If a POP chain is present via an additional plugin or theme installed on the target system, it could allow the attacker to delete arbitrary files, retrieve sensitive data, or execute code.",
    "published": "2024-05-23T15:15:16.540",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-5227": {
    "cvss": 7.5,
    "description": "TP-Link Omada ER605 PPTP VPN username Command Injection Remote Code Execution Vulnerability. This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of TP-Link Omada ER605 routers. Authentication is not required to exploit this vulnerability. However, devices are only vulnerable if configured to use a PPTP VPN with LDAP authentication.\n\nThe specific flaw exists within the handling of the username parameter provided to the /usr/bin/pppd endpoint. The issue results from the lack of proper validation of a user-supplied string before using it to execute a system call. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-22446.",
    "published": "2024-05-23T22:15:12.727",
    "keywords": "remote,execution,authentication,command,vpn"
  },
  "CVE-2024-5228": {
    "cvss": 7.5,
    "description": "TP-Link Omada ER605  Comexe DDNS Response Handling Heap-based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of TP-Link Omada ER605 routers. Authentication is not required to exploit this vulnerability. However, devices are vulnerable only if configured to use the Comexe DDNS service.\n\nThe specific flaw exists within the handling of DNS responses. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a fixed-length heap-based buffer. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-22383.",
    "published": "2024-05-23T22:15:13.047",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2024-5242": {
    "cvss": 7.5,
    "description": "TP-Link Omada ER605 Stack-based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of TP-Link Omada ER605 routers. Authentication is not required to exploit this vulnerability. However, devices are vulnerable only if configured to use the Comexe DDNS service.\n\nThe specific flaw exists within the handling of DDNS error codes. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a fixed-length stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-22522.",
    "published": "2024-05-23T22:15:13.310",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2024-5243": {
    "cvss": 7.5,
    "description": "TP-Link Omada ER605 Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of TP-Link Omada ER605 routers. Authentication is not required to exploit this vulnerability. However, devices are vulnerable only if configured to use the Comexe DDNS service.\n\nThe specific flaw exists within the handling of DNS names. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a buffer. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-22523.",
    "published": "2024-05-23T22:15:13.503",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2024-5246": {
    "cvss": 8.8,
    "description": "NETGEAR ProSAFE Network Management System Tomcat Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of NETGEAR ProSAFE Network Management System. Authentication is required to exploit this vulnerability.\n\nThe specific flaw exists within the product installer. The issue results from the use of a vulnerable version of Apache Tomcat. An attacker can leverage this vulnerability to execute code in the context of SYSTEM. Was ZDI-CAN-22868.",
    "published": "2024-05-23T22:15:14.200",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2024-5247": {
    "cvss": 8.8,
    "description": "NETGEAR ProSAFE Network Management System UpLoadServlet Unrestricted File Upload Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of NETGEAR ProSAFE Network Management System. Authentication is required to exploit this vulnerability.\n\nThe specific flaw exists within the UpLoadServlet class. The issue results from the lack of proper validation of user-supplied data, which can allow the upload of arbitrary files. An attacker can leverage this vulnerability to execute code in the context of SYSTEM. Was ZDI-CAN-22923.",
    "published": "2024-05-23T22:15:14.387",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2024-5291": {
    "cvss": 8.8,
    "description": "D-Link DIR-2150 GetDeviceSettings Target Command Injection Remote Code Execution Vulnerability. This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of D-Link DIR-2150 routers. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the SOAP API interface, which listens on TCP port 80 by default. The issue results from the lack of proper validation of a user-supplied string before using it to execute a system call. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-21235.",
    "published": "2024-05-23T22:15:14.580",
    "keywords": "remote,execution,authentication,command"
  },
  "CVE-2024-5293": {
    "cvss": 8.8,
    "description": "D-Link DIR-2640 HTTP Referer Stack-Based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of D-Link DIR-2640-US routers. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within prog.cgi, which handles HNAP requests made to the lighttpd webserver listening on TCP ports 80 and 443. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a fixed-length stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-21853.",
    "published": "2024-05-23T22:15:15.000",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2024-5294": {
    "cvss": 4.3,
    "description": "D-Link DIR-3040 prog.cgi websSecurityHandler Memory Leak Denial-of-Service Vulnerability. This vulnerability allows network-adjacent attackers to create a denial-of-service condition on affected installations of D-Link DIR-3040 routers. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the prog.cgi program, which handles HNAP requests made to the lighttpd webserver listening on ports 80 and 443. The issue results from the lack of proper memory management when processing HTTP cookie values. An attacker can leverage this vulnerability to create a denial-of-service condition on the system.\n. Was ZDI-CAN-21668.",
    "published": "2024-05-23T22:15:15.213",
    "keywords": "authentication,leak"
  },
  "CVE-2024-5295": {
    "cvss": 8.8,
    "description": "D-Link G416 flupl self Command Injection Remote Code Execution Vulnerability. This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of D-Link G416 wireless routers. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the HTTP service listening on TCP port 80. The issue results from the lack of proper validation of a user-supplied string before using it to execute a system call. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-21294.",
    "published": "2024-05-23T22:15:15.420",
    "keywords": "remote,execution,authentication,command"
  },
  "CVE-2024-5296": {
    "cvss": 9.8,
    "description": "D-Link D-View Use of Hard-coded Cryptographic Key Authentication Bypass Vulnerability. This vulnerability allows remote attackers to bypass authentication on affected installations of D-Link D-View. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the TokenUtils class. The issue results from a hard-coded cryptographic key. An attacker can leverage this vulnerability to bypass authentication on the system. Was ZDI-CAN-21991.",
    "published": "2024-05-23T22:15:15.617",
    "keywords": "remote,authentication,bypass"
  },
  "CVE-2024-5297": {
    "cvss": 8.8,
    "description": "D-Link D-View executeWmicCmd Command Injection Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of D-Link D-View. Although authentication is required to exploit this vulnerability, the existing authentication mechanism can be bypassed.\n\nThe specific flaw exists within the executeWmicCmd method. The issue results from the lack of proper validation of a user-supplied string before using it to execute a system call. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-21821.",
    "published": "2024-05-23T22:15:15.890",
    "keywords": "remote,execution,authentication,command,bypass"
  },
  "CVE-2024-5298": {
    "cvss": 8.8,
    "description": "D-Link D-View queryDeviceCustomMonitorResult Exposed Dangerous Method Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of D-Link D-View. Although authentication is required to exploit this vulnerability, the existing authentication mechanism can be bypassed.\n\nThe specific flaw exists within the queryDeviceCustomMonitorResult method. The issue results from an exposed dangerous method. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-21842.",
    "published": "2024-05-23T22:15:16.107",
    "keywords": "remote,execution,authentication,bypass"
  },
  "CVE-2024-5299": {
    "cvss": 8.8,
    "description": "D-Link D-View execMonitorScript Exposed Dangerous Method Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of D-Link D-View. Although authentication is required to exploit this vulnerability, the existing authentication mechanism can be bypassed.\n\nThe specific flaw exists within the execMonitorScript method. The issue results from an exposed dangerous method. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-21828.",
    "published": "2024-05-23T22:15:16.320",
    "keywords": "remote,execution,authentication,bypass"
  },
  "CVE-2024-4544": {
    "cvss": 9.8,
    "description": "The Pie Register - Social Sites Login (Add on) plugin for WordPress is vulnerable to authentication bypass in versions up to, and including, 1.7.7. This is due to insufficient verification on the user being supplied during a social login through the plugin. This makes it possible for unauthenticated attackers to log in as any existing user on the site, such as an administrator, if they have access to the email.",
    "published": "2024-05-24T04:15:08.670",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-36361": {
    "url": "https://github.com/pugjs/pug/pull/3428",
    "cvss": "-",
    "description": "Pug through 3.0.2 allows JavaScript code execution if an application accepts untrusted input for the name option of the compileClient, compileFileClient, or compileClientWithDependenciesTracked function. NOTE: these functions are for compiling Pug templates into JavaScript, and there would typically be no reason to allow untrusted callers.",
    "published": "2024-05-24T06:15:08.947"
  },
  "CVE-2024-4037": {
    "cvss": 6.5,
    "description": "The WP Photo Album Plus plugin for WordPress is vulnerable to arbitrary shortcode execution in all versions up to, and including, 8.7.02.003. This is due to the plugin allowing unauthenticated users to execute an action that does not properly validate a value before running do_shortcode. This makes it possible for unauthenticated attackers to execute arbitrary shortcodes.",
    "published": "2024-05-24T09:15:08.873",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-5315": {
    "cvss": 9.1,
    "description": "Vulnerabilities in Dolibarr ERP - CRM that affect version 9.0.1 and allow SQL injection. These vulnerabilities could allow a remote attacker to send a specially crafted SQL query to the system and retrieve all the information stored in the database through the parameters \n\nviewstatut in /dolibarr/commande/list.php.",
    "published": "2024-05-24T10:15:11.197",
    "keywords": "remote,command"
  },
  "CVE-2024-35591": {
    "url": "https://github.com/o2oa/o2oa/issues/156",
    "cvss": "-",
    "description": "An arbitrary file upload vulnerability in O2OA v8.3.8 allows attackers to execute arbitrary code via uploading a crafted PDF file.",
    "published": "2024-05-24T14:15:17.153"
  },
  "CVE-2024-22588": {
    "url": "https://github.com/ptrd/kwik/issues/31",
    "cvss": "-",
    "description": "Kwik commit 745fd4e2 does not discard unused encryption keys.",
    "published": "2024-05-24T15:15:23.377"
  },
  "CVE-2024-33809": {
    "url": "https://github.com/pingcap/tidb/issues/52159",
    "cvss": "-",
    "description": "PingCAP TiDB v7.5.1 was discovered to contain a buffer overflow vulnerability, which could lead to database crashes and denial of service attacks.",
    "published": "2024-05-24T15:15:24.040"
  },
  "CVE-2024-35618": {
    "url": "https://github.com/pingcap/tidb/issues/52768",
    "cvss": "-",
    "description": "PingCAP TiDB v7.5.1 was discovered to contain a NULL pointer dereference via the component SortedRowContainer.",
    "published": "2024-05-24T15:15:24.670"
  },
  "CVE-2024-33427": {
    "url": "https://github.com/squid-cache/squid/pull/1763",
    "cvss": "-",
    "description": "Buffer Overflow vulnerability in Squid version before v.6.10 allows a local attacker cause a denial of service via a improper check of string in function ConfigParser::UnQuote.",
    "published": "2024-05-24T16:15:10.253"
  },
  "CVE-2024-34995": {
    "url": "https://github.com/cym1102/svnwebui/issues/8",
    "cvss": "-",
    "description": "svnWebUI v1.8.3 was discovered to contain an arbitrary file deletion vulnerability via the dirTemps parameter under com.cym.controller.UserController#importOver. This vulnerability allows attackers to delete arbitrary files via a crafted POST request.",
    "published": "2024-05-24T16:15:10.460"
  },
  "CVE-2024-35373": {
    "cvss": "-",
    "description": "Mocodo Mocodo Online 4.2.6 and below is vulnerable to Remote Code Execution via /web/rewrite.php.",
    "published": "2024-05-24T21:15:59.720",
    "keywords": "remote,execution"
  },
  "CVE-2024-35374": {
    "cvss": "-",
    "description": "Mocodo Mocodo Online 4.2.6 and below does not properly sanitize the sql_case input field in /web/generate.php, allowing remote attackers to execute arbitrary SQL commands and potentially command injection, leading to remote code execution (RCE) under certain conditions.",
    "published": "2024-05-24T21:15:59.793",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-5336": {
    "cvss": 4.7,
    "description": "A vulnerability has been found in Ruijie RG-UAC up to 20240516 and classified as critical. This vulnerability affects the function addVlan of the file /view/networkConfig/vlan/vlan_add_commit.php. The manipulation of the argument phyport leads to os command injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. VDB-266242 is the identifier assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-05-25T15:15:09.150",
    "keywords": "remote,command"
  },
  "CVE-2024-5337": {
    "cvss": 4.7,
    "description": "A vulnerability was found in Ruijie RG-UAC up to 20240516 and classified as critical. This issue affects some unknown processing of the file /view/systemConfig/sys_user/user_commit.php. The manipulation of the argument email2/user_name leads to os command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-266243. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-05-25T15:15:09.943",
    "keywords": "remote,command"
  },
  "CVE-2024-5338": {
    "cvss": 4.7,
    "description": "A vulnerability was found in Ruijie RG-UAC up to 20240516. It has been classified as critical. Affected is an unknown function of the file /view/vpn/autovpn/online.php. The manipulation of the argument peernode leads to os command injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-266244. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-05-25T16:15:08.390",
    "keywords": "remote,command,vpn"
  },
  "CVE-2024-5339": {
    "cvss": 4.7,
    "description": "A vulnerability was found in Ruijie RG-UAC up to 20240516. It has been declared as critical. Affected by this vulnerability is an unknown functionality of the file /view/vpn/autovpn/online_check.php. The manipulation of the argument peernode leads to os command injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-266245 was assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-05-25T17:15:15.830",
    "keywords": "remote,command,vpn"
  }
}