{
  "CVE-2024-24485": {
    "cvss": "-",
    "description": "An issue discovered in silex technology DS-600 Firmware v.1.4.1 allows a remote attacker to obtain sensitive information via the GET EEP_DATA command.",
    "published": "2024-04-15T19:15:09.740",
    "keywords": "remote,command,sensitive"
  },
  "CVE-2024-24486": {
    "cvss": "-",
    "description": "An issue discovered in silex technology DS-600 Firmware v.1.4.1 allows a remote attacker to edit device settings via the SAVE EEP_DATA command.",
    "published": "2024-04-15T19:15:09.787",
    "keywords": "remote,command"
  },
  "CVE-2024-24487": {
    "cvss": "-",
    "description": "An issue discovered in silex technology DS-600 Firmware v.1.4.1 allows a remote attacker to cause a denial of service via crafted UDP packets using the EXEC REBOOT SYSTEM command.",
    "published": "2024-04-15T19:15:09.830",
    "keywords": "remote,command"
  },
  "CVE-2024-32035": {
    "url": "https://github.com/sixlabors/imagesharp/commit/f21d64188e59ae9464ff462056a5e29d8e618b27",
    "cvss": 5.3,
    "description": "ImageSharp is a 2D graphics API. A vulnerability discovered in the ImageSharp library, where the processing of specially crafted files can lead to excessive memory usage in image decoders. The vulnerability is triggered when ImageSharp attempts to process image files that are designed to exploit this flaw.  This flaw can be exploited to cause a denial of service (DoS) by depleting process memory, thereby affecting applications and services that rely on ImageSharp for image processing tasks. Users and administrators are advised to update to the latest version of ImageSharp that addresses this vulnerability to mitigate the risk of exploitation. The problem has been patched in v3.1.4 and v2.1.8.",
    "published": "2024-04-15T20:15:11.323"
  },
  "CVE-2024-32036": {
    "cvss": 5.3,
    "description": "ImageSharp is a 2D graphics API. A data leakage flaw was found in ImageSharp's JPEG and TGA decoders. This vulnerability is triggered when an attacker passes a specially crafted JPEG or TGA image file to a software using ImageSharp, potentially disclosing sensitive information from other parts of the software in the resulting image buffer. The problem has been patched in v3.1.4 and v2.1.8.",
    "published": "2024-04-15T20:15:11.543",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-0404": {
    "url": "https://github.com/mintplex-labs/anything-llm/commit/8cd3a92c660b202655d99bee90b2864694c99946",
    "cvss": 9.1,
    "description": "A mass assignment vulnerability exists in the `/api/invite/:code` endpoint of the mintplex-labs/anything-llm repository, allowing unauthorized creation of high-privileged accounts. By intercepting and modifying the HTTP request during the account creation process via an invitation link, an attacker can add a `role` property with `admin` value, thereby gaining administrative access. This issue arises due to the lack of property allowlisting and blocklisting, enabling the attacker to exploit the system and perform actions as an administrator.",
    "published": "2024-04-16T00:15:07.387"
  },
  "CVE-2024-0549": {
    "url": "https://github.com/mintplex-labs/anything-llm/commit/026849df0224b6a8754f4103530bc015874def62",
    "cvss": 8.1,
    "description": "mintplex-labs/anything-llm is vulnerable to a relative path traversal attack, allowing unauthorized attackers with a default role account to delete files and folders within the filesystem, including critical database files such as 'anythingllm.db'. The vulnerability stems from insufficient input validation and normalization in the handling of file and folder deletion requests. Successful exploitation results in the compromise of data integrity and availability.",
    "published": "2024-04-16T00:15:07.603"
  },
  "CVE-2024-1558": {
    "cvss": 7.5,
    "description": "A path traversal vulnerability exists in the `_create_model_version()` function within `server/handlers.py` of the mlflow/mlflow repository, due to improper validation of the `source` parameter. Attackers can exploit this vulnerability by crafting a `source` parameter that bypasses the `_validate_non_local_source_contains_relative_paths(source)` function's checks, allowing for arbitrary file read access on the server. The issue arises from the handling of unquoted URL characters and the subsequent misuse of the original `source` value for model version creation, leading to the exposure of sensitive files when interacting with the `/model-versions/get-artifact` handler.",
    "published": "2024-04-16T00:15:08.533",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-1561": {
    "cvss": 7.5,
    "description": "An issue was discovered in gradio-app/gradio, where the `/component_server` endpoint improperly allows the invocation of any method on a `Component` class with attacker-controlled arguments. Specifically, by exploiting the `move_resource_to_block_cache()` method of the `Block` class, an attacker can copy any file on the filesystem to a temporary directory and subsequently retrieve it. This vulnerability enables unauthorized local file read access, posing a significant risk especially when the application is exposed to the internet via `launch(share=True)`, thereby allowing remote attackers to read files on the host machine. Furthermore, gradio apps hosted on `huggingface.co` are also affected, potentially leading to the exposure of sensitive information such as API keys and credentials stored in environment variables.",
    "published": "2024-04-16T00:15:08.887",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-1646": {
    "cvss": 8.2,
    "description": "parisneo/lollms-webui is vulnerable to authentication bypass due to insufficient protection over sensitive endpoints. The application checks if the host parameter is not '0.0.0.0' to restrict access, which is inadequate when the application is bound to a specific interface, allowing unauthorized access to endpoints such as '/restart_program', '/update_software', '/check_update', '/start_recording', and '/stop_recording'. This vulnerability can lead to denial of service, unauthorized disabling or overriding of recordings, and potentially other impacts if certain features are enabled in the configuration.",
    "published": "2024-04-16T00:15:09.967",
    "keywords": "authentication,sensitive,bypass"
  },
  "CVE-2024-1739": {
    "cvss": 7.5,
    "description": "lunary-ai/lunary is vulnerable to an authentication issue due to improper validation of email addresses during the signup process. Specifically, the server fails to treat email addresses as case insensitive, allowing the creation of multiple accounts with the same email address by varying the case of the email characters. For example, accounts for 'abc@gmail.com' and 'Abc@gmail.com' can both be created, leading to potential impersonation and confusion among users.",
    "published": "2024-04-16T00:15:10.697",
    "keywords": "authentication,sensitive"
  },
  "CVE-2024-1961": {
    "cvss": 8.8,
    "description": "vertaai/modeldb is vulnerable to a path traversal attack due to improper sanitization of user-supplied file paths in its file upload functionality. Attackers can exploit this vulnerability to write arbitrary files anywhere in the file system by manipulating the 'artifact_path' parameter. This flaw can lead to Remote Code Execution (RCE) by overwriting critical files, such as the application's configuration file, especially when the application is run outside of Docker. The vulnerability is present in the NFSController.java and NFSService.java components of the application.",
    "published": "2024-04-16T00:15:10.867",
    "keywords": "remote,execution"
  },
  "CVE-2024-2260": {
    "cvss": 4.2,
    "description": "A session fixation vulnerability exists in the zenml-io/zenml application, where JWT tokens used for user authentication are not invalidated upon logout. This flaw allows an attacker to bypass authentication mechanisms by reusing a victim's JWT token.",
    "published": "2024-04-16T00:15:11.237",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-2912": {
    "cvss": 9.8,
    "description": "An insecure deserialization vulnerability exists in the BentoML framework, allowing remote code execution (RCE) by sending a specially crafted POST request. By exploiting this vulnerability, attackers can execute arbitrary commands on the server hosting the BentoML application. The vulnerability is triggered when a serialized object, crafted to execute OS commands upon deserialization, is sent to any valid BentoML endpoint. This issue poses a significant security risk, enabling attackers to compromise the server and potentially gain unauthorized access or control.",
    "published": "2024-04-16T00:15:11.427",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-3028": {
    "url": "https://github.com/mintplex-labs/anything-llm/commit/7de23dbb2da932fbfb39f56d981784d3702cf5ce",
    "cvss": 7.2,
    "description": "mintplex-labs/anything-llm is vulnerable to improper input validation, allowing attackers to read and delete arbitrary files on the server. By manipulating the 'logo_filename' parameter in the 'system-preferences' API endpoint, an attacker can construct requests to read sensitive files or the application's '.env' file, and even delete files by setting the 'logo_filename' to the path of the target file and invoking the 'remove-logo' API endpoint. This vulnerability is due to the lack of proper sanitization of user-supplied input.",
    "published": "2024-04-16T00:15:11.667"
  },
  "CVE-2024-3029": {
    "url": "https://github.com/mintplex-labs/anything-llm/commit/99cfee1e7025fe9a0919a4d506ba1e1b819f6073",
    "cvss": 9.0,
    "description": "In mintplex-labs/anything-llm, an attacker can exploit improper input validation by sending a malformed JSON payload to the '/system/enable-multi-user' endpoint. This triggers an error that is caught by a catch block, which in turn deletes all users and disables the 'multi_user_mode'. The vulnerability allows an attacker to remove all existing users and potentially create a new admin user without requiring a password, leading to unauthorized access and control over the application.",
    "published": "2024-04-16T00:15:11.850"
  },
  "CVE-2024-3271": {
    "cvss": 9.8,
    "description": "A command injection vulnerability exists in the run-llama/llama_index repository, specifically within the safe_eval function. Attackers can bypass the intended security mechanism, which checks for the presence of underscores in code generated by LLM, to execute arbitrary code. This is achieved by crafting input that does not contain an underscore but still results in the execution of OS commands. The vulnerability allows for remote code execution (RCE) on the server hosting the application.",
    "published": "2024-04-16T00:15:12.017",
    "keywords": "remote,execution,command,bypass"
  },
  "CVE-2024-3571": {
    "cvss": 6.5,
    "description": "langchain-ai/langchain is vulnerable to path traversal due to improper limitation of a pathname to a restricted directory ('Path Traversal') in its LocalFileStore functionality. An attacker can leverage this vulnerability to read or write files anywhere on the filesystem, potentially leading to information disclosure or remote code execution. The issue lies in the handling of file paths in the mset and mget methods, where user-supplied input is not adequately sanitized, allowing directory traversal sequences to reach unintended directories.",
    "published": "2024-04-16T00:15:12.203",
    "keywords": "remote,execution"
  },
  "CVE-2024-3573": {
    "cvss": 9.3,
    "description": "mlflow/mlflow is vulnerable to Local File Inclusion (LFI) due to improper parsing of URIs, allowing attackers to bypass checks and read arbitrary files on the system. The issue arises from the 'is_local_uri' function's failure to properly handle URIs with empty or 'file' schemes, leading to the misclassification of URIs as non-local. Attackers can exploit this by crafting malicious model versions with specially crafted 'source' parameters, enabling the reading of sensitive files within at least two directory levels from the server's root.",
    "published": "2024-04-16T00:15:12.570",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-3574": {
    "cvss": 7.5,
    "description": "In scrapy version 2.10.1, an issue was identified where the Authorization header, containing credentials for server authentication, is leaked to a third-party site during a cross-domain redirect. This vulnerability arises from the failure to remove the Authorization header when redirecting across domains. The exposure of the Authorization header to unauthorized actors could potentially allow for account hijacking.",
    "published": "2024-04-16T00:15:12.750",
    "keywords": "authentication,leak"
  },
  "CVE-2024-3871": {
    "cvss": 9.8,
    "description": "The Delta Electronics DVW-W02W2-E2 devices expose a web administration interface to users. This interface implements multiple features that are affected by command injections and stack overflows vulnerabilities.\nSuccessful exploitation of these flaws would allow remote unauthenticated attackers to gain remote code execution with elevated privileges on the affected devices.\n\nThis issue affects DVW-W02W2-E2 through version 2.5.2.\n\n",
    "published": "2024-04-16T09:15:08.630",
    "keywords": "remote,execution,unauthenticated,command"
  },
  "CVE-2024-3872": {
    "cvss": 3.1,
    "description": "Mattermost Mobile app versions 2.13.0 and earlier use a regular expression with polynomial complexity to parse certain deeplinks, which allows an unauthenticated remote attacker to freeze or crash the app via a long maliciously crafted link.\n\n",
    "published": "2024-04-16T09:15:08.817",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-3067": {
    "cvss": 7.2,
    "description": "The WooCommerce Google Feed Manager plugin for WordPress is vulnerable to SQL Injection via the 'id' parameter in all versions up to, and including, 2.4.2 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for authenticated attackers, with administrator-level access and above, to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database. This can also be used by unauthenticated attackers to inject malicious web scripts.",
    "published": "2024-04-16T13:15:11.230",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-3880": {
    "cvss": 6.3,
    "description": "A vulnerability has been found in Tenda W30E 1.0.1.25(633) and classified as critical. This vulnerability affects the function formWriteFacMac of the file /goform/WriteFacMac. The manipulation of the argument mac leads to os command injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. VDB-260914 is the identifier assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-04-16T19:15:08.357",
    "keywords": "remote,command"
  },
  "CVE-2024-30378": {
    "cvss": 5.5,
    "description": "A Use After Free vulnerability in command processing of Juniper Networks Junos OS on MX Series allows a local, authenticated attacker to cause the broadband edge service manager daemon (bbe-smgd) to crash upon execution of specific CLI commands, creating a Denial of Service (DoS) condition.  The process crashes and restarts automatically.\n\nWhen specific CLI commands are executed, the bbe-smgd daemon attempts to write into an area of memory (mgd socket) that was already closed, causing the process to crash.  This process manages and controls the configuration of broadband subscriber sessions and services.  While the process is unavailable, additional subscribers will not be able to connect to the device, causing a temporary Denial of Service condition.\n\nThis issue only occurs if Graceful Routing Engine Switchover (GRES) and Subscriber Management are enabled.\nThis issue affects Junos OS:\n\n\n  *  All versions before 20.4R3-S5, \n  *  from 21.1 before 21.1R3-S4, \n  *  from 21.2 before 21.2R3-S3, \n  *  from 21.3 before 21.3R3-S5, \n  *  from 21.4 before 21.4R3-S5, \n  *  from 22.1 before 22.1R3, \n  *  from 22.2 before 22.2R3, \n  *  from 22.3 before 22.3R2;\n\n\n\n\n\n\n\n\n\n",
    "published": "2024-04-16T20:15:09.680",
    "keywords": "execution,command"
  },
  "CVE-2024-31887": {
    "cvss": 7.5,
    "description": "IBM Security Verify Privilege 11.6.25 could allow an unauthenticated actor to obtain sensitive information from the SOAP API.   IBM X-Force ID:  287651.",
    "published": "2024-04-16T22:15:35.240",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-31760": {
    "url": "https://github.com/flipped-aurora/gin-vue-admin/issues/1324",
    "cvss": "-",
    "description": "An issue in sanluan flipped-aurora gin-vue-admin 2.4.x allows an attacker to escalate privileges via the Session Expiration component.",
    "published": "2024-04-16T23:15:09.107"
  },
  "CVE-2024-22354": {
    "cvss": 7.0,
    "description": "\nIBM WebSphere Application Server 8.5, 9.0 and IBM WebSphere Application Server Liberty 17.0.0.3 through 24.0.0.3 are vulnerable to an XML External Entity Injection (XXE) attack when processing XML data. A remote attacker could exploit this vulnerability to expose sensitive information, consume memory resources, or to conduct a server-side request forgery attack. IBM X-Force ID: 280401.\n\n",
    "published": "2024-04-17T01:15:06.747",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-3839": {
    "cvss": "-",
    "description": "Out of bounds read in Fonts in Google Chrome prior to 124.0.6367.60 allowed a remote attacker to obtain potentially sensitive information from process memory via a crafted HTML page. (Chromium security severity: Medium)",
    "published": "2024-04-17T08:15:10.433",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-3840": {
    "cvss": "-",
    "description": "Insufficient policy enforcement in Site Isolation in Google Chrome prior to 124.0.6367.60 allowed a remote attacker to bypass navigation restrictions via a crafted HTML page. (Chromium security severity: Medium)",
    "published": "2024-04-17T08:15:10.483",
    "keywords": "remote,bypass"
  },
  "CVE-2024-3845": {
    "cvss": "-",
    "description": "Inappropriate implementation in Networks in Google Chrome prior to 124.0.6367.60 allowed a remote attacker to bypass mixed content policy via a crafted HTML page. (Chromium security severity: Low)",
    "published": "2024-04-17T08:15:10.673",
    "keywords": "remote,bypass"
  },
  "CVE-2024-3847": {
    "cvss": "-",
    "description": "Insufficient policy enforcement in WebUI in Google Chrome prior to 124.0.6367.60 allowed a remote attacker to bypass content security policy via a crafted HTML page. (Chromium security severity: Low)",
    "published": "2024-04-17T08:15:10.767",
    "keywords": "remote,bypass"
  },
  "CVE-2024-26829": {
    "cvss": "-",
    "description": "In the Linux kernel, the following vulnerability has been resolved:\n\nmedia: ir_toy: fix a memleak in irtoy_tx\n\nWhen irtoy_command fails, buf should be freed since it is allocated by\nirtoy_tx, or there is a memleak.",
    "published": "2024-04-17T10:15:09.347",
    "keywords": "command,leak"
  },
  "CVE-2024-3905": {
    "cvss": 8.8,
    "description": "A vulnerability was found in Tenda AC500 2.0.1.9(1307). It has been classified as critical. This affects the function R7WebsSecurityHandler of the file /goform/execCommand. The manipulation of the argument password leads to stack-based buffer overflow. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-261141 was assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-04-17T11:15:11.620",
    "keywords": "remote,command"
  },
  "CVE-2024-3908": {
    "cvss": 6.3,
    "description": "A vulnerability classified as critical has been found in Tenda AC500 2.0.1.9(1307). Affected is the function formWriteFacMac of the file /goform/WriteFacMac. The manipulation of the argument mac leads to command injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-261144. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-04-17T12:15:07.633",
    "keywords": "remote,command"
  },
  "CVE-2024-3909": {
    "cvss": 8.8,
    "description": "A vulnerability classified as critical was found in Tenda AC500 2.0.1.9(1307). Affected by this vulnerability is the function formexeCommand of the file /goform/execCommand. The manipulation of the argument cmdinput leads to stack-based buffer overflow. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-261145 was assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-04-17T12:15:07.853",
    "keywords": "remote,command"
  },
  "CVE-2024-1132": {
    "cvss": 8.1,
    "description": "A flaw was found in Keycloak, where it does not properly validate URLs included in a redirect. This issue could allow an attacker to construct a malicious request to bypass validation and access other URLs and sensitive information within the domain or conduct further attacks. This flaw affects any client that utilizes a wildcard in the Valid Redirect URIs field, and requires user interaction within the malicious URL.",
    "published": "2024-04-17T14:15:07.953",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-32463": {
    "url": "https://github.com/phlex-ruby/phlex/commit/9e3f5b980655817993682e409cbda72956d865cb",
    "cvss": 7.1,
    "description": "phlex is an open source framework for building object-oriented views in Ruby. There is a potential cross-site scripting (XSS) vulnerability that can be exploited via maliciously crafted user data. The filter to detect and prevent the use of the `javascript:` URL scheme in the `href` attribute of an `<a>` tag could be bypassed with tab `\\t` or newline `\\n` characters between the characters of the protocol, e.g. `java\\tscript:`. This vulnerability is fixed in 1.10.1, 1.9.2, 1.8.3, 1.7.2, 1.6.3, 1.5.3, and 1.4.2. Configuring a Content Security Policy that does not allow `unsafe-inline` would effectively prevent this vulnerability from being exploited.",
    "published": "2024-04-17T16:15:09.243"
  },
  "CVE-2024-29950": {
    "cvss": 7.5,
    "description": "The class FileTransfer implemented in Brocade SANnav before v2.3.1, v2.3.0a, uses the ssh-rsa signature scheme, which has a SHA-1 hash.\nThe vulnerability could allow a remote, unauthenticated attacker to perform a man-in-the-middle attack.\n",
    "published": "2024-04-17T19:15:07.213",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-31031": {
    "url": "https://github.com/obgm/libcoap/issues/1351",
    "cvss": "-",
    "description": "An issue in `coap_pdu.c` in libcoap 4.3.4 allows attackers to cause undefined behavior via a sequence of messages leading to unsigned integer overflow.",
    "published": "2024-04-17T19:15:07.623"
  },
  "CVE-2024-31040": {
    "url": "https://github.com/nanomq/nanomq/issues/1720",
    "cvss": "-",
    "description": "Buffer Overflow vulnerability in the get_var_integer function in mqtt_parser.c in NanoMQ 0.21.7 allows remote attackers to cause a denial of service via a series of specially crafted hexstreams.",
    "published": "2024-04-17T19:15:07.680"
  },
  "CVE-2024-31041": {
    "url": "https://github.com/nanomq/nanomq/issues/1723",
    "cvss": "-",
    "description": "Null Pointer Dereference vulnerability in topic_filtern function in mqtt_parser.c in NanoMQ 0.21.7 allows attackers to cause a denial of service.",
    "published": "2024-04-17T19:15:07.733"
  }
}