{
  "CVE-2024-55956": {
    "cvss": 9.8,
    "description": "In Cleo Harmony before 5.8.0.24, VLTrader before 5.8.0.24, and LexiCom before 5.8.0.24, an unauthenticated user can import and execute arbitrary Bash or PowerShell commands on the host system by leveraging the default settings of the Autorun directory.",
    "published": "2024-12-13T21:15:13.767",
    "keywords": "unauthenticated,command"
  },
  "CVE-2024-12553": {
    "cvss": 6.5,
    "description": "GeoVision GV-ASManager Missing Authorization Information Disclosure Vulnerability. This vulnerability allows remote attackers to disclose sensitive information on affected installations of GeoVision GV-ASManager. Although authentication is required to exploit this vulnerability, default guest credentials may be used.\n\nThe specific flaw exists within the GV-ASWeb service. The issue results from the lack of authorization prior to allowing access to functionality. An attacker can leverage this vulnerability to disclose stored credentials, leading to further compromise. Was ZDI-CAN-25394.",
    "published": "2024-12-13T23:15:06.310",
    "keywords": "remote,authentication,sensitive"
  },
  "CVE-2024-12578": {
    "cvss": 5.3,
    "description": "The Tickera – WordPress Event Ticketing plugin for WordPress is vulnerable to Information Exposure in all versions up to, and including, 3.5.4.8 via the 'tickera_tickets_info' endpoint. This makes it possible for unauthenticated attackers to extract sensitive data from bookings like full names, email addresses, check-in/out timestamps and more.",
    "published": "2024-12-14T05:15:12.000",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-9698": {
    "cvss": 7.2,
    "description": "The Crafthemes Demo Import plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the 'process_uploaded_files' function in all versions up to, and including, 3.3. This makes it possible for authenticated attackers, with Administrator-level access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-12-14T05:15:12.987",
    "keywords": "remote,execution"
  },
  "CVE-2024-11711": {
    "cvss": 7.5,
    "description": "The WP Job Portal – A Complete Recruitment System for Company or Job Board website plugin for WordPress is vulnerable to SQL Injection via the 'resumeid' parameter in all versions up to, and including, 2.2.1 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-12-14T07:15:06.187",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-56074": {
    "url": "https://github.com/cyclotruc/gitingest/pull/23",
    "cvss": 5.5,
    "description": "gitingest before 9996a06 mishandles symbolic links that point outside of the base directory.",
    "published": "2024-12-15T04:15:05.360"
  },
  "CVE-2024-56082": {
    "url": "https://github.com/andrewnguonly/lumos/issues/193",
    "cvss": 3.5,
    "description": "ChatBar.tsx in Lumos before 1.0.17 parses raw HTML in Markdown because the markdown-to-jsx package is used without disableParsingRawHTML set to true.",
    "published": "2024-12-15T05:15:05.803"
  },
  "CVE-2024-53376": {
    "cvss": "-",
    "description": "CyberPanel before 2.3.8 allows remote authenticated users to execute arbitrary commands via shell metacharacters in the phpSelection field to the websites/submitWebsiteCreation URI.",
    "published": "2024-12-16T04:15:05.263",
    "keywords": "remote,command"
  },
  "CVE-2024-56084": {
    "cvss": 7.1,
    "description": "An issue was discovered in Logpoint UniversalNormalizer before 5.7.0. Authenticated users can inject payloads while creating Universal Normalizer. These are executed, leading to Remote Code Execution.",
    "published": "2024-12-16T06:15:07.070",
    "keywords": "remote,execution"
  },
  "CVE-2024-56086": {
    "cvss": 7.1,
    "description": "An issue was discovered in Logpoint before 7.5.0. Authenticated users can inject payloads in Report Templates. These are executed when the backup process is initiated, leading to Remote Code Execution.",
    "published": "2024-12-16T06:15:07.557",
    "keywords": "remote,execution"
  },
  "CVE-2024-56112": {
    "url": "https://github.com/usmannasir/cyberpanel/commit/f0cf648c7851c96c36bb0c390d13e60931f45900",
    "cvss": 6.1,
    "description": "CyberPanel (aka Cyber Panel) before f0cf648 allows XSS via token or username to plogical/phpmyadminsignin.php.",
    "published": "2024-12-16T06:15:07.920"
  },
  "CVE-2024-12641": {
    "cvss": 9.6,
    "description": "TenderDocTransfer from Chunghwa Telecom has a Reflected Cross-site scripting vulnerability. The application sets up a simple local web server and provides APIs for communication with the target website. Due to the lack of CSRF protection for the APIs, unauthenticated remote attackers could use specific APIs through phishing to execute arbitrary JavaScript code in the user’s browser. Since the web server set by the application supports Node.Js features, attackers can further leverage this to run OS commands.",
    "published": "2024-12-16T07:15:05.787",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-12642": {
    "cvss": 8.1,
    "description": "TenderDocTransfer from Chunghwa Telecom has an Arbitrary File Write vulnerability. The application sets up a simple local web server and provides APIs for communication with the target website. Due to the lack of CSRF protection for the APIs, unauthenticated remote attackers could use these APIs through phishing. Additionally, one of the APIs contains a Relative Path Traversal vulnerability, allowing attackers to write arbitrary files to any path on the user's system.",
    "published": "2024-12-16T07:15:06.023",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-12643": {
    "cvss": 8.1,
    "description": "The tbm-client from Chunghwa Telecom has an Arbitrary File Delete vulnerability. The application sets up a simple local web server and provides APIs for communication with the target website. Due to the lack of CSRF protection in the APIs, unauthenticated remote attackers could use these APIs through phishing. Additionally, one of the APIs contains an Absolute Path Traversal vulnerability, allowing attackers to delete arbitrary files on the user's system.",
    "published": "2024-12-16T07:15:06.217",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-12644": {
    "cvss": 7.1,
    "description": "The tbm-client from Chunghwa Telecom has an Arbitrary File vulnerability. The application sets up a simple local web server and provides APIs for communication with the target website. Due to the lack of CSRF protection in the APIs, unauthenticated remote attackers could use these APIs through phishing. Additionally, one of the APIs contains an Absolute Path Traversal vulnerability. Attackers can copy arbitrary files on the user's system and paste them into any path, which poses a potential risk of information leakage or could consume hard drive space by copying files in large volumes.",
    "published": "2024-12-16T07:15:06.387",
    "keywords": "remote,unauthenticated,leak"
  },
  "CVE-2024-12645": {
    "cvss": 6.5,
    "description": "The topm-client from Chunghwa Telecom has an Arbitrary File Read vulnerability. The application sets up a simple local web server and provides APIs for communication with the target website. Due to the lack of CSRF protection for the APIs, unauthenticated remote attackers could use these APIs through phishing. Additionally, one of the APIs contains a Relative Path Traversal vulnerability, allowing attackers to read arbitrary files on the user's system.",
    "published": "2024-12-16T07:15:06.560",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-12646": {
    "cvss": 8.1,
    "description": "The topm-client from Chunghwa Telecom has an Arbitrary File Delete vulnerability. The application sets up a simple local web server and provides APIs for communication with the target website. Due to the lack of CSRF protection in the APIs, unauthenticated remote attackers could use these APIs through phishing. Additionally, one of the APIs contains an Absolute Path Traversal vulnerability, allowing attackers to delete arbitrary files on the user's system.",
    "published": "2024-12-16T07:15:06.737",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-9678": {
    "cvss": 4.9,
    "description": "An SQL Injection vulnerability existed in DLP Extension 11.11.1.3.  The vulnerability allowed an attacker to perform arbitrary SQL queries potentially leading to command execution.",
    "published": "2024-12-16T07:15:06.917",
    "keywords": "execution,command"
  },
  "CVE-2024-49775": {
    "cvss": 9.8,
    "description": "A vulnerability has been identified in Opcenter Execution Foundation (All versions), Opcenter Intelligence (All versions), Opcenter Quality (All versions), Opcenter RDL (All versions), SIMATIC PCS neo V4.0 (All versions), SIMATIC PCS neo V4.1 (All versions), SIMATIC PCS neo V5.0 (All versions < V5.0 Update 1), SINEC NMS (All versions if operated in conjunction with UMC < V2.15), Totally Integrated Automation Portal (TIA Portal) V16 (All versions), Totally Integrated Automation Portal (TIA Portal) V17 (All versions), Totally Integrated Automation Portal (TIA Portal) V18 (All versions), Totally Integrated Automation Portal (TIA Portal) V19 (All versions). Affected products contain a heap-based buffer overflow vulnerability in the integrated UMC component.\r\nThis could allow an unauthenticated remote attacker to execute arbitrary code.",
    "published": "2024-12-16T15:15:07.173",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-56013": {
    "cvss": 8.8,
    "description": "Authentication Bypass Using an Alternate Path or Channel vulnerability in Wovax, LLC. Wovax IDX allows Authentication Bypass.This issue affects Wovax IDX: from n/a through 1.2.2.",
    "published": "2024-12-16T15:15:28.090",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-43234": {
    "cvss": 9.8,
    "description": "Authentication Bypass Using an Alternate Path or Channel vulnerability in Envato Security Team Woffice allows Authentication Bypass.This issue affects Woffice: from n/a through 5.4.14.",
    "published": "2024-12-16T16:15:07.037",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-11144": {
    "cvss": 7.5,
    "description": "The server lacks thread safety and can be crashed by anomalous data sent by an anonymous user from a remote network. The crash causes the FTP service to become unavailable, affecting all users and processes that rely on it for file transfers. If the crash occurs during file upload or download, it could lead to incomplete file transfers, potentially corrupting data. The repeated crash might also affect the stability of the underlying system, especially if it leads to resource leaks or affects other services.",
    "published": "2024-12-16T17:15:07.327",
    "keywords": "remote,leak"
  },
  "CVE-2024-12663": {
    "url": "https://github.com/funnyzpc/mee-admin/issues/9",
    "cvss": 3.7,
    "description": "A vulnerability classified as problematic was found in funnyzpc Mee-Admin up to 1.6. This vulnerability affects unknown code of the file /mee/login of the component Login. The manipulation of the argument username leads to observable response discrepancy. The attack can be initiated remotely. The complexity of an attack is rather high. The exploitation appears to be difficult. The exploit has been disclosed to the public and may be used.",
    "published": "2024-12-16T19:15:07.200"
  }
}