{
  "CVE-2024-41376": {
    "url": "https://github.com/zyx0814/dzzoffice/issues/252",
    "cvss": 8.8,
    "description": "dzzoffice 2.02.1 is vulnerable to Directory Traversal via user/space/about.php.",
    "published": "2024-08-05T17:15:41.803"
  },
  "CVE-2024-41380": {
    "url": "https://github.com/microweber/microweber/issues/1111",
    "cvss": 6.1,
    "description": "microweber 2.0.16 was discovered to contain a Cross Site Scripting (XSS) vulnerability via userfiles\\modules\\tags\\add_tagging_tagged.php.",
    "published": "2024-08-05T17:15:41.860"
  },
  "CVE-2024-41381": {
    "url": "https://github.com/microweber/microweber/issues/1110",
    "cvss": 6.1,
    "description": "microweber 2.0.16 was discovered to contain a Cross Site Scripting (XSS) vulnerability via userfiles\\modules\\settings\\admin.php.",
    "published": "2024-08-05T18:15:32.397"
  },
  "CVE-2024-42010": {
    "cvss": 7.5,
    "description": "mod_css_styles in Roundcube through 1.5.7 and 1.6.x through 1.6.7 allows a insufficiently filters Cascading Style Sheets (CSS) token sequences in rendered e-mail messages, allowing a remote attacker to obtain sensitive information.",
    "published": "2024-08-05T19:15:38.273",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-6361": {
    "cvss": "-",
    "description": "Improper Neutralization vulnerability (XSS) has been discovered in OpenText™ ALM Octane. The vulnerability affects all version prior to version 23.4. The vulnerability could cause remote code execution attack.",
    "published": "2024-08-05T19:15:38.333",
    "keywords": "remote,execution"
  },
  "CVE-2024-41958": {
    "cvss": 6.6,
    "description": "mailcow: dockerized is an open source groupware/email suite based on docker. A vulnerability has been discovered in the two-factor authentication (2FA) mechanism. This flaw allows an authenticated attacker to bypass the 2FA protection, enabling unauthorized access to other accounts that are otherwise secured with 2FA. To exploit this vulnerability, the attacker must first have access to an account within the system and possess the credentials of the target account that has 2FA enabled. By leveraging these credentials, the attacker can circumvent the 2FA process and gain access to the protected account. This issue has been addressed in the `2024-07` release. All users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-08-05T20:15:36.063",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-42350": {
    "url": "https://github.com/biscuit-auth/biscuit/commit/c87cbb5d778964d6574df3e9e6579567cad12fff",
    "cvss": 3.0,
    "description": "Biscuit is an authorization token with decentralized verification, offline attenuation and strong security policy enforcement based on a logic language. Third-party blocks can be generated without transferring the whole token to the third-party authority. Instead, a `ThirdPartyBlock` request can be sent, providing only the necessary info to generate a third-party block and to sign it: 1. the public key of the previous block (used in the signature), 2. the public keys part of the token symbol table (for public key interning in datalog expressions). A third-part block request forged by a malicious user can trick the third-party authority into generating datalog trusting the wrong keypair. Tokens with third-party blocks containing `trusted` annotations generated through a third party block request. This has been addressed in version 4 of the specification. Users are advised to update their implementations to conform. There are no known workarounds for this vulnerability.",
    "published": "2024-08-05T20:15:36.697"
  },
  "CVE-2024-23657": {
    "cvss": 8.8,
    "description": "Nuxt is a free and open-source framework to create full-stack web applications and websites with Vue.js. Nuxt Devtools is missing authentication on the `getTextAssetContent` RPC function which is vulnerable to path traversal.  Combined with a lack of Origin checks on the WebSocket handler,  an attacker is able to interact with a locally running devtools instance and exfiltrate data abusing this vulnerability. In certain configurations an attacker could leak the devtools authentication token and then abuse other RPC functions to achieve RCE. The `getTextAssetContent` function does not check for path traversals, this could allow an attacker to read arbitrary files over the RPC WebSocket. The WebSocket server does not check the origin of the request leading to cross-site-websocket-hijacking. This may be intentional to allow certain configurations to work correctly. Nuxt Devtools authentication tokens are placed within the home directory of the current user. The malicious webpage can connect to the Devtools WebSocket, perform a directory traversal brute force to find the authentication token, then use the *authenticated* `writeStaticAssets` function to create a new Component, Nitro Handler or `app.vue` file which will run automatically as the file is changed. This vulnerability has been addressed in release version 1.3.9. All users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-08-05T21:15:37.880",
    "keywords": "authentication,leak"
  },
  "CVE-2024-34344": {
    "cvss": 8.8,
    "description": "Nuxt is a free and open-source framework to create full-stack web applications and websites with Vue.js. Due to the insufficient validation of the `path` parameter in the NuxtTestComponentWrapper, an attacker can execute arbitrary JavaScript on the server side, which allows them to execute arbitrary commands. Users who open a malicious web page in the browser while running the test locally are affected by this vulnerability, which results in the remote code execution from the malicious web page. Since web pages can send requests to arbitrary addresses, a malicious web page can repeatedly try to exploit this vulnerability, which then triggers the exploit when the test server starts.",
    "published": "2024-08-05T21:15:38.457",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-7537": {
    "cvss": 3.3,
    "description": "oFono QMI SMS Handling Out-Of-Bounds Read Information Disclosure Vulnerability. This vulnerability allows local attackers to disclose sensitive information on affected installations of oFono. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the processing of SMS message lists. The issue results from the lack of proper validation of user-supplied data, which can result in a read past the end of an allocated buffer. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of root. Was ZDI-CAN-23157.",
    "published": "2024-08-06T00:15:34.653",
    "keywords": "authentication,sensitive"
  },
  "CVE-2024-7538": {
    "cvss": 7.8,
    "description": "oFono CUSD AT Command Stack-based Buffer Overflow Code Execution Vulnerability. This vulnerability allows local attackers to execute arbitrary code on affected installations of oFono. An attacker must first obtain the ability to execute code on the target modem in order to exploit this vulnerability.\n\nThe specific flaw exists within the parsing of responses from AT Commands. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-23190.",
    "published": "2024-08-06T00:15:34.860",
    "keywords": "execution,command"
  },
  "CVE-2024-7539": {
    "cvss": 7.8,
    "description": "oFono CUSD Stack-based Buffer Overflow Code Execution Vulnerability. This vulnerability allows local attackers to execute arbitrary code on affected installations of oFono. An attacker must first obtain the ability to execute code on the target modem in order to exploit this vulnerability.\n\nThe specific flaw exists within the parsing of responses from AT+CUSD commands. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-23195.",
    "published": "2024-08-06T00:15:35.053",
    "keywords": "execution,command"
  },
  "CVE-2024-7540": {
    "cvss": 3.3,
    "description": "oFono AT CMGL Command Uninitialized Variable Information Disclosure Vulnerability. This vulnerability allows local attackers to disclose sensitive information on affected installations of oFono. An attacker must first obtain the ability to execute code on the target modem in order to exploit this vulnerability.\n\nThe specific flaw exists within the parsing of responses from AT+CMGL commands. The issue results from the lack of proper initialization of memory prior to accessing it. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of root. Was ZDI-CAN-23307.",
    "published": "2024-08-06T00:15:35.270",
    "keywords": "command,sensitive"
  },
  "CVE-2024-7541": {
    "cvss": 3.3,
    "description": "oFono AT CMT Command Uninitialized Variable Information Disclosure Vulnerability. This vulnerability allows local attackers to disclose sensitive information on affected installations of oFono. An attacker must first obtain the ability to execute code on the target modem in order to exploit this vulnerability.\n\nThe specific flaw exists within the parsing of responses from AT+CMT commands. The issue results from the lack of proper initialization of memory prior to accessing it. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of root. Was ZDI-CAN-23308.",
    "published": "2024-08-06T00:15:35.470",
    "keywords": "command,sensitive"
  },
  "CVE-2024-7542": {
    "cvss": 3.3,
    "description": "oFono AT CMGR Command Uninitialized Variable Information Disclosure Vulnerability. This vulnerability allows local attackers to disclose sensitive information on affected installations of oFono. An attacker must first obtain the ability to execute code on the target modem in order to exploit this vulnerability.\n\nThe specific flaw exists within the parsing of responses from AT+CMGR commands. The issue results from the lack of proper initialization of memory prior to accessing it. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of root. Was ZDI-CAN-23309.",
    "published": "2024-08-06T00:15:35.663",
    "keywords": "command,sensitive"
  },
  "CVE-2024-6315": {
    "cvss": 8.8,
    "description": "The Blox Page Builder plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the 'handleUploadFile' function in all versions up to, and including, 1.0.65. This makes it possible for authenticated attackers, with contributor-level and above permissions, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-08-06T02:15:35.277",
    "keywords": "remote,execution"
  },
  "CVE-2024-7484": {
    "cvss": 7.2,
    "description": "The CRM Perks Forms plugin for WordPress is vulnerable to arbitrary file uploads due to insufficient file validation on the 'handle_uploaded_files' function in versions up to, and including, 1.1.3. This makes it possible for authenticated attackers with administrator-level capabilities or above, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-08-06T02:15:35.497",
    "keywords": "remote,execution"
  },
  "CVE-2024-28962": {
    "cvss": 6.5,
    "description": "Dell Command | Update, Dell Update, and Alienware Update UWP, versions prior to 5.4, contain an Exposed Dangerous Method or Function vulnerability. An unauthenticated attacker with remote access could potentially exploit this vulnerability, leading to denial of service.",
    "published": "2024-08-06T04:16:45.810",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-6782": {
    "cvss": 9.8,
    "description": "Improper access control in Calibre 6.9.0 ~ 7.14.0 allow unauthenticated attackers to achieve remote code execution.",
    "published": "2024-08-06T04:16:46.450",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-5709": {
    "cvss": 8.8,
    "description": "The WPBakery Visual Composer plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 7.7 via the 'layout_name' parameter. This makes it possible for authenticated attackers, with Author-level access and above, and with post permissions granted by an Administrator, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-08-06T06:15:34.793",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-6201": {
    "cvss": 5.3,
    "description": "HaloITSM versions up to 2.146.1 are affected by a Template Injection vulnerability within the engine used to generate emails. This can lead to the leakage of potentially sensitive information. HaloITSM versions past 2.146.1 (and patches starting from 2.143.61 ) fix the mentioned vulnerability.",
    "published": "2024-08-06T06:15:35.283",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-7246": {
    "url": "https://github.com/grpc/grpc/issues/36245",
    "cvss": "-",
    "description": "It's possible for a gRPC client communicating with a HTTP/2 proxy to poison the HPACK table between the proxy and the backend such that other clients see failed requests. It's also possible to use this vulnerability to leak other clients HTTP header keys, but not values.\n\nThis occurs because the error status for a misencoded header is not cleared between header reads, resulting in subsequent (incrementally indexed) added headers in the first request being poisoned until cleared from the HPACK table.\n\nPlease update to a fixed version of gRPC as soon as possible. This bug has been fixed in 1.58.3, 1.59.5, 1.60.2, 1.61.3, 1.62.3, 1.63.2, 1.64.3, 1.65.4.",
    "published": "2024-08-06T11:16:07.587"
  },
  "CVE-2024-7526": {
    "cvss": 7.5,
    "description": "ANGLE failed to initialize parameters which led to reading from uninitialized memory. This could be leveraged to leak sensitive data from memory. This vulnerability affects Firefox < 129, Firefox ESR < 115.14, Firefox ESR < 128.1, Thunderbird < 128.1, and Thunderbird < 115.14.",
    "published": "2024-08-06T13:15:57.483",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-40101": {
    "cvss": "-",
    "description": "A Reflected Cross-site scripting (XSS) vulnerability exists in '/search' in microweber 2.0.15 and earlier allowing unauthenticated remote attackers to inject arbitrary web script or HTML via the 'keywords' parameter.",
    "published": "2024-08-06T14:16:04.117",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-39225": {
    "cvss": 9.8,
    "description": "GL-iNet products AR750/AR750S/AR300M/AR300M16/MT300N-V2/B1300/MT1300/SFT1200/X750 v4.3.11, MT3000/MT2500/AXT1800/AX1800/A1300/X300B v4.5.16, XE300 v4.3.16, E750 v4.3.12, AP1300/S1300 v4.3.13, and XE3000/X3000 v4.4 were discovered to contain a remote code execution (RCE) vulnerability.",
    "published": "2024-08-06T16:15:48.647",
    "keywords": "remote,execution"
  },
  "CVE-2024-39751": {
    "cvss": 4.3,
    "description": "IBM InfoSphere Information Server 11.7 could allow a remote attacker to obtain sensitive information when a detailed technical error message is returned in the browser.  This information could be used in further attacks against the system.  IBM X-Force ID:  297429",
    "published": "2024-08-06T16:15:48.930",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-7004": {
    "cvss": 4.3,
    "description": "Insufficient validation of untrusted input in Safe Browsing in Google Chrome prior to 127.0.6533.72 allowed a remote attacker who convinced a user to engage in specific UI gestures to bypass discretionary access control via a malicious file. (Chromium security severity: Low)",
    "published": "2024-08-06T16:15:50.760",
    "keywords": "remote,bypass"
  },
  "CVE-2024-7005": {
    "cvss": 8.8,
    "description": "Insufficient validation of untrusted input in Safe Browsing in Google Chrome prior to 127.0.6533.72 allowed a remote attacker who convinced a user to engage in specific UI gestures to bypass discretionary access control via a malicious file. (Chromium security severity: Low)",
    "published": "2024-08-06T16:15:50.837",
    "keywords": "remote,bypass"
  },
  "CVE-2024-7564": {
    "cvss": 6.5,
    "description": "Logsign Unified SecOps Platform Directory Traversal Information Disclosure Vulnerability. This vulnerability allows remote attackers to disclose sensitive information on affected installations of Logsign Unified SecOps Platform. Authentication is required to exploit this vulnerability.\n\nThe specific flaw exists within the get_response_json_result endpoint. The issue results from the lack of proper validation of a user-supplied path prior to using it in file operations. An attacker can leverage this vulnerability to disclose information in the context of root. Was ZDI-CAN-24680.",
    "published": "2024-08-06T16:15:51.000",
    "keywords": "remote,authentication,sensitive"
  },
  "CVE-2024-42393": {
    "cvss": 9.8,
    "description": "There are vulnerabilities in the Soft AP Daemon Service which could allow a threat actor to execute an unauthenticated RCE attack. Successful exploitation could allow an attacker to execute arbitrary commands on the underlying operating system leading to complete system compromise.",
    "published": "2024-08-06T19:15:56.640",
    "keywords": "unauthenticated,command"
  },
  "CVE-2024-42394": {
    "cvss": 9.8,
    "description": "There are vulnerabilities in the Soft AP Daemon Service which could allow a threat actor to execute an unauthenticated RCE attack. Successful exploitation could allow an attacker to execute arbitrary commands on the underlying operating system leading to complete system compromise.",
    "published": "2024-08-06T19:15:56.830",
    "keywords": "unauthenticated,command"
  },
  "CVE-2024-42395": {
    "cvss": 9.8,
    "description": "There is a vulnerability in the AP Certificate Management Service which could allow a threat actor to execute an unauthenticated RCE attack. Successful exploitation could allow an attacker to execute arbitrary commands on the underlying operating system leading to complete system compromise.",
    "published": "2024-08-06T19:15:57.017",
    "keywords": "unauthenticated,command"
  },
  "CVE-2024-38206": {
    "cvss": 8.5,
    "description": "An authenticated attacker can bypass Server-Side Request Forgery (SSRF) protection in Microsoft Copilot Studio to leak sensitive information over a network.",
    "published": "2024-08-06T22:15:54.430",
    "keywords": "sensitive,bypass,leak"
  },
  "CVE-2024-34788": {
    "cvss": 5.3,
    "description": "An improper authentication vulnerability in web component of EPMM prior to 12.1.0.1 allows a remote malicious user to access potentially sensitive information",
    "published": "2024-08-07T04:17:17.680",
    "keywords": "remote,authentication,sensitive"
  },
  "CVE-2024-36131": {
    "cvss": 8.8,
    "description": "An insecure deserialization vulnerability in web component of EPMM prior to 12.1.0.1 allows an authenticated remote attacker to execute arbitrary commands on the underlying operating system of the appliance.",
    "published": "2024-08-07T04:17:18.207",
    "keywords": "remote,command"
  },
  "CVE-2024-36132": {
    "cvss": 8.2,
    "description": "Insufficient verification of authentication controls in EPMM prior to 12.1.0.1 allows a remote attacker to bypass authentication and access sensitive resources.",
    "published": "2024-08-07T04:17:18.437",
    "keywords": "remote,authentication,sensitive,bypass"
  },
  "CVE-2024-42222": {
    "url": "https://github.com/apache/cloudstack/issues/9456",
    "cvss": "-",
    "description": "In Apache CloudStack 4.19.1.0, a regression in the network listing API allows unauthorised list access of network details for domain admin and normal user accounts. This vulnerability compromises tenant isolation, potentially leading to unauthorised access to network details, configurations and data.\n\nAffected users are advised to upgrade to version 4.19.1.1 to address this issue. Users on older versions of CloudStack considering to upgrade, can skip 4.19.1.0 and upgrade directly to 4.19.1.1.",
    "published": "2024-08-07T08:16:12.473"
  },
  "CVE-2024-7579": {
    "cvss": 6.3,
    "description": "A vulnerability was found in Alien Technology ALR-F800 up to 19.10.24.00. It has been declared as critical. Affected by this vulnerability is the function popen of the file /var/www/cgi-bin/upgrade.cgi of the component File Name Handler. The manipulation of the argument uploadedFile leads to os command injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-08-07T14:15:33.380",
    "keywords": "remote,command"
  },
  "CVE-2024-7580": {
    "cvss": 9.8,
    "description": "A vulnerability was found in Alien Technology ALR-F800 up to 19.10.24.00. It has been rated as critical. Affected by this issue is some unknown functionality of the file /admin/system.html. The manipulation of the argument uploadedFile with the input ;whoami leads to os command injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-08-07T15:15:56.500",
    "keywords": "remote,command"
  },
  "CVE-2024-41246": {
    "cvss": 5.3,
    "description": "An Incorrect Access Control vulnerability was found in /smsa/admin_dashboard.php in Kashipara Responsive School Management System v3.2.0, which allows remote unauthenticated attackers to view administrator dashboard.",
    "published": "2024-08-07T16:15:45.600",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-41247": {
    "cvss": 9.1,
    "description": "An Incorrect Access Control vulnerability was found in /smsa/add_class.php and /smsa/add_class_submit.php in Kashipara Responsive School Management System v3.2.0, which allows remote unauthenticated attackers to add a new class entry.",
    "published": "2024-08-07T16:15:45.663",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-41248": {
    "cvss": 7.5,
    "description": "An Incorrect Access Control vulnerability was found in /smsa/add_subject.php and /smsa/add_subject_submit.php in Kashipara Responsive School Management System v3.2.0, which allows remote unauthenticated attackers to add a new subject entry.",
    "published": "2024-08-07T16:15:45.717",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-41249": {
    "cvss": 7.5,
    "description": "An Incorrect Access Control vulnerability was found in /smsa/view_subject.php in Kashipara Responsive School Management System v3.2.0, which allows remote unauthenticated attackers to view SUBJECT details.",
    "published": "2024-08-07T16:15:45.780",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-41251": {
    "cvss": 6.5,
    "description": "An Incorrect Access Control vulnerability was found in /smsa/admin_teacher_register_approval.php and /smsa/admin_teacher_register_approval_submit.php in Kashipara Responsive School Management System v3.2.0, which allows remote unauthenticated attackers to view and approve Teacher registration.",
    "published": "2024-08-07T16:15:45.850",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-41252": {
    "cvss": 6.5,
    "description": "An Incorrect Access Control vulnerability was found in /smsa/admin_student_register_approval.php and /smsa/admin_student_register_approval_submit.php in Kashipara Responsive School Management System v3.2.0, which allows remote unauthenticated attackers to view and approve student registration.",
    "published": "2024-08-07T16:15:45.910",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20443": {
    "cvss": 5.4,
    "description": "A vulnerability in the web-based management interface of Cisco ISE could allow an authenticated, remote attacker to conduct an XSS attack against a user of the interface.\r\n\r\nThis vulnerability is due to insufficient validation of user-supplied input by the web-based management interface of an affected system. An attacker could exploit this vulnerability by injecting malicious code into specific pages of the interface. A successful exploit could allow the attacker to execute arbitrary script code in the context of the affected interface or access sensitive, browser-based information. To exploit this vulnerability, the attacker must have at least a low-privileged account on an affected device.",
    "published": "2024-08-07T17:15:50.053",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-20450": {
    "cvss": 9.8,
    "description": "Multiple vulnerabilities in the web-based management interface of Cisco Small Business SPA300 Series IP Phones and Cisco Small Business SPA500 Series IP Phones could allow an unauthenticated, remote attacker to execute arbitrary commands on the underlying operating system with root privileges.\r\n\r\nThese vulnerabilities exist because incoming HTTP packets are not properly checked for errors, which could result in a buffer overflow. An attacker could exploit this vulnerability by sending a crafted HTTP request to an affected device. A successful exploit could allow the attacker to overflow an internal buffer and execute arbitrary commands at the root privilege level.",
    "published": "2024-08-07T17:15:50.283",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-20451": {
    "cvss": 7.5,
    "description": "Multiple vulnerabilities in the web-based management interface of Cisco Small Business SPA300 Series IP Phones and Cisco Small Business SPA500 Series IP Phones could allow an unauthenticated, remote attacker to cause an affected device to reload unexpectedly.\r\n\r\nThese vulnerabilities exist because HTTP packets are not properly checked for errors. An attacker could exploit this vulnerability by sending a crafted HTTP packet to the remote interface of an affected device. A successful exploit could allow the attacker to cause a DoS condition on the device.",
    "published": "2024-08-07T17:15:50.493",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20454": {
    "cvss": 9.8,
    "description": "Multiple vulnerabilities in the web-based management interface of Cisco Small Business SPA300 Series IP Phones and Cisco Small Business SPA500 Series IP Phones could allow an unauthenticated, remote attacker to execute arbitrary commands on the underlying operating system with root privileges.\r\n\r\nThese vulnerabilities exist because incoming HTTP packets are not properly checked for errors, which could result in a buffer overflow. An attacker could exploit this vulnerability by sending a crafted HTTP request to an affected device. A successful exploit could allow the attacker to overflow an internal buffer and execute arbitrary commands at the root privilege level.",
    "published": "2024-08-07T17:15:50.713",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-20479": {
    "cvss": 4.8,
    "description": "A vulnerability in the web-based management interface of Cisco ISE could allow an authenticated, remote attacker to conduct an XSS attack against a user of the interface.\r\n\r\nThis vulnerability is due to insufficient validation of user-supplied input by the web-based management interface of an affected system. An attacker could exploit this vulnerability by injecting malicious code into specific pages of the interface. A successful exploit could allow the attacker to execute arbitrary script code in the context of the affected interface or access sensitive, browser-based information. To exploit this vulnerability, the attacker must have Admin privileges on an affected device.",
    "published": "2024-08-07T17:15:50.930",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-41243": {
    "cvss": "-",
    "description": "An Incorrect Access Control vulnerability was found in /smsa/view_marks.php in Kashipara Responsive School Management System v3.2.0, which allows remote unauthenticated attackers to view MARKS details.",
    "published": "2024-08-07T17:15:51.620",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-41244": {
    "cvss": 7.5,
    "description": "An Incorrect Access Control vulnerability was found in /smsa/view_class.php in Kashipara Responsive School Management System v3.2.0, which allows remote unauthenticated attackers to view CLASS details.",
    "published": "2024-08-07T17:15:51.687",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-41245": {
    "cvss": 7.5,
    "description": "An Incorrect Access Control vulnerability was found in /smsa/view_teachers.php in Kashipara Responsive School Management System v3.2.0, which allows remote unauthenticated attackers to view TEACHER details.",
    "published": "2024-08-07T17:15:51.763",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-41250": {
    "cvss": "-",
    "description": "An Incorrect Access Control vulnerability was found in /smsa/view_students.php in Kashipara Responsive School Management System v3.2.0, which allows remote unauthenticated attackers to view STUDENT details.",
    "published": "2024-08-07T17:15:51.837",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-21302": {
    "cvss": 6.7,
    "description": "Summary:\nMicrosoft was notified that an elevation of privilege vulnerability exists in Windows based systems supporting Virtualization Based Security (VBS) including a subset of Azure Virtual Machine SKUS; enabling an attacker with administrator privileges to replace current versions of Windows system files with outdated versions. By exploiting this vulnerability, an attacker could reintroduce previously mitigated vulnerabilities, circumvent some features of VBS, and exfiltrate data protected by VBS.  For more information on Windows versions and VM SKUs supporting VBS, reference: Virtualization-based Security (VBS) | Microsoft Learn..\nMicrosoft is developing a security update to mitigate this vulnerability, but it is not yet available. Guidance to help customers reduce the risks associated with this vulnerability and to protect their systems until the mitigation is available in a Windows security update is provided in the Recommended Actions section of this CVE.\nThis CVE will be updated when the mitigation is available in a Windows security update. We highly encourage customers to subscribe to Security Update Guide notifications to receive an alert when this update occurs.\nDetails:\nA security researcher informed Microsoft of an elevation of privilege vulnerability in Windows 10, Windows 11, Windows Server 2016, Windows Server 2019, Windows Server 2022 , and a subset of Azure Virtual Machines (VM) SKUs with a Windows based guestOS supporting VBS. For more information on Windows versions and VM SKUs supporting VBS, reference: Virtualization-based Security (VBS) | Microsoft Learn.\nThe vulnerability enables an attacker with administrator privileges on the target system to replace current Windows system files with outdated versions. Successful exploitation provides an attacker with the ability to reintroduce previously mitigated vulnerabilities, circumvent VBS security features, and exfiltrate data protected by VBS.\nMicrosoft is developing a security update that will revoke outdated, unpatched VBS system files to mitigate this vulnerability, but it is not yet available. Due to the complexity of blocking such a large quantity of files, rigorous testing is required to avoid integration failures or regressions. This CVE will be updated with new information and links to the security updates once available. We highly encourage customers subscribe to Security Update Guide notifications to be alerted of updates. See Microsoft Technical Security Notifications and Security Update Guide Notification System News: Create your profile now – Microsoft Security Response Center.\nMicrosoft is not aware of any attempts to exploit this vulnerability. However, a public presentation regarding this vulnerability was hosted at BlackHat on August 07th, 2024. The presentation was appropriately coordinated with Microsoft but may change the threat landscape. Customers concerned with these risks should reference the guidance provided in the Recommended Actions section of this CVE to protect their systems.\nRecommended Actions:\nThe following recommendations do not mitigate the vulnerability but can be used to reduce the risk of exploitation until the security update is available.\n\nConfigure “Audit Object Access” settings to monitor attempts to access files, such as handle creation, read / write operations, or modifications to security descriptors.\n\nAudit File System - Windows 10 | Microsoft Learn\nApply a basic audit policy on a file or folder - Windows 10 | Microsoft Learn\n\n\nAuditing sensitive privileges used to identify access, modification, or replacement of VBS related files could help indicacte attempts to exploit this vulnerability.\n\nAudit Sensitive Privilege Use - Windows 10 | Microsoft Learn\n\n\nProtect your Azure tenant by investigating administrators and users flagged for risky sign-ins and rotating their credentials.\n\nInvestigate risk Microsoft Entra ID Protection - Microsoft Entra ID Protection | Microsoft Learn\n\n\nEnabling Multi-Factor Authentication can also help alleviate concerns about compromised accounts or exposure.\n\nEnforce multifactor...",
    "published": "2024-08-08T02:15:37.827",
    "keywords": "authentication,sensitive"
  },
  "CVE-2024-7350": {
    "cvss": 9.8,
    "description": "The Appointment Booking Calendar Plugin and Online Scheduling Plugin – BookingPress plugin for WordPress is vulnerable to authentication bypass in versions 1.1.6 to 1.1.7. This is due to the plugin not properly verifying a user's identity prior to logging them in when completing a booking. This makes it possible for unauthenticated attackers to log in as registered users, including administrators, if they have access to that user's email.  This is only exploitable when the 'Auto login user after successful booking' setting is enabled.",
    "published": "2024-08-08T03:15:34.800",
    "keywords": "unauthenticated,authentication,bypass"
  }
}