{
  "CVE-2024-38016": {
    "cvss": 7.8,
    "description": "Microsoft Office Visio Remote Code Execution Vulnerability",
    "published": "2024-09-19T17:15:12.947",
    "keywords": "remote,execution"
  },
  "CVE-2024-8963": {
    "cvss": 9.4,
    "description": "Path Traversal in the Ivanti CSA before 4.6 Patch 519 allows a remote unauthenticated attacker to access restricted functionality.",
    "published": "2024-09-19T18:15:10.600",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-9001": {
    "cvss": 6.3,
    "description": "A vulnerability was found in TOTOLINK T10 4.1.8cu.5207. It has been declared as critical. This vulnerability affects the function setTracerouteCfg of the file /cgi-bin/cstecgi.cgi. The manipulation of the argument command leads to os command injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-09-19T20:15:07.810",
    "keywords": "remote,command"
  },
  "CVE-2024-43489": {
    "cvss": 6.5,
    "description": "Microsoft Edge (Chromium-based) Remote Code Execution Vulnerability",
    "published": "2024-09-19T21:15:15.677",
    "keywords": "remote,execution"
  },
  "CVE-2024-43496": {
    "cvss": 6.5,
    "description": "Microsoft Edge (Chromium-based) Remote Code Execution Vulnerability",
    "published": "2024-09-19T21:15:15.917",
    "keywords": "remote,execution"
  },
  "CVE-2024-9004": {
    "cvss": 6.3,
    "description": "A vulnerability classified as critical has been found in D-Link DAR-7000 up to 20240912. Affected is an unknown function of the file /view/DBManage/Backup_Server_commit.php. The manipulation of the argument host leads to os command injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. NOTE: This vulnerability only affects products that are no longer supported by the maintainer.",
    "published": "2024-09-19T21:15:16.383",
    "keywords": "remote,command"
  },
  "CVE-2024-45806": {
    "cvss": 6.5,
    "description": "Envoy is a cloud-native high-performance edge/middle/service proxy. A security vulnerability in Envoy allows external clients to manipulate Envoy headers, potentially leading to unauthorized access or other malicious actions within the mesh. This issue arises due to Envoy's default configuration of internal trust boundaries, which considers all RFC1918 private address ranges as internal. The default behavior for handling internal addresses in Envoy has been changed. Previously, RFC1918 IP addresses were automatically considered internal, even if the internal_address_config was empty.  The default configuration of Envoy will continue to trust internal addresses while in this release and it will not trust them by default in next release. If you have tooling such as probes on your private network which need to be treated as trusted (e.g. changing arbitrary x-envoy headers) please explicitly include those addresses or CIDR ranges into `internal_address_config`. Successful exploitation could allow attackers to bypass security controls, access sensitive data, or disrupt services within the mesh, like Istio. This issue has been addressed in versions 1.31.2, 1.30.6, 1.29.9, and 1.28.7. Users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-09-20T00:15:02.293",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-41721": {
    "cvss": 9.8,
    "description": "An insufficient boundary validation in the USB code could lead to an out-of-bounds read on the heap, which could potentially lead to an arbitrary write and remote code execution.",
    "published": "2024-09-20T08:15:11.323",
    "keywords": "remote,execution"
  },
  "CVE-2024-9043": {
    "cvss": 9.8,
    "description": "Secure Email Gateway from Cellopoint has Buffer Overflow Vulnerability in authentication process. Remote unauthenticated attackers can send crafted packets to crash the process, thereby bypassing authentication and obtaining system administrator privileges.",
    "published": "2024-09-20T11:15:13.280",
    "keywords": "remote,unauthenticated,authentication,bypass"
  },
  "CVE-2024-45489": {
    "cvss": 9.8,
    "description": "Arc before 2024-08-26 allows remote code execution in JavaScript boosts. Boosts that run JavaScript cannot be shared by default; however (because of misconfigured Firebase ACLs), it is possible to create or update a boost using another user's ID. This installs the boost in the victim's browser and runs arbitrary Javascript on that browser in a privileged context. NOTE: this is a no-action cloud vulnerability with zero affected users.",
    "published": "2024-09-20T17:15:15.060",
    "keywords": "remote,execution"
  },
  "CVE-2024-46654": {
    "url": "https://github.com/magicblack/maccms10/issues/1183",
    "cvss": 4.8,
    "description": "A stored cross-site scripting (XSS) vulnerability in the Add Scheduled Task module of Maccms10 v2024.1000.4040 allows attackers to execute arbitrary web scripts or HTML via a crafted payload.",
    "published": "2024-09-20T19:15:16.473"
  },
  "CVE-2024-46640": {
    "cvss": "-",
    "description": "SeaCMS 13.2 has a remote code execution vulnerability located in the file sql.class.chp. Although the system has a check function, the check function is not executed during execution, allowing remote code execution by writing to the file through the MySQL slow query method.",
    "published": "2024-09-20T21:15:12.700",
    "keywords": "remote,execution"
  },
  "CVE-2024-47218": {
    "cvss": "-",
    "description": "An issue was discovered in vesoft NebulaGraph through 3.8.0. It allows bypassing authentication.",
    "published": "2024-09-22T01:15:11.583",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-47219": {
    "url": "https://github.com/vesoft-inc/nebula/pull/5936",
    "cvss": "-",
    "description": "An issue was discovered in vesoft NebulaGraph through 3.8.0. It allows shell command injection.",
    "published": "2024-09-22T01:15:11.890"
  },
  "CVE-2024-47220": {
    "url": "https://github.com/ruby/webrick/pull/146/commits/d88321da45dcd230ac2b4585cad4833d6d5e8841",
    "cvss": "-",
    "description": "An issue was discovered in the WEBrick toolkit through 1.8.1 for Ruby. It allows HTTP request smuggling by providing both a Content-Length header and a Transfer-Encoding header, e.g., \"GET /admin HTTP/1.1\\r\\n\" inside of a \"POST /user HTTP/1.1\\r\\n\" request. NOTE: the supplier's position is \"Webrick should not be used in production.\"",
    "published": "2024-09-22T01:15:11.950"
  },
  "CVE-2024-47221": {
    "url": "https://github.com/rapidscada/scada/commit/b14cbdfa6cf3a205e57f2383c915365adc3859a7",
    "cvss": "-",
    "description": "CheckUser in ScadaServerEngine/MainLogic.cs in Rapid SCADA through 5.8.4 allows an empty password.",
    "published": "2024-09-22T01:15:12.013"
  },
  "CVE-2024-9076": {
    "cvss": 6.3,
    "description": "A vulnerability was found in DedeCMS up to 5.7.115. It has been rated as critical. This issue affects some unknown processing of the file article_string_mix.php. The manipulation leads to os command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-09-22T01:15:12.070",
    "keywords": "remote,command"
  }
}