{
  "CVE-2025-0731": {
    "cvss": 6.5,
    "description": "An unauthenticated remote attacker can upload a .aspx file instead of a PV system picture through the demo account. The code can only be executed in the security context of the user.",
    "published": "2025-02-26T13:15:41.040",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-25789": {
    "cvss": "-",
    "description": "FoxCMS v1.2.5 was discovered to contain a remote code execution (RCE) vulnerability via the index() method at \\controller\\Sitemap.php.",
    "published": "2025-02-26T15:15:26.853",
    "keywords": "remote,execution"
  },
  "CVE-2025-25792": {
    "cvss": "-",
    "description": "SeaCMS v13.3 was discovered to contain a remote code execution (RCE) vulnerability via the isopen parameter at admin_weixin.php.",
    "published": "2025-02-26T15:15:27.230",
    "keywords": "remote,execution"
  },
  "CVE-2025-25793": {
    "cvss": "-",
    "description": "SeaCMS v13.3 was discovered to contain a remote code execution (RCE) vulnerability via the component admin_notify.php.",
    "published": "2025-02-26T15:15:27.367",
    "keywords": "remote,execution"
  },
  "CVE-2025-25794": {
    "cvss": "-",
    "description": "SeaCMS v13.3 was discovered to contain a remote code execution (RCE) vulnerability via the component admin_ping.php.",
    "published": "2025-02-26T15:15:27.490",
    "keywords": "remote,execution"
  },
  "CVE-2025-25796": {
    "cvss": "-",
    "description": "SeaCMS v13.3 was discovered to contain a remote code execution (RCE) vulnerability via the component admin_template.php.",
    "published": "2025-02-26T15:15:27.620",
    "keywords": "remote,execution"
  },
  "CVE-2025-25797": {
    "cvss": "-",
    "description": "SeaCMS v13.3 was discovered to contain a remote code execution (RCE) vulnerability via the component admin_smtp.php.",
    "published": "2025-02-26T15:15:27.743",
    "keywords": "remote,execution"
  },
  "CVE-2025-25802": {
    "cvss": "-",
    "description": "SeaCMS v13.3 was discovered to contain a remote code execution (RCE) vulnerability via the component admin_ip.php.",
    "published": "2025-02-26T15:15:28.127",
    "keywords": "remote,execution"
  },
  "CVE-2025-25813": {
    "cvss": "-",
    "description": "SeaCMS v13.3 was discovered to contain a remote code execution (RCE) vulnerability via the component admin_files.php.",
    "published": "2025-02-26T15:15:28.250",
    "keywords": "remote,execution"
  },
  "CVE-2025-20116": {
    "cvss": 4.8,
    "description": "A vulnerability in the web UI of Cisco APIC could allow an authenticated, remote attacker to perform a stored XSS attack on an affected system. To exploit this vulnerability, the attacker must have valid administrative credentials.\r\n\r\nThis vulnerability is due to improper input validation in the web UI. An authenticated attacker could exploit this vulnerability by injecting malicious code into specific pages of the web UI. A successful exploit could allow the attacker to execute arbitrary script code in the context of the web UI or access sensitive, browser-based information.",
    "published": "2025-02-26T17:15:22.403",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-20118": {
    "cvss": 4.4,
    "description": "A vulnerability in the implementation of the internal system processes of Cisco APIC could allow an authenticated, local attacker to access sensitive information on an affected device. To exploit this vulnerability, the attacker must have valid administrative credentials.\r\n\r\nThis vulnerability is due to insufficient masking of sensitive information that is displayed through system CLI commands. An attacker could exploit this vulnerability by using reconnaissance techniques at the device CLI. A successful exploit could allow the attacker to access sensitive information on an affected device that could be used for additional attacks.",
    "published": "2025-02-26T17:15:22.723",
    "keywords": "command,sensitive"
  },
  "CVE-2025-1726": {
    "cvss": 4.3,
    "description": "There is a SQL injection issue in Esri ArcGIS Monitor versions 2023.0 through 2024.x on Windows and Linux that allows a remote, authenticated attacker with low privileges to improperly read limited database schema information by passing crafted queries. While it is possible to enumerate some internal database identifiers, the impact to the confidentiality vector is \"LOW' because any sensitive data returned in a response is encrypted. There is no evidence of impact to the integrity or availability vectors. This issue is addressed in ArcGIS Monitor 2024.1.",
    "published": "2025-02-26T20:15:13.510",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-21751": {
    "cvss": 7.8,
    "description": "In the Linux kernel, the following vulnerability has been resolved:\n\nnet/mlx5: HWS, change error flow on matcher disconnect\n\nCurrently, when firmware failure occurs during matcher disconnect flow,\nthe error flow of the function reconnects the matcher back and returns\nan error, which continues running the calling function and eventually\nfrees the matcher that is being disconnected.\nThis leads to a case where we have a freed matcher on the matchers list,\nwhich in turn leads to use-after-free and eventual crash.\n\nThis patch fixes that by not trying to reconnect the matcher back when\nsome FW command fails during disconnect.\n\nNote that we're dealing here with FW error. We can't overcome this\nproblem. This might lead to bad steering state (e.g. wrong connection\nbetween matchers), and will also lead to resource leakage, as it is\nthe case with any other error handling during resource destruction.\n\nHowever, the goal here is to allow the driver to continue and not crash\nthe machine with use-after-free error.",
    "published": "2025-02-27T03:15:15.760",
    "keywords": "command,leak"
  },
  "CVE-2025-1686": {
    "url": "https://github.com/pebbletemplates/pebble/issues/688",
    "cvss": 6.8,
    "description": "All versions of the package io.pebbletemplates:pebble are vulnerable to External Control of File Name or Path via the include tag. A high privileged attacker can access sensitive local files by crafting malicious notification templates that leverage this tag to include files like /etc/passwd or /proc/1/environ.\r\r Workaround\r\rThis vulnerability can be mitigated by disabling the include macro in Pebble Templates:\r\rjava\rnew PebbleEngine.Builder()\r            .registerExtensionCustomizer(new DisallowExtensionCustomizerBuilder()\r                    .disallowedTokenParserTags(List.of(\"include\"))\r                    .build())\r            .build();",
    "published": "2025-02-27T05:15:14.143"
  },
  "CVE-2025-1717": {
    "cvss": 8.1,
    "description": "The Login Me Now plugin for WordPress is vulnerable to authentication bypass in versions up to, and including, 1.7.2. This is due to insecure authentication based on an arbitrary transient name in the 'AutoLogin::listen()' function. This makes it possible for unauthenticated attackers to log in an existing user on the site, even an administrator. Note: this vulnerability requires using a transient name and value from another software, so the plugin is not inherently vulnerable on it's own.",
    "published": "2025-02-27T08:15:31.130",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2025-1282": {
    "cvss": 8.8,
    "description": "The Car Dealer Automotive WordPress Theme – Responsive theme for WordPress is vulnerable to arbitrary file deletion due to insufficient file path validation in the delete_post_photo() and add_car() functions in all versions up to, and including, 1.6.3. This makes it possible for authenticated attackers, with Subscriber-level access and above, to delete arbitrary files on the server, which can easily lead to remote code execution when the right file is deleted (such as wp-config.php). The add_car() function may also make it possible to read arbitrary files.",
    "published": "2025-02-27T09:15:10.160",
    "keywords": "remote,execution"
  },
  "CVE-2025-1739": {
    "cvss": 7.1,
    "description": "An Authentication Bypass vulnerability has been found in Trivision Camera NC227WF v5.8.0 from TrivisionSecurity. This vulnerability allows an attacker to retrieve administrator's credentials in cleartext by sending a request against the server using curl with random credentials to \"/en/player/activex_pal.asp\" and successfully authenticating the application.",
    "published": "2025-02-27T13:15:11.883",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-22952": {
    "url": "https://github.com/usememos/memos/pull/4428",
    "cvss": "-",
    "description": "elestio memos v0.23.0 is vulnerable to Server-Side Request Forgery (SSRF) due to insufficient validation of user-supplied URLs, which can be exploited to perform SSRF attacks.",
    "published": "2025-02-27T20:16:04.983"
  },
  "CVE-2025-26264": {
    "cvss": 8.8,
    "description": "GeoVision GV-ASWeb with the version 6.1.2.0 or less, contains a Remote Code Execution (RCE) vulnerability within its Notification Settings feature. An authenticated attacker with \"System Settings\" privileges in ASWeb can exploit this flaw to execute arbitrary commands on the server, leading to a full system compromise.",
    "published": "2025-02-27T22:15:38.947",
    "keywords": "remote,execution,command"
  },
  "CVE-2025-26325": {
    "url": "https://github.com/gongfuxiang/shopxo/issues/86",
    "cvss": 9.8,
    "description": "ShopXO 6.4.0 is vulnerable to File Upload in ThemeDataService.php.",
    "published": "2025-02-27T22:15:39.057"
  },
  "CVE-2025-1744": {
    "url": "https://github.com/radareorg/radare2/pull/23969",
    "cvss": "-",
    "description": "Out-of-bounds Write vulnerability in radareorg radare2 allows \n\nheap-based buffer over-read or buffer overflow.This issue affects radare2: before <5.9.9.",
    "published": "2025-02-28T04:15:09.603"
  },
  "CVE-2025-22270": {
    "cvss": "-",
    "description": "An attacker with access to the Administration panel, specifically the \"Role Management\"\ntab, can\ninject code by adding a new role in the \"name\" field. It should be noted, however, that the risk of exploiting vulnerability is reduced due to the\nrequired additional error that allows bypassing the Content-Security-Policy policy, which\nmitigates JS code execution while still allowing HTML injection.\n\n\nThis issue affects CyberArk Endpoint Privilege Manager in SaaS version 24.7.1. The status of other versions is unknown. After multiple attempts to contact the vendor we did not receive any answer.",
    "published": "2025-02-28T13:15:27.447",
    "keywords": "execution,bypass"
  },
  "CVE-2025-1776": {
    "cvss": 6.1,
    "description": "Cross-Site Scripting (XSS) vulnerability in Soteshop, versions prior to 8.3.4, which could allow remote attackers to execute arbitrary code via the ‘query’ parameter in /app-google-custom-search/searchResults. This vulnerability can be exploited to steal sensitive user data, such as session cookies, or to perform actions on behalf of the user.",
    "published": "2025-02-28T14:15:35.943",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-25916": {
    "url": "https://github.com/wuzhicms/wuzhicms/issues/213",
    "cvss": 5.4,
    "description": "wuzhicms v4.1.0 has a Cross Site Scripting (XSS) vulnerability in del function in \\coreframe\\app\\member\\admin\\group.php.",
    "published": "2025-02-28T15:15:13.613"
  },
  "CVE-2025-26326": {
    "cvss": "-",
    "description": "A vulnerability in the remote connection complements of the NVDA (Nonvisual Desktop Access) 2024.4.1 and 2024.4.2 was identified, which allows an attacker to obtain total control of the remote system when guessing a weak password. The problem occurs because the complements accept any password typed by the user and do not have an additional authentication or checking mechanism by the computer that will be accessed. Tests indicate that over 1,000 systems use easy to guess passwords, many with less than 4 to 6 characters, including common sequences. This enables brute strength or attempt and error attacks on the part of malicious invaders. Vulnerability can be explored by a remote striker who knows or can guess the password used in the connection. As a result, the invader gets complete access to the affected system and can run commands, modify files and compromise user security.",
    "published": "2025-02-28T15:15:13.743",
    "keywords": "remote,authentication,command"
  },
  "CVE-2025-0159": {
    "cvss": 9.1,
    "description": "IBM FlashSystem (IBM Storage Virtualize (8.5.0.0 through 8.5.0.13, 8.5.1.0, 8.5.2.0 through 8.5.2.3, 8.5.3.0 through 8.5.3.1, 8.5.4.0, 8.6.0.0 through 8.6.0.5, 8.6.1.0, 8.6.2.0 through 8.6.2.1, 8.6.3.0, 8.7.0.0 through 8.7.0.2, 8.7.1.0, 8.7.2.0 through 8.7.2.1) could allow a remote attacker to bypass RPCAdapter endpoint authentication by sending a specifically crafted HTTP request.",
    "published": "2025-02-28T19:15:36.243",
    "keywords": "remote,authentication,bypass"
  },
  "CVE-2025-27410": {
    "cvss": 6.5,
    "description": "PwnDoc is a penetration test reporting application. Prior to version 1.2.0, the backup restore functionality is vulnerable to path traversal in the TAR entry's name, allowing an attacker to overwrite any file on the system with their content. By overwriting an included `.js` file and restarting the container, this allows for Remote Code Execution as an administrator. The remote code execution occurs because any user with the `backups:create` and `backups:update` (only administrators by default) is able to overwrite any file on the system. Version 1.2.0 fixes the issue.",
    "published": "2025-02-28T21:15:27.677",
    "keywords": "remote,execution"
  },
  "CVE-2025-27413": {
    "cvss": 6.5,
    "description": "PwnDoc is a penetration test reporting application. Prior to version 1.2.0, the backup restore functionality allows an administrator to import raw data into the database, including Path Traversal (`../`) sequences. This is problematic for the template update functionality as it uses the path from the database to write arbitrary content to, potentially overwriting source code to achieve Remote Code Execution. Any user with the `backups:create`, `backups:update` and `templates:update` permissions (only administrators by default) can write arbitrary content to anywhere on the filesystem. By overwriting source code, it is possible to achieve Remote Code Execution. Version 1.2.0 fixes the issue.",
    "published": "2025-02-28T21:15:27.820",
    "keywords": "remote,execution"
  },
  "CVE-2025-27414": {
    "cvss": "-",
    "description": "MinIO is a high performance object storage. Starting in RELEASE.2024-06-06T09-36-42Z and prior to \nRELEASE.2025-02-28T09-55-16Z, a bug in evaluating the trust of the SSH key used in an SFTP connection to MinIO allows authentication bypass and unauthorized data access. On a MinIO server with SFTP access configured and using LDAP as an external identity provider, MinIO supports SSH key based authentication for SFTP connections when the user has the `sshPublicKey` attribute set in their LDAP server. The server trusts the client's key only when the public key is the same as the `sshPublicKey` attribute. Due to the bug, when the user has no `sshPublicKey` property in LDAP, the server ends up trusting the key allowing the client to perform any FTP operations allowed by the MinIO access policies associated with the LDAP user (or any of their groups). Three requirements must be met in order to exploit the vulnerability. First, the MinIO server must be configured to allow SFTP access and use LDAP as an external identity provider. Second, the attacker must have knowledge of an LDAP username that does not have the `sshPublicKey` property set. Third, such an LDAP username or one of their groups must also have some MinIO access policy configured. When this bug is successfully exploited, the attacker can perform any FTP operations (i.e. reading, writing, deleting and listing objects) allowed by the access policy associated with the LDAP user account (and their groups). Version 1.2.0 fixes the issue.",
    "published": "2025-02-28T21:15:27.957",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-25723": {
    "url": "https://github.com/gpac/gpac/issues/3089",
    "cvss": "-",
    "description": "Buffer Overflow vulnerability in GPAC version 2.5 allows a local attacker to execute arbitrary code.",
    "published": "2025-02-28T23:15:11.280"
  }
}