{
  "CVE-2024-7340": {
    "cvss": 8.8,
    "description": "The Weave server API allows remote users to fetch files from a specific directory, but due to a lack of input validation, it is possible to traverse and leak arbitrary files remotely. In various common scenarios, this allows a low-privileged user to assume the role of the server admin.",
    "published": "2024-07-31T15:15:11.203",
    "keywords": "remote,leak"
  },
  "CVE-2024-37898": {
    "url": "https://github.com/xwiki/xwiki-platform/commit/e4968fe268e5644ffd9bfa4ef6257d2796446009",
    "cvss": 4.3,
    "description": "XWiki Platform is a generic wiki platform offering runtime services for applications built on top of it. When a user has view but not edit right on a page in XWiki, that user can delete the page and replace it by a page with new content without having delete right. The previous version of the page is moved into the recycle bin and can be restored from there by an admin. As the user is recorded as deleter, the user would in theory also be able to view the deleted content, but this is not directly possible as rights of the previous version are transferred to the new page and thus the user still doesn't have view right on the page. It therefore doesn't seem to be possible to exploit this to gain any rights. This has been patched in XWiki 14.10.21, 15.5.5 and 15.10.6 by cancelling save operations by users when a new document shall be saved despite the document's existing already.",
    "published": "2024-07-31T16:15:03.197"
  },
  "CVE-2024-37901": {
    "cvss": 9.9,
    "description": "XWiki Platform is a generic wiki platform offering runtime services for applications built on top of it. Any user with edit right on any page can perform arbitrary remote code execution by adding instances of `XWiki.SearchSuggestConfig` and `XWiki.SearchSuggestSourceClass` to their user profile or any other page. This compromises the confidentiality, integrity and availability of the whole XWiki installation. This vulnerability has been patched in XWiki 14.10.21, 15.5.5 and 15.10.2.",
    "published": "2024-07-31T16:15:03.683",
    "keywords": "remote,execution"
  },
  "CVE-2024-41947": {
    "url": "https://github.com/xwiki/xwiki-platform/commit/e00e159d3737397eebd1f6ff925c1f5cb7cdec34",
    "cvss": 9.0,
    "description": "XWiki Platform is a generic wiki platform offering runtime services for applications built on top of it. By creating a conflict when another user with more rights is currently editing a page, it is possible to execute JavaScript snippets on the side of the other user, which compromises the confidentiality, integrity and availability of the whole XWiki installation. This has been patched in XWiki 15.10.8 and 16.3.0RC1.",
    "published": "2024-07-31T16:15:04.540"
  },
  "CVE-2024-41950": {
    "cvss": 7.5,
    "description": "Haystack is an end-to-end LLM framework that allows you to build applications powered by LLMs, Transformer models, vector search and more. Haystack clients that let their users create and run Pipelines from scratch are vulnerable to remote code executions. Certain Components in Haystack use Jinja2 templates, if anyone can create and render that template on the client machine they run any code. The vulnerability has been fixed with Haystack `2.3.1`.",
    "published": "2024-07-31T16:15:04.797",
    "keywords": "remote,execution"
  },
  "CVE-2024-6973": {
    "cvss": 7.5,
    "description": "Remote Code Execution in Cato Windows SDP client via crafted URLs.\nThis issue affects Windows SDP Client before 5.10.34.",
    "published": "2024-07-31T17:15:11.153",
    "keywords": "remote,execution"
  },
  "CVE-2024-6977": {
    "cvss": 6.5,
    "description": "A vulnerability in Cato Networks SDP Client on Windows allows the insertion of sensitive information into the log file, which can lead to an account takeover. However, the attack requires bypassing protections on modifying the tunnel token on a the attacker's system.This issue affects SDP Client: before 5.10.34.",
    "published": "2024-07-31T17:15:11.860",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-41955": {
    "url": "https://github.com/mobsf/mobile-security-framework-mobsf/commit/fdaad81314f393d324c1ede79627e9d47986c8c8",
    "cvss": 5.2,
    "description": "Mobile Security Framework (MobSF) is a security research platform for mobile applications in Android, iOS and Windows Mobile. An open redirect vulnerability exist in MobSF authentication view. Update to MobSF v4.0.5.",
    "published": "2024-07-31T20:15:06.793"
  },
  "CVE-2024-38182": {
    "cvss": 9.0,
    "description": "Weak authentication in Microsoft Dynamics 365 allows an unauthenticated attacker to elevate privileges over a network.",
    "published": "2024-07-31T23:15:13.560",
    "keywords": "unauthenticated,authentication"
  },
  "CVE-2024-34021": {
    "cvss": 6.8,
    "description": "Unrestricted upload of file with dangerous type vulnerability exists in ELECOM wireless LAN routers. A specially crafted file may be uploaded to the affected product by a logged-in user with an administrative privilege, resulting in an arbitrary OS command execution.",
    "published": "2024-08-01T02:15:01.873",
    "keywords": "execution,command"
  },
  "CVE-2024-28972": {
    "cvss": 5.9,
    "description": "Dell InsightIQ, Verion 5.0.0, contains a use of a broken or risky cryptographic algorithm vulnerability. An unauthenticated remote attacker could potentially exploit this vulnerability, leading to information disclosure.",
    "published": "2024-08-01T08:15:02.520",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-7357": {
    "cvss": 6.3,
    "description": "** UNSUPPORTED WHEN ASSIGNED ** A vulnerability was found in D-Link DIR-600 up to 2.18. It has been rated as critical. This issue affects the function soapcgi_main of the file /soap.cgi. The manipulation of the argument service leads to os command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-273329 was assigned to this vulnerability. NOTE: This vulnerability only affects products that are no longer supported by the maintainer. NOTE: Vendor was contacted early and confirmed immediately that the product is end-of-life. It should be retired and replaced.",
    "published": "2024-08-01T13:15:10.950",
    "keywords": "remote,command"
  },
  "CVE-2024-41961": {
    "url": "https://github.com/sapcc/elektra/commit/8bce00be93b95a6512ff68fe86bf9554e486bc02",
    "cvss": 9.6,
    "description": "Elektra is an opinionated Openstack Dashboard for Operators and Consumers of Openstack Services. A code injection vulnerability was found in the live search functionality of the Ruby on Rails based Elektra web application. An authenticated user can craft a search term containing Ruby code, which later flows into an `eval` sink which executes the code. Fixed in commit 8bce00be93b95a6512ff68fe86bf9554e486bc02.",
    "published": "2024-08-01T15:15:14.310"
  },
  "CVE-2024-6242": {
    "cvss": "-",
    "description": "A vulnerability exists in Rockwell Automation affected products that allows a threat actor to bypass the Trusted® Slot feature in a ControlLogix® controller. If exploited on any affected module in a 1756 chassis, a threat actor could potentially execute CIP commands that modify user projects and/or device configuration on a Logix controller in the chassis.",
    "published": "2024-08-01T16:15:07.013",
    "keywords": "command,bypass"
  },
  "CVE-2024-6873": {
    "cvss": 8.1,
    "description": "It is possible to crash or redirect the execution flow of the ClickHouse server process from an unauthenticated vector by sending a specially crafted request to the ClickHouse server native interface. This redirection is limited to what is available within a 256-byte range of memory at the time of execution, and no known remote code execution (RCE) code has been produced or exploited.\n\n Fixes have been merged to all currently supported version of ClickHouse. If you are maintaining your own forked version of ClickHouse or using an older version and cannot upgrade, the fix for this vulnerability can be found in this commit  https://github.com/ClickHouse/ClickHouse/pull/64024 .",
    "published": "2024-08-01T16:15:07.187",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-4353": {
    "url": "https://github.com/concretecms/concretecms/pull/12151",
    "cvss": "-",
    "description": "Concrete CMS versions 9.0.0 through 9.3.2 are affected by a stored XSS vulnerability in the generate dashboard board\ninstance functionality. The Name input field does not check the input sufficiently letting a rogue administrator hav the capability to inject malicious\nJavaScript code. The Concrete CMS security team gave this vulnerability a CVSS v3.1 score of 3.1 with a vector of  AV:N/AC:H/PR:H/UI:R/S:U/C:L/I:L/A:N https://nvd.nist.gov/vuln-metrics/cvss/v3-calculator  and a CVSS v4 score of 1.8 with a vector of CVSS:4.0/AV:N/AC:H/AT:N/PR:H/UI:A/VC:L/VI:L/VA:N/SC:N/SI:N/SA:N Thanks fhAnso for reporting.",
    "published": "2024-08-01T19:15:52.313"
  },
  "CVE-2024-38770": {
    "cvss": 9.8,
    "description": "Improper Privilege Management vulnerability in Revmakx Backup and Staging by WP Time Capsule allows Privilege Escalation, Authentication Bypass.This issue affects Backup and Staging by WP Time Capsule: from n/a through 1.22.20.",
    "published": "2024-08-01T21:15:27.880",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-7093": {
    "cvss": "-",
    "description": "Dispatch's notification service uses Jinja templates to generate messages to users. Jinja permits code execution within blocks, which were neither properly sanitized nor sandboxed. This vulnerability enables users to construct command line scripts in their custom message templates, which are then executed whenever these notifications are rendered and sent out.",
    "published": "2024-08-01T21:16:05.100",
    "keywords": "execution,command"
  },
  "CVE-2024-41956": {
    "cvss": 8.1,
    "description": "Soft Serve is a self-hostable Git server for the command line. Prior to 0.7.5, it is possible for a user who can commit files to a repository hosted by Soft Serve to execute arbitrary code via environment manipulation and Git. The issue is that Soft Serve passes all environment variables given by the client to git subprocesses. This includes environment variables that control program execution, such as LD_PRELOAD. This vulnerability is fixed in 0.7.5.",
    "published": "2024-08-01T22:15:29.153",
    "keywords": "execution,command"
  },
  "CVE-2024-38482": {
    "cvss": 6.6,
    "description": "CloudLink, versions 7.1.x and 8.x, contain an Improper check or handling of Exceptional Conditions Vulnerability in Cluster Component. A highly privileged malicious user with remote access could potentially exploit this vulnerability, leading to execute unauthorized actions and retrieve sensitive information from the database.",
    "published": "2024-08-02T04:17:27.750",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-7389": {
    "cvss": 7.5,
    "description": "The Forminator plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 1.29.1 via class-forminator-addon-hubspot-wp-api.php. This makes it possible for unauthenticated attackers to extract the HubSpot integration developer API key and make unauthorized changes to the plugin's HubSpot integration or expose personally identifiable information from plugin users using the HubSpot integration.",
    "published": "2024-08-02T05:15:51.510",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-39396": {
    "cvss": 5.5,
    "description": "InDesign Desktop versions ID18.5.2, ID19.3 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-08-02T07:16:09.270",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-42459": {
    "url": "https://github.com/indutny/elliptic/pull/317",
    "cvss": 5.3,
    "description": "In the Elliptic package 6.5.6 for Node.js, EDDSA signature malleability occurs because there is a missing signature length check, and thus zero-valued bytes can be removed or appended.",
    "published": "2024-08-02T07:16:10.003"
  },
  "CVE-2024-42460": {
    "url": "https://github.com/indutny/elliptic/pull/317",
    "cvss": 5.3,
    "description": "In the Elliptic package 6.5.6 for Node.js, ECDSA signature malleability occurs because there is a missing check for whether the leading bit of r and s is zero.",
    "published": "2024-08-02T07:16:10.120"
  },
  "CVE-2024-42461": {
    "url": "https://github.com/indutny/elliptic/pull/317",
    "cvss": "-",
    "description": "In the Elliptic package 6.5.6 for Node.js, ECDSA signature malleability occurs because BER-encoded signatures are allowed.",
    "published": "2024-08-02T07:16:10.230"
  },
  "CVE-2024-36268": {
    "cvss": "-",
    "description": "Improper Control of Generation of Code ('Code Injection') vulnerability in Apache InLong.\n\nThis issue affects Apache InLong: from 1.10.0 through 1.12.0, which could lead to Remote Code Execution. Users are advised to upgrade to Apache InLong's 1.13.0 or cherry-pick [1] to solve it.\n\n[1]  https://github.com/apache/inlong/pull/10251",
    "published": "2024-08-02T10:16:00.367",
    "keywords": "remote,execution"
  },
  "CVE-2024-40720": {
    "cvss": 8.8,
    "description": "The specific API in TCBServiSign Windows Version from CHANGING Information Technology does not properly validate server-side input. When a user visits a spoofed website, unauthenticated remote attackers can modify the `HKEY_CURRENT_USER` registry to execute arbitrary commands.",
    "published": "2024-08-02T11:16:42.763",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-40721": {
    "cvss": 8.8,
    "description": "The specific API in TCBServiSign Windows Version from CHANGING Information Technology does not properly validate server-side input. When a user visits a spoofed website, unauthenticated remote attackers can cause the TCBServiSign to load a DLL from an arbitrary path.",
    "published": "2024-08-02T11:16:43.020",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-40722": {
    "cvss": 4.3,
    "description": "The specific API in TCBServiSign Windows Version from CHANGING Information Technology does does not properly validate the length of server-side input. When a user visits a spoofed website, unauthenticated remote attackers can cause a stack-based buffer overflow in the TCBServiSign, temporarily disrupting its service.",
    "published": "2024-08-02T11:16:43.283",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-40723": {
    "cvss": 4.3,
    "description": "The specific API in HWATAIServiSign Windows Version from CHANGING Information Technology does not properly validate the length of server-side inputs. When a user visits a spoofed website, unauthenticated remote attackers can cause a stack-based buffer overflow in the HWATAIServiSign, temporarily disrupting its service.",
    "published": "2024-08-02T11:16:43.520",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-7204": {
    "cvss": 6.1,
    "description": "Ai3 QbiBot does not properly filter user input, allowing unauthenticated remote attackers to insert JavaScript code into the chat box. Once the recipient views the message, they will be subject to a Stored XSS attack.",
    "published": "2024-08-02T11:16:43.987",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-38890": {
    "cvss": "-",
    "description": "An issue in Horizon Business Services Inc. Caterease Software 16.0.1.1663 through 24.0.1.2405 and possibly later versions allows a local attacker to perform an Authentication Bypass by Capture-replay attack due to insufficient protection against capture-replay attacks.",
    "published": "2024-08-02T15:16:35.320",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-7029": {
    "cvss": 8.8,
    "description": "Commands can be injected over the network and executed without authentication.",
    "published": "2024-08-02T15:16:37.163",
    "keywords": "authentication,command"
  },
  "CVE-2024-7314": {
    "cvss": 9.8,
    "description": "anji-plus AJ-Report is affected by an authentication bypass vulnerability. A remote and unauthenticated attacker can append \";swagger-ui\" to HTTP requests to bypass authentication and execute arbitrary Java on the victim server.",
    "published": "2024-08-02T17:16:41.400",
    "keywords": "remote,unauthenticated,authentication,bypass"
  },
  "CVE-2024-38882": {
    "cvss": "-",
    "description": "An issue in Horizon Business Services Inc. Caterease 16.0.1.1663 through 24.0.1.2405 and possibly later versions, allows a remote attacker to perform command line execution through SQL Injection due to improper neutralization of special elements used in an OS command.",
    "published": "2024-08-02T18:16:19.300",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-38884": {
    "cvss": "-",
    "description": "An issue in Horizon Business Services Inc. Caterease 16.0.1.1663 through 24.0.1.2405 and possibly later versions, allows a local attacker to perform an Authentication Bypass attack due to improperly implemented security checks for standard authentication mechanisms",
    "published": "2024-08-02T18:16:19.487",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-38889": {
    "cvss": "-",
    "description": "An issue in Horizon Business Services Inc. Caterease 16.0.1.1663 through 24.0.1.2405 and possibly later versions, allows a remote attacker to perform SQL Injection due to improper neutralization of special elements used in an SQL command.",
    "published": "2024-08-02T20:17:00.407",
    "keywords": "remote,command"
  },
  "CVE-2024-38887": {
    "cvss": "-",
    "description": "An issue in Horizon Business Services Inc. Caterease 16.0.1.1663 through 24.0.1.2405 and possibly later versions, allows a remote attacker to expand control over the operating system from the database due to the execution of commands with unnecessary privileges.",
    "published": "2024-08-02T21:16:30.760",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-38891": {
    "cvss": "-",
    "description": "An issue in Horizon Business Services Inc. Caterease 16.0.1.1663 through 24.0.1.2405 and possibly later versions, allows a remote attacker to perform a Sniffing Network Traffic attack due to the cleartext transmission of sensitive information.",
    "published": "2024-08-02T21:16:30.853",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-7319": {
    "cvss": 7.4,
    "description": "An incomplete fix for CVE-2023-1625 was found in openstack-heat. Sensitive information may possibly be disclosed through the OpenStack stack abandon command with the hidden feature set to True and the CVE-2023-1625 fix applied.",
    "published": "2024-08-02T21:16:31.180",
    "keywords": "command,sensitive"
  }
}