{
  "CVE-2024-8417": {
    "cvss": 3.1,
    "description": "A vulnerability was found in ?????????? Yunke Online School System up to 1.5.5. It has been declared as problematic. This vulnerability affects unknown code of the file /admin/educloud/videobind.html. The manipulation leads to inclusion of sensitive information in source code. The attack can be initiated remotely. The complexity of an attack is rather high. The exploitation appears to be difficult. The exploit has been disclosed to the public and may be used. Upgrading to version 1.5.6 is able to address this issue. It is recommended to upgrade the affected component.",
    "published": "2024-09-04T18:15:06.273",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-20505": {
    "cvss": 4.0,
    "description": "A vulnerability in the PDF parsing module of Clam AntiVirus (ClamAV) versions 1.4.0, 1.3.2 and prior versions, all 1.2.x versions, 1.0.6 and prior versions, all 0.105.x versions, all 0.104.x versions, and 0.103.11 and all prior versions could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition on an affected device.\r\n\r\nThe vulnerability is due to an out of bounds read. An attacker could exploit this vulnerability by submitting a crafted PDF file to be scanned by ClamAV on an affected device. An exploit could allow the attacker to terminate the scanning process.",
    "published": "2024-09-04T22:15:03.887",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-7627": {
    "cvss": 8.1,
    "description": "The Bit File Manager plugin for WordPress is vulnerable to Remote Code Execution in versions 6.0 to 6.5.5 via the 'checkSyntax' function. This is due to writing a temporary file to a publicly accessible directory before performing file validation. This makes it possible for unauthenticated attackers to execute code on the server if an administrator has allowed Guest User read permissions.",
    "published": "2024-09-05T03:15:03.560",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-42416": {
    "cvss": 8.8,
    "description": "The ctl_report_supported_opcodes function did not sufficiently validate a field provided by userspace, allowing an arbitrary write to a limited amount of kernel help memory.\n\nMalicious software running in a guest VM that exposes virtio_scsi can exploit the vulnerabilities to achieve code execution on the host in the bhyve userspace process, which typically runs as root.  Note that bhyve runs in a Capsicum sandbox, so malicious code is constrained by the capabilities available to the bhyve process.  A malicious iSCSI initiator could achieve remote code execution on the iSCSI target host.",
    "published": "2024-09-05T05:15:13.600",
    "keywords": "remote,execution"
  },
  "CVE-2024-43110": {
    "cvss": 8.8,
    "description": "The ctl_request_sense function could expose up to three bytes of the kernel heap to userspace.\n\nMalicious software running in a guest VM that exposes virtio_scsi can exploit the vulnerabilities to achieve code execution on the host in the bhyve userspace process, which typically runs as root.  Note that bhyve runs in a Capsicum sandbox, so malicious code is constrained by the capabilities available to the bhyve process.  A malicious iSCSI initiator could achieve remote code execution on the iSCSI target host.",
    "published": "2024-09-05T05:15:13.757",
    "keywords": "remote,execution"
  },
  "CVE-2024-45063": {
    "cvss": 9.8,
    "description": "The function ctl_write_buffer incorrectly set a flag which resulted in a kernel Use-After-Free when a command finished processing.\n\nMalicious software running in a guest VM that exposes virtio_scsi can exploit the vulnerabilities to achieve code execution on the host in the bhyve userspace process, which typically runs as root.  Note that bhyve runs in a Capsicum sandbox, so malicious code is constrained by the capabilities available to the bhyve process.  A malicious iSCSI initiator could achieve remote code execution on the iSCSI target host.",
    "published": "2024-09-05T05:15:13.830",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-8178": {
    "cvss": 9.3,
    "description": "The ctl_write_buffer and ctl_read_buffer functions allocated memory to be returned to userspace, without initializing it.\n\nMalicious software running in a guest VM that exposes virtio_scsi can exploit the vulnerabilities to achieve code execution on the host in the bhyve userspace process, which typically runs as root.  Note that bhyve runs in a Capsicum sandbox, so malicious code is constrained by the capabilities available to the bhyve process.  A malicious iSCSI initiator could achieve remote code execution on the iSCSI target host.",
    "published": "2024-09-05T05:15:13.907",
    "keywords": "remote,execution"
  },
  "CVE-2024-45107": {
    "cvss": 5.5,
    "description": "Acrobat Reader versions 20.005.30636, 24.002.20964, 24.001.30123, 24.002.20991 and earlier are affected by a Use After Free vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-09-05T09:15:03.123",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-6332": {
    "cvss": 6.5,
    "description": "The Booking for Appointments and Events Calendar – Amelia Premium and Lite plugins for WordPress are vulnerable to unauthorized access of data due to a missing capability check on the 'ameliaButtonCommand' function in all versions up to, and including, Premium 7.7 and Lite 1.2.3. This makes it possible for unauthenticated attackers to access employee calendar details, including Google Calendar OAuth tokens in the premium version.",
    "published": "2024-09-05T10:15:02.970",
    "keywords": "unauthenticated,command"
  },
  "CVE-2024-5956": {
    "cvss": 6.5,
    "description": "This vulnerability allows unauthenticated remote attackers to bypass authentication and gain partial data access to the vulnerable Trellix IPS Manager with garbage data in response mostly",
    "published": "2024-09-05T11:15:12.387",
    "keywords": "remote,unauthenticated,authentication,bypass"
  },
  "CVE-2024-5957": {
    "cvss": 7.5,
    "description": "This vulnerability allows unauthenticated remote attackers to bypass authentication and gain APIs access of the Manager.",
    "published": "2024-09-05T11:15:12.610",
    "keywords": "remote,unauthenticated,authentication,bypass"
  },
  "CVE-2024-7381": {
    "cvss": 5.3,
    "description": "The Geo Controller plugin for WordPress is vulnerable to unauthorized shortcode execution due to missing authorization and capability checks on the ajax__shortcode_cache function in all versions up to, and including, 8.6.9. This makes it possible for unauthenticated attackers to execute arbitrary shortcodes available on the target site.",
    "published": "2024-09-05T11:15:13.043",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-7884": {
    "cvss": 7.5,
    "description": "When a canister method is called via ic_cdk::call* , a new Future CallFuture is created  and can be awaited by the caller to get the execution result. Internally, the state of the Future is tracked and stored in a struct called CallFutureState.  A bug in the polling implementation of the CallFuture allows multiple references to be held for this internal state and not all references were dropped before the Future is resolved. Since we have unaccounted references held, a copy of the internal state ended up being persisted in the canister's heap and thus causing a memory leak. \nImpact Canisters built in Rust with ic_cdk and ic_cdk_timers are affected. If these canisters call a canister method, use timers or heartbeat, they will likely leak a small amount of memory on every such operation. In the worst case, this could lead to heap memory exhaustion triggered by an attacker. Motoko based canisters are not affected by the bug.\nPatchesThe patch has been backported to all minor versions between >= 0.8.0, <= 0.15.0. The patched versions available are 0.8.2, 0.9.3, 0.10.1, 0.11.6, 0.12.2, 0.13.5, 0.14.1, 0.15.1 and their previous versions have been yanked. WorkaroundsThere are no known workarounds at the moment. Developers are recommended to upgrade their canister as soon as possible to the latest available patched version of ic_cdk to avoid running out of Wasm heap memory. \nUpgrading the canisters (without updating `ic_cdk`) also frees the leaked memory but it's only a temporary solution.",
    "published": "2024-09-05T13:15:11.390",
    "keywords": "execution,leak"
  },
  "CVE-2024-8462": {
    "cvss": 3.7,
    "description": "A vulnerability was found in Windmill 1.380.0. It has been classified as problematic. Affected is an unknown function of the file backend/windmill-api/src/users.rs of the component HTTP Request Handler. The manipulation leads to improper restriction of excessive authentication attempts. It is possible to launch the attack remotely. The complexity of an attack is rather high. The exploitability is told to be difficult. Upgrading to version 1.390.1 is able to address this issue. The patch is identified as acfe7786152f036f2476f93ab5536571514fa9e3. It is recommended to upgrade the affected component.",
    "published": "2024-09-05T13:15:12.050",
    "keywords": "remote,authentication"
  },
  "CVE-2024-45589": {
    "cvss": 6.5,
    "description": "RapidIdentity LTS through 2023.0.2 and Cloud through 2024.08.0 improperly restricts excessive authentication attempts and allows a remote attacker to cause a denial of service via the username parameters.",
    "published": "2024-09-05T16:15:08.737",
    "keywords": "remote,authentication"
  },
  "CVE-2024-8480": {
    "cvss": 8.8,
    "description": "The Image Optimizer, Resizer and CDN – Sirv plugin for WordPress is vulnerable to unauthorized modification of data due to a missing capability check on the 'sirv_save_prevented_sizes' function in all versions up to, and including, 7.2.7. This makes it possible for authenticated attackers, with Contributor-level access and above, to exploit the 'sirv_upload_file_by_chunks_callback' function, which lacks proper file type validation, allowing attackers to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-09-06T04:15:05.847",
    "keywords": "remote,execution"
  },
  "CVE-2024-38486": {
    "cvss": 7.5,
    "description": "Dell SmartFabric OS10 Software, version(s) 10.5.5.4 through 10.5.5.10 and 10.5.6.x , contain(s) an Improper Neutralization of Special Elements used in a Command ('Command Injection') vulnerability. A low privileged attacker with remote access could potentially exploit this vulnerability, leading to Command execution.",
    "published": "2024-09-06T05:15:13.370",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-45758": {
    "cvss": 9.1,
    "description": "H2O.ai H2O through 3.46.0.4 allows attackers to arbitrarily set the JDBC URL, leading to deserialization attacks, file reads, and command execution. Exploitation can occur when an attacker has access to post to the ImportSQLTable URI with a JSON document containing a connection_url property with any typical JDBC Connection URL attack payload such as one that uses queryInterceptors.",
    "published": "2024-09-06T16:15:03.517",
    "keywords": "execution,command"
  },
  "CVE-2024-8517": {
    "cvss": 9.8,
    "description": "SPIP before 4.3.2, 4.2.16, and \n4.1.18 is vulnerable to a command injection issue. A \nremote and unauthenticated attacker can execute arbitrary operating system commands by sending a crafted multipart file upload HTTP request.",
    "published": "2024-09-06T16:15:03.793",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-8523": {
    "cvss": 4.7,
    "description": "A vulnerability was found in lmxcms up to 1.4 and classified as critical. Affected by this issue is the function formatData of the file /admin.php?m=Acquisi&a=testcj&lid=1 of the component SQL Command Execution Module. The manipulation of the argument data leads to code injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-09-07T09:15:02.807",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-7620": {
    "cvss": 6.6,
    "description": "The Customizer Export/Import plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the '_import' function in all versions up to, and including, 0.9.7. This makes it possible for authenticated attackers, with Administrator-level access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible. NOTE: This vulnerability is only exploitable when used in conjunction with a race condition as the uploaded file is deleted shortly after it is created.",
    "published": "2024-09-07T12:15:12.550",
    "keywords": "remote,execution"
  },
  "CVE-2024-36138": {
    "cvss": 8.1,
    "description": "Bypass incomplete fix of CVE-2024-27980, that arises from improper handling of batch files with all possible extensions on Windows via child_process.spawn / child_process.spawnSync. A malicious command line argument can inject arbitrary commands and achieve code execution even if the shell option is not enabled.",
    "published": "2024-09-07T16:15:02.620",
    "keywords": "execution,command,bypass"
  },
  "CVE-2024-38650": {
    "cvss": 9.9,
    "description": "An authentication bypass vulnerability can allow a low privileged attacker to access the NTLM hash of service account on the VSPC server.",
    "published": "2024-09-07T17:15:12.183",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-38651": {
    "cvss": 8.5,
    "description": "A code injection vulnerability can allow a low-privileged user to overwrite files on that VSPC server, which can lead to remote code execution on VSPC server.",
    "published": "2024-09-07T17:15:12.347",
    "keywords": "remote,execution"
  },
  "CVE-2024-39714": {
    "cvss": 9.9,
    "description": "A code injection vulnerability that permits a low-privileged user to upload arbitrary files to the server, leading to remote code execution on VSPC server.",
    "published": "2024-09-07T17:15:12.507",
    "keywords": "remote,execution"
  },
  "CVE-2024-39715": {
    "cvss": 8.5,
    "description": "A code injection vulnerability that allows a low-privileged user with REST API access granted to remotely upload arbitrary files to the VSPC server using REST API, leading to remote code execution on VSPC server.",
    "published": "2024-09-07T17:15:12.663",
    "keywords": "remote,execution"
  },
  "CVE-2024-40710": {
    "cvss": 8.8,
    "description": "A series of related high-severity vulnerabilities, the most notable enabling remote code execution (RCE) as the service account and extraction of sensitive information (savedcredentials and passwords). Exploiting these vulnerabilities requires a user who has been assigned a low-privileged role within Veeam Backup & Replication.",
    "published": "2024-09-07T17:15:13.110",
    "keywords": "remote,execution,sensitive"
  },
  "CVE-2024-40711": {
    "cvss": 9.8,
    "description": "A deserialization of untrusted data vulnerability with a malicious payload can allow an unauthenticated remote code execution (RCE).",
    "published": "2024-09-07T17:15:13.260",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-40713": {
    "cvss": 7.8,
    "description": "A vulnerability that allows a user who has been assigned a low-privileged role within Veeam Backup & Replication to alter Multi-Factor Authentication (MFA) settings and bypass MFA.",
    "published": "2024-09-07T17:15:13.550",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-42024": {
    "cvss": 9.1,
    "description": "A vulnerability that allows an attacker in possession of the Veeam ONE Agent service account credentials to perform remote code execution on the machine where the Veeam ONE Agent is installed.",
    "published": "2024-09-07T17:15:14.700",
    "keywords": "remote,execution"
  }
}