{
  "CVE-2025-21124": {
    "cvss": 5.5,
    "description": "InDesign Desktop versions ID20.0, ID19.5.1 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2025-02-11T17:15:23.950",
    "keywords": "sensitive,bypass"
  },
  "CVE-2025-24470": {
    "cvss": 8.6,
    "description": "An Improper Resolution of Path Equivalence vulnerability [CWE-41] in FortiPortal 7.4.0 through 7.4.2, 7.2.0 through 7.2.6, 7.0.0 through 7.0.11 may allow a remote unauthenticated attacker to retrieve source code via crafted HTTP requests.",
    "published": "2025-02-11T17:15:34.730",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-24472": {
    "cvss": 8.1,
    "description": "An Authentication Bypass Using an Alternate Path or Channel vulnerability [CWE-288] affecting FortiOS 7.0.0 through 7.0.16 and FortiProxy 7.2.0 through 7.2.12, 7.0.0 through 7.0.19 may allow a remote attacker to gain super-admin privileges via crafted CSF proxy requests.",
    "published": "2025-02-11T17:15:34.867",
    "keywords": "remote,authentication,bypass"
  },
  "CVE-2025-21190": {
    "cvss": 8.8,
    "description": "Windows Telephony Service Remote Code Execution Vulnerability",
    "published": "2025-02-11T18:15:30.610",
    "keywords": "remote,execution"
  },
  "CVE-2025-21198": {
    "cvss": 9.0,
    "description": "Microsoft High Performance Compute (HPC) Pack Remote Code Execution Vulnerability",
    "published": "2025-02-11T18:15:31.020",
    "keywords": "remote,execution"
  },
  "CVE-2025-21200": {
    "cvss": 8.8,
    "description": "Windows Telephony Service Remote Code Execution Vulnerability",
    "published": "2025-02-11T18:15:31.203",
    "keywords": "remote,execution"
  },
  "CVE-2025-21201": {
    "cvss": 8.8,
    "description": "Windows Telephony Server Remote Code Execution Vulnerability",
    "published": "2025-02-11T18:15:31.407",
    "keywords": "remote,execution"
  },
  "CVE-2025-21208": {
    "cvss": 8.8,
    "description": "Windows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability",
    "published": "2025-02-11T18:15:31.793",
    "keywords": "remote,execution"
  },
  "CVE-2025-21368": {
    "cvss": 8.8,
    "description": "Microsoft Digest Authentication Remote Code Execution Vulnerability",
    "published": "2025-02-11T18:15:35.123",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2025-21369": {
    "cvss": 8.8,
    "description": "Microsoft Digest Authentication Remote Code Execution Vulnerability",
    "published": "2025-02-11T18:15:35.340",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2025-21371": {
    "cvss": 8.8,
    "description": "Windows Telephony Service Remote Code Execution Vulnerability",
    "published": "2025-02-11T18:15:35.540",
    "keywords": "remote,execution"
  },
  "CVE-2025-21376": {
    "cvss": 8.1,
    "description": "Windows Lightweight Directory Access Protocol (LDAP) Remote Code Execution Vulnerability",
    "published": "2025-02-11T18:15:36.167",
    "keywords": "remote,execution"
  },
  "CVE-2025-21379": {
    "cvss": 7.1,
    "description": "DHCP Client Service Remote Code Execution Vulnerability",
    "published": "2025-02-11T18:15:36.590",
    "keywords": "remote,execution"
  },
  "CVE-2025-21381": {
    "cvss": 7.8,
    "description": "Microsoft Excel Remote Code Execution Vulnerability",
    "published": "2025-02-11T18:15:36.773",
    "keywords": "remote,execution"
  },
  "CVE-2025-21386": {
    "cvss": 7.8,
    "description": "Microsoft Excel Remote Code Execution Vulnerability",
    "published": "2025-02-11T18:15:37.157",
    "keywords": "remote,execution"
  },
  "CVE-2025-21387": {
    "cvss": 7.8,
    "description": "Microsoft Excel Remote Code Execution Vulnerability",
    "published": "2025-02-11T18:15:37.337",
    "keywords": "remote,execution"
  },
  "CVE-2025-21390": {
    "cvss": 7.8,
    "description": "Microsoft Excel Remote Code Execution Vulnerability",
    "published": "2025-02-11T18:15:37.523",
    "keywords": "remote,execution"
  },
  "CVE-2025-21392": {
    "cvss": 7.8,
    "description": "Microsoft Office Remote Code Execution Vulnerability",
    "published": "2025-02-11T18:15:37.907",
    "keywords": "remote,execution"
  },
  "CVE-2025-21394": {
    "cvss": 7.8,
    "description": "Microsoft Excel Remote Code Execution Vulnerability",
    "published": "2025-02-11T18:15:38.100",
    "keywords": "remote,execution"
  },
  "CVE-2025-21397": {
    "cvss": 7.8,
    "description": "Microsoft Office Remote Code Execution Vulnerability",
    "published": "2025-02-11T18:15:38.293",
    "keywords": "remote,execution"
  },
  "CVE-2025-21400": {
    "cvss": 8.0,
    "description": "Microsoft SharePoint Server Remote Code Execution Vulnerability",
    "published": "2025-02-11T18:15:38.483",
    "keywords": "remote,execution"
  },
  "CVE-2025-21406": {
    "cvss": 8.8,
    "description": "Windows Telephony Service Remote Code Execution Vulnerability",
    "published": "2025-02-11T18:15:38.907",
    "keywords": "remote,execution"
  },
  "CVE-2025-21407": {
    "cvss": 8.8,
    "description": "Windows Telephony Service Remote Code Execution Vulnerability",
    "published": "2025-02-11T18:15:39.157",
    "keywords": "remote,execution"
  },
  "CVE-2025-21410": {
    "cvss": 8.8,
    "description": "Windows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability",
    "published": "2025-02-11T18:15:39.593",
    "keywords": "remote,execution"
  },
  "CVE-2025-26494": {
    "cvss": "-",
    "description": "Server-Side Request Forgery (SSRF) vulnerability in Salesforce Tableau Server allows Authentication Bypass.This issue affects Tableau Server: from 2023.3 through 2023.3.5.",
    "published": "2025-02-11T18:15:47.060",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-25524": {
    "cvss": 5.1,
    "description": "Buffer overflow vulnerability in TOTOLink X6000R routers V9.4.0cu.652_B20230116 due to the lack of length verification, which is related to the addition of Wi-Fi filtering rules. Attackers who successfully exploit this vulnerability can cause the remote target device to crash or execute arbitrary commands.",
    "published": "2025-02-11T19:15:19.110",
    "keywords": "remote,command"
  },
  "CVE-2025-0899": {
    "cvss": 8.8,
    "description": "PDF-XChange Editor AcroForm Use-After-Free Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of PDF-XChange Editor. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the handling of AcroForms. The issue results from the lack of validating the existence of an object prior to performing operations on the object. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-25349.",
    "published": "2025-02-11T20:15:34.347",
    "keywords": "remote,execution"
  },
  "CVE-2025-0901": {
    "cvss": 8.8,
    "description": "PDF-XChange Editor Doc Object Out-Of-Bounds Read Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of PDF-XChange Editor. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the handling of Doc objects. The issue results from the lack of proper validation of user-supplied data, which can result in a read past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-25372.",
    "published": "2025-02-11T20:15:34.480",
    "keywords": "remote,execution"
  },
  "CVE-2025-0902": {
    "cvss": 8.8,
    "description": "PDF-XChange Editor XPS File Parsing Out-Of-Bounds Read Information Disclosure Vulnerability. This vulnerability allows remote attackers to disclose sensitive information on affected installations of PDF-XChange Editor. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of XPS files. The issue results from the lack of proper validation of user-supplied data, which can result in a read past the end of an allocated object. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-25405.",
    "published": "2025-02-11T20:15:34.610",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-0903": {
    "cvss": 8.8,
    "description": "PDF-XChange Editor RTF File Parsing Heap-based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of PDF-XChange Editor. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of RTF files. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a fixed-length heap-based buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-25421.",
    "published": "2025-02-11T20:15:34.737",
    "keywords": "remote,execution"
  },
  "CVE-2025-0904": {
    "cvss": 8.8,
    "description": "PDF-XChange Editor XPS File Parsing Out-Of-Bounds Read Information Disclosure Vulnerability. This vulnerability allows remote attackers to disclose sensitive information on affected installations of PDF-XChange Editor. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of XPS files. The issue results from the lack of proper validation of user-supplied data, which can result in a read past the end of an allocated object. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-25422.",
    "published": "2025-02-11T20:15:34.867",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-0905": {
    "cvss": 8.8,
    "description": "PDF-XChange Editor JB2 File Parsing Out-Of-Bounds Read Information Disclosure Vulnerability. This vulnerability allows remote attackers to disclose sensitive information on affected installations of PDF-XChange Editor. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of JB2 files. The issue results from the lack of proper validation of user-supplied data, which can result in a read past the end of an allocated object. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-25433.",
    "published": "2025-02-11T20:15:34.997",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-0906": {
    "cvss": 8.8,
    "description": "PDF-XChange Editor JB2 File Parsing Out-Of-Bounds Read Information Disclosure Vulnerability. This vulnerability allows remote attackers to disclose sensitive information on affected installations of PDF-XChange Editor. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of JB2 files. The issue results from the lack of proper validation of user-supplied data, which can result in a read past the end of an allocated buffer. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-25434.",
    "published": "2025-02-11T20:15:35.113",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-0907": {
    "cvss": 8.8,
    "description": "PDF-XChange Editor JB2 File Parsing Out-Of-Bounds Read Information Disclosure Vulnerability. This vulnerability allows remote attackers to disclose sensitive information on affected installations of PDF-XChange Editor. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of JB2 files. The issue results from the lack of proper validation of user-supplied data, which can result in a read past the end of an allocated object. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-25435.",
    "published": "2025-02-11T20:15:35.240",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-0908": {
    "cvss": 8.8,
    "description": "PDF-XChange Editor U3D File Parsing Out-Of-Bounds Read Information Disclosure Vulnerability. This vulnerability allows remote attackers to disclose sensitive information on affected installations of PDF-XChange Editor. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of U3D files. The issue results from the lack of proper validation of user-supplied data, which can result in a read past the end of an allocated buffer. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-25557.",
    "published": "2025-02-11T20:15:35.370",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-0909": {
    "cvss": 8.8,
    "description": "PDF-XChange Editor XPS File Parsing Out-Of-Bounds Read Information Disclosure Vulnerability. This vulnerability allows remote attackers to disclose sensitive information on affected installations of PDF-XChange Editor. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of XPS files. The issue results from the lack of proper validation of user-supplied data, which can result in a read past the end of an allocated object. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-25678.",
    "published": "2025-02-11T20:15:35.500",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-0910": {
    "cvss": 8.8,
    "description": "PDF-XChange Editor U3D File Parsing Out-Of-Bounds Write Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of PDF-XChange Editor. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of U3D files. The issue results from the lack of proper validation of user-supplied data, which can result in a write  past the end of an allocated object. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-25748.",
    "published": "2025-02-11T20:15:35.633",
    "keywords": "remote,execution"
  },
  "CVE-2025-0911": {
    "cvss": 8.8,
    "description": "PDF-XChange Editor U3D File Parsing Out-Of-Bounds Read Information Disclosure Vulnerability. This vulnerability allows remote attackers to disclose sensitive information on affected installations of PDF-XChange Editor. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of U3D files. The issue results from the lack of proper validation of user-supplied data, which can result in a read past the end of an allocated object. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-25957.",
    "published": "2025-02-11T20:15:35.770",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-1044": {
    "cvss": 9.8,
    "description": "Logsign Unified SecOps Platform Authentication Bypass Vulnerability. This vulnerability allows remote attackers to bypass authentication on affected installations of Logsign Unified SecOps Platform. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the web service, which listens on TCP port 443 by default. The issue results from the lack of proper implementation of the authentication algorithm. An attacker can leverage this vulnerability to bypass authentication on the system. Was ZDI-CAN-25336.",
    "published": "2025-02-11T20:15:35.913",
    "keywords": "remote,authentication,bypass"
  },
  "CVE-2025-1052": {
    "cvss": 8.8,
    "description": "Mintty Sixel Image Parsing Heap-based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Mintty. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of sixel images. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a heap-based buffer. An attacker can leverage this vulnerability to execute code in the context of the current user. Was ZDI-CAN-23382.",
    "published": "2025-02-11T20:15:36.070",
    "keywords": "remote,execution"
  },
  "CVE-2025-25525": {
    "cvss": 5.1,
    "description": "Buffer overflow vulnerability in H3C FA3010L access points SWFA1B0V100R005 due to the lack of length verification, which is related to the setting of firewall rules. Attackers who successfully exploit this vulnerability can cause the remote target device to crash or execute arbitrary commands.",
    "published": "2025-02-11T20:15:38.727",
    "keywords": "remote,command"
  },
  "CVE-2025-25526": {
    "cvss": 5.1,
    "description": "Buffer overflow vulnerability in Mercury MIPC552W Camera v1.0 due to the lack of length verification, which is related to the configuration of the PPTP server. Attackers who successfully exploit this vulnerability can cause the remote target device to crash or execute arbitrary commands.",
    "published": "2025-02-11T20:15:38.850",
    "keywords": "remote,command"
  },
  "CVE-2025-25527": {
    "cvss": 5.1,
    "description": "Buffer overflow vulnerability in Ruijie RG-NBR2600S Gateway 10.3(4b12) due to the lack of length verification, which is related to the configuration of source address NAT rules. Attackers who successfully exploit this vulnerability can cause the remote target device to crash or execute arbitrary commands.",
    "published": "2025-02-11T20:15:38.973",
    "keywords": "remote,command"
  },
  "CVE-2025-25528": {
    "cvss": 5.1,
    "description": "Multiple buffer overflow vulnerabilities in Wavlink WL-WN575A3 RPT75A3.V4300, which are caused by not performing strict length checks on user-controlled data. By successfully exploiting the vulnerabilities, attackers can crash the remote devices or execute arbitrary commands without any authorization verification.",
    "published": "2025-02-11T20:15:39.090",
    "keywords": "remote,command"
  },
  "CVE-2025-25529": {
    "cvss": 5.1,
    "description": "Buffer overflow vulnerability in Digital China DCBC Gateway 200-2.1.1 due to the lack of length verification, which is related to the configuration of static NAT rules. Attackers who successfully exploit this vulnerability can cause the remote target device to crash or execute arbitrary commands.",
    "published": "2025-02-11T20:15:39.217",
    "keywords": "remote,command"
  },
  "CVE-2025-25530": {
    "cvss": "-",
    "description": "Buffer overflow vulnerability in Digital China DCBI-Netlog-LAB Gateway 1.0 due to the lack of length verification, which is related to saving parental control configuration information. Attackers who successfully exploit this vulnerability can cause the remote target device to crash or execute arbitrary commands.",
    "published": "2025-02-11T20:15:39.327",
    "keywords": "remote,command"
  },
  "CVE-2025-1240": {
    "cvss": 7.8,
    "description": "WinZip 7Z File Parsing Out-Of-Bounds Write Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of WinZip. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of 7Z files. The issue results from the lack of proper validation of user-supplied data, which can result in a write past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-24986.",
    "published": "2025-02-11T22:15:29.800",
    "keywords": "remote,execution"
  },
  "CVE-2025-26520": {
    "url": "https://github.com/cacti/cacti/pull/6096",
    "cvss": 7.6,
    "description": "Cacti through 1.2.29 allows SQL injection in the template function in host_templates.php via the graph_template parameter. NOTE: this issue exists because of an incomplete fix for CVE-2024-54146.",
    "published": "2025-02-12T07:15:08.617"
  },
  "CVE-2025-1100": {
    "cvss": 9.8,
    "description": "A CWE-259 \"Use of Hard-coded Password\" for the root account in Q-Free MaxTime less than or equal to version 2.11.0 allows an unauthenticated remote attacker to execute arbitrary code with root privileges via SSH.",
    "published": "2025-02-12T14:15:31.647",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-1101": {
    "cvss": 5.3,
    "description": "A CWE-204 \"Observable Response Discrepancy\" in the login page in Q-Free MaxTime less than or equal to version 2.11.0 allows an unauthenticated remote attacker to enumerate valid usernames via crafted HTTP requests.",
    "published": "2025-02-12T14:15:31.800",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-1102": {
    "cvss": 5.5,
    "description": "A CWE-346 \"Origin Validation Error\" in the CORS configuration in Q-Free MaxTime less than or equal to version 2.11.0 allows an unauthenticated remote attacker to affect the device confidentiality, integrity, or availability via crafted URLs or HTTP requests.",
    "published": "2025-02-12T14:15:31.943",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-26339": {
    "cvss": 9.8,
    "description": "A CWE-306 \"Missing Authentication for Critical Function\" in maxtime/handleRoute.lua in Q-Free MaxTime less than or equal to version 2.11.0 allows an unauthenticated remote attacker to affect the device confidentiality, integrity, or availability in multiple unspecified ways via crafted HTTP requests.",
    "published": "2025-02-12T14:15:33.510",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2025-26340": {
    "cvss": 8.8,
    "description": "A CWE-321 \"Use of Hard-coded Cryptographic Key\" in the JWT signing in Q-Free MaxTime less than or equal to version 2.11.0 allows an unauthenticated remote attacker to bypass the authentication via crafted HTTP requests.",
    "published": "2025-02-12T14:15:33.650",
    "keywords": "remote,unauthenticated,authentication,bypass"
  },
  "CVE-2025-26341": {
    "cvss": 9.8,
    "description": "A CWE-306 \"Missing Authentication for Critical Function\" in maxprofile/accounts/routes.lua in Q-Free MaxTime less than or equal to version 2.11.0 allows an unauthenticated remote attacker to reset arbitrary user passwords via crafted HTTP requests.",
    "published": "2025-02-12T14:15:33.857",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2025-26342": {
    "cvss": 9.8,
    "description": "A CWE-306 \"Missing Authentication for Critical Function\" in maxprofile/accounts/routes.lua in Q-Free MaxTime less than or equal to version 2.11.0 allows an unauthenticated remote attacker to create arbitrary users, including administrators, via crafted HTTP requests.",
    "published": "2025-02-12T14:15:33.990",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2025-26343": {
    "cvss": 8.1,
    "description": "A CWE-1390 \"Weak Authentication\" in the PIN authentication mechanism in Q-Free MaxTime less than or equal to version 2.11.0 allows an unauthenticated remote attacker to brute-force user PINs via multiple crafted HTTP requests.",
    "published": "2025-02-12T14:15:34.130",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2025-26344": {
    "cvss": 9.8,
    "description": "A CWE-306 \"Missing Authentication for Critical Function\" in maxprofile/guest-mode/routes.lua in Q-Free MaxTime less than or equal to version 2.11.0 allows an unauthenticated remote attacker to enable passwordless guest mode via crafted HTTP requests.",
    "published": "2025-02-12T14:15:34.273",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2025-26345": {
    "cvss": 9.8,
    "description": "A CWE-306 \"Missing Authentication for Critical Function\" in maxprofile/menu/routes.lua in Q-Free MaxTime less than or equal to version 2.11.0 allows an unauthenticated remote attacker to edit user group permissions via crafted HTTP requests.",
    "published": "2025-02-12T14:15:34.407",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2025-26346": {
    "cvss": 5.5,
    "description": "A CWE-89 \"Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection')\" in maxprofile/menu/model.lua (editUserGroupMenu endpoint) in Q-Free MaxTime less than or equal to version 2.11.0 allows an authenticated remote attacker to execute arbitrary SQL commands via crafted HTTP requests.",
    "published": "2025-02-12T14:15:34.547",
    "keywords": "remote,command"
  },
  "CVE-2025-26347": {
    "cvss": 9.8,
    "description": "A CWE-306 \"Missing Authentication for Critical Function\" in maxprofile/menu/routes.lua in Q-Free MaxTime less than or equal to version 2.11.0 allows an unauthenticated remote attacker to edit user permissions via crafted HTTP requests.",
    "published": "2025-02-12T14:15:34.687",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2025-26348": {
    "cvss": 5.5,
    "description": "A CWE-89 \"Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection')\" in maxprofile/menu/model.lua (editUserMenu endpoint) in Q-Free MaxTime less than or equal to version 2.11.0 allows an authenticated remote attacker to execute arbitrary SQL commands via crafted HTTP requests.",
    "published": "2025-02-12T14:15:34.827",
    "keywords": "remote,command"
  },
  "CVE-2025-26351": {
    "cvss": 4.9,
    "description": "A CWE-35 \"Path Traversal\" in the template download mechanism in Q-Free MaxTime less than or equal to version 2.11.0 allows an authenticated remote attacker to read sensitive files via crafted HTTP requests.",
    "published": "2025-02-12T14:15:35.270",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-26352": {
    "cvss": 6.5,
    "description": "A CWE-35 \"Path Traversal\" in the template deletion mechanism in Q-Free MaxTime less than or equal to version 2.11.0 allows an authenticated remote attacker to delete sensitive files via crafted HTTP requests.",
    "published": "2025-02-12T14:15:35.430",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-26353": {
    "cvss": 4.9,
    "description": "A CWE-35 \"Path Traversal\" in maxtime/api/sql/sql.lua in Q-Free MaxTime less than or equal to version 2.11.0 allows an authenticated remote attacker to read sensitive files via crafted HTTP requests.",
    "published": "2025-02-12T14:15:35.587",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-26354": {
    "cvss": 7.2,
    "description": "A CWE-35 \"Path Traversal\" in maxtime/api/database/database.lua (copy endpoint) in Q-Free MaxTime less than or equal to version 2.11.0 allows an authenticated remote attacker to overwrite sensitive files via crafted HTTP requests.",
    "published": "2025-02-12T14:15:35.727",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-26355": {
    "cvss": 6.5,
    "description": "A CWE-35 \"Path Traversal\" in maxtime/api/database/database.lua in Q-Free MaxTime less than or equal to version 2.11.0 allows an authenticated remote attacker to delete sensitive files via crafted HTTP requests.",
    "published": "2025-02-12T14:15:35.870",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-26356": {
    "cvss": 7.2,
    "description": "A CWE-35 \"Path Traversal\" in maxtime/api/database/database.lua (setActive endpoint) in Q-Free MaxTime less than or equal to version 2.11.0 allows an authenticated remote attacker to overwrite sensitive files via crafted HTTP requests.",
    "published": "2025-02-12T14:15:36.017",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-26357": {
    "cvss": 4.9,
    "description": "A CWE-35 \"Path Traversal\" in maxtime/api/database/database.lua in Q-Free MaxTime less than or equal to version 2.11.0 allows an authenticated remote attacker to read sensitive files via crafted HTTP requests.",
    "published": "2025-02-12T14:15:36.160",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-26359": {
    "cvss": 9.8,
    "description": "A CWE-306 \"Missing Authentication for Critical Function\" in maxprofile/accounts/routes.lua in Q-Free MaxTime less than or equal to version 2.11.0 allows an unauthenticated remote attacker to reset user PINs via crafted HTTP requests.",
    "published": "2025-02-12T14:15:36.437",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2025-26360": {
    "cvss": 5.3,
    "description": "A CWE-306 \"Missing Authentication for Critical Function\" in maxprofile/persistance/routes.lua in Q-Free MaxTime less than or equal to version 2.11.0 allows an unauthenticated remote attacker to delete dashboards via crafted HTTP requests.",
    "published": "2025-02-12T14:15:36.577",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2025-26361": {
    "cvss": 9.1,
    "description": "A CWE-306 \"Missing Authentication for Critical Function\" in maxprofile/setup/routes.lua in Q-Free MaxTime less than or equal to version 2.11.0 allows an unauthenticated remote attacker to factory reset the device via crafted HTTP requests.",
    "published": "2025-02-12T14:15:36.717",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2025-26362": {
    "cvss": 7.5,
    "description": "A CWE-306 \"Missing Authentication for Critical Function\" in maxprofile/setup/routes.lua in Q-Free MaxTime less than or equal to version 2.11.0 allows an unauthenticated remote attacker to set an arbitrary authentication profile server via crafted HTTP requests.",
    "published": "2025-02-12T14:15:36.847",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2025-26363": {
    "cvss": 7.5,
    "description": "A CWE-306 \"Missing Authentication for Critical Function\" in maxprofile/setup/routes.lua in Q-Free MaxTime less than or equal to version 2.11.0 allows an unauthenticated remote attacker to enable an authentication profile server via crafted HTTP requests.",
    "published": "2025-02-12T14:15:36.983",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2025-26364": {
    "cvss": 7.5,
    "description": "A CWE-306 \"Missing Authentication for Critical Function\" in maxprofile/setup/routes.lua in Q-Free MaxTime less than or equal to version 2.11.0 allows an unauthenticated remote attacker to disable an authentication profile server via crafted HTTP requests.",
    "published": "2025-02-12T14:15:37.123",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2025-26365": {
    "cvss": 7.5,
    "description": "A CWE-306 \"Missing Authentication for Critical Function\" in maxprofile/setup/routes.lua in Q-Free MaxTime less than or equal to version 2.11.0 allows an unauthenticated remote attacker to enable front panel authentication via crafted HTTP requests.",
    "published": "2025-02-12T14:15:37.267",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2025-26366": {
    "cvss": 7.5,
    "description": "A CWE-306 \"Missing Authentication for Critical Function\" in maxprofile/setup/routes.lua in Q-Free MaxTime less than or equal to version 2.11.0 allows an unauthenticated remote attacker to disable front panel authentication via crafted HTTP requests.",
    "published": "2025-02-12T14:15:37.397",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2025-25182": {
    "cvss": 9.4,
    "description": "Stroom is a data processing, storage and analysis platform. A vulnerability exists starting in version 7.2-beta.53 and prior to versions 7.2.24, 7.3-beta.22, 7.4.4, and 7.5-beta.2 that allows authentication bypass to a Stroom system when configured with ALB and installed in a way that the application is accessible not through the ALB itself. This vulnerability may also allow for server-side request forgery which may lead to code execution or further privileges escalations when using the AWS metadata URL. This scenario assumes that Stroom must be configured to use ALB Authentication integration and the application is network accessible. The vulnerability has been fixed in versions 7.2.24, 7.3-beta.22, 7.4.4, and 7.5-beta.2.",
    "published": "2025-02-12T17:15:23.857",
    "keywords": "execution,authentication,bypass"
  },
  "CVE-2025-25205": {
    "cvss": 8.2,
    "description": "Audiobookshelf is a self-hosted audiobook and podcast server. Starting in version 2.17.0 and prior to version 2.19.1, a flaw in the authentication bypass logic allows unauthenticated requests to match certain unanchored regex patterns in the URL. Attackers can craft URLs containing substrings like \"/api/items/1/cover\" in a query parameter (?r=/api/items/1/cover) to partially bypass authentication or trigger server crashes under certain routes. This could lead to information disclosure of otherwise protected data and, in some cases, a complete denial of service (server crash) if downstream code expects an authenticated user object. Version 2.19.1 contains a patch for the issue.",
    "published": "2025-02-12T19:15:21.717",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2025-0108": {
    "cvss": "-",
    "description": "An authentication bypass in the Palo Alto Networks PAN-OS software enables an unauthenticated attacker with network access to the management web interface to bypass the authentication otherwise required by the PAN-OS management web interface and invoke certain PHP scripts. While invoking these PHP scripts does not enable remote code execution, it can negatively impact integrity and confidentiality of PAN-OS.\n\nYou can greatly reduce the risk of this issue by restricting access to the management web interface to only trusted internal IP addresses according to our recommended  best practices deployment guidelines https://live.paloaltonetworks.com/t5/community-blogs/tips-amp-tricks-how-to-secure-the-management-access-of-your-palo/ba-p/464431 .\n\nThis issue does not affect Cloud NGFW or Prisma Access software.",
    "published": "2025-02-12T21:15:16.290",
    "keywords": "remote,execution,unauthenticated,authentication,bypass"
  },
  "CVE-2025-0110": {
    "cvss": "-",
    "description": "A command injection vulnerability in the Palo Alto Networks PAN-OS OpenConfig plugin enables an authenticated administrator with the ability to make gNMI requests to the PAN-OS management web interface to bypass system restrictions and run arbitrary commands. The commands are run as the “__openconfig” user (which has the Device Administrator role) on the firewall.\n\nYou can greatly reduce the risk of this issue by restricting access to the management web interface to only trusted internal IP addresses according to our recommended  best practices deployment guidelines https://live.paloaltonetworks.com/t5/community-blogs/tips-amp-tricks-how-to-secure-the-management-access-of-your-palo/ba-p/464431 .",
    "published": "2025-02-12T21:15:16.630",
    "keywords": "command,bypass"
  },
  "CVE-2025-1229": {
    "cvss": 6.3,
    "description": "A vulnerability classified as critical was found in olajowon Loggrove up to e428fac38cc480f011afcb1d8ce6c2bad378ddd6. Affected by this vulnerability is an unknown functionality of the file /read/?page=1&logfile=eee&match=. The manipulation of the argument path leads to os command injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. This product does not use versioning. This is why information about affected and unaffected releases are unavailable.",
    "published": "2025-02-12T22:15:41.667",
    "keywords": "remote,command"
  },
  "CVE-2025-0896": {
    "cvss": 9.8,
    "description": "Orthanc server prior to version 1.5.8 does not enable basic authentication by default when remote access is enabled. This could result in unauthorized access by an attacker.",
    "published": "2025-02-13T02:15:29.470",
    "keywords": "remote,authentication"
  },
  "CVE-2025-1271": {
    "cvss": 6.1,
    "description": "Reflected Cross-Site Scripting (XSS) in Anapi Group's h6web. This security flaw could allow an attacker to inject malicious JavaScript code into a URL. When a user accesses that URL, the injected code is executed in their browser, which can result in the theft of sensitive information, identity theft or the execution of unauthorised actions on behalf of the affected user.",
    "published": "2025-02-13T13:15:09.433",
    "keywords": "execution,sensitive"
  },
  "CVE-2025-1247": {
    "cvss": 8.3,
    "description": "A flaw was found in Quarkus REST that allows request parameters to leak between concurrent requests if endpoints use field injection without a CDI scope. This vulnerability allows attackers to manipulate request data, impersonate users, or access sensitive information.",
    "published": "2025-02-13T14:16:18.400",
    "keywords": "sensitive,leak"
  },
  "CVE-2025-0426": {
    "url": "https://github.com/kubernetes/kubernetes/issues/130016",
    "cvss": 6.2,
    "description": "A security issue was discovered in Kubernetes where a large number of container checkpoint requests made to the unauthenticated kubelet read-only HTTP endpoint may cause a Node Denial of Service by filling the Node's disk.",
    "published": "2025-02-13T16:16:48.417"
  },
  "CVE-2025-24903": {
    "url": "https://github.com/whisperfish/libsignal-service-rs/commit/82d70f6720e762898f34ae76b0894b0297d9b2f8",
    "cvss": 8.5,
    "description": "libsignal-service-rs is a Rust version of the libsignal-service-java library which implements the core functionality to communicate with Signal servers. Prior to commit 82d70f6720e762898f34ae76b0894b0297d9b2f8, any contact may forge a sync message, impersonating another device of the local user. The origin of sync messages is not checked. Patched libsignal-service can be found after commit 82d70f6720e762898f34ae76b0894b0297d9b2f8. The `Metadata` struct contains an additional `was_encrypted` field, which breaks the API, but should be easily resolvable. No known workarounds are available.",
    "published": "2025-02-13T16:16:48.913"
  },
  "CVE-2025-24904": {
    "cvss": 8.5,
    "description": "libsignal-service-rs is a Rust version of the libsignal-service-java library which implements the core functionality to communicate with Signal servers. Prior to commit 82d70f6720e762898f34ae76b0894b0297d9b2f8, plaintext content envelopes could be injected by a server or a malicious client, and may have been able to bypass the end-to-end encryption and authentication. The vulnerability is fixed per 82d70f6720e762898f34ae76b0894b0297d9b2f8. The `Metadata` struct contains an additional `was_encrypted` field, which breaks the API, but should be easily resolvable. No known workarounds are available.",
    "published": "2025-02-13T16:16:49.053",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-26511": {
    "cvss": 8.8,
    "description": "Systems running the Instaclustr \nfork of Stratio's Cassandra-Lucene-Index plugin versions 4.0-rc1-1.0.0 \nthrough 4.0.16-1.0.0 and 4.1.2-1.0.0 through 4.1.8-1.0.0, installed into\n Apache Cassandra version 4.x, are susceptible to a vulnerability which \nwhen successfully exploited could allow authenticated Cassandra users to\n remotely bypass RBAC and escalate their privileges.",
    "published": "2025-02-13T16:16:50.270",
    "keywords": "remote,bypass"
  },
  "CVE-2025-20615": {
    "cvss": 6.2,
    "description": "The Qardio Arm iOS application exposes sensitive data such as usernames \nand passwords in a plist file. This allows an attacker to log in to \nproduction-level development accounts and access an engineering backdoor\n in the application. The engineering backdoor allows the attacker to \nsend hex-based commands over a UI-based terminal.",
    "published": "2025-02-13T22:15:11.590",
    "keywords": "command,sensitive"
  },
  "CVE-2025-24865": {
    "cvss": 10.0,
    "description": "The administrative web interface of \nmySCADA myPRO Manager\n\ncan be accessed without authentication \nwhich could allow an unauthorized attacker to retrieve sensitive \ninformation and upload files without the associated password.",
    "published": "2025-02-13T22:15:12.613",
    "keywords": "authentication,sensitive"
  },
  "CVE-2025-25067": {
    "cvss": 9.8,
    "description": "mySCADA myPRO Manager\n \nis vulnerable to an OS command injection which could allow a remote attacker to execute arbitrary OS commands.",
    "published": "2025-02-13T22:15:12.780",
    "keywords": "remote,command"
  },
  "CVE-2025-25195": {
    "url": "https://github.com/zulip/zulip/commit/a2a1a7f8d152296c8966f1380872c0ac69e5c87e",
    "cvss": 4.3,
    "description": "Zulip is an open source team chat application. A weekly cron job (added in 50256f48314250978f521ef439cafa704e056539) demotes channels to being \"inactive\" after they have not received traffic for 180 days.  However, upon doing so, an event was sent to all users in the organization, not just users in the channel.  This event contained the name of the private channel. Similarly, the same commit (50256f48314250978f521ef439cafa704e056539) added functionality to notify clients when channels stopped being \"inactive.\"  The first message sent to a private channel which had not previously had any messages for over 180 days (and were thus already marked \"inactive\") would leak an event to all users in the organization; this event also contained the name of the private channel. Commits 75be449d456d29fef27e9d1828bafa30174284b4 and a2a1a7f8d152296c8966f1380872c0ac69e5c87e fixed the issue. This vulnerability only existed in `main`, and was not part of any published versions.",
    "published": "2025-02-13T22:15:13.100"
  },
  "CVE-2025-22960": {
    "cvss": "-",
    "description": "A session hijacking vulnerability exists in the web-based management interface of GatesAir Maxiva UAXT, VAXT transmitters. Unauthenticated attackers can access exposed log files (/logs/debug/xteLog*), potentially revealing sensitive session-related information such as session IDs (sess_id) and authentication success tokens (user_check_password OK). Exploiting this flaw could allow attackers to hijack active sessions, gain unauthorized access, and escalate privileges on affected devices.",
    "published": "2025-02-13T23:15:10.960",
    "keywords": "unauthenticated,authentication,sensitive"
  },
  "CVE-2025-22961": {
    "cvss": "-",
    "description": "A critical information disclosure vulnerability exists in the web-based management interface of GatesAir Maxiva UAXT, VAXT transmitters due to Incorrect Access Control (CWE-284). Unauthenticated attackers can directly access sensitive database backup files (snapshot_users.db) via publicly exposed URLs (/logs/devcfg/snapshot/ and /logs/devcfg/user/). Exploiting this vulnerability allows retrieval of sensitive user data, including login credentials, potentially leading to full system compromise.",
    "published": "2025-02-13T23:15:11.047",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-22962": {
    "cvss": 7.2,
    "description": "A critical remote code execution (RCE) vulnerability exists in the web-based management interface of GatesAir Maxiva UAXT, VAXT transmitters when debugging mode is enabled. An attacker with a valid session ID (sess_id) can send specially crafted POST requests to the /json endpoint, enabling arbitrary command execution on the underlying system. This vulnerability can lead to full system compromise, including unauthorized access, privilege escalation, and potentially full device takeover.",
    "published": "2025-02-13T23:15:11.140",
    "keywords": "remote,execution,command"
  },
  "CVE-2025-26522": {
    "cvss": "-",
    "description": "This vulnerability exists in RupeeWeb trading platform due to improper implementation of OTP validation mechanism in certain API endpoints. A remote attacker with valid credentials could exploit this vulnerability by manipulating API responses.  \n\nSuccessful exploitation of this vulnerability could allow the attacker to bypass Two-Factor Authentication (2FA) for other user accounts.",
    "published": "2025-02-14T12:15:29.583",
    "keywords": "remote,authentication,bypass"
  }
}