{
  "CVE-2024-28767": {
    "cvss": 6.8,
    "description": "IBM Security Directory Integrator 7.2.0 through 7.2.0.13 and 10.0.0 through 10.0.3 could allow a remote authenticated attacker to execute arbitrary commands on the system by sending a specially crafted request.",
    "published": "2024-12-20T14:15:23.850",
    "keywords": "remote,command"
  },
  "CVE-2024-51466": {
    "cvss": 9.0,
    "description": "IBM Cognos Analytics 11.2.0 through 11.2.4 FP4 and \n\n12.0.0 through 12.0.4\n\nis vulnerable to an Expression Language (EL) Injection vulnerability. A remote attacker could exploit this vulnerability to expose sensitive information, consume memory resources, and/or cause the server to crash when using a specially crafted EL statement.",
    "published": "2024-12-20T14:15:24.250",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-10385": {
    "cvss": "-",
    "description": "Ticket management system in DirectAdmin Evolution Skin is vulnerable to XSS (Cross-site Scripting), which allows a low-privileged user to inject and store malicious JavaScript code.\nIf an admin views the ticket, the script might perform actions with their privileges, including command execution. \nThis issue has been fixed in version 1.668 of DirectAdmin Evolution Skin.",
    "published": "2024-12-20T16:15:21.523",
    "keywords": "execution,command"
  },
  "CVE-2024-55470": {
    "cvss": 7.5,
    "description": "Oqtane Framework 6.0.0 is vulnerable to Incorrect Access Control. By manipulating the entityid parameter, attackers can bypass passcode validation and successfully log into the application or access restricted data without proper authorization. The lack of server-side validation exacerbates the issue, as the application relies on client-side information for authentication.",
    "published": "2024-12-20T16:15:23.977",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-12841": {
    "url": "https://github.com/emlog/emlog/issues/305",
    "cvss": 4.3,
    "description": "A vulnerability was found in Emlog Pro up to 2.4.1. It has been classified as problematic. This affects an unknown part of the file /admin/tag.php. The manipulation of the argument keyword leads to cross site scripting. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2024-12-20T19:15:06.097"
  },
  "CVE-2024-12842": {
    "url": "https://github.com/emlog/emlog/issues/305",
    "cvss": 4.3,
    "description": "A vulnerability was found in Emlog Pro up to 2.4.1. It has been declared as problematic. This vulnerability affects unknown code of the file /admin/user.php. The manipulation of the argument keyword leads to cross site scripting. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2024-12-20T20:15:21.880"
  },
  "CVE-2024-12867": {
    "cvss": "-",
    "description": "Server-Side Request Forgery in URL Mapper in Arctic Security's Arctic Hub versions 3.0.1764-5.6.1877 allows an unauthenticated remote attacker to exfiltrate and modify configurations and data.",
    "published": "2024-12-20T20:15:22.740",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-56329": {
    "cvss": "-",
    "description": "Socialstream is a third-party package for Laravel Jetstream. It replaces the published authentication and profile scaffolding provided by Laravel Jetstream, with scaffolding that has support for Laravel Socialite. When linking a social account to an already authenticated user, the lack of a confirmation step introduces a security risk. This is exacerbated if ->stateless() is used in the Socialite configuration, bypassing state verification and making the exploit easier. Developers should ensure that users explicitly confirm account linking and avoid configurations that skip critical security checks. Socialstream v6.2 introduces a new custom route that requires a user to \"Confirm\" or \"Deny\" a request to link a social account. Users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-12-20T20:15:23.987",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-12843": {
    "url": "https://github.com/emlog/emlog/issues/305",
    "cvss": 4.3,
    "description": "A vulnerability was found in Emlog Pro up to 2.4.1. It has been rated as problematic. This issue affects some unknown processing of the file /admin/plugin.php. The manipulation of the argument filter leads to cross site scripting. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2024-12-20T21:15:07.337"
  },
  "CVE-2024-12844": {
    "url": "https://github.com/emlog/emlog/issues/305",
    "cvss": 4.3,
    "description": "A vulnerability classified as problematic has been found in Emlog Pro up to 2.4.1. Affected is an unknown function of the file /admin/store.php. The manipulation of the argument tag leads to cross site scripting. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2024-12-20T21:15:07.833"
  },
  "CVE-2024-56334": {
    "cvss": 7.8,
    "description": "systeminformation is a System and OS information library for node.js. In affected versions SSIDs are not sanitized when before they are passed as a parameter to cmd.exe in the `getWindowsIEEE8021x` function. This means that malicious content in the SSID can be executed as OS commands. This vulnerability may enable an attacker, depending on how the package is used, to perform remote code execution or local privilege escalation. This issue has been addressed in version 5.23.7 and all users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-12-20T21:15:10.080",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-12845": {
    "url": "https://github.com/emlog/emlog/issues/306",
    "cvss": 3.5,
    "description": "A vulnerability classified as problematic was found in Emlog Pro up to 2.4.1. Affected by this vulnerability is an unknown functionality in the library /include/lib/common.php. The manipulation of the argument msg leads to cross site scripting. The attack can be launched remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2024-12-20T22:15:24.727"
  },
  "CVE-2024-11349": {
    "cvss": 9.8,
    "description": "The AdForest theme for WordPress is vulnerable to authentication bypass in all versions up to, and including, 5.1.6. This is due to the plugin not properly verifying a user's identity prior to authenticating them through the sb_login_user_with_otp_fun() function. This makes it possible for unauthenticated attackers to log in as arbitrary users, including administrators.",
    "published": "2024-12-21T05:15:07.017",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-12846": {
    "url": "https://github.com/emlog/emlog/issues/307",
    "cvss": 4.3,
    "description": "A vulnerability, which was classified as problematic, has been found in Emlog Pro up to 2.4.1. Affected by this issue is some unknown functionality of the file /admin/link.php. The manipulation of the argument siteurl/icon leads to cross site scripting. The attack may be launched remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2024-12-21T05:15:07.373"
  },
  "CVE-2024-11977": {
    "cvss": 7.3,
    "description": "The The kk Star Ratings – Rate Post & Collect User Feedbacks plugin for WordPress is vulnerable to arbitrary shortcode execution in all versions up to, and including, 5.4.10. This is due to the software allowing users to execute an action that does not properly validate a value before running do_shortcode. This makes it possible for unauthenticated attackers to execute arbitrary shortcodes.",
    "published": "2024-12-21T06:15:21.830",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-12066": {
    "cvss": 8.8,
    "description": "The SMSA Shipping(official) plugin for WordPress is vulnerable to arbitrary file deletion due to insufficient file path validation in the smsa_delete_label() function in all versions up to, and including, 2.2. This makes it possible for authenticated attackers, with Subscriber-level access and above, to delete arbitrary files on the server, which can easily lead to remote code execution when the right file is deleted (such as wp-config.php).",
    "published": "2024-12-21T07:15:08.907",
    "keywords": "remote,execution"
  },
  "CVE-2024-11722": {
    "cvss": 5.9,
    "description": "The Frontend Admin by DynamiApps plugin for WordPress is vulnerable to SQL Injection via the 'orderby' parameter in all versions up to, and including, 3.25.1 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database. This requires an unauthenticated user to have been given permission to view form submissions, and the form submission shortcode be added to a page.",
    "published": "2024-12-21T10:15:07.367",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-51464": {
    "cvss": 4.3,
    "description": "IBM i 7.3, 7.4, and 7.5 is vulnerable to bypassing Navigator for i interface restrictions.  By sending a specially crafted request, an authenticated attacker could exploit this vulnerability to remotely perform operations that the user is not allowed to perform when using Navigator for i.",
    "published": "2024-12-21T14:15:21.627",
    "keywords": "remote,bypass"
  },
  "CVE-2024-12896": {
    "cvss": 5.3,
    "description": "A vulnerability was found in Intelbras VIP S3020 G2, VIP S4020 G2, VIP S4020 G3 and VIP S4320 G2 up to 20241222 and classified as problematic. Affected by this issue is some unknown functionality of the file /web_caps/webCapsConfig of the component Web Interface. The manipulation leads to information disclosure. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The vendor assesses that \"the information disclosed in the URL is not sensitive or poses any risk to the user\".",
    "published": "2024-12-22T23:15:05.677",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-46873": {
    "cvss": 9.8,
    "description": "Multiple SHARP routers leave the hidden debug function enabled. An arbitrary OS command may be executed with the root privilege by a remote unauthenticated attacker.",
    "published": "2024-12-23T01:15:07.403",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-47864": {
    "cvss": 5.3,
    "description": "home 5G HR02, Wi-Fi STATION SH-52B, and Wi-Fi STATION SH-54C contain a buffer overflow vulnerability in the hidden debug function. A remote unauthenticated attacker may get the web console of the product down.",
    "published": "2024-12-23T01:15:07.553",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-52321": {
    "cvss": 5.9,
    "description": "Multiple SHARP routers contain an improper authentication vulnerability in the configuration backup function. The product's backup files containing sensitive information may be retrieved by a remote unauthenticated attacker.",
    "published": "2024-12-23T01:15:07.700",
    "keywords": "remote,unauthenticated,authentication,sensitive"
  }
}