{
  "CVE-2024-46486": {
    "cvss": "-",
    "description": "TP-LINK TL-WDR5620 v2.3 was discovered to contain a remote code execution (RCE) vulnerability via the httpProcDataSrv function.",
    "published": "2024-10-04T17:15:17.173",
    "keywords": "remote,execution"
  },
  "CVE-2024-25691": {
    "cvss": 6.1,
    "description": "There is a reflected XSS vulnerability in Esri Portal for ArcGIS versions 11.1, 10.9.1 and 10.8.1 which may allow a remote, unauthenticated attacker to create a crafted link which when clicked could potentially execute arbitrary JavaScript code in the victim’s browser.",
    "published": "2024-10-04T18:15:05.840",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-38036": {
    "cvss": 4.6,
    "description": "There is a reflected XSS vulnerability in Esri Portal for ArcGIS versions 10.9.1, 10.8.1 and 10.7.1 which may allow a remote, unauthenticated attacker to create a crafted link which when clicked could potentially execute arbitrary JavaScript code in the victim’s browser.",
    "published": "2024-10-04T18:15:06.973",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-38037": {
    "cvss": 6.1,
    "description": "There is an unvalidated redirect vulnerability in Esri Portal for ArcGIS 11.0 and 10.9.1 that may allow a remote, unauthenticated attacker to craft a URL that could redirect a victim to an arbitrary website, simplifying phishing attacks.",
    "published": "2024-10-04T18:15:07.207",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-38038": {
    "cvss": 6.1,
    "description": "There is a reflected XSS vulnerability in Esri Portal for ArcGIS versions 10.9.1, 10.8.1 and 10.7.1 which may allow a remote, unauthenticated attacker to create a crafted link which when clicked could potentially execute arbitrary JavaScript code in the victim’s browser.",
    "published": "2024-10-04T18:15:07.413",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-38040": {
    "cvss": 7.5,
    "description": "There is a local file inclusion vulnerability in Esri Portal for ArcGIS 11.2. 11.1, 11.0 and 10.9.1 that may allow a remote, unauthenticated attacker to craft a URL that could potentially disclose sensitive configuration information by reading internal files.",
    "published": "2024-10-04T18:15:07.897",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-41512": {
    "cvss": "-",
    "description": "A SQL Injection vulnerability in \"ccHandler.aspx\" in all versions of CADClick v.1.11.0 and before allows remote attackers to execute arbitrary SQL commands via the \"bomid\" parameter.",
    "published": "2024-10-04T18:15:08.153",
    "keywords": "remote,command"
  },
  "CVE-2024-8148": {
    "cvss": 6.1,
    "description": "There is an unvalidated redirect vulnerability in Esri Portal for ArcGIS 10.8.1 - 11.2 that may allow a remote, unauthenticated attacker to craft a URL that could redirect a victim to an arbitrary website, simplifying phishing attacks.",
    "published": "2024-10-04T18:15:08.633",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-8149": {
    "cvss": 4.6,
    "description": "There is a reflected XSS vulnerability in Esri Portal for ArcGIS versions 11.1 and 11.2 which may allow a remote, unauthenticated attacker to create a crafted link which when clicked could potentially execute arbitrary JavaScript code in the victim’s browser.",
    "published": "2024-10-04T18:15:08.833",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-9054": {
    "cvss": "-",
    "description": "Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection'), Exposure of Sensitive Information to an Unauthorized Actor vulnerability in Microchip TimeProvider 4100 (Configuration modules) allows Command Injection.This issue affects TimeProvider 4100: from 1.0 before 2.4.7.",
    "published": "2024-10-04T20:15:07.587",
    "keywords": "command,sensitive"
  },
  "CVE-2024-47848": {
    "cvss": "-",
    "description": "Exposure of Sensitive Information to an Unauthorized Actor vulnerability in The Wikimedia Foundation Mediawiki - PageTriage allows Authentication Bypass.This issue affects Mediawiki - PageTriage: from 1.39.X before 1.39.9, from 1.41.X before 1.41.3, from 1.42.X before 1.42.2.",
    "published": "2024-10-05T00:15:02.800",
    "keywords": "authentication,sensitive,bypass"
  },
  "CVE-2024-9554": {
    "cvss": 3.7,
    "description": "A vulnerability classified as problematic was found in Sovell Smart Canteen System up to 3.0.7303.30513. Affected by this vulnerability is the function Check_ET_CheckPwdz201 of the file suanfa.py of the component Password Reset Handler. The manipulation leads to authorization bypass. The attack can be launched remotely. The complexity of an attack is rather high. The exploitation appears to be difficult. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-10-06T12:15:08.117",
    "keywords": "remote,bypass"
  },
  "CVE-2024-9560": {
    "cvss": 6.3,
    "description": "A vulnerability was found in ESAFENET CDG V5. It has been rated as critical. Affected by this issue is the function delCatelogs of the file /CDGServer3/document/Catelogs;logindojojs?command=DelCatelogs. The manipulation of the argument id leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2024-10-06T22:15:02.677",
    "keywords": "remote,command"
  },
  "CVE-2024-20094": {
    "cvss": "-",
    "description": "In Modem, there is a possible system crash due to a missing bounds check. This could lead to remote denial of service with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: MOLY00843282; Issue ID: MSV-1535.",
    "published": "2024-10-07T03:15:02.823",
    "keywords": "remote,execution"
  },
  "CVE-2024-20100": {
    "cvss": "-",
    "description": "In wlan driver, there is a possible out of bounds write due to improper input validation. This could lead to remote code execution with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: ALPS08998449; Issue ID: MSV-1603.",
    "published": "2024-10-07T03:15:03.273",
    "keywords": "remote,execution"
  },
  "CVE-2024-20101": {
    "cvss": "-",
    "description": "In wlan driver, there is a possible out of bounds write due to improper input validation. This could lead to remote code execution with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: ALPS08998901; Issue ID: MSV-1602.",
    "published": "2024-10-07T03:15:03.350",
    "keywords": "remote,execution"
  },
  "CVE-2024-20102": {
    "cvss": "-",
    "description": "In wlan driver, there is a possible out of bounds read due to improper input validation. This could lead to remote information disclosure with System execution privileges needed. User interaction is not needed for exploitation. Patch ID: ALPS08998892; Issue ID: MSV-1601.",
    "published": "2024-10-07T03:15:03.427",
    "keywords": "remote,execution"
  },
  "CVE-2024-20103": {
    "cvss": "-",
    "description": "In wlan firmware, there is a possible out of bounds write due to improper input validation. This could lead to remote code execution with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: ALPS09001358; Issue ID: MSV-1599.",
    "published": "2024-10-07T03:15:03.500",
    "keywords": "remote,execution"
  },
  "CVE-2024-46041": {
    "cvss": "-",
    "description": "IoT Haat Smart Plug IH-IN-16A-S v5.16.1 is vulnerable to Authentication Bypass by Capture-replay.",
    "published": "2024-10-07T16:15:05.477",
    "keywords": "authentication,bypass"
  }
}