{
  "CVE-2024-43425": {
    "cvss": 8.1,
    "description": "A flaw was found in Moodle. Additional restrictions are required to avoid a remote code execution risk in calculated question types. Note: This requires the capability to add/update questions.",
    "published": "2024-11-07T14:15:15.280",
    "keywords": "remote,execution"
  },
  "CVE-2024-10668": {
    "url": "https://github.com/google/nearby/pull/2892",
    "cvss": "-",
    "description": "There exists an auth bypass in Google Quickshare where an attacker can upload an unknown file type to a victim. The root cause of the vulnerability lies in the fact that when a Payload Transfer frame of type FILE is sent to Quick Share, the file that is contained in this frame is written to disk in the Downloads folder. Quickshare normally deletes unkown files, however an attacker can send two Payload transfer frames of type FILE and the same payload ID. The deletion logic will only delete the first file and not the second. We recommend upgrading past commit 5d8b9156e0c339d82d3dab0849187e8819ad92c0 or Quick Share Windows v1.0.2002.2",
    "published": "2024-11-07T16:15:16.923"
  },
  "CVE-2024-40715": {
    "cvss": 7.7,
    "description": "A vulnerability in Veeam Backup & Replication Enterprise Manager has been identified, which allows attackers to perform authentication bypass. Attackers must be able to perform Man-in-the-Middle (MITM) attack to exploit this vulnerability.",
    "published": "2024-11-07T17:15:08.083",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-48950": {
    "cvss": 7.5,
    "description": "An issue was discovered in Logpoint before 7.5.0. An endpoint used by Distributed Logpoint Setup was exposed, allowing unauthenticated attackers to bypass CSRF protections and authentication.",
    "published": "2024-11-07T17:15:08.373",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-48951": {
    "cvss": 7.5,
    "description": "An issue was discovered in Logpoint before 7.5.0. Server-Side Request Forgery (SSRF) on SOAR can be used to leak Logpoint's API Token leading to authentication bypass.",
    "published": "2024-11-07T17:15:08.443",
    "keywords": "authentication,bypass,leak"
  },
  "CVE-2024-48953": {
    "cvss": 7.5,
    "description": "An issue was discovered in Logpoint before 7.5.0. Endpoints for creating, editing, or deleting third-party authentication modules lacked proper authorization checks. This allowed unauthenticated users to register their own authentication plugins in Logpoint, resulting in unauthorized access.",
    "published": "2024-11-07T17:15:08.570",
    "keywords": "unauthenticated,authentication"
  },
  "CVE-2024-48954": {
    "cvss": 6.4,
    "description": "An issue was discovered in Logpoint before 7.5.0. Unvalidated input during the EventHub Collector setup by an authenticated user leads to Remote Code execution.",
    "published": "2024-11-07T17:15:08.650",
    "keywords": "remote,execution"
  },
  "CVE-2024-10966": {
    "cvss": 6.3,
    "description": "A vulnerability, which was classified as critical, has been found in TOTOLINK X18 9.1.0cu.2024_B20220329. Affected by this issue is some unknown functionality of the file /cgi-bin/cstecgi.cgi. The manipulation of the argument enable leads to os command injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2024-11-07T18:15:16.033",
    "keywords": "remote,command"
  },
  "CVE-2024-10824": {
    "cvss": "-",
    "description": "An authorization bypass vulnerability was identified in GitHub Enterprise Server that allowed unauthorized internal users to access sensitive secret scanning alert data intended only for business owners. This issue could be exploited only by organization members with a personal access token (PAT) and required that secret scanning be enabled on user-owned repositories. This vulnerability affected GitHub Enterprise Server versions after 3.13.0 but prior to 3.14.0 and was fixed in version 3.13.2.",
    "published": "2024-11-07T22:15:20.450",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-45759": {
    "cvss": 6.8,
    "description": "Dell PowerProtect Data Domain, versions prior to 8.1.0.0, 7.13.1.10, 7.10.1.40, and 7.7.5.50, contains an escalation of privilege vulnerability. A local low privileged attacker could potentially exploit this vulnerability, leading to unauthorized execution of certain commands to overwrite system config of the application. Exploitation may lead to denial of service of system.",
    "published": "2024-11-08T03:15:03.647",
    "keywords": "execution,command"
  },
  "CVE-2024-48011": {
    "cvss": 3.1,
    "description": "Dell PowerProtect DD, versions prior to 7.7.5.50, contains an Exposure of Sensitive Information to an Unauthorized Actor vulnerability. A low privileged attacker with remote access could potentially exploit this vulnerability, leading to Information disclosure.",
    "published": "2024-11-08T03:15:04.160",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-50588": {
    "cvss": 9.8,
    "description": "An unauthenticated attacker with access to the local network of the \nmedical office can use known default credentials to gain remote DBA \naccess to the Elefant Firebird database. The data in the database \nincludes patient data and login credentials among other sensitive data. \nIn addition, this enables an attacker to create and overwrite arbitrary \nfiles on the server filesystem with the rights of the Firebird database \n(\"NT AUTHORITY\\SYSTEM\").",
    "published": "2024-11-08T09:15:07.680",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-50589": {
    "cvss": 7.5,
    "description": "An unauthenticated attacker with access to the local network of the \nmedical office can query an unprotected Fast Healthcare Interoperability\n Resources (FHIR) API to get access to sensitive electronic health \nrecords (EHR).",
    "published": "2024-11-08T12:15:14.707",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-45764": {
    "cvss": 9.0,
    "description": "Dell Enterprise SONiC OS, version(s) 4.1.x, 4.2.x, contain(s) a Missing Critical Step in Authentication vulnerability. An unauthenticated attacker with remote access could potentially exploit this vulnerability, leading to Protection mechanism bypass. This is a critical severity vulnerability so Dell recommends customers to upgrade at the earliest opportunity.",
    "published": "2024-11-08T16:15:23.070",
    "keywords": "remote,unauthenticated,authentication,bypass"
  },
  "CVE-2024-45765": {
    "cvss": 9.1,
    "description": "Dell Enterprise SONiC OS, version(s) 4.1.x, 4.2.x, contain(s) an Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection') vulnerability. A high privileged attacker with remote access could potentially exploit this vulnerability, leading to Command execution. This is a critical severity vulnerability as it allows high privilege OS commands to be executed with a less privileged role; so Dell recommends customers to upgrade at the earliest opportunity.",
    "published": "2024-11-08T16:15:23.350",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-45763": {
    "cvss": 9.1,
    "description": "Dell Enterprise SONiC OS, version(s) 4.1.x, 4.2.x, contain(s) an Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection') vulnerability. A high privileged attacker with remote access could potentially exploit this vulnerability, leading to Command execution. This is a critical severity vulnerability so Dell recommends customers to upgrade at the earliest opportunity.",
    "published": "2024-11-08T17:15:06.243",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-51030": {
    "cvss": "-",
    "description": "A SQL injection vulnerability in manage_client.php and view_cab.php of Sourcecodester Cab Management System 1.0 allows remote attackers to execute arbitrary SQL commands via the id parameter, leading to unauthorized access and potential compromise of sensitive data within the database.",
    "published": "2024-11-08T18:15:17.463",
    "keywords": "remote,command,sensitive"
  },
  "CVE-2024-50810": {
    "url": "https://github.com/hopetree/izone/issues/289",
    "cvss": "-",
    "description": "hopetree izone lts c011b48 contains a Cross Site Scripting (XSS) vulnerability in the article comment function. In \\apps\\comment\\views.py, AddCommintView() does not securely filter user input and renders it directly to the frontend page through templates.",
    "published": "2024-11-08T19:15:05.877"
  },
  "CVE-2024-50811": {
    "url": "https://github.com/hopetree/izone/issues/290",
    "cvss": "-",
    "description": "hopetree izone lts c011b48 contains a server-side request forgery (SSRF) vulnerability in the active push function as \\\\apps\\\\tool\\\\apis\\\\bd_push.py does not securely filter user input through push_urls() and get_urls().",
    "published": "2024-11-08T19:15:06.020"
  },
  "CVE-2024-51055": {
    "url": "https://github.com/havok89/hoosk/issues/66",
    "cvss": "-",
    "description": "An issue Hoosk v1.7.1 allows a remote attacker to execute arbitrary code via a crafted script to the config.php component.",
    "published": "2024-11-08T19:15:06.190"
  },
  "CVE-2024-50809": {
    "cvss": "-",
    "description": "The theme.php file in SDCMS 2.8 has a command execution vulnerability that allows for the execution of system commands",
    "published": "2024-11-08T21:15:20.870",
    "keywords": "execution,command"
  },
  "CVE-2024-27527": {
    "url": "https://github.com/wasm3/wasm3/issues/464",
    "cvss": "-",
    "description": "wasm3 139076a is vulnerable to Denial of Service (DoS).",
    "published": "2024-11-08T22:15:15.253"
  },
  "CVE-2024-27528": {
    "url": "https://github.com/wasm3/wasm3/issues/463",
    "cvss": "-",
    "description": "wasm3 139076a suffers from Invalid Memory Read, leading to DoS and potential Code Execution.",
    "published": "2024-11-08T22:15:15.360"
  },
  "CVE-2024-27529": {
    "url": "https://github.com/wasm3/wasm3/issues/462",
    "cvss": "-",
    "description": "wasm3 139076a contains memory leaks in Read_utf8.",
    "published": "2024-11-08T22:15:15.440"
  },
  "CVE-2024-27530": {
    "url": "https://github.com/wasm3/wasm3/issues/458",
    "cvss": "-",
    "description": "wasm3 139076a contains a Use-After-Free in ForEachModule.",
    "published": "2024-11-08T22:15:15.520"
  },
  "CVE-2024-27532": {
    "url": "https://github.com/bytecodealliance/wasm-micro-runtime/issues/3130",
    "cvss": "-",
    "description": "wasm-micro-runtime (aka WebAssembly Micro Runtime or WAMR) 06df58f is vulnerable to NULL Pointer Dereference in function `block_type_get_result_types.",
    "published": "2024-11-08T22:15:15.603"
  },
  "CVE-2024-35410": {
    "url": "https://github.com/kanaka/wac/issues/17",
    "cvss": "-",
    "description": "wac commit 385e1 was discovered to contain a heap overflow via the interpret function at /wac-asan/wa.c. This vulnerability allows attackers to cause a Denial of Service (DoS) via a crafted wasm file.",
    "published": "2024-11-08T22:15:15.737"
  },
  "CVE-2024-35418": {
    "url": "https://github.com/kanaka/wac/issues/19",
    "cvss": "-",
    "description": "wac commit 385e1 was discovered to contain a heap overflow via the setup_call function at /wac-asan/wa.c. This vulnerability allows attackers to cause a Denial of Service (DoS) via a crafted wasm file.",
    "published": "2024-11-08T22:15:15.823"
  },
  "CVE-2024-35419": {
    "url": "https://github.com/kanaka/wac/issues/18",
    "cvss": "-",
    "description": "wac commit 385e1 was discovered to contain a heap overflow via the load_module function at /wac-asan/wa.c. This vulnerability allows attackers to cause a Denial of Service (DoS) via a crafted wasm file.",
    "published": "2024-11-08T22:15:15.913"
  },
  "CVE-2024-35420": {
    "url": "https://github.com/kanaka/wac/issues/20",
    "cvss": "-",
    "description": "wac commit 385e1 was discovered to contain a heap overflow.",
    "published": "2024-11-08T22:15:16.010"
  },
  "CVE-2024-35421": {
    "url": "https://github.com/andoma/vmir/issues/22",
    "cvss": "-",
    "description": "vmir e8117 was discovered to contain a segmentation violation via the wasm_parse_block function at /src/vmir_wasm_parser.c.",
    "published": "2024-11-08T22:15:16.090"
  },
  "CVE-2024-35422": {
    "url": "https://github.com/andoma/vmir/issues/23",
    "cvss": "-",
    "description": "vmir e8117 was discovered to contain a heap buffer overflow via the wasm_call function at /src/vmir_wasm_parser.c.",
    "published": "2024-11-08T22:15:16.180"
  },
  "CVE-2024-35423": {
    "url": "https://github.com/andoma/vmir/issues/18",
    "cvss": "-",
    "description": "vmir e8117 was discovered to contain a heap buffer overflow via the wasm_parse_section_functions function at /src/vmir_wasm_parser.c.",
    "published": "2024-11-08T22:15:16.257"
  },
  "CVE-2024-35424": {
    "url": "https://github.com/andoma/vmir/issues/21",
    "cvss": "-",
    "description": "vmir e8117 was discovered to contain a segmentation violation via the import_function function at /src/vmir_wasm_parser.c.",
    "published": "2024-11-08T22:15:16.343"
  },
  "CVE-2024-35425": {
    "url": "https://github.com/andoma/vmir/issues/19",
    "cvss": "-",
    "description": "vmir e8117 was discovered to contain a segmentation violation via the function_prepare_parse function at /src/vmir_function.c.",
    "published": "2024-11-08T22:15:16.430"
  },
  "CVE-2024-48073": {
    "cvss": "-",
    "description": "sunniwell HT3300 before 1.0.0.B022.2 is vulnerable to Insecure Permissions. The /usr/local/bin/update program, which is responsible for updating the software in the HT3300 device, is given the execution mode of sudo NOPASSWD. This program is vulnerable to a command injection vulnerability, which could allow an attacker to pass commands to this program via command line arguments to gain elevated root privileges.",
    "published": "2024-11-08T22:15:20.787",
    "keywords": "execution,command"
  },
  "CVE-2024-35426": {
    "url": "https://github.com/andoma/vmir/issues/24",
    "cvss": "-",
    "description": "vmir e8117 was discovered to contain a stack overflow via the init_local_vars function at /src/vmir_wasm_parser.c.",
    "published": "2024-11-08T23:15:03.580"
  },
  "CVE-2024-35427": {
    "url": "https://github.com/andoma/vmir/issues/20",
    "cvss": "-",
    "description": "vmir e8117 was discovered to contain a segmentation violation via the export_function function at /src/vmir_wasm_parser.c.",
    "published": "2024-11-08T23:15:03.680"
  },
  "CVE-2024-52004": {
    "cvss": "-",
    "description": "MediaCMS is an open source video and media CMS, written in Python/Django and React, featuring a REST API. MediaCMS has been prone to vulnerabilities that upon special cases can lead to remote code execution. All versions before v4.1.0 are susceptible, and users are highly recommended to upgrade. The vulnerabilities are related with insufficient input validation while uploading media content. The condition to exploit the vulnerability is that the portal allows users to upload content. This issue has been patched in version 4.1.0. There are no known workarounds for this vulnerability.",
    "published": "2024-11-08T23:15:04.627",
    "keywords": "remote,execution"
  },
  "CVE-2024-52311": {
    "cvss": 6.3,
    "description": "Authentication tokens issued via Cognito in data.all are not invalidated on log out, allowing for previously authenticated user to continue execution of authorized API Requests until token is expired.",
    "published": "2024-11-09T01:15:04.133",
    "keywords": "execution,authentication"
  },
  "CVE-2024-10284": {
    "cvss": 9.8,
    "description": "The CE21 Suite plugin for WordPress is vulnerable to authentication bypass in versions up to, and including, 2.2.0. This is due to hardcoded encryption key in the 'ce21_authentication_phrase' function. This makes it possible for unauthenticated attackers to log in as any existing user on the site, such as an administrator, if they have access to the email.",
    "published": "2024-11-09T03:15:03.943",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-10285": {
    "cvss": 9.8,
    "description": "The CE21 Suite plugin for WordPress is vulnerable to sensitive information disclosure via the plugin-log.txt in versions up to, and including, 2.2.0. This makes it possible for unauthenticated attackers to log in the user associated with the JWT token.",
    "published": "2024-11-09T03:15:04.410",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-10586": {
    "cvss": 9.8,
    "description": "The Debug Tool plugin for WordPress is vulnerable to arbitrary file creation due to a missing capability check on the dbt_pull_image() function and missing file type validation in all versions up to, and including, 2.2. This makes it possible for unauthenticated attackers to to create arbitrary files such as .php files that can be leveraged for remote code execution.",
    "published": "2024-11-09T03:15:04.940",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-9262": {
    "cvss": 6.5,
    "description": "The User Meta – User Profile Builder and User management plugin plugin for WordPress is vulnerable to Insecure Direct Object Reference in all versions up to, and including, 3.1 via the getUser() due to missing validation on a user controlled key. This makes it possible for authenticated attackers, with Contributor-level access and above, to obtain user meta values from form fields. Please note that this requires a site administrator to create a form that displays potentially sensitive information like password hashes. This may also be exploited by unauthenticated users if the  'user-meta-public-profile' shortcode is used insecurely.",
    "published": "2024-11-09T03:15:05.970",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-10625": {
    "cvss": 9.8,
    "description": "The WooCommerce Support Ticket System plugin for WordPress is vulnerable to arbitrary file deletion due to insufficient file path validation in the delete_tmp_uploaded_file() function in all versions up to, and including, 17.7. This makes it possible for unauthenticated attackers to delete arbitrary files on the server, which can easily lead to remote code execution when the right file is deleted (such as wp-config.php).",
    "published": "2024-11-09T04:15:03.393",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-10626": {
    "cvss": 8.8,
    "description": "The WooCommerce Support Ticket System plugin for WordPress is vulnerable to arbitrary file deletion due to insufficient file path validation in the delete_uploaded_file() function in all versions up to, and including, 17.7. This makes it possible for authenticated attackers, with Subscriber-level access and above, to delete arbitrary files on the server, which can easily lead to remote code execution when the right file is deleted (such as wp-config.php).",
    "published": "2024-11-09T04:15:03.747",
    "keywords": "remote,execution"
  },
  "CVE-2024-10627": {
    "cvss": 9.8,
    "description": "The WooCommerce Support Ticket System plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the ajax_manage_file_chunk_upload() function in all versions up to, and including, 17.7. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-11-09T04:15:04.053",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-10673": {
    "cvss": 8.8,
    "description": "The Top Store theme for WordPress is vulnerable to unauthorized arbitrary plugin installation due to a missing capability check on the top_store_install_and_activate_callback() function in all versions up to, and including, 1.5.4. This makes it possible for authenticated attackers, with subscriber-level access and above, to install arbitrary plugins which can contain other exploitable vulnerabilities to elevate privileges and gain remote code execution.",
    "published": "2024-11-09T04:15:04.363",
    "keywords": "remote,execution"
  },
  "CVE-2024-10674": {
    "cvss": 8.8,
    "description": "The Th Shop Mania theme for WordPress is vulnerable to unauthorized arbitrary plugin installation due to a missing capability check on the th_shop_mania_install_and_activate_callback() function in all versions up to, and including, 1.4.9. This makes it possible for authenticated attackers, with Subscriber-level access and above, to install arbitrary plugins which can be leveraged to exploit other vulnerabilities and achieve remote code execution and privilege escalation.",
    "published": "2024-11-09T04:15:04.677",
    "keywords": "remote,execution"
  },
  "CVE-2024-10470": {
    "cvss": 9.8,
    "description": "The WPLMS Learning Management System for WordPress, WordPress LMS theme for WordPress is vulnerable to arbitrary file read and deletion due to insufficient file path validation and permissions checks in the readfile and unlink functions in all versions up to, and including, 4.962. This makes it possible for unauthenticated attackers to delete arbitrary files on the server, which can easily lead to remote code execution when the right file is deleted (such as wp-config.php). The theme is vulnerable even when it is not activated.",
    "published": "2024-11-09T06:15:15.967",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-8756": {
    "cvss": 5.3,
    "description": "The Quform - WordPress Form Builder plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 2.20.0 via the 'saveUploadedFile' function. This makes it possible for unauthenticated attackers to extract sensitive data, such as Personally Identifiable Information, from files uploaded by users. Files uploaded via forms created before version 2.21.0 will remain vulnerable to exposure after upgrading. To fully patch the plugin, site administrators should download any previously uploaded files, delete previously existing files and forms, and create the forms again after upgrading to version 2.21.0.",
    "published": "2024-11-09T06:15:16.383",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-10547": {
    "cvss": 9.8,
    "description": "The WP Membership plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the user_profile_image_upload() function in all versions up to, and including, 1.6.2. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-11-09T08:15:03.563",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-10801": {
    "cvss": 9.8,
    "description": "The WordPress User Extra Fields plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the ajax_manage_file_chunk_upload() function in all versions up to, and including, 16.5. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected site's server which may make remote code execution possible. User registration must be enabled for this to be exploited.",
    "published": "2024-11-09T08:15:04.260",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-10871": {
    "cvss": 9.8,
    "description": "The Category Ajax Filter plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 2.8.2 via the 'params[caf-post-layout]' parameter. This makes it possible for unauthenticated attackers to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where files with a .php extension can be uploaded and included.",
    "published": "2024-11-09T08:15:04.530",
    "keywords": "execution,unauthenticated,sensitive,bypass"
  },
  "CVE-2024-50252": {
    "cvss": "-",
    "description": "In the Linux kernel, the following vulnerability has been resolved:\n\nmlxsw: spectrum_ipip: Fix memory leak when changing remote IPv6 address\n\nThe device stores IPv6 addresses that are used for encapsulation in\nlinear memory that is managed by the driver.\n\nChanging the remote address of an ip6gre net device never worked\nproperly, but since cited commit the following reproducer [1] would\nresult in a warning [2] and a memory leak [3]. The problem is that the\nnew remote address is never added by the driver to its hash table (and\ntherefore the device) and the old address is never removed from it.\n\nFix by programming the new address when the configuration of the ip6gre\nnet device changes and removing the old one. If the address did not\nchange, then the above would result in increasing the reference count of\nthe address and then decreasing it.\n\n[1]\n # ip link add name bla up type ip6gre local 2001:db8:1::1 remote 2001:db8:2::1 tos inherit ttl inherit\n # ip link set dev bla type ip6gre remote 2001:db8:3::1\n # ip link del dev bla\n # devlink dev reload pci/0000:01:00.0\n\n[2]\nWARNING: CPU: 0 PID: 1682 at drivers/net/ethernet/mellanox/mlxsw/spectrum.c:3002 mlxsw_sp_ipv6_addr_put+0x140/0x1d0\nModules linked in:\nCPU: 0 UID: 0 PID: 1682 Comm: ip Not tainted 6.12.0-rc3-custom-g86b5b55bc835 #151\nHardware name: Nvidia SN5600/VMOD0013, BIOS 5.13 05/31/2023\nRIP: 0010:mlxsw_sp_ipv6_addr_put+0x140/0x1d0\n[...]\nCall Trace:\n <TASK>\n mlxsw_sp_router_netdevice_event+0x55f/0x1240\n notifier_call_chain+0x5a/0xd0\n call_netdevice_notifiers_info+0x39/0x90\n unregister_netdevice_many_notify+0x63e/0x9d0\n rtnl_dellink+0x16b/0x3a0\n rtnetlink_rcv_msg+0x142/0x3f0\n netlink_rcv_skb+0x50/0x100\n netlink_unicast+0x242/0x390\n netlink_sendmsg+0x1de/0x420\n ____sys_sendmsg+0x2bd/0x320\n ___sys_sendmsg+0x9a/0xe0\n __sys_sendmsg+0x7a/0xd0\n do_syscall_64+0x9e/0x1a0\n entry_SYSCALL_64_after_hwframe+0x77/0x7f\n\n[3]\nunreferenced object 0xffff898081f597a0 (size 32):\n  comm \"ip\", pid 1626, jiffies 4294719324\n  hex dump (first 32 bytes):\n    20 01 0d b8 00 02 00 00 00 00 00 00 00 00 00 01   ...............\n    21 49 61 83 80 89 ff ff 00 00 00 00 01 00 00 00  !Ia.............\n  backtrace (crc fd9be911):\n    [<00000000df89c55d>] __kmalloc_cache_noprof+0x1da/0x260\n    [<00000000ff2a1ddb>] mlxsw_sp_ipv6_addr_kvdl_index_get+0x281/0x340\n    [<000000009ddd445d>] mlxsw_sp_router_netdevice_event+0x47b/0x1240\n    [<00000000743e7757>] notifier_call_chain+0x5a/0xd0\n    [<000000007c7b9e13>] call_netdevice_notifiers_info+0x39/0x90\n    [<000000002509645d>] register_netdevice+0x5f7/0x7a0\n    [<00000000c2e7d2a9>] ip6gre_newlink_common.isra.0+0x65/0x130\n    [<0000000087cd6d8d>] ip6gre_newlink+0x72/0x120\n    [<000000004df7c7cc>] rtnl_newlink+0x471/0xa20\n    [<0000000057ed632a>] rtnetlink_rcv_msg+0x142/0x3f0\n    [<0000000032e0d5b5>] netlink_rcv_skb+0x50/0x100\n    [<00000000908bca63>] netlink_unicast+0x242/0x390\n    [<00000000cdbe1c87>] netlink_sendmsg+0x1de/0x420\n    [<0000000011db153e>] ____sys_sendmsg+0x2bd/0x320\n    [<000000003b6d53eb>] ___sys_sendmsg+0x9a/0xe0\n    [<00000000cae27c62>] __sys_sendmsg+0x7a/0xd0",
    "published": "2024-11-09T11:15:10.973",
    "keywords": "remote,leak"
  },
  "CVE-2024-10261": {
    "cvss": 7.3,
    "description": "The The Paid Membership Subscriptions – Effortless Memberships, Recurring Payments & Content Restriction plugin for WordPress is vulnerable to arbitrary shortcode execution in all versions up to, and including, 2.13.0. This is due to the software allowing users to execute an action that does not properly validate a value before running do_shortcode. This makes it possible for unauthenticated attackers to execute arbitrary shortcodes.",
    "published": "2024-11-09T12:15:16.800",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-10640": {
    "cvss": 7.3,
    "description": "The The FOX – Currency Switcher Professional for WooCommerce plugin for WordPress is vulnerable to arbitrary shortcode execution in all versions up to, and including, 1.4.2.2. This is due to the software allowing users to execute an action that does not properly validate a value before running do_shortcode. This makes it possible for unauthenticated attackers to execute arbitrary shortcodes.",
    "published": "2024-11-09T12:15:17.460",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-11046": {
    "cvss": 6.3,
    "description": "A vulnerability was found in D-Link DI-8003 16.07.16A1. It has been classified as critical. Affected is the function upgrade_filter_asp of the file /upgrade_filter.asp. The manipulation of the argument path leads to os command injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2024-11-10T03:15:03.940",
    "keywords": "remote,command"
  }
}