{
  "CVE-2024-38887": {
    "cvss": "-",
    "description": "An issue in Horizon Business Services Inc. Caterease 16.0.1.1663 through 24.0.1.2405 and possibly later versions, allows a remote attacker to expand control over the operating system from the database due to the execution of commands with unnecessary privileges.",
    "published": "2024-08-02T21:16:30.760",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-38891": {
    "cvss": "-",
    "description": "An issue in Horizon Business Services Inc. Caterease 16.0.1.1663 through 24.0.1.2405 and possibly later versions, allows a remote attacker to perform a Sniffing Network Traffic attack due to the cleartext transmission of sensitive information.",
    "published": "2024-08-02T21:16:30.853",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-7319": {
    "cvss": 7.4,
    "description": "An incomplete fix for CVE-2023-1625 was found in openstack-heat. Sensitive information may possibly be disclosed through the OpenStack stack abandon command with the hidden feature set to True and the CVE-2023-1625 fix applied.",
    "published": "2024-08-02T21:16:31.180",
    "keywords": "command,sensitive"
  },
  "CVE-2024-6477": {
    "cvss": "-",
    "description": "The UsersWP  WordPress plugin before 1.2.12 uses predictable filenames when an admin generates an export, which could allow unauthenticated attackers to download them and retrieve sensitive information such as IP, username, and email address",
    "published": "2024-08-03T06:16:29.427",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-7257": {
    "cvss": 9.8,
    "description": "The YayExtra – WooCommerce Extra Product Options plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the handle_upload_file function in all versions up to, and including, 1.3.7. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-08-03T10:15:50.710",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-7436": {
    "cvss": 6.3,
    "description": "A vulnerability, which was classified as critical, has been found in D-Link DI-8100 16.07. This issue affects the function msp_info_htm of the file msp_info.htm. The manipulation of the argument cmd leads to command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-273521 was assigned to this vulnerability.",
    "published": "2024-08-03T14:15:48.247",
    "keywords": "remote,command"
  },
  "CVE-2024-7440": {
    "cvss": 6.3,
    "description": "** UNSUPPORTED WHEN ASSIGNED ** A vulnerability was found in Vivotek CC8160 VVTK-0100d. It has been classified as critical. This affects the function getenv of the file upload_file.cgi. The manipulation of the argument QUERY_STRING leads to command injection. It is possible to initiate the attack remotely. The identifier VDB-273525 was assigned to this vulnerability. NOTE: This vulnerability only affects products that are no longer supported by the maintainer. NOTE: Vendor was contacted early and confirmed that the affected release tree is end-of-life.",
    "published": "2024-08-03T17:15:49.667",
    "keywords": "remote,command"
  },
  "CVE-2024-7442": {
    "cvss": 6.3,
    "description": "** UNSUPPORTED WHEN ASSIGNED ** A vulnerability was found in Vivotek SD9364 VVTK-0103f. It has been rated as critical. This issue affects the function getenv of the file upload_file.cgi. The manipulation of the argument QUERY_STRING leads to command injection. The attack may be initiated remotely. The associated identifier of this vulnerability is VDB-273527. NOTE: This vulnerability only affects products that are no longer supported by the maintainer. NOTE: Vendor was contacted early and confirmed that the affected release tree is end-of-life.",
    "published": "2024-08-03T18:15:35.793",
    "keywords": "remote,command"
  },
  "CVE-2024-7443": {
    "cvss": 6.3,
    "description": "** UNSUPPORTED WHEN ASSIGNED ** A vulnerability classified as critical has been found in Vivotek IB8367A VVTK-0100b. Affected is the function getenv of the file upload_file.cgi. The manipulation of the argument QUERY_STRING leads to command injection. It is possible to launch the attack remotely. The identifier of this vulnerability is VDB-273528. NOTE: This vulnerability only affects products that are no longer supported by the maintainer. NOTE: Vendor was contacted early and confirmed that the affected release tree is end-of-life.",
    "published": "2024-08-03T19:15:42.590",
    "keywords": "remote,command"
  },
  "CVE-2024-6331": {
    "cvss": 7.5,
    "description": "stitionai/devika main branch as of commit cdfb782b0e634b773b10963c8034dc9207ba1f9f is vulnerable to Local File Read (LFI) by Prompt Injection. The integration of Google Gimini 1.0 Pro with `HarmBlockThreshold.BLOCK_NONE` for `HarmCategory.HARM_CATEGORY_HATE_SPEECH` and `HarmCategory.HARM_CATEGORY_HARASSMENT` in `safety_settings` disables content protection. This allows malicious commands to be executed, such as reading sensitive file contents like `/etc/passwd`.",
    "published": "2024-08-04T00:15:47.863",
    "keywords": "command,sensitive"
  },
  "CVE-2024-35143": {
    "cvss": 6.7,
    "description": "IBM Planning Analytics Local 2.0 and 2.1 connects to a MongoDB server. MongoDB, a document-oriented database system, is listening on the remote port, and it is configured to allow connections without password authentication. A remote attacker can gain unauthorized access to the database.  IBM X-Force ID:  292420.",
    "published": "2024-08-04T13:15:57.480",
    "keywords": "remote,authentication"
  },
  "CVE-2024-7458": {
    "url": "https://github.com/elunez/eladmin/issues/851",
    "cvss": 5.5,
    "description": "A vulnerability was found in elunez eladmin up to 2.7 and classified as critical. This issue affects some unknown processing of the file /api/deploy/upload /api/database/upload of the component Database Management/Deployment Management. The manipulation of the argument file leads to path traversal: 'dir/../../filename'. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-273551.",
    "published": "2024-08-04T22:15:50.837"
  },
  "CVE-2024-7464": {
    "cvss": 6.3,
    "description": "A vulnerability, which was classified as critical, has been found in TOTOLINK CP900 6.3c.566. This issue affects the function setTelnetCfg of the component Telnet Service. The manipulation of the argument telnet_enabled leads to command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-273557 was assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-08-05T01:16:08.157",
    "keywords": "remote,command"
  },
  "CVE-2024-7467": {
    "cvss": 6.3,
    "description": "A vulnerability was found in Raisecom MSG1200, MSG2100E, MSG2200 and MSG2300 3.90 and classified as critical. Affected by this issue is the function sslvpn_config_mod of the file /vpn/list_ip_network.php of the component Web Interface. The manipulation of the argument template/stylenum leads to os command injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-273560. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-08-05T03:16:08.040",
    "keywords": "remote,command,vpn"
  },
  "CVE-2024-7468": {
    "cvss": 6.3,
    "description": "A vulnerability was found in Raisecom MSG1200, MSG2100E, MSG2200 and MSG2300 3.90. It has been classified as critical. This affects the function sslvpn_config_mod of the file /vpn/list_service_manage.php of the component Web Interface. The manipulation of the argument template/stylenum leads to os command injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-273561 was assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-08-05T03:16:08.363",
    "keywords": "remote,command,vpn"
  },
  "CVE-2024-7469": {
    "cvss": 6.3,
    "description": "A vulnerability was found in Raisecom MSG1200, MSG2100E, MSG2200 and MSG2300 3.90. It has been declared as critical. This vulnerability affects the function sslvpn_config_mod of the file /vpn/list_vpn_web_custom.php of the component Web Interface. The manipulation of the argument template/stylenum leads to os command injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. VDB-273562 is the identifier assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-08-05T04:15:59.370",
    "keywords": "remote,command,vpn"
  },
  "CVE-2024-7470": {
    "cvss": 6.3,
    "description": "A vulnerability was found in Raisecom MSG1200, MSG2100E, MSG2200 and MSG2300 3.90. It has been rated as critical. This issue affects the function sslvpn_config_mod of the file /vpn/vpn_template_style.php of the component Web Interface. The manipulation of the argument template/stylenum leads to os command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-273563. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-08-05T04:15:59.730",
    "keywords": "remote,command,vpn"
  },
  "CVE-2024-41889": {
    "cvss": "-",
    "description": "Multiple Pimax products accept WebSocket connections from unintended endpoints. If this vulnerability is exploited, arbitrary code may be executed by a remote unauthenticated attacker.",
    "published": "2024-08-05T05:15:39.697",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-6117": {
    "cvss": "-",
    "description": "A Unrestricted upload of file with dangerous type vulnerability in meeting management function in Hamastar MeetingHub Paperless Meetings 2021 allows remote authenticated users to perform arbitrary system commands via a crafted ASP file.",
    "published": "2024-08-05T05:15:39.760",
    "keywords": "remote,command"
  },
  "CVE-2024-38856": {
    "cvss": "-",
    "description": "Incorrect Authorization vulnerability in Apache OFBiz.\n\nThis issue affects Apache OFBiz: through 18.12.14.\n\nUsers are recommended to upgrade to version 18.12.15, which fixes the issue.\n\nUnauthenticated endpoints could allow execution of screen rendering code of screens if some preconditions are met (such as when the screen definitions don't explicitly check user's permissions because they rely on the configuration of their endpoints).",
    "published": "2024-08-05T09:15:56.780",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-7395": {
    "cvss": "-",
    "description": "An authentication bypass vulnerability in Korenix JetPort 5601v3 allows an attacker to access functionality on the device without specifying a password.This issue affects JetPort 5601v3: through 1.2.",
    "published": "2024-08-05T14:15:35.483",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-41376": {
    "url": "https://github.com/zyx0814/dzzoffice/issues/252",
    "cvss": 8.8,
    "description": "dzzoffice 2.02.1 is vulnerable to Directory Traversal via user/space/about.php.",
    "published": "2024-08-05T17:15:41.803"
  },
  "CVE-2024-41380": {
    "url": "https://github.com/microweber/microweber/issues/1111",
    "cvss": "-",
    "description": "microweber 2.0.16 was discovered to contain a Cross Site Scripting (XSS) vulnerability via userfiles\\modules\\tags\\add_tagging_tagged.php.",
    "published": "2024-08-05T17:15:41.860"
  },
  "CVE-2024-41381": {
    "url": "https://github.com/microweber/microweber/issues/1110",
    "cvss": "-",
    "description": "microweber 2.0.16 was discovered to contain a Cross Site Scripting (XSS) vulnerability via userfiles\\modules\\settings\\admin.php.",
    "published": "2024-08-05T18:15:32.397"
  },
  "CVE-2024-42010": {
    "cvss": "-",
    "description": "mod_css_styles in Roundcube through 1.5.7 and 1.6.x through 1.6.7 allows a insufficiently filters Cascading Style Sheets (CSS) token sequences in rendered e-mail messages, allowing a remote attacker to obtain sensitive information.",
    "published": "2024-08-05T19:15:38.273",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-6361": {
    "cvss": "-",
    "description": "Improper Neutralization vulnerability (XSS) has been discovered in OpenText™ ALM Octane. The vulnerability affects all version prior to version 23.4. The vulnerability could cause remote code execution attack.",
    "published": "2024-08-05T19:15:38.333",
    "keywords": "remote,execution"
  },
  "CVE-2024-41958": {
    "cvss": 6.6,
    "description": "mailcow: dockerized is an open source groupware/email suite based on docker. A vulnerability has been discovered in the two-factor authentication (2FA) mechanism. This flaw allows an authenticated attacker to bypass the 2FA protection, enabling unauthorized access to other accounts that are otherwise secured with 2FA. To exploit this vulnerability, the attacker must first have access to an account within the system and possess the credentials of the target account that has 2FA enabled. By leveraging these credentials, the attacker can circumvent the 2FA process and gain access to the protected account. This issue has been addressed in the `2024-07` release. All users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-08-05T20:15:36.063",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-42350": {
    "url": "https://github.com/biscuit-auth/biscuit/commit/c87cbb5d778964d6574df3e9e6579567cad12fff",
    "cvss": 3.0,
    "description": "Biscuit is an authorization token with decentralized verification, offline attenuation and strong security policy enforcement based on a logic language. Third-party blocks can be generated without transferring the whole token to the third-party authority. Instead, a `ThirdPartyBlock` request can be sent, providing only the necessary info to generate a third-party block and to sign it: 1. the public key of the previous block (used in the signature), 2. the public keys part of the token symbol table (for public key interning in datalog expressions). A third-part block request forged by a malicious user can trick the third-party authority into generating datalog trusting the wrong keypair. Tokens with third-party blocks containing `trusted` annotations generated through a third party block request. This has been addressed in version 4 of the specification. Users are advised to update their implementations to conform. There are no known workarounds for this vulnerability.",
    "published": "2024-08-05T20:15:36.697"
  }
}