{
  "CVE-2024-35155": {
    "cvss": 6.5,
    "description": "IBM MQ Console 9.3 LTS and 9.3 CD could disclose could allow a remote attacker to obtain sensitive information when a detailed technical error message is returned in the browser.  This information could be used in further attacks against the system.  IBM X-Force ID:  292765.",
    "published": "2024-06-28T18:15:04.170",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-25041": {
    "cvss": 5.4,
    "description": "IBM Cognos Analytics 11.2.0, 11.2.1, 11.2.2, 11.2.3, 11.2.4, 12.0.0, 12.0.1, and 12.0.2 is potentially vulnerable to cross site scripting (XSS). A remote attacker could execute malicious commands due to improper validation of column headings in Cognos Assistant.  IBM X-Force ID:  282780.",
    "published": "2024-06-28T19:15:04.653",
    "keywords": "remote,command"
  },
  "CVE-2024-27629": {
    "url": "https://github.com/rordenlab/dcm2niix/pull/789",
    "cvss": "-",
    "description": "An issue in dc2niix before v.1.0.20240202 allows a local attacker to execute arbitrary code via the generated file name is not properly escaped and injected into a system call when certain types of compression are used.",
    "published": "2024-06-28T19:15:05.243"
  },
  "CVE-2024-35156": {
    "cvss": 6.5,
    "description": "IBM MQ 9.3 LTS and 9.3 CD could allow a remote attacker to obtain sensitive information when a detailed technical error message is returned in the browser.  This information could be used in further attacks against the system.  IBM X-Force ID:  292766.",
    "published": "2024-06-28T19:15:05.917",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-38528": {
    "cvss": 7.5,
    "description": "nptd-rs is a tool for synchronizing your computer's clock, implementing the NTP and NTS protocols. There is a missing limit for accepted NTS-KE connections. This allows an unauthenticated remote attacker to crash ntpd-rs when an NTS-KE server is configured. Non NTS-KE server configurations, such as the default ntpd-rs configuration, are unaffected. This vulnerability has been patched in version 1.1.3.\n",
    "published": "2024-06-28T20:15:02.533",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-5827": {
    "cvss": 9.8,
    "description": "Vanna v0.3.4 is vulnerable to SQL injection in its DuckDB integration exposed to its Flask Web APIs. Attackers can inject malicious SQL training data and generate corresponding queries to write arbitrary files on the victim's file system, such as backdoor.php with contents `<?php system($_GET[0]); ?>`. This can lead to command execution or the creation of backdoors.",
    "published": "2024-06-28T20:15:03.217",
    "keywords": "execution,command"
  },
  "CVE-2024-5598": {
    "cvss": 7.5,
    "description": "The Advanced File Manager plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 5.2.4 via the 'fma_local_file_system' function. This makes it possible for unauthenticated attackers to extract sensitive data including backups or other sensitive information if the files have been moved to the built-in Trash folder.",
    "published": "2024-06-29T05:15:02.960",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-6265": {
    "cvss": 9.8,
    "description": "The UsersWP – Front-end login form, User Registration, User Profile & Members Directory plugin for WordPress plugin for WordPress is vulnerable to time-based SQL Injection via the ‘uwp_sort_by’ parameter in all versions up to, and including, 1.2.10 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-06-29T05:15:03.560",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-25943": {
    "cvss": 7.6,
    "description": "iDRAC9, versions prior to 7.00.00.172 for 14th Generation and 7.10.50.00 for 15th and 16th Generations, contains a session hijacking vulnerability in IPMI. A remote attacker could potentially exploit this vulnerability, leading to arbitrary code execution on the vulnerable application.",
    "published": "2024-06-29T13:15:10.403",
    "keywords": "remote,execution"
  },
  "CVE-2024-39848": {
    "cvss": "-",
    "description": "Internet2 Grouper before 5.6 allows authentication bypass when LDAP authentication is used in certain ways. This is related to internet2.middleware.grouper.ws.security.WsGrouperLdapAuthentication and the use of the UyY29r password for the M3vwHr account. This also affects \"Grouper for Web Services\" before 4.13.1.",
    "published": "2024-06-29T22:15:02.263",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-35119": {
    "cvss": 5.3,
    "description": "IBM InfoSphere Information Server 11.7 could allow a remote attacker to obtain sensitive information when a detailed technical error message is returned in a stack trace.  This information could be used in further attacks against the system.  IBM X-Force ID:  290342.",
    "published": "2024-06-30T17:15:03.153",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-31898": {
    "cvss": 5.4,
    "description": "IBM InfoSphere Information Server 11.7 could allow an authenticated user to read or modify sensitive information by bypassing authentication using insecure direct object references.   IBM X-Force ID:  288182.",
    "published": "2024-06-30T18:15:03.693",
    "keywords": "authentication,sensitive,bypass"
  },
  "CVE-2024-20076": {
    "cvss": "-",
    "description": "In Modem, there is a possible system crash due to incorrect error handling. This could lead to remote denial of service with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: MOLY01297806; Issue ID: MSV-1481.",
    "published": "2024-07-01T05:15:03.957",
    "keywords": "remote,execution"
  },
  "CVE-2024-20077": {
    "cvss": "-",
    "description": "In Modem, there is a possible system crash due to incorrect error handling. This could lead to remote denial of service with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: MOLY01297807; Issue ID: MSV-1482.",
    "published": "2024-07-01T05:15:04.133",
    "keywords": "remote,execution"
  },
  "CVE-2024-20080": {
    "cvss": "-",
    "description": "In gnss service, there is a possible escalation of privilege due to improper certificate validation. This could lead to remote escalation of privilege with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: ALPS08720039; Issue ID: MSV-1424.",
    "published": "2024-07-01T05:15:04.430",
    "keywords": "remote,execution"
  },
  "CVE-2024-3123": {
    "cvss": 7.2,
    "description": "CHANGING Mobile One Time Password's uploading function in a hidden page does not filter file type properly. Remote attackers with  administrator privilege can exploit this vulnerability to upload and run malicious file to execute system commands.",
    "published": "2024-07-01T05:15:04.973",
    "keywords": "remote,command"
  },
  "CVE-2024-6424": {
    "cvss": 9.3,
    "description": "External server-side request vulnerability in MESbook 20221021.03 version, which could allow a remote, unauthenticated attacker to exploit the endpoint \"/api/Proxy/Post?userName=&password=&uri=<FILE|INTERNAL URL|IP/HOST\" or \"/api/Proxy/Get?userName=&password=&uri=<ARCHIVO|URL INTERNA|IP/HOST\" to read the source code of web files, read internal files or access network resources.",
    "published": "2024-07-01T13:15:06.690",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-6425": {
    "cvss": 9.1,
    "description": "Incorrect Provision of Specified Functionality vulnerability in MESbook 20221021.03 version. An unauthenticated remote attacker can register user accounts without being authenticated from the route \"/account/Register/\" and in the parameters \"UserName=<RANDOMUSER>&Password=<PASSWORD>&ConfirmPassword=<PASSWORD-REPEAT>\".",
    "published": "2024-07-01T13:15:06.927",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-38953": {
    "url": "https://github.com/qinggan/phpok/issues/17",
    "cvss": "-",
    "description": "phpok 6.4.003 contains a Cross Site Scripting (XSS) vulnerability in the ok_f() method under the framework/api/upload_control.php file.",
    "published": "2024-07-01T14:15:05.600"
  },
  "CVE-2024-21482": {
    "cvss": 6.8,
    "description": "Memory corruption during the secure boot process, when the `bootm` command is used, it bypasses the authentication of the kernel/rootfs image.",
    "published": "2024-07-01T15:15:15.497",
    "keywords": "authentication,command,bypass"
  },
  "CVE-2024-36401": {
    "cvss": 9.8,
    "description": "GeoServer is an open source server that allows users to share and edit geospatial data. Prior to versions 2.23.6, 2.24.4, and 2.25.2, multiple OGC request parameters allow Remote Code Execution (RCE) by unauthenticated users through specially crafted input against a default GeoServer installation due to unsafely evaluating property names as XPath expressions.\n\nThe GeoTools library API that GeoServer calls evaluates property/attribute names for feature types in a way that unsafely passes them to the commons-jxpath library which can execute arbitrary code when evaluating XPath expressions. This XPath evaluation is intended to be used only by complex feature types (i.e., Application Schema data stores) but is incorrectly being applied to simple feature types as well which makes this vulnerability apply to **ALL** GeoServer instances. No public PoC is provided but this vulnerability has been confirmed to be exploitable through WFS GetFeature, WFS GetPropertyValue, WMS GetMap, WMS GetFeatureInfo, WMS GetLegendGraphic and WPS Execute requests. This vulnerability can lead to executing arbitrary code.\n\nVersions 2.23.6, 2.24.4, and 2.25.2 contain a patch for the issue. A workaround exists by removing the `gt-complex-x.y.jar` file from the GeoServer where `x.y` is the GeoTools version (e.g., `gt-complex-31.1.jar` if running GeoServer 2.25.1). This will remove the vulnerable code from GeoServer but may break some GeoServer functionality or prevent GeoServer from deploying if the gt-complex module is needed.",
    "published": "2024-07-01T16:15:04.120",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-36422": {
    "cvss": 6.1,
    "description": "Flowise is a drag & drop user interface to build a customized large language model flow. In version 1.4.3 of Flowise, a reflected cross-site scripting vulnerability occurs in the `api/v1/chatflows/id` endpoint. If the default configuration is used (unauthenticated), an attacker may be able to craft a specially crafted URL that injects Javascript into the user sessions, allowing the attacker to steal information, create false popups, or even redirect the user to other websites without interaction. If the chatflow ID is not found, its value is reflected in the 404 page, which has type text/html. This allows an attacker to attach arbitrary scripts to the page, allowing an attacker to steal sensitive information. This XSS may be chained with the path injection to allow an attacker without direct access to Flowise to read arbitrary files from the Flowise server. As of time of publication, no known patches are available.",
    "published": "2024-07-01T16:15:04.860",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-36985": {
    "cvss": 8.8,
    "description": "In Splunk Enterprise versions below 9.2.2, 9.1.5, and 9.0.10, a low-privileged user that does not hold the admin or power Splunk roles could cause a Remote Code Execution through an external lookup that references the “splunk_archiver“ application.",
    "published": "2024-07-01T17:15:06.703",
    "keywords": "remote,execution"
  },
  "CVE-2024-36986": {
    "cvss": 6.3,
    "description": "In Splunk Enterprise versions below 9.2.2, 9.1.5, and 9.0.10 and Splunk Cloud Platform versions below 9.1.2312.200 and 9.1.2308.207, an authenticated user could run risky commands using the permissions of a higher-privileged user to bypass SPL safeguards for risky commands in the Analytics Workspace. The vulnerability requires the authenticated user to phish the victim by tricking them into initiating a request within their browser. The authenticated user should not be able to exploit the vulnerability at will.",
    "published": "2024-07-01T17:15:06.910",
    "keywords": "command,bypass"
  }
}