{
  "CVE-2024-8271": {
    "cvss": 7.3,
    "description": "The The FOX – Currency Switcher Professional for WooCommerce plugin for WordPress is vulnerable to arbitrary shortcode execution in all versions up to, and including, 1.4.2.1. This is due to the software allowing users to execute an action that does not properly validate a value before running do_shortcode in the 'woocs_get_custom_price_html' function. This makes it possible for unauthenticated attackers to execute arbitrary shortcodes.",
    "published": "2024-09-14T03:15:08.730",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-8775": {
    "cvss": 5.5,
    "description": "A flaw was found in Ansible, where sensitive information stored in Ansible Vault files can be exposed in plaintext during the execution of a playbook. This occurs when using tasks such as include_vars to load vaulted variables without setting the no_log: true parameter, resulting in sensitive data being printed in the playbook output or logs. This can lead to the unintentional disclosure of secrets like passwords or API keys, compromising security and potentially allowing unauthorized access or actions.",
    "published": "2024-09-14T03:15:08.987",
    "keywords": "execution,sensitive"
  },
  "CVE-2024-8479": {
    "cvss": 7.3,
    "description": "The The Simple Spoiler plugin for WordPress is vulnerable to arbitrary shortcode execution in versions 1.2 to 1.3. This is due to the plugin adding the filter add_filter('comment_text', 'do_shortcode'); which will run all shortcodes in comments. This makes it possible for unauthenticated attackers to execute arbitrary shortcodes.",
    "published": "2024-09-14T04:15:04.733",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-8869": {
    "cvss": 5.0,
    "description": "A vulnerability classified as critical has been found in TOTOLINK A720R 4.1.5. Affected is the function exportOvpn. The manipulation leads to os command injection. It is possible to launch the attack remotely. The complexity of an attack is rather high. The exploitability is told to be difficult. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-09-15T11:15:13.323",
    "keywords": "remote,command,vpn"
  },
  "CVE-2024-8777": {
    "cvss": 7.5,
    "description": "OMFLOW from The SYSCOM Group has an information leakage vulnerability, allowing unauthorized remote attackers to read arbitrary system configurations. If LDAP authentication is enabled, attackers can obtain plaintext credentials.",
    "published": "2024-09-16T06:15:11.483",
    "keywords": "remote,authentication,leak"
  },
  "CVE-2024-39613": {
    "cvss": 5.3,
    "description": "Mattermost Desktop App versions <=5.8.0 fail to specify an absolute path when searching the cmd.exe file,  which allows a local attacker who is able to put an cmd.exe file in the Downloads folder of a user's machine to cause remote code execution on that machine.",
    "published": "2024-09-16T07:15:02.373",
    "keywords": "remote,execution"
  },
  "CVE-2024-45694": {
    "cvss": 9.8,
    "description": "The web service of certain models of D-Link wireless routers contains a Stack-based Buffer Overflow vulnerability, which allows unauthenticated remote attackers to exploit this vulnerability to execute arbitrary code on the device.",
    "published": "2024-09-16T07:15:02.610",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-45695": {
    "cvss": 9.8,
    "description": "The web service of certain models of D-Link wireless routers contains a Stack-based Buffer Overflow vulnerability, which allows unauthenticated remote attackers to exploit this vulnerability to execute arbitrary code on the device.",
    "published": "2024-09-16T07:15:02.840",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-45697": {
    "cvss": 9.8,
    "description": "Certain models of D-Link wireless routers have a hidden functionality where the telnet service is enabled when the WAN port is plugged in. Unauthorized remote attackers can log in and execute OS commands using hard-coded credentials.",
    "published": "2024-09-16T07:15:03.233",
    "keywords": "remote,command"
  },
  "CVE-2024-45698": {
    "cvss": 8.8,
    "description": "Certain models of D-Link wireless routers do not properly validate user input in the telnet service, allowing unauthenticated remote attackers to use hard-coded credentials to log into telnet and inject arbitrary OS commands, which can then be executed on the device.",
    "published": "2024-09-16T07:15:03.450",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-46937": {
    "cvss": "-",
    "description": "An improper access control (IDOR) vulnerability in the /api-selfportal/get-info-token-properties endpoint in MFASOFT Secure Authentication Server (SAS) 1.8.x through 1.9.x before 1.9.040924 allows remote attackers gain access to user tokens without authentication. The is a brute-force attack on the serial parameter by number identifier: GA00001, GA00002, GA00003, etc.",
    "published": "2024-09-16T13:15:10.917",
    "keywords": "remote,authentication"
  }
}