{
  "CVE-2024-20127": {
    "cvss": 7.5,
    "description": "In Telephony, there is a possible out of bounds read due to a missing bounds check. This could lead to remote denial of service with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: ALPS09289881; Issue ID: MSV-2023.",
    "published": "2024-12-02T04:15:04.777",
    "keywords": "remote,execution"
  },
  "CVE-2024-20128": {
    "cvss": 7.5,
    "description": "In Telephony, there is a possible out of bounds read due to a missing bounds check. This could lead to remote denial of service with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: ALPS09289881; Issue ID: MSV-2024.",
    "published": "2024-12-02T04:15:04.967",
    "keywords": "remote,execution"
  },
  "CVE-2024-20129": {
    "cvss": "-",
    "description": "In Telephony, there is a possible out of bounds read due to a missing bounds check. This could lead to remote denial of service with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: ALPS09289881; Issue ID: MSV-2025.",
    "published": "2024-12-02T04:15:05.073",
    "keywords": "remote,execution"
  },
  "CVE-2024-20137": {
    "cvss": 7.5,
    "description": "In wlan driver, there is a possible client disconnection due to improper handling of exceptional conditions. This could lead to remote denial of service with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: WCNCR00384543; Issue ID: MSV-1727.",
    "published": "2024-12-02T04:15:06.030",
    "keywords": "remote,execution"
  },
  "CVE-2024-20138": {
    "cvss": 7.5,
    "description": "In wlan driver, there is a possible out of bound read due to improper input validation. This could lead to remote information disclosure with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: ALPS08998291; Issue ID: MSV-1604.",
    "published": "2024-12-02T04:15:06.133",
    "keywords": "remote,execution"
  },
  "CVE-2024-10490": {
    "cvss": "-",
    "description": "An “Authentication Bypass Using an Alternate Path or Channel” vulnerability in the OPC UA Server configuration required for B&R mapp Cockpit before 6.0, B&R mapp View before 6.0, B&R mapp Services before 6.0, B&R mapp Motion before 6.0 and B&R mapp Vision before 6.0 may be used by an unauthenticated network-based attacker to cause information disclosure, unintended change of data, or denial of service conditions.\nB&R mapp Services is only affected, when mpUserX or mpCodeBox are used in the Automation Studio project.",
    "published": "2024-12-02T09:15:04.613",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-46909": {
    "cvss": 9.8,
    "description": "In WhatsUp Gold versions released before 2024.0.1, a remote unauthenticated attacker could leverage this vulnerability to execute code in the context of the service account.",
    "published": "2024-12-02T15:15:12.120",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-8785": {
    "cvss": 9.8,
    "description": "In WhatsUp Gold versions released before 2024.0.1, a remote unauthenticated attacker could leverage NmAPI.exe to create or change an existing registry value in registry path HKEY_LOCAL_MACHINE\\SOFTWARE\\WOW6432Node\\Ipswitch\\.",
    "published": "2024-12-02T15:15:12.380",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-53617": {
    "url": "https://github.com/librephotos/librephotos/pull/1476",
    "cvss": 4.8,
    "description": "A Cross Site Scripting vulnerability in LibrePhotos before commit 32237 allows attackers to takeover any account via uploading an HTML file on behalf of the admin user using IDOR in file upload.",
    "published": "2024-12-02T19:15:10.940"
  },
  "CVE-2024-49581": {
    "cvss": 6.5,
    "description": "Restricted Views backed objects (OSV1) could be bypassed under specific circumstances due to a software bug, this could have allowed users that didn't have permission to see such objects to view them via Object Explorer directly. This software bug did not impact or otherwise make data available across organizational boundaries nor did it allow for data to be viewed or accessed by unauthenticated users.  \nThe affected service have been patched and automatically deployed to all Apollo-managed Foundry instances.",
    "published": "2024-12-02T21:15:10.830",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2024-53477": {
    "cvss": "-",
    "description": "JFinal CMS 5.1.0 is vulnerable to Command Execution via unauthorized execution of deserialization in the file ApiForm.java",
    "published": "2024-12-02T21:15:11.217",
    "keywords": "execution,command"
  },
  "CVE-2024-53375": {
    "cvss": 8.0,
    "description": "Authenticated remote code execution (RCE) vulnerabilities affect TP-Link Archer, Deco, and Tapo series routers. A vulnerability exists in the \"tmp_get_sites\" function of the HomeShield functionality provided by TP-Link. This vulnerability is still exploitable without the installation or activation of the HomeShield functionality.",
    "published": "2024-12-02T22:15:10.507",
    "keywords": "remote,execution"
  },
  "CVE-2024-53938": {
    "cvss": 8.8,
    "description": "An issue was discovered in Victure RX1800 WiFi 6 Router (software EN_V1.0.0_r12_110933, hardware 1.0) devices. The TELNET service is enabled by default and exposed over the LAN. The root account is accessible without a password, allowing attackers to achieve full control over the router remotely without any authentication.",
    "published": "2024-12-02T22:15:10.633",
    "keywords": "remote,authentication"
  },
  "CVE-2024-53940": {
    "cvss": 8.8,
    "description": "An issue was discovered in Victure RX1800 WiFi 6 Router (software EN_V1.0.0_r12_110933, hardware 1.0) devices. Certain /cgi-bin/luci/admin endpoints are vulnerable to command injection. Attackers can exploit this by sending crafted payloads through parameters intended for the ping utility, enabling arbitrary command execution with root-level permissions on the device.",
    "published": "2024-12-02T22:15:10.880",
    "keywords": "execution,command"
  },
  "CVE-2024-9200": {
    "cvss": 7.2,
    "description": "A post-authentication command injection vulnerability in the \"host\" parameter of the diagnostic function in Zyxel VMG4005-B50A firmware versions through V5.15(ABQA.2.2)C0 could allow an authenticated attacker with administrator privileges to execute operating system (OS) commands on a vulnerable device.",
    "published": "2024-12-03T02:15:17.913",
    "keywords": "authentication,command"
  },
  "CVE-2024-45068": {
    "cvss": 7.1,
    "description": "Authentication credentials leakage vulnerability in Hitachi Ops Center Common Services within Hitachi Ops Center OVA.\n\n\nThis issue affects Hitachi Ops Center Common Services: from 10.9.3-00 before 11.0.3-00; Hitachi Ops Center OVA: from 10.9.3-00 before 11.0.2-01.",
    "published": "2024-12-03T03:15:04.953",
    "keywords": "authentication,leak"
  },
  "CVE-2024-49414": {
    "cvss": 2.4,
    "description": "Authentication Bypass Using an Alternate Path in Dex Mode prior to SMR Dec-2024 Release 1 allows physical attackers to temporarily access to recent app list.",
    "published": "2024-12-03T06:15:09.430",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-47476": {
    "cvss": 7.8,
    "description": "Dell NetWorker Management Console, version(s) 19.11, contain(s) an Improper Verification of Cryptographic Signature vulnerability. An unauthenticated attacker with local access could potentially exploit this vulnerability, leading to Code execution.",
    "published": "2024-12-03T10:15:05.883",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-42422": {
    "cvss": 8.3,
    "description": "Dell NetWorker, version(s) 19.10, contain(s) an Authorization Bypass Through User-Controlled Key vulnerability. An unauthenticated attacker with remote access could potentially exploit this vulnerability, leading to Information disclosure.",
    "published": "2024-12-03T13:15:04.987",
    "keywords": "remote,unauthenticated,bypass"
  },
  "CVE-2024-11391": {
    "cvss": 7.5,
    "description": "The Advanced File Manager plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation via the 'class_fma_connector.php' file in all versions up to, and including, 5.2.10. This makes it possible for authenticated attackers, with Subscriber-level access and above, and granted permissions by an Administrator, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-12-03T15:15:09.973",
    "keywords": "remote,execution"
  },
  "CVE-2024-53999": {
    "url": "https://github.com/mobsf/mobile-security-framework-mobsf/commit/27d165872847f5ae7417caf09f37edeeba741e1e",
    "cvss": 8.1,
    "description": "Mobile Security Framework (MobSF) is a pen-testing, malware analysis and security assessment framework capable of performing static and dynamic analysis. The application allows users to upload files with scripts in the filename parameter. As a result, a malicious user can upload a script file to the system. When users in the application use the \"Diff or Compare\" functionality, they are affected by a Stored Cross-Site Scripting vulnerability. This vulnerability is fixed in 4.2.9.",
    "published": "2024-12-03T16:15:24.250"
  },
  "CVE-2024-37302": {
    "cvss": 7.5,
    "description": "Synapse is an open-source Matrix homeserver. Synapse versions before 1.106 are vulnerable to a disk fill attack, where an unauthenticated adversary can induce Synapse to download and cache large amounts of remote media. The default rate limit strategy is insufficient to mitigate this. This can lead to a denial of service, ranging from further media uploads/downloads failing to completely unavailability of the Synapse process, depending on how Synapse was deployed. Synapse 1.106 introduces a new \"leaky bucket\" rate limit on remote media downloads to reduce the amount of data a user can request at a time. This does not fully address the issue, but does limit an unauthenticated user's ability to request large amounts of data to be cached.",
    "published": "2024-12-03T17:15:10.733",
    "keywords": "remote,unauthenticated,leak"
  },
  "CVE-2024-37303": {
    "cvss": 5.3,
    "description": "Synapse is an open-source Matrix homeserver. Synapse before version 1.106 allows, by design, unauthenticated remote participants to trigger a download and caching of remote media from a remote homeserver to the local media repository. Such content then also becomes available for download from the local homeserver in an unauthenticated way. The implication is that unauthenticated remote adversaries can use this functionality to plant problematic content into the media repository. Synapse 1.106 introduces a partial mitigation in the form of new endpoints which require authentication for media downloads. The unauthenticated endpoints will be frozen in a future release, closing the attack vector.",
    "published": "2024-12-03T17:15:10.890",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2024-52805": {
    "url": "https://github.com/twisted/twisted/issues/4688#issuecomment-2385711609",
    "cvss": "-",
    "description": "Synapse is an open-source Matrix homeserver. In Synapse before 1.120.1, multipart/form-data requests can in certain configurations transiently increase memory consumption beyond expected levels while processing the request, which can be used to amplify denial of service attacks. Synapse 1.120.1 resolves the issue by denying requests with unsupported multipart/form-data content type.",
    "published": "2024-12-03T17:15:12.120"
  },
  "CVE-2024-53867": {
    "url": "https://github.com/matrix-org/matrix-spec-proposals/pull/4186",
    "cvss": 4.3,
    "description": "Synapse is an open-source Matrix homeserver. The Sliding Sync feature on Synapse versions between 1.113.0rc1 and 1.120.0 can leak partial room state changes to users no longer in a room. Non-state events, like messages, are unaffected. This vulnerability is fixed in 1.120.1.",
    "published": "2024-12-03T17:15:12.787"
  },
  "CVE-2024-52548": {
    "cvss": 6.7,
    "description": "An attacker who can execute arbitrary Operating Systems commands, can bypass code signing enforcements in the kernel, and execute arbitrary native code. This vulnerability has been resolved in firmware version 2.800.0000000.8.R.20241111.",
    "published": "2024-12-03T18:15:16.023",
    "keywords": "command,bypass"
  },
  "CVE-2024-51771": {
    "cvss": 7.2,
    "description": "A vulnerability in the HPE Aruba Networking ClearPass Policy Manager web-based management interface could allow an authenticated remote threat actor to conduct a remote code execution attack. Successful exploitation could enable the attacker to run arbitrary commands on the underlying operating system.",
    "published": "2024-12-03T20:15:15.477",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-51772": {
    "cvss": 6.4,
    "description": "An authenticated RCE vulnerability in the ClearPass Policy Manager web-based management interface allows remote authenticated users to run arbitrary commands on the underlying host. Successful exploitation could allow an attacker to execute arbitrary commands on the underlying operating system.",
    "published": "2024-12-03T21:15:07.140",
    "keywords": "remote,command"
  },
  "CVE-2024-53672": {
    "cvss": 4.7,
    "description": "A vulnerability in the ClearPass Policy Manager web-based management interface allows remote authenticated users to run arbitrary commands on the underlying host. Successful exploit could allow an attacker to execute arbitrary commands as a lower privileged user on the underlying operating system.",
    "published": "2024-12-03T21:15:07.990",
    "keywords": "remote,command"
  },
  "CVE-2024-40717": {
    "cvss": 8.8,
    "description": "A vulnerability in Veeam Backup & Replication allows a low-privileged user with certain roles to perform remote code execution (RCE) by updating existing jobs. These jobs can be configured to run pre- and post-scripts, which can be located on a network share and are executed with elevated privileges by default. The user can update a job and schedule it to run almost immediately, allowing arbitrary code execution on the server.",
    "published": "2024-12-04T02:15:04.410",
    "keywords": "remote,execution"
  },
  "CVE-2024-42451": {
    "cvss": 7.7,
    "description": "A vulnerability in Veeam Backup & Replication allows low-privileged users to leak all saved credentials in plaintext. This is achieved by calling a series of methods over an external protocol, ultimately retrieving the credentials using a malicious setup on the attacker's side. This exposes sensitive data, which could be used for further attacks, including unauthorized access to systems managed by the platform.",
    "published": "2024-12-04T02:15:04.643",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-42452": {
    "cvss": 8.8,
    "description": "A vulnerability in Veeam Backup & Replication allows a low-privileged user to start an agent remotely in server mode and obtain credentials, effectively escalating privileges to system-level access. This allows the attacker to upload files to the server with elevated privileges. The vulnerability exists because remote calls bypass permission checks, leading to full system compromise.",
    "published": "2024-12-04T02:15:04.747",
    "keywords": "remote,bypass"
  },
  "CVE-2024-42457": {
    "cvss": 7.7,
    "description": "A vulnerability in Veeam Backup & Replication allows users with certain operator roles to expose saved credentials by leveraging a combination of methods in a remote management interface. This can be achieved using a session object that allows for credential enumeration and exploitation, leading to the leak of plaintext credentials to a malicious host. The attack is facilitated by improper usage of a method that allows operators to add a new host with an attacker-controlled IP, enabling them to retrieve sensitive credentials in plaintext.",
    "published": "2024-12-04T02:15:05.133",
    "keywords": "remote,sensitive,leak"
  },
  "CVE-2024-45204": {
    "cvss": 7.7,
    "description": "A vulnerability exists where a low-privileged user can exploit insufficient permissions in credential handling to leak NTLM hashes of saved credentials. The exploitation involves using retrieved credentials to expose sensitive NTLM hashes, impacting systems beyond the initial target and potentially leading to broader security vulnerabilities.",
    "published": "2024-12-04T02:15:05.233",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-10952": {
    "cvss": 7.3,
    "description": "The The Authors List plugin for WordPress is vulnerable to arbitrary shortcode execution via update_authors_list_ajax AJAX action in all versions up to, and including, 2.0.4. This is due to the software allowing users to execute an action that does not properly validate a value before running do_shortcode. This makes it possible for unauthenticated attackers to execute arbitrary shortcodes.",
    "published": "2024-12-04T03:15:04.593",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-54664": {
    "cvss": 7.8,
    "description": "An issue was discovered in Veritas NetBackup before 10.5. This only applies to NetBackup components running on a Windows Operating System. If a user executes specific NetBackup commands or an attacker uses social engineering techniques to impel the user to execute the commands, a malicious DLL could be loaded, resulting in execution of the attacker's code in the user's security context, a different vulnerability than CVE-2024-52945.",
    "published": "2024-12-04T06:15:08.357",
    "keywords": "execution,command"
  },
  "CVE-2024-11293": {
    "cvss": 8.1,
    "description": "The  Registration Forms – User Registration Forms, Invitation-Based Registrations, Front-end User Profile, Login Form & Content Restriction Social Sites Login plugin for WordPress is vulnerable to authentication bypass in all versions up to, and including, 1.7.9. This is due to insufficient verification on the user being returned by the social login token. This makes it possible for unauthenticated attackers to log in as any existing user on the site, such as an administrator, if they have access to the email and the user does not have an already-existing account for the service returning the token.",
    "published": "2024-12-04T08:15:06.343",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-11952": {
    "cvss": 7.5,
    "description": "The Classic Addons – WPBakery Page Builder plugin for WordPress is vulnerable to Limited Local PHP File Inclusion in all versions up to, and including, 3.0 via the 'style' parameter. This makes it possible for authenticated attackers, with Contributor-level access and above, and permissions granted by an Administrator, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included. The vulnerability is limited to PHP files in a Windows environment.",
    "published": "2024-12-04T09:15:04.637",
    "keywords": "execution,sensitive,bypass"
  }
}