{
  "CVE-2025-66382": {
    "url": "https://github.com/libexpat/libexpat/issues/1076",
    "cvss": 2.9,
    "description": "In libexpat through 2.7.3, a crafted file with an approximate size of 2 MiB can lead to dozens of seconds of processing time.",
    "published": "2025-11-28T07:15:57.900"
  },
  "CVE-2025-13768": {
    "cvss": 7.5,
    "description": "WebITR developed by Uniong has an Authentication Bypass vulnerability, allowing authenticated remote attackers to log into the system as any user by modifying a specific parameter. Attackers must first obtain a user ID to exploit this vulnerability.",
    "published": "2025-11-28T08:15:52.560",
    "keywords": "remote,authentication,bypass"
  },
  "CVE-2025-13769": {
    "cvss": 6.5,
    "description": "WebITR developed by Uniong has a SQL Injection vulnerability, allowing authenticated remote attackers to inject arbitrary SQL commands to read database contents.",
    "published": "2025-11-28T08:15:53.713",
    "keywords": "remote,command"
  },
  "CVE-2025-13770": {
    "cvss": 6.5,
    "description": "WebITR developed by Uniong has a SQL Injection vulnerability, allowing authenticated remote attackers to inject arbitrary SQL commands to read database contents.",
    "published": "2025-11-28T08:15:53.930",
    "keywords": "remote,command"
  },
  "CVE-2025-12638": {
    "cvss": 8.0,
    "description": "Keras version 3.11.3 is affected by a path traversal vulnerability in the keras.utils.get_file() function when extracting tar archives. The vulnerability arises because the function uses Python's tarfile.extractall() method without the security-critical filter='data' parameter. Although Keras attempts to filter unsafe paths using filter_safe_paths(), this filtering occurs before extraction, and a PATH_MAX symlink resolution bug triggers during extraction. This bug causes symlink resolution to fail due to path length limits, resulting in a security bypass that allows files to be written outside the intended extraction directory. This can lead to arbitrary file writes outside the cache directory, enabling potential system compromise or malicious code execution. The vulnerability affects Keras installations that process tar archives with get_file() and does not affect versions where this extraction method is secured with the appropriate filter parameter.",
    "published": "2025-11-28T15:16:00.270",
    "keywords": "execution,bypass"
  },
  "CVE-2025-65113": {
    "cvss": 6.5,
    "description": "ClipBucket v5 is an open source video sharing platform. Prior to version 5.5.2 - #164, an authorization bypass vulnerability in the AJAX flagging system allows any unauthenticated user to flag any content (users, videos, photos, collections) on the platform. This can lead to mass flagging attacks, content disruption, and moderation system abuse. This issue has been patched in version 5.5.2 - #164.",
    "published": "2025-11-29T01:16:02.640",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2025-66034": {
    "cvss": 6.3,
    "description": "fontTools is a library for manipulating fonts, written in Python. In versions from 4.33.0 to before 4.60.2, the fonttools varLib (or python3 -m fontTools.varLib) script has an arbitrary file write vulnerability that leads to remote code execution when a malicious .designspace file is processed. The vulnerability affects the main() code path of fontTools.varLib, used by the fonttools varLib CLI and any code that invokes fontTools.varLib.main(). This issue has been patched in version 4.60.2.",
    "published": "2025-11-29T01:16:02.967",
    "keywords": "remote,execution"
  },
  "CVE-2025-66219": {
    "cvss": "-",
    "description": "willitmerge is a command line tool to check if pull requests are mergeable. In versions 0.2.1 and prior, there is a command Injection vulnerability in willitmerge. The vulnerability manifests in this package due to the use of insecure child process execution API (exec) to which it concatenates user input, whether provided to the command-line flag, or is in user control in the target repository. At time of publication, no known fix is public.",
    "published": "2025-11-29T02:15:52.577",
    "keywords": "execution,command"
  },
  "CVE-2025-66217": {
    "cvss": "-",
    "description": "AIS-catcher is a multi-platform AIS receiver. Prior to version 0.64, an integer underflow vulnerability exists in the MQTT parsing logic of AIS-catcher. This vulnerability allows an attacker to trigger a massive Heap Buffer Overflow by sending a malformed MQTT packet with a manipulated Topic Length field. This leads to an immediate Denial of Service (DoS) and, when used as a library, severe Memory Corruption that can be leveraged for Remote Code Execution (RCE). This issue has been patched in version 0.64.",
    "published": "2025-11-29T03:15:59.880",
    "keywords": "remote,execution"
  },
  "CVE-2025-65540": {
    "url": "https://github.com/exrick/xmall/issues/101",
    "cvss": "-",
    "description": "Multiple Cross-Site Scripting (XSS) vulnerabilities exist in xmall v1.1 due to improper handling of user-supplied data. User input fields such as username and description are directly rendered into HTML without proper sanitization or encoding, allowing attackers to inject and execute malicious scripts.",
    "published": "2025-11-29T04:15:56.417"
  },
  "CVE-2025-65892": {
    "cvss": "-",
    "description": "Reflected Cross-Site Scripting (rXSS) in krpano before version 1.23.2 allows a remote unauthenticated attacker to execute arbitrary JavaScript in the victim's browser via a crafted URL to the passQueryParameters function with the xml parameter enabled.",
    "published": "2025-11-29T04:15:57.367",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-66224": {
    "cvss": "-",
    "description": "OrangeHRM is a comprehensive human resource management (HRM) system. From version 5.0 to 5.7, the application contains an input-neutralization flaw in its mail configuration and delivery workflow that allows user-controlled values to flow directly into the system’s sendmail command. Because these values are not sanitized or constrained before being incorporated into the command execution path, certain sendmail behaviors can be unintentionally invoked during email processing. This makes it possible for the application to write files on the server as part of the mail-handling routine, and in deployments where those files end up in web-accessible locations, the behavior can be leveraged to achieve execution of attacker-controlled content. The issue stems entirely from constructing OS-level command strings using unsanitized input within the mail-sending logic. This issue has been patched in version 5.8.",
    "published": "2025-11-29T04:15:57.497",
    "keywords": "execution,command"
  },
  "CVE-2025-13615": {
    "cvss": 9.8,
    "description": "The StreamTube Core plugin for WordPress is vulnerable to Arbitrary User Password Change in versions up to, and including, 4.78. This is due to the plugin providing user-controlled access to objects, letting a user bypass authorization and access system resources. This makes it possible for unauthenticated attackers to change user passwords and potentially take over administrator accounts. Note: This can only be exploited if the 'registration password fields' enabled in theme options.",
    "published": "2025-11-30T02:15:58.233",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2025-66422": {
    "cvss": 4.3,
    "description": "Tryton trytond before 7.6.11 allows remote attackers to obtain sensitive trace-back (server setup) information. This is fixed in 7.6.11, 7.4.21, 7.0.40, and 6.0.70.",
    "published": "2025-11-30T03:15:47.970",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-13797": {
    "cvss": 6.3,
    "description": "A vulnerability was detected in ADSLR B-QE2W401 250814-r037c. Affected by this issue is the function parameterdel_swifimac of the file /send_order.cgi. Performing manipulation of the argument del_swifimac results in command injection. The attack is possible to be carried out remotely. The exploit is now public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2025-12-01T01:16:00.147",
    "keywords": "remote,command"
  },
  "CVE-2025-13798": {
    "cvss": 6.3,
    "description": "A flaw has been found in ADSLR NBR1005GPEV2 250814-r037c. This affects the function ap_macfilter_add of the file /send_order.cgi. Executing manipulation of the argument mac can lead to command injection. The attack may be performed from remote. The exploit has been published and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2025-12-01T01:16:00.383",
    "keywords": "remote,command"
  },
  "CVE-2025-13799": {
    "cvss": 6.3,
    "description": "A vulnerability has been found in ADSLR NBR1005GPEV2 250814-r037c. This vulnerability affects the function ap_macfilter_del of the file /send_order.cgi. The manipulation of the argument mac leads to command injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2025-12-01T01:16:00.620",
    "keywords": "remote,command"
  },
  "CVE-2025-13800": {
    "cvss": 6.3,
    "description": "A vulnerability was found in ADSLR NBR1005GPEV2 250814-r037c. This issue affects the function set_mesh_disconnect of the file /send_order.cgi. The manipulation of the argument mac results in command injection. It is possible to launch the attack remotely. The exploit has been made public and could be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2025-12-01T02:15:45.677",
    "keywords": "remote,command"
  }
}