{
  "CVE-2024-6741": {
    "cvss": 5.8,
    "description": "Openfind's Mail2000 has a vulnerability that allows the HttpOnly flag to be bypassed. Unauthenticated remote attackers can exploit this vulnerability using specific JavaScript code to obtain the session cookie with the HttpOnly flag enabled.",
    "published": "2024-07-15T09:15:03.117",
    "keywords": "remote,unauthenticated,bypass"
  },
  "CVE-2024-6746": {
    "url": "https://github.com/naibowang/easyspider/issues/466",
    "cvss": 4.3,
    "description": "A vulnerability classified as problematic was found in NaiboWang EasySpider 0.6.2 on Windows. Affected by this vulnerability is an unknown functionality of the file \\EasySpider\\resources\\app\\server.js of the component HTTP GET Request Handler. The manipulation with the input /../../../../../../../../../Windows/win.ini leads to path traversal: '../filedir'. The attack needs to be done within the local network. The exploit has been disclosed to the public and may be used. The identifier VDB-271477 was assigned to this vulnerability. NOTE: The code maintainer explains, that this is not a big issue \"because the default is that the software runs locally without going through the Internet\".",
    "published": "2024-07-15T12:15:02.707"
  },
  "CVE-2024-36455": {
    "cvss": "-",
    "description": "An improper input validation allows an unauthenticated attacker to achieve remote command execution on the affected PAM system by sending a specially crafted HTTP request.",
    "published": "2024-07-15T14:15:02.700",
    "keywords": "remote,execution,unauthenticated,command"
  },
  "CVE-2024-36456": {
    "cvss": "-",
    "description": "This vulnerability allows an unauthenticated attacker to achieve remote command execution on the affected PAM system by uploading a specially crafted PAM upgrade file.",
    "published": "2024-07-15T14:15:02.827",
    "keywords": "remote,execution,unauthenticated,command"
  },
  "CVE-2024-36457": {
    "cvss": "-",
    "description": "The vulnerability allows an attacker to bypass the authentication requirements for a specific PAM endpoint.",
    "published": "2024-07-15T14:15:02.917",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-38492": {
    "cvss": "-",
    "description": "This vulnerability allows an unauthenticated attacker to achieve remote command execution on the affected PAM system by uploading a specially crafted PAM upgrade file.",
    "published": "2024-07-15T14:15:03.240",
    "keywords": "remote,execution,unauthenticated,command"
  },
  "CVE-2024-38494": {
    "cvss": "-",
    "description": "This vulnerability allows a high-privileged authenticated PAM user to achieve remote command execution on the affected PAM system by sending a specially crafted HTTP request.",
    "published": "2024-07-15T14:15:03.420",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-37016": {
    "cvss": "-",
    "description": "Mengshen Wireless Door Alarm M70 2024-05-24 allows Authentication Bypass via a Capture-Replay approach.",
    "published": "2024-07-15T18:15:04.337",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-40624": {
    "url": "https://github.com/torrentpier/torrentpier/commit/ed37e6e522f345f2b46147c6f53c1ab6dec1db9e",
    "cvss": 9.8,
    "description": "TorrentPier is an open source BitTorrent Public/Private tracker engine, written in php. In `torrentpier/library/includes/functions.php`, `get_tracks()` uses the unsafe native PHP serialization format to deserialize user-controlled cookies. One can use phpggc and the chain Guzzle/FW1 to write PHP code to an arbitrary file, and execute commands on the system. For instance, the cookie bb_t will be deserialized when browsing to viewforum.php. This issue has been addressed in commit `ed37e6e52` which is expected to be included in release version 2.4.4. Users are advised to upgrade as soon as the new release is available. There are no known workarounds for this vulnerability.",
    "published": "2024-07-15T20:15:04.810"
  },
  "CVE-2024-40627": {
    "cvss": 5.8,
    "description": "Fastapi OPA is an opensource fastapi middleware which includes auth flow. HTTP `OPTIONS` requests are always allowed by `OpaMiddleware`, even when they lack authentication, and are passed through directly to the application. `OpaMiddleware` allows all HTTP `OPTIONS` requests without evaluating it against any policy. If an application provides different responses to HTTP `OPTIONS` requests based on an entity existing (such as to indicate whether an entity is writable on a system level), an unauthenticated attacker could discover which entities exist within an application. This issue has been addressed in release version 2.0.1. All users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-07-15T20:15:05.033",
    "keywords": "unauthenticated,authentication"
  },
  "CVE-2024-39887": {
    "cvss": 4.3,
    "description": "An SQL Injection vulnerability in Apache Superset exists due to improper neutralization of special elements used in SQL commands. Specifically, certain engine-specific functions are not checked, which allows attackers to bypass Apache Superset's SQL authorization. To mitigate this, a new configuration key named DISALLOWED_SQL_FUNCTIONS has been introduced. This key disallows the use of the following PostgreSQL functions: version, query_to_xml, inet_server_addr, and inet_client_addr. Additional functions can be added to this list for increased protection.\n\nThis issue affects Apache Superset: before 4.0.2.\n\nUsers are recommended to upgrade to version 4.0.2, which fixes the issue.\n\n",
    "published": "2024-07-16T10:15:03.380",
    "keywords": "command,bypass"
  },
  "CVE-2024-6457": {
    "cvss": 9.8,
    "description": "The HUSKY – Products Filter Professional for WooCommerce plugin for WordPress is vulnerable to time-based SQL Injection via the ‘woof_author’ parameter in all versions up to, and including, 1.3.6 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-07-16T11:15:10.097",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-22442": {
    "cvss": 9.8,
    "description": "The vulnerability could be remotely exploited to bypass authentication.",
    "published": "2024-07-16T16:15:04.017",
    "keywords": "remote,authentication,bypass"
  },
  "CVE-2024-40626": {
    "cvss": 7.3,
    "description": "Outline is an open source, collaborative document editor. A type confusion issue was found in ProseMirror’s rendering process that leads to a Stored Cross-Site Scripting (XSS) vulnerability in Outline. An authenticated user can create a document containing a malicious JavaScript payload. When other users view this document, the malicious Javascript can execute in the origin of Outline. Outline includes CSP rules to prevent third-party code execution, however in the case of self-hosting and having your file storage on the same domain as Outline a malicious payload can be uploaded as a file attachment and bypass those CSP restrictions. This issue has been addressed in release version 0.77.3. Users are advised to upgrade. There are no known workarounds for this vulnerability.\n",
    "published": "2024-07-16T17:15:11.580",
    "keywords": "execution,bypass"
  },
  "CVE-2024-39036": {
    "url": "https://github.com/seacms-net/cms/issues/18",
    "cvss": "-",
    "description": "SeaCMS v12.9 is vulnerable to Arbitrary File Read via admin_safe.php.",
    "published": "2024-07-16T19:15:12.460"
  },
  "CVE-2024-6492": {
    "cvss": "-",
    "description": "Exposure of Sensitive Information in edge browser session proxy feature in Devolutions Remote Desktop Manager 2024.2.14.0 and earlier on Windows allows an attacker to intercept proxy credentials via a specially crafted website.",
    "published": "2024-07-16T19:15:13.567",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-5500": {
    "cvss": "-",
    "description": "Inappropriate implementation in Sign-In in Google Chrome prior to 1.3.36.351 allowed a remote attacker to bypass navigation restrictions via a crafted HTML page. (Chromium security severity: Medium)",
    "published": "2024-07-16T23:15:24.487",
    "keywords": "remote,bypass"
  },
  "CVE-2024-6535": {
    "cvss": 5.9,
    "description": "A flaw was found in Skupper. When Skupper is initialized with the console-enabled and with console-auth set to Openshift, it configures the openshift oauth-proxy with a static cookie-secret. In certain circumstances, this may allow an attacker to bypass authentication to the Skupper console via a specially-crafted cookie.",
    "published": "2024-07-17T03:15:01.890",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-6467": {
    "cvss": 8.8,
    "description": "The BookingPress – Appointment Booking Calendar Plugin and Online Scheduling Plugin plugin for WordPress is vulnerable to Arbitrary File Read to Arbitrary File Creation in all versions up to, and including, 1.1.5 via the 'bookingpress_save_lite_wizard_settings_func' function. This makes it possible for authenticated attackers, with Subscriber-level access and above, to create arbitrary files that contain the content of files on the server, allowing the execution of any PHP code in those files or the exposure of sensitive information.",
    "published": "2024-07-17T07:15:03.493",
    "keywords": "execution,sensitive"
  },
  "CVE-2024-6220": {
    "cvss": 9.8,
    "description": "The 简数采集器 (Keydatas) plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the keydatas_downloadImages function in all versions up to, and including, 2.5.2. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-07-17T08:15:02.730",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-29737": {
    "cvss": "-",
    "description": "In streampark, the project module integrates Maven's compilation capabilities. The input parameter validation is not strict, allowing attackers to insert commands for remote command execution, The prerequisite for a successful attack is that the user needs to log in to the streampark system and have system-level permissions. Generally, only users of that system have the authorization to log in, and users would not manually input a dangerous operation command. Therefore, the risk level of this vulnerability is very low.\n\nMitigation:\n\nall users should upgrade to 2.1.4\n\nBackground info:\n\nLog in to Streampark using the default username (e.g. test1, test2, test3) and the default password (streampark). Navigate to the Project module, then add a new project. Enter the git repository address of the project and input `touch /tmp/success_2.1.2` as the \"Build Argument\". Note that there is no verification and interception of the special character \"`\". As a result, you will find that this injection command will be successfully executed after executing the build.\n\nIn the latest version, the special symbol ` is intercepted.\n\n",
    "published": "2024-07-17T09:15:02.527",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-31070": {
    "cvss": "-",
    "description": "Initialization of a resource with an insecure default vulnerability in FutureNet NXR series, VXR series and WXR series provided by Century Systems Co., Ltd. allows a remote unauthenticated attacker to access telnet service unlimitedly.",
    "published": "2024-07-17T09:15:02.813",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-36491": {
    "cvss": "-",
    "description": "FutureNet NXR series, VXR series and WXR series provided by Century Systems Co., Ltd. allow a remote unauthenticated attacker to execute an arbitrary OS command, obtain and/or alter sensitive information, and be able to cause a denial of service (DoS) condition.",
    "published": "2024-07-17T09:15:03.090",
    "keywords": "remote,unauthenticated,command,sensitive"
  },
  "CVE-2024-40617": {
    "cvss": "-",
    "description": "Path traversal vulnerability exists in FUJITSU Network Edgiot GW1500 (M2M-GW for FENICS). If a remote authenticated attacker with User Class privilege sends a specially crafted request to the affected product, access restricted files containing sensitive information may be accessed. As a result, Administrator Class privileges of the product may be hijacked.",
    "published": "2024-07-17T09:15:03.163",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-31411": {
    "cvss": "-",
    "description": "Unrestricted Upload of File with dangerous type vulnerability in Apache StreamPipes.\nSuch a dangerous type might be an executable file that may lead to a remote code execution (RCE).\nThe unrestricted upload is only possible for authenticated and authorized users.\nThis issue affects Apache StreamPipes: through 0.93.0.\n\nUsers are recommended to upgrade to version 0.95.0, which fixes the issue.\n\n",
    "published": "2024-07-17T10:15:01.810",
    "keywords": "remote,execution"
  },
  "CVE-2024-23465": {
    "cvss": 8.3,
    "description": "The SolarWinds Access Rights Manager was found to be susceptible to an authentication bypass vulnerability. This vulnerability allows an unauthenticated user to gain domain admin access within the Active Directory environment.     ",
    "published": "2024-07-17T15:15:10.977",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-23466": {
    "cvss": 9.6,
    "description": "SolarWinds Access Rights Manager (ARM) is susceptible to a Directory Traversal Remote Code Execution vulnerability. If exploited, this vulnerability allows an unauthenticated user to perform the actions with SYSTEM privileges.  ",
    "published": "2024-07-17T15:15:11.270",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-23467": {
    "cvss": 9.6,
    "description": "The SolarWinds Access Rights Manager was susceptible to a Directory Traversal and Information Disclosure Vulnerability. This vulnerability allows an unauthenticated user to perform remote code execution.",
    "published": "2024-07-17T15:15:11.500",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-23468": {
    "cvss": 7.6,
    "description": "The SolarWinds Access Rights Manager was susceptible to a Directory Traversal and Information Disclosure Vulnerability. This vulnerability allows an unauthenticated user to perform arbitrary file deletion and leak sensitive information.",
    "published": "2024-07-17T15:15:11.730",
    "keywords": "unauthenticated,sensitive,leak"
  },
  "CVE-2024-23469": {
    "cvss": 9.6,
    "description": "SolarWinds Access Rights Manager (ARM) is susceptible to a Remote Code Execution vulnerability. If exploited, this vulnerability allows an unauthenticated user to perform the actions with SYSTEM privileges. ",
    "published": "2024-07-17T15:15:11.947",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-23470": {
    "cvss": 9.6,
    "description": "The SolarWinds Access Rights Manager was found to be susceptible to a pre-authentication remote code execution vulnerability. If exploited, this vulnerability allows an unauthenticated user to run commands and executables. ",
    "published": "2024-07-17T15:15:12.167",
    "keywords": "remote,execution,unauthenticated,authentication,command"
  },
  "CVE-2024-23471": {
    "cvss": 9.6,
    "description": "The SolarWinds Access Rights Manager was found to be susceptible to a Remote Code Execution Vulnerability. If exploited, this vulnerability allows an authenticated user to abuse a SolarWinds service resulting in remote code execution. ",
    "published": "2024-07-17T15:15:12.403",
    "keywords": "remote,execution"
  },
  "CVE-2024-23475": {
    "cvss": 9.6,
    "description": "The SolarWinds Access Rights Manager was susceptible to a Directory Traversal and Information Disclosure Vulnerability. This vulnerability allows an unauthenticated user to perform arbitrary file deletion and leak sensitive information.",
    "published": "2024-07-17T15:15:13.057",
    "keywords": "unauthenticated,sensitive,leak"
  },
  "CVE-2024-28992": {
    "cvss": 7.6,
    "description": "The SolarWinds Access Rights Manager was susceptible to a Directory Traversal and Information Disclosure Vulnerability. This vulnerability allows an unauthenticated user to perform arbitrary file deletion and leak sensitive information.",
    "published": "2024-07-17T15:15:13.623",
    "keywords": "unauthenticated,sensitive,leak"
  },
  "CVE-2024-28993": {
    "cvss": 7.6,
    "description": "The SolarWinds Access Rights Manager was susceptible to a Directory Traversal and Information Disclosure Vulnerability. This vulnerability allows an unauthenticated user to perform arbitrary file deletion and leak sensitive information.",
    "published": "2024-07-17T15:15:13.860",
    "keywords": "unauthenticated,sensitive,leak"
  },
  "CVE-2024-20296": {
    "cvss": 4.7,
    "description": "A vulnerability in the web-based management interface of Cisco Identity Services Engine (ISE) could allow an authenticated, remote attacker to upload arbitrary files to an affected device. To exploit this vulnerability, an attacker would need at least valid Policy Admin credentials on the affected device.\r\n\r This vulnerability is due to improper validation of files that are uploaded to the web-based management interface. An attacker could exploit this vulnerability by uploading arbitrary files to an affected device. A successful exploit could allow the attacker to store malicious files on the system, execute arbitrary commands on the operating system, and elevate privileges to root.",
    "published": "2024-07-17T17:15:12.367",
    "keywords": "remote,command"
  },
  "CVE-2024-20323": {
    "cvss": 7.5,
    "description": "A vulnerability in Cisco Intelligent Node (iNode) Software could allow an unauthenticated, remote attacker to hijack the TLS connection between Cisco iNode Manager and associated intelligent nodes and send arbitrary traffic to an affected device.\r\n\r This vulnerability is due to the presence of hard-coded cryptographic material. An attacker in a man-in-the-middle position between Cisco iNode Manager and associated deployed nodes could exploit this vulnerability by using the static cryptographic key to generate a trusted certificate and impersonate an affected device. A successful exploit could allow the attacker to read data that is meant for a legitimate device, modify the startup configuration of an associated node, and, consequently, cause a denial of service (DoS) condition for downstream devices that are connected to the affected node.",
    "published": "2024-07-17T17:15:12.607",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20395": {
    "cvss": 6.4,
    "description": "A vulnerability in the media retrieval functionality of Cisco Webex App could allow an unauthenticated, adjacent attacker to gain access to sensitive session information.\r\n\r This vulnerability is due to insecure transmission of requests to backend services when the app accesses embedded media, such as images. An attacker could exploit this vulnerability by sending a message with embedded media that is stored on a messaging server to a targeted user. If the attacker can observe transmitted traffic in a privileged network position, a successful exploit could allow the attacker to capture session token information from insecurely transmitted requests and possibly reuse the captured session information to take further actions as the targeted user.",
    "published": "2024-07-17T17:15:12.833",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-20396": {
    "cvss": 5.3,
    "description": "A vulnerability in the protocol handlers of Cisco Webex App could allow an unauthenticated, remote attacker to gain access to sensitive information.\r\n\r This vulnerability exists because the affected application does not safely handle file protocol handlers. An attacker could exploit this vulnerability by persuading a user to follow a link that is designed to cause the application to send requests. If the attacker can observe transmitted traffic in a privileged network position, a successful exploit could allow the attacker to capture sensitive information, including credential information, from the requests.",
    "published": "2024-07-17T17:15:13.070",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-20400": {
    "cvss": 4.7,
    "description": "A vulnerability in the web-based management interface of Cisco Expressway Series could allow an unauthenticated, remote attacker to redirect a user to a malicious web page.\r\n\r This vulnerability is due to improper input validation of HTTP request parameters. An attacker could exploit this vulnerability by intercepting and modifying an HTTP request from a user. A successful exploit could allow the attacker to redirect the user to a malicious web page.\r\n\r Note: Cisco Expressway Series refers to Cisco Expressway Control (Expressway-C) devices and Cisco Expressway Edge (Expressway-E) devices.",
    "published": "2024-07-17T17:15:13.300",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20401": {
    "cvss": 9.8,
    "description": "A vulnerability in the content scanning and message filtering features of Cisco Secure Email Gateway could allow an unauthenticated, remote attacker to overwrite arbitrary files on the underlying operating system.\r\n\r This vulnerability is due to improper handling of email attachments when file analysis and content filters are enabled. An attacker could exploit this vulnerability by sending an email that contains a crafted attachment through an affected device. A successful exploit could allow the attacker to replace any file on the underlying file system. The attacker could then perform any of the following actions: add users with root privileges, modify the device configuration, execute arbitrary code, or cause a permanent denial of service (DoS) condition on the affected device.\r\n\r Note: Manual intervention is required to recover from the DoS condition. Customers are advised to contact the Cisco Technical Assistance Center (TAC) to help recover a device in this condition.",
    "published": "2024-07-17T17:15:13.540",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20416": {
    "cvss": 6.5,
    "description": "A vulnerability in the upload module of Cisco RV340 and RV345 Dual WAN Gigabit VPN Routers could allow an authenticated, remote attacker to execute arbitrary code on an affected device.\r\n\r This vulnerability is due to insufficient boundary checks when processing specific HTTP requests. An attacker could exploit this vulnerability by sending crafted HTTP requests to an affected device. A successful exploit could allow the attacker to execute arbitrary code as the root user on the underlying operating system of the device.",
    "published": "2024-07-17T17:15:13.877",
    "keywords": "remote,vpn"
  },
  "CVE-2024-20419": {
    "cvss": 10.0,
    "description": "A vulnerability in the authentication system of Cisco Smart Software Manager On-Prem (SSM On-Prem) could allow an unauthenticated, remote attacker to change the password of any user, including administrative users.\r\n\r This vulnerability is due to improper implementation of the password-change process. An attacker could exploit this vulnerability by sending crafted HTTP requests to an affected device. A successful exploit could allow an attacker to access the web UI or API with the privileges of the compromised user.",
    "published": "2024-07-17T17:15:14.143",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2024-20429": {
    "cvss": 6.5,
    "description": "A vulnerability in the web-based management interface of Cisco AsyncOS for Secure Email Gateway could allow an authenticated, remote attacker to execute arbitrary system commands on an affected device.\r\n\r This vulnerability is due to insufficient input validation in certain portions of the web-based management interface. An attacker could exploit this vulnerability by sending a crafted HTTP request to the affected device. A successful exploit could allow the attacker to execute arbitrary commands on the underlying operating system with root privileges. To successfully exploit this vulnerability, an attacker would need at least valid Operator credentials.",
    "published": "2024-07-17T17:15:14.497",
    "keywords": "remote,command"
  },
  "CVE-2024-41184": {
    "url": "https://github.com/acassen/keepalived/issues/2447#issuecomment-2231329734",
    "cvss": "-",
    "description": "In the vrrp_ipsets_handler handler (fglobal_parser.c) of keepalived through 2.3.1, an integer overflow can occur. NOTE: this CVE Record might not be worthwhile because an empty ipset name must be configured by the user.",
    "published": "2024-07-18T01:15:15.253"
  },
  "CVE-2024-6164": {
    "cvss": "-",
    "description": "The Filter & Grids WordPress plugin before 2.8.33 is vulnerable to Local File Inclusion via the post_layout parameter. This makes it possible for an unauthenticated attacker to include and execute PHP files on the server, allowing the execution of any PHP code in those files.",
    "published": "2024-07-18T06:15:02.233",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-40764": {
    "cvss": "-",
    "description": "Heap-based buffer overflow vulnerability in the SonicOS IPSec VPN allows an unauthenticated remote attacker to cause Denial of Service (DoS).",
    "published": "2024-07-18T08:15:02.340",
    "keywords": "remote,unauthenticated,vpn"
  }
}