{
  "CVE-2024-37889": {
    "url": "https://github.com/treyww/myfinances/commit/2c1e6d5b7ec8b2d6f660b260e3c5f4d3eaaa613f",
    "cvss": 6.5,
    "description": "MyFinances is a web application for managing finances. MyFinances has a way to access other customer invoices while signed in as a user. This method allows an actor to access PII and financial information from another account. The vulnerability is fixed in 0.4.6.",
    "published": "2024-06-14T20:15:11.873"
  },
  "CVE-2024-3813": {
    "cvss": 8.8,
    "description": "The tagDiv Composer plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 4.8 via the 'td_block_title' shortcode 'block_template_id' attribute. This makes it possible for authenticated attackers, with contributor-level and above permissions, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where php file type can be uploaded and included.",
    "published": "2024-06-15T02:15:50.817",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-5868": {
    "cvss": 6.5,
    "description": "The WooCommerce - Social Login plugin for WordPress is vulnerable to Email Verification in all versions up to, and including, 2.6.2 via the use of insufficiently random activation code. This makes it possible for unauthenticated attackers to bypass the email verification.",
    "published": "2024-06-15T04:15:13.373",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2024-5871": {
    "cvss": 9.8,
    "description": "The WooCommerce - Social Login plugin for WordPress is vulnerable to PHP Object Injection in all versions up to, and including, 2.6.2 via deserialization of untrusted input from the 'woo_slg_verify' vulnerable parameter. This makes it possible for unauthenticated attackers to inject a PHP Object. No known POP chain is present in the vulnerable software. If a POP chain is present via an additional plugin or theme installed on the target system, it could allow the attacker to delete arbitrary files, retrieve sensitive data, or execute code.",
    "published": "2024-06-15T04:15:13.693",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-6000": {
    "cvss": 7.1,
    "description": "The FooEvents for WooCommerce plugin for WordPress is vulnerable to unauthorized arbitrary file uploads due to an improper capability setting on the 'display_ticket_themes_page' function in versions up to, and including, 1.19.20. This makes it possible for authenticated attackers with contributor-level capabilities or above, to upload arbitrary files on the affected site's server which may make remote code execution possible. This was partially patched in 1.19.20, and fully patched in 1.19.21.",
    "published": "2024-06-15T04:15:14.313",
    "keywords": "remote,execution"
  },
  "CVE-2024-3105": {
    "cvss": 9.9,
    "description": "The Woody code snippets – Insert Header Footer Code, AdSense Ads plugin for WordPress is vulnerable to Remote Code Execution in all versions up to, and including, 2.5.0 via the 'insert_php' shortcode. This is due to the plugin not restricting the usage of the functionality to high level authorized users. This makes it possible for authenticated attackers, with contributor-level access and above, to execute code on the server.",
    "published": "2024-06-15T09:15:11.947",
    "keywords": "remote,execution"
  },
  "CVE-2024-4258": {
    "cvss": 9.8,
    "description": "The Video Gallery – YouTube Playlist, Channel Gallery by YotuWP plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 1.3.13 via the settings parameter. This makes it possible for unauthenticated attackers to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-06-15T09:15:12.370",
    "keywords": "execution,unauthenticated,sensitive,bypass"
  },
  "CVE-2024-4551": {
    "cvss": 6.4,
    "description": "The Video Gallery – YouTube Playlist, Channel Gallery by YotuWP plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 1.3.13 via the display function. This makes it possible for authenticated attackers, with contributor access and higher, to include and execute arbitrary php files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-06-15T09:15:12.587",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-38395": {
    "cvss": "-",
    "description": "In iTerm2 before 3.5.2, the \"Terminal may report window title\" setting is not honored, and thus remote code execution might occur but \"is not trivially exploitable.\"",
    "published": "2024-06-16T01:15:48.537",
    "keywords": "remote,execution"
  },
  "CVE-2024-38427": {
    "url": "https://github.com/internationalcolorconsortium/demoiccmax/pull/66",
    "cvss": "-",
    "description": "In International Color Consortium DemoIccMAX before 85ce74e, a logic flaw in CIccTagXmlProfileSequenceId::ParseXml in IccXML/IccLibXML/IccTagXml.cpp results in unconditionally returning false.",
    "published": "2024-06-16T02:15:08.557"
  },
  "CVE-2024-38439": {
    "url": "https://github.com/netatalk/netatalk/issues/1096",
    "cvss": "-",
    "description": "Netatalk 3.2.0 has an off-by-one error and resultant heap-based buffer overflow because of setting ibuf[PASSWDLEN] to '\\0' in FPLoginExt in login in etc/uams/uams_pam.c.",
    "published": "2024-06-16T13:15:53.030"
  },
  "CVE-2024-38440": {
    "url": "https://github.com/netatalk/netatalk/issues/1097",
    "cvss": "-",
    "description": "Netatalk 3.2.0 has an off-by-one error and resultant heap-based buffer overflow because of incorrectly using FPLoginExt in BN_bin2bn in etc/uams/uams_dhx_pam.c.",
    "published": "2024-06-16T13:15:53.147"
  },
  "CVE-2024-38441": {
    "url": "https://github.com/netatalk/netatalk/issues/1098",
    "cvss": "-",
    "description": "Netatalk 3.2.0 has an off-by-one error and resultant heap-based buffer overflow because of setting ibuf[len] to '\\0' in FPMapName in afp_mapname in etc/afp/directory.c.",
    "published": "2024-06-16T13:15:53.230"
  },
  "CVE-2024-38443": {
    "url": "https://github.com/thealgorithms/c/issues/1394",
    "cvss": "-",
    "description": "C/sorting/binary_insertion_sort.c in The Algorithms - C through e5dad3f has a segmentation fault for deep recursion, which may affect common use cases such as sorting an array of 50 elements.",
    "published": "2024-06-16T13:15:53.483"
  },
  "CVE-2024-38461": {
    "url": "https://github.com/irods/irods/issues/7652",
    "cvss": "-",
    "description": "irodsServerMonPerf in iRODS before 4.3.2 attempts to proceed with use of a path even if it is not a directory.",
    "published": "2024-06-16T16:15:09.537"
  },
  "CVE-2024-38462": {
    "url": "https://github.com/irods/irods/issues/7651",
    "cvss": "-",
    "description": "iRODS before 4.3.2 provides an msiSendMail function with a problematic dependency on the mail binary, such as in the mailMS.cpp#L94-L106 reference.",
    "published": "2024-06-16T16:15:09.627"
  },
  "CVE-2024-34451": {
    "cvss": "-",
    "description": "Ghost through 5.85.1 allows remote attackers to bypass an authentication rate-limit protection mechanism by using many X-Forwarded-For headers with different values. NOTE: the vendor's position is that Ghost should be installed with a reverse proxy that allows only trusted X-Forwarded-For headers.",
    "published": "2024-06-16T22:15:09.130",
    "keywords": "remote,authentication,bypass"
  },
  "CVE-2024-6046": {
    "cvss": 9.8,
    "description": "SECOM WRTR-304GN-304TW-UPSC V02(unsupported-when-assigned) does not properly filter user input in the specific functionality. Unauthenticated remote attackers can exploit this vulnerability to inject and execute arbitrary system commands on the device.",
    "published": "2024-06-17T04:15:09.867",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-6047": {
    "cvss": 9.8,
    "description": "Certain EOL GeoVision devices fail to properly filter user input for the specific functionality. Unauthenticated remote attackers can exploit this vulnerability to inject and execute arbitrary system commands on the device.",
    "published": "2024-06-17T06:15:09.237",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-6048": {
    "cvss": 9.8,
    "description": "Openfind's MailGates and MailAudit fail to properly filter user input when analyzing email attachments. An unauthenticated remote attacker can exploit this vulnerability to inject system commands and execute them on the remote server.",
    "published": "2024-06-17T08:15:49.150",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-6055": {
    "cvss": "-",
    "description": "Improper removal of sensitive information in data source export feature in Devolutions Remote Desktop Manager 2024.1.32.0 and earlier on Windows allows an attacker that obtains the exported settings to recover powershell credentials configured on the data source via stealing the configuration file.",
    "published": "2024-06-17T13:15:53.697",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-6057": {
    "cvss": "-",
    "description": "Improper authentication in the vault password feature in Devolutions Remote Desktop Manager 2024.1.31.0 and earlier allows an attacker that has compromised an access to an RDM instance to bypass the vault master password via the offline mode feature.",
    "published": "2024-06-17T13:15:53.800",
    "keywords": "remote,authentication,bypass"
  },
  "CVE-2024-37622": {
    "url": "https://github.com/rainrocka/xinhu/issues/4",
    "cvss": "-",
    "description": "Xinhu RockOA v2.6.3 was discovered to contain a reflected cross-site scripting (XSS) vulnerability via the num parameter at /flow/flow.php.",
    "published": "2024-06-17T14:15:11.480"
  },
  "CVE-2024-37623": {
    "url": "https://github.com/rainrocka/xinhu/issues/5",
    "cvss": "-",
    "description": "Xinhu RockOA v2.6.3 was discovered to contain a reflected cross-site scripting (XSS) vulnerability via the /kaoqin/tpl_kaoqin_locationchange.html component.",
    "published": "2024-06-17T14:15:11.580"
  },
  "CVE-2024-37624": {
    "url": "https://github.com/rainrocka/xinhu/issues/6",
    "cvss": "-",
    "description": "Xinhu RockOA v2.6.3 was discovered to contain a reflected cross-site scripting (XSS) vulnerability via the /chajian/inputChajian.php. component.",
    "published": "2024-06-17T14:15:11.680"
  },
  "CVE-2024-37625": {
    "url": "https://github.com/zhimengzhe/ibarn/issues/20",
    "cvss": "-",
    "description": "zhimengzhe iBarn v1.5 was discovered to contain a reflected cross-site scripting (XSS) vulnerability via the $search parameter at /index.php.",
    "published": "2024-06-17T14:15:11.790"
  },
  "CVE-2024-38469": {
    "url": "https://github.com/zhimengzhe/ibarn/issues/20",
    "cvss": "-",
    "description": "zhimengzhe iBarn v1.5 was discovered to contain a reflected cross-site scripting (XSS) vulnerability via the $search parameter at /pay.php.",
    "published": "2024-06-17T14:15:12.070"
  },
  "CVE-2024-38470": {
    "url": "https://github.com/zhimengzhe/ibarn/issues/20",
    "cvss": "-",
    "description": "zhimengzhe iBarn v1.5 was discovered to contain a reflected cross-site scripting (XSS) vulnerability via the $search parameter at /own.php.",
    "published": "2024-06-17T14:15:12.183"
  },
  "CVE-2024-37794": {
    "url": "https://github.com/cvc5/cvc5/issues/10813",
    "cvss": "-",
    "description": "Improper input validation in CVC5 Solver v1.1.3 allows attackers to cause a Denial of Service (DoS) via a crafted SMT2 input file.",
    "published": "2024-06-17T18:15:17.853"
  },
  "CVE-2024-37795": {
    "url": "https://github.com/cvc5/cvc5/issues/10813",
    "cvss": "-",
    "description": "A segmentation fault in CVC5 Solver v1.1.3 allows attackers to cause a Denial of Service (DoS) via a crafted SMT-LIB input file containing the `set-logic` command with specific formatting errors.",
    "published": "2024-06-17T18:15:17.953"
  },
  "CVE-2024-6058": {
    "cvss": 3.5,
    "description": "A vulnerability classified as problematic has been found in LabVantage LIMS 2017. This affects an unknown part of the file /labvantage/rc?command=page&page=SampleHistoricalList&_iframename=list&__crc=crc_1701669816260. The manipulation of the argument height/width leads to cross site scripting. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-268785 was assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-06-17T18:15:18.520",
    "keywords": "remote,command"
  },
  "CVE-2024-38449": {
    "url": "https://github.com/kasmtech/kasmvnc/issues/254",
    "cvss": "-",
    "description": "A Directory Traversal vulnerability in KasmVNC 1.3.1.230e50f7b89663316c70de7b0e3db6f6b9340489 and possibly earlier versions allows remote authenticated attackers to browse parent directories and read the content of files outside the scope of the application.",
    "published": "2024-06-17T19:15:58.567"
  }
}