{
  "CVE-2024-7646": {
    "cvss": 8.8,
    "description": "A security issue was discovered in ingress-nginx where an actor with permission to create Ingress objects (in the `networking.k8s.io` or `extensions` API group) can bypass annotation validation to inject arbitrary commands and obtain the credentials of the ingress-nginx controller. In the default configuration, that credential has access to all secrets in the cluster.",
    "published": "2024-08-16T18:15:10.970",
    "keywords": "command,bypass"
  },
  "CVE-2024-6459": {
    "cvss": "-",
    "description": "The News Element Elementor Blog Magazine WordPress plugin before 1.0.6 is vulnerable to Local File Inclusion via the template parameter. This makes it possible for unauthenticated attacker to include and execute PHP files on the server, allowing the execution of any PHP code in those files.",
    "published": "2024-08-17T06:15:03.973",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-7896": {
    "cvss": 6.3,
    "description": "A vulnerability was found in Tosei Online Store Management System ??????????? 4.02/4.03/4.04. It has been rated as critical. Affected by this issue is some unknown functionality of the file /cgi-bin/p1_ftpserver.php. The manipulation of the argument adr_txt leads to command injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-08-17T14:15:12.303",
    "keywords": "remote,command"
  },
  "CVE-2024-7897": {
    "cvss": 6.3,
    "description": "A vulnerability classified as critical has been found in Tosei Online Store Management System ??????????? 4.02/4.03/4.04. This affects an unknown part of the file /cgi-bin/tosei_kikai.php. The manipulation of the argument kikaibangou leads to command injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-08-17T15:15:11.597",
    "keywords": "remote,command"
  },
  "CVE-2024-7907": {
    "cvss": 6.3,
    "description": "A vulnerability, which was classified as critical, has been found in TOTOLINK X6000R 9.4.0cu.852_20230719. This issue affects the function setSyslogCfg of the file /cgi-bin/cstecgi.cgi. The manipulation of the argument rtLogServer leads to command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-08-18T16:15:04.193",
    "keywords": "remote,command"
  },
  "CVE-2024-44069": {
    "url": "https://github.com/pi-hole/web/pull/3077",
    "cvss": "-",
    "description": "Pi-hole before 6 allows unauthenticated admin/api.php?setTempUnit= calls to change the temperature units of the web dashboard. NOTE: the supplier reportedly does \"not consider the bug a security issue\" but the specific motivation for letting arbitrary persons change the value (Celsius, Fahrenheit, or Kelvin), seen by the device owner, is unclear.",
    "published": "2024-08-19T02:15:04.437"
  },
  "CVE-2024-44076": {
    "url": "https://github.com/microcks/microcks/issues/1212",
    "cvss": 9.8,
    "description": "In Microcks before 1.10.0, the POST /api/import and POST /api/export endpoints allow non-administrator access.",
    "published": "2024-08-19T03:15:03.883"
  },
  "CVE-2024-6330": {
    "cvss": 9.8,
    "description": "The GEO my WP WordPress plugin before 4.5.0.2 does not prevent unauthenticated attackers from including arbitrary files in PHP's execution context, which leads to Remote Code Execution.",
    "published": "2024-08-19T06:15:05.690",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-6451": {
    "cvss": "-",
    "description": "AI Engine < 2.4.3 is susceptible to remote-code-execution (RCE) via Log Poisoning. The AI Engine WordPress plugin before 2.5.1 fails to validate the file extension of \"logs_path\", allowing Administrators to change log filetypes from .log to .php.",
    "published": "2024-08-19T06:15:05.880",
    "keywords": "remote,execution"
  },
  "CVE-2024-43399": {
    "url": "https://github.com/mobsf/mobile-security-framework-mobsf/commit/cc625fe8430f3437a473e82aa2966d100a4dc883",
    "cvss": 8.0,
    "description": "Mobile Security Framework (MobSF) is a pen-testing, malware analysis and security assessment framework capable of performing static and dynamic analysis. Before 4.0.7, there is a flaw in the Static Libraries analysis section. Specifically, during the extraction of .a extension files, the measure intended to prevent Zip Slip attacks is improperly implemented. Since the implemented measure can be bypassed, the vulnerability allows an attacker to extract files to any desired location within the server running MobSF. This vulnerability is fixed in 4.0.7.",
    "published": "2024-08-19T15:15:09.073"
  },
  "CVE-2024-7922": {
    "cvss": 6.3,
    "description": "A vulnerability was found in D-Link DNS-120, DNR-202L, DNS-315L, DNS-320, DNS-320L, DNS-320LW, DNS-321, DNR-322L, DNS-323, DNS-325, DNS-326, DNS-327L, DNR-326, DNS-340L, DNS-343, DNS-345, DNS-726-4, DNS-1100-4, DNS-1200-05 and DNS-1550-04 up to 20240814 and classified as critical. Affected by this issue is the function cgi_audio_search/cgi_create_playlist/cgi_get_album_all_tracks/cgi_get_alltracks_editlist/cgi_get_artist_all_album/cgi_get_genre_all_tracks/cgi_get_tracks_list/cgi_set_airplay_content/cgi_write_playlist of the file /cgi-bin/myMusic.cgi. The manipulation leads to command injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. NOTE: This vulnerability only affects products that are no longer supported by the maintainer. NOTE: Vendor was contacted early and confirmed that the product is end-of-life. It should be retired and replaced.",
    "published": "2024-08-19T15:15:09.403",
    "keywords": "remote,command"
  }
}