{
  "CVE-2024-20357": {
    "cvss": 5.9,
    "description": "A vulnerability in the XML service of Cisco IP Phone firmware could allow an unauthenticated, remote attacker to initiate phone calls on an affected device.  \r\n\r This vulnerability exists because bounds-checking does not occur while parsing XML requests. An attacker could exploit this vulnerability by sending a crafted XML request to an affected device. A successful exploit could allow the attacker to initiate calls or play sounds on the device.",
    "published": "2024-05-01T17:15:28.143",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20376": {
    "cvss": 7.5,
    "description": "A vulnerability in the web-based management interface of Cisco IP Phone firmware could allow an unauthenticated, remote attacker to cause an affected device to reload, resulting in a DoS condition.  \r\n\r This vulnerability is due to insufficient validation of user-supplied input. An attacker could exploit this vulnerability by sending a crafted request to the web-based management interface of an affected device. A successful exploit could allow the attacker to cause the affected device to reload.",
    "published": "2024-05-01T17:15:28.407",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20378": {
    "cvss": 7.5,
    "description": "A vulnerability in the web-based management interface of Cisco IP Phone firmware could allow an unauthenticated, remote attacker to retrieve sensitive information from an affected device.  \r\n\r This vulnerability is due to a lack of authentication for specific endpoints of the web-based management interface on an affected device. An attacker could exploit this vulnerability by connecting to the affected device. A successful exploit could allow the attacker to gain unauthorized access to the device, enabling the recording of user credentials and traffic to and from the affected device, including VoIP calls that could be replayed.",
    "published": "2024-05-01T17:15:28.660",
    "keywords": "remote,unauthenticated,authentication,sensitive"
  },
  "CVE-2024-33078": {
    "cvss": "-",
    "description": "Tencent Libpag v4.3 is vulnerable to Buffer Overflow. A user can send a crafted image to trigger a overflow leading to remote code execution.",
    "published": "2024-05-01T18:15:24.283",
    "keywords": "remote,execution"
  },
  "CVE-2024-24312": {
    "cvss": "-",
    "description": "SQL injection vulnerability in Vaales Technologies V_QRS v.2024-01-17 allows a remote attacker to obtain sensitive information via the Models/UserModel.php component.",
    "published": "2024-05-01T19:15:22.087",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-24313": {
    "cvss": "-",
    "description": "An issue in Vaales Technologies V_QRS v.2024-01-17 allows a remote attacker to obtain sensitive information via the Models/FormModel.php and QRModel.php component.",
    "published": "2024-05-01T19:15:22.140",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-25458": {
    "cvss": "-",
    "description": "An issue in CYCZCAM, SHIX ZHAO, SHIXCAM A9 Camera (circuit board identifier A9-48B-V1.0) firmware v.CYCAM_48B_BC01_v87_0903 allows a remote attacker to obtain sensitive information via a crafted request to a UDP port.",
    "published": "2024-05-01T19:15:22.333",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-29011": {
    "cvss": 7.5,
    "description": "Use of hard-coded password in the GMS ECM endpoint leading to authentication bypass vulnerability.\n\nThis issue affects GMS: 9.3.4 and earlier versions.\n",
    "published": "2024-05-01T19:15:22.627",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-33292": {
    "cvss": "-",
    "description": "SQL Injection vulnerability in Realisation MGSD v.1.0 allows a remote attacker to obtain sensitive information via the id parameter.",
    "published": "2024-05-01T19:15:26.857",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-33428": {
    "url": "https://github.com/stsaz/phiola/issues/29",
    "cvss": "-",
    "description": "Buffer-Overflow vulnerability at conv.c:68 of stsaz phiola v2.0-rc22 allows a remote attacker to execute arbitrary code via the a crafted .wav file.",
    "published": "2024-05-01T19:15:27.120"
  },
  "CVE-2024-33429": {
    "url": "https://github.com/stsaz/phiola/issues/30",
    "cvss": "-",
    "description": "Buffer-Overflow vulnerability at pcm_convert.h:513 of phiola v2.0-rc22 allows a remote attacker to execute arbitrary code via a crafted .wav file.",
    "published": "2024-05-01T19:15:27.170"
  },
  "CVE-2024-33430": {
    "url": "https://github.com/stsaz/phiola/issues/28",
    "cvss": "-",
    "description": "An issue in phiola/src/afilter/pcm_convert.h:513 of phiola v2.0-rc22 allows a remote attacker to execute arbitrary code via the a crafted .wav file.",
    "published": "2024-05-01T19:15:27.223"
  },
  "CVE-2024-33431": {
    "url": "https://github.com/stsaz/phiola/issues/27",
    "cvss": "-",
    "description": "An issue in phiola/src/afilter/conv.c:115 of phiola v2.0-rc22 allows a remote attacker to cause a denial of service via a crafted .wav file.",
    "published": "2024-05-01T19:15:27.283"
  },
  "CVE-2024-3955": {
    "url": "https://github.com/pibrewing/craftbeerpi4/issues/132",
    "cvss": "-",
    "description": "URL GET parameter \"logtime\" utilized within the \"downloadlog\" function from \"cbpi/http_endpoints/http_system.py\" is subsequently passed to the \"os.system\" function in \"cbpi/controller/system_controller.py\" without prior validation allowing to execute arbitrary code.This issue affects CraftBeerPi 4: from 4.0.0.58 (commit 563fae9) before 4.4.1.a1 (commit 57572c7).\n\n",
    "published": "2024-05-02T10:15:08.630"
  },
  "CVE-2024-4405": {
    "cvss": 8.8,
    "description": "Xiaomi Pro 13 mimarket manual-upgrade Cross-Site Scripting Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Xiaomi Pro 13 smartphones. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the manual-upgrade.html file. When parsing the manualUpgradeInfo parameter, the process does not properly sanitize user-supplied data, which can lead to the injection of an arbitrary script. An attacker can leverage this vulnerability to execute code in the context of the current user. Was ZDI-CAN-22379.",
    "published": "2024-05-02T15:15:07.427",
    "keywords": "remote,execution"
  },
  "CVE-2024-4406": {
    "cvss": 8.8,
    "description": "Xiaomi Pro 13 GetApps integral-dialog-page Cross-Site Scripting Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Xiaomi Pro 13 smartphones. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the integral-dialog-page.html file. When parsing the integralInfo parameter, the process does not properly sanitize user-supplied data, which can lead to the injection of an arbitrary script. An attacker can leverage this vulnerability to execute code in the context of the current user. Was ZDI-CAN-22332.",
    "published": "2024-05-02T15:15:07.670",
    "keywords": "remote,execution"
  },
  "CVE-2024-31963": {
    "cvss": "-",
    "description": "A vulnerability on Mitel 6800 Series and 6900 Series SIP Phones through 6.3 SP3 HF4, 6900w Series SIP Phone through 6.3.3, and 6970 Conference Unit through 5.1.1 SP8 allows an authenticated attacker to conduct a buffer overflow attack due to insufficient bounds checking and input sanitization. A successful exploit could allow an attacker to gain access to sensitive information, modify system configuration or execute arbitrary commands within the context of the system.",
    "published": "2024-05-02T16:15:07.863",
    "keywords": "command,sensitive"
  },
  "CVE-2024-31964": {
    "cvss": "-",
    "description": "A vulnerability on Mitel 6800 Series and 6900 Series SIP Phones through 6.3 SP3 HF4, 6900w Series SIP Phone through 6.3.3, and 6970 Conference Unit through 5.1.1 SP8 allows an unauthenticated attacker to conduct an authentication bypass attack due to improper authentication control. A successful exploit could allow an attacker to modify system configuration settings and potentially cause a denial of service.",
    "published": "2024-05-02T16:15:07.913",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-31966": {
    "cvss": "-",
    "description": "A vulnerability on Mitel 6800 Series and 6900 Series SIP Phones through 6.3 SP3 HF4, 6900w Series SIP Phone through 6.3.3, and 6970 Conference Unit through 5.1.1 SP8 allows an authenticated attacker with administrative privilege to conduct an argument injection attack due to insufficient parameter sanitization. A successful exploit could allow an attacker to access sensitive information, modify system configuration or execute arbitrary commands.",
    "published": "2024-05-02T16:15:08.020",
    "keywords": "command,sensitive"
  },
  "CVE-2024-0615": {
    "cvss": 5.3,
    "description": "The Content Control – The Ultimate Content Restriction Plugin! Restrict Content, Create Conditional Blocks & More plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 2.1.0 via the API. This makes it possible for unauthenticated attackers to extract post titles, IDs, slugs, statuses and other information including post content. This includes published content only.",
    "published": "2024-05-02T17:15:09.360",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-1567": {
    "cvss": 8.2,
    "description": "The Royal Elementor Addons and Templates plugin for WordPress is vulnerable to limited file uploads due to missing file type validation in the 'file_validity' function in all versions up to, and including, 1.3.94. This makes it possible for unauthenticated attackers to upload dangerous file types such as .svgz on the affected site's server which may make cross-site scripting or remote code execution possible.",
    "published": "2024-05-02T17:15:11.603",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-1584": {
    "cvss": 5.3,
    "description": "The Analytify – Google Analytics Dashboard For WordPress (GA4 analytics made easy) plugin for WordPress is vulnerable to unauthorized modification of data due to a missing capability check on the 'wpa_check_authentication' function in all versions up to, and including, 5.2.1. This makes it possible for unauthenticated attackers to modify the site's Google Analytics tracking ID.",
    "published": "2024-05-02T17:15:11.960",
    "keywords": "unauthenticated,authentication"
  },
  "CVE-2024-1678": {
    "cvss": 5.3,
    "description": "The Subway – Private Site Option plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 2.1.4 via the REST API. This makes it possible for unauthenticated attackers to bypass the plugin's private site feature and view restricted page and post content.",
    "published": "2024-05-02T17:15:12.300",
    "keywords": "unauthenticated,sensitive,bypass"
  },
  "CVE-2024-1809": {
    "cvss": 5.4,
    "description": "The Analytify – Google Analytics Dashboard For WordPress (GA4 analytics made easy) plugin for WordPress is vulnerable to unauthorized access of data due to a missing capability check on AJAX functions in combination with nonce leakage in all versions up to, and including, 5.2.3. This makes it possible for authenticated attackers, with subscriber access and higher, to obtain certain sensitive information related to plugin settings.",
    "published": "2024-05-02T17:15:13.500",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-2109": {
    "cvss": 5.3,
    "description": "The Booster Extension plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 1.2.0 via the 'booster_extension_authorbox_shortcode_display' function. This makes it possible for unauthenticated attackers to extract sensitive data including user emails",
    "published": "2024-05-02T17:15:15.880",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-2876": {
    "cvss": 9.8,
    "description": "The Email Subscribers by Icegram Express – Email Marketing, Newsletters, Automation for WordPress & WooCommerce plugin for WordPress is vulnerable to SQL Injection via the 'run' function of the 'IG_ES_Subscribers_Query' class in all versions up to, and including, 5.7.14 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-05-02T17:15:20.463",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-3312": {
    "cvss": 5.3,
    "description": "The Easy Custom Auto Excerpt plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 2.4.12. This makes it possible for unauthenticated attackers to obtain excerpts of password-protected posts.",
    "published": "2024-05-02T17:15:24.690",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-3499": {
    "cvss": 8.8,
    "description": "The ElementsKit Elementor addons plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 3.1.0 via the generate_navigation_markup function of the Onepage Scroll module. This makes it possible for authenticated attackers, with contributor-level access and above, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-05-02T17:15:25.940",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-3500": {
    "cvss": 8.8,
    "description": "The ElementsKit Pro plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 3.6.0 via the Price Menu, Hotspot, and Advanced Toggle widgets. This makes it possible for authenticated attackers, with contributor-level access and above, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-05-02T17:15:26.100",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-3717": {
    "cvss": 5.3,
    "description": "The Drag and Drop Multiple File Upload – Contact Form 7 plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 1.3.7.7 via the '/wp-content/uploads/wp_dndcf7_uploads/wpcf7-files' directory. This makes it possible for unauthenticated attackers to extract sensitive data uploaded via this plugin through a form.",
    "published": "2024-05-02T17:15:29.987",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-3729": {
    "cvss": 9.8,
    "description": "The Frontend Admin by DynamiApps plugin for WordPress is vulnerable to improper missing encryption exception handling  on the 'fea_encrypt' function in all versions up to, and including, 3.19.4. This makes it possible for unauthenticated attackers to manipulate the user processing forms, which can be used to add and edit administrator user for privilege escalation, or to automatically log in users for authentication bypass, or manipulate the post processing form that can be used to inject arbitrary web scripts. This can only be exploited if the 'openssl' php extension is not loaded on the server.",
    "published": "2024-05-02T17:15:30.730",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-3734": {
    "cvss": 6.5,
    "description": "The FOX – Currency Switcher Professional for WooCommerce plugin is vulnerable to Unauthenticated Arbitrary Shortcode Execution in versions up to, and including, 1.4.1.8. This allows unauthenticated attackers to execute arbitrary shortcodes. The severity and exploitability depends on what other plugins are installed and what shortcode functionality they provide.",
    "published": "2024-05-02T17:15:30.900",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-3849": {
    "cvss": 8.8,
    "description": "The Click to Chat – HoliThemes plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 3.35. This makes it possible for authenticated attackers, with contributor access or above, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-05-02T17:15:31.563",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-3870": {
    "cvss": 5.3,
    "description": "The Contact Form 7 Database Addon – CFDB7 plugin for WordPress is vulnerable to Sensitive Information Exposure in versions up to, and including, 1.2.6.8 via the cfdb7_before_send_mail function. This can allow unauthenticated attackers to extract sensitive data, such as Personally Identifiable Information, from files uploaded by users.",
    "published": "2024-05-02T17:15:31.743",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-3957": {
    "cvss": 6.5,
    "description": "The Booster for WooCommerce plugin is vulnerable to Unauthenticated Arbitrary Shortcode Execution in versions up to, and including, 7.1.8. This allows unauthenticated attackers to execute arbitrary shortcodes. The severity and exploitability depends on what other plugins are installed and what shortcode functionality they provide.",
    "published": "2024-05-02T17:15:32.910",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-4033": {
    "cvss": 8.8,
    "description": "The All-in-One Video Gallery plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the aiovg_create_attachment_from_external_image_url function in all versions up to, and including, 3.6.4. This makes it possible for authenticated attackers, with contributor access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-05-02T17:15:33.740",
    "keywords": "remote,execution"
  },
  "CVE-2024-4215": {
    "cvss": 7.4,
    "description": "pgAdmin <= 8.5 is affected by a multi-factor authentication bypass vulnerability. This vulnerability allows an attacker with knowledge of a legitimate account’s username and password may authenticate to the application and perform sensitive actions within the application, such as managing files and executing SQL queries, regardless of the account’s MFA enrollment status.\n",
    "published": "2024-05-02T18:15:07.593",
    "keywords": "authentication,sensitive,bypass"
  },
  "CVE-2024-4216": {
    "url": "https://github.com/pgadmin-org/pgadmin4/issues/7282",
    "cvss": 7.4,
    "description": "pgAdmin <= 8.5 is affected by XSS vulnerability in /settings/store API response json payload. This vulnerability allows attackers to execute malicious script at the client end.\n",
    "published": "2024-05-02T18:15:07.757"
  },
  "CVE-2024-34391": {
    "cvss": 8.1,
    "description": "libxmljs is vulnerable to a type confusion vulnerability when parsing a specially crafted XML while invoking a function on the result of attrs() that was called on a parsed node. This vulnerability might lead to denial of service (on both 32-bit systems and 64-bit systems), data leak, infinite loop and remote code execution (on 32-bit systems with the XML_PARSE_HUGE flag enabled).\n\n",
    "published": "2024-05-02T19:15:06.177",
    "keywords": "remote,execution,leak"
  },
  "CVE-2024-34392": {
    "cvss": 8.1,
    "description": "libxmljs is vulnerable to a type confusion vulnerability when parsing a specially crafted XML while invoking the namespaces() function (which invokes _wrap__xmlNode_nsDef_get()) on a grand-child of a node that refers to an entity. This vulnerability can lead to denial of service and remote code execution.",
    "published": "2024-05-02T19:15:06.333",
    "keywords": "remote,execution"
  },
  "CVE-2024-30302": {
    "cvss": 5.5,
    "description": "Acrobat Reader versions 20.005.30539, 23.008.20470 and earlier are affected by a Use After Free vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-05-02T21:16:11.747",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-34402": {
    "url": "https://github.com/uriparser/uriparser/pull/185",
    "cvss": "-",
    "description": "An issue was discovered in uriparser through 0.9.7. ComposeQueryEngine in UriQuery.c has an integer overflow via long keys or values, with a resultant buffer overflow.",
    "published": "2024-05-03T01:15:48.633"
  },
  "CVE-2024-34403": {
    "url": "https://github.com/uriparser/uriparser/pull/186",
    "cvss": "-",
    "description": "An issue was discovered in uriparser through 0.9.7. ComposeQueryMallocExMm in UriQuery.c has an integer overflow via a long string.",
    "published": "2024-05-03T01:15:48.693"
  },
  "CVE-2024-34408": {
    "url": "https://github.com/tencent/libpag/pull/2243",
    "cvss": "-",
    "description": "Tencent libpag through 4.3.51 has an integer overflow in DecodeStream::checkEndOfFile() in codec/utils/DecodeStream.cpp via a crafted PAG (Portable Animated Graphics) file.",
    "published": "2024-05-03T06:15:13.883"
  },
  "CVE-2024-34063": {
    "url": "https://github.com/matrix-org/vodozemac/commit/297548cad4016ce448c4b5007c54db7ee39489d9",
    "cvss": 2.5,
    "description": "vodozemac is an implementation of Olm and Megolm in pure Rust. Versions 0.5.0 and 0.5.1 of vodozemac have degraded secret zeroization capabilities, due to changes in third-party cryptographic dependencies (the Dalek crates), which moved secret zeroization capabilities behind a feature flag and defaulted this feature to off. The degraded zeroization capabilities could result in the production of more memory copies of encryption secrets and secrets could linger in memory longer than necessary. This marginally increases the risk of sensitive data exposure. This issue has been addressed in version 0.6.0 and users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-05-03T10:15:08.690"
  },
  "CVE-2024-34072": {
    "cvss": 7.8,
    "description": "sagemaker-python-sdk is a library for training and deploying machine learning models on Amazon SageMaker. The sagemaker.base_deserializers.NumpyDeserializer module before v2.218.0 allows potentially unsafe deserialization when untrusted data is passed as pickled object arrays. This consequently may allow an unprivileged third party to cause remote code execution, denial of service, affecting both confidentiality and integrity. Users are advised to upgrade to version 2.218.0. Users unable to upgrade should not pass pickled numpy object arrays which originated from an untrusted source, or that could have been tampered with. Only pass pickled numpy object arrays from trusted sources.",
    "published": "2024-05-03T11:15:22.260",
    "keywords": "remote,execution"
  },
  "CVE-2024-34073": {
    "cvss": 7.8,
    "description": "sagemaker-python-sdk is a library for training and deploying machine learning models on Amazon SageMaker. In affected versions the capture_dependencies function in `sagemaker.serve.save_retrive.version_1_0_0.save.utils` module allows for potentially unsafe Operating System (OS) Command Injection if inappropriate command is passed as the “requirements_path” parameter. This consequently may allow an unprivileged third party to cause remote code execution, denial of service, affecting both confidentiality and integrity. This issue has been addressed in version 2.214.3. Users are advised to upgrade. Users unable to upgrade should not override the “requirements_path” parameter of capture_dependencies function in `sagemaker.serve.save_retrive.version_1_0_0.save.utils`, and instead use the default value.",
    "published": "2024-05-03T11:15:22.447",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-34446": {
    "cvss": "-",
    "description": "Mullvad VPN through 2024.1 on Android does not set a DNS server in the blocking state (after a hard failure to create a tunnel), and thus DNS traffic can leave the device. Data showing that the affected device was the origin of sensitive DNS requests may be observed and logged by operators of unintended DNS servers.",
    "published": "2024-05-03T15:15:08.210",
    "keywords": "sensitive,vpn"
  },
  "CVE-2024-34449": {
    "url": "https://github.com/vanessa219/vditor/issues/1604",
    "cvss": "-",
    "description": "Vditor 3.10.3 allows XSS via an attribute of an A element. NOTE: the vendor indicates that a user is supposed to mitigate this via sanitize=true.",
    "published": "2024-05-03T16:15:11.520"
  },
  "CVE-2024-31636": {
    "url": "https://github.com/lief-project/lief/issues/1038",
    "cvss": "-",
    "description": "An issue in LIEF v.0.14.1 allows a local attacker to obtain sensitive information via the name parameter of the machd_reader.c component.",
    "published": "2024-05-03T17:15:07.687"
  },
  "CVE-2024-31673": {
    "url": "https://github.com/kliqqi-cms/kliqqi-cms/issues/265",
    "cvss": "-",
    "description": "Kliqqi-CMS 2.0.2 is vulnerable to SQL Injection in load_data.php via the userid parameter.",
    "published": "2024-05-03T18:15:09.310"
  },
  "CVE-2024-34068": {
    "cvss": 6.4,
    "description": "Pterodactyl wings is the server control plane for Pterodactyl Panel. An authenticated user who has access to a game server is able to bypass the previously implemented access control (GHSA-6rg3-8h8x-5xfv) that prevents accessing internal endpoints of the node hosting Wings in the pull endpoint. This would allow malicious users to potentially access resources on local networks that would otherwise be inaccessible. This issue has been addressed in version 1.11.2 and users are advised to upgrade. Users unable to upgrade may enable the `api.disable_remote_download` option as a workaround. ",
    "published": "2024-05-03T18:15:09.773",
    "keywords": "remote,bypass"
  },
  "CVE-2024-34453": {
    "url": "https://github.com/tznb1/twonav/issues/9#issuecomment-2022194939",
    "cvss": "-",
    "description": "TwoNav 2.1.13 contains an SSRF vulnerability via the url paramater to index.php?c=api&method=read_data&type=connectivity_test (which reaches /system/api.php).",
    "published": "2024-05-03T18:15:10.160"
  },
  "CVE-2024-34455": {
    "url": "https://github.com/buildroot/buildroot/commit/0b2967e15800421efbdfe3a7a6061cf6bd84134d",
    "cvss": "-",
    "description": "Buildroot before 0b2967e lacks the sticky bit for the /dev/shm directory.",
    "published": "2024-05-03T19:15:07.950"
  }
}