{
  "CVE-2024-3319": {
    "cvss": 9.1,
    "description": "An issue was identified in the Identity Security Cloud (ISC) Transform preview and IdentityProfile preview API endpoints that allowed an authenticated administrator to execute user-defined templates as part of attribute transforms which could allow remote code execution on the host.",
    "published": "2024-05-15T16:15:11.170",
    "keywords": "remote,execution"
  },
  "CVE-2024-3483": {
    "cvss": 7.8,
    "description": "Remote Code\nExecution has been discovered in\nOpenText™ iManager 3.2.6.0200. The vulnerability can\ntrigger command injection and insecure deserialization issues.\n\n",
    "published": "2024-05-15T17:15:12.943",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-3486": {
    "cvss": 7.8,
    "description": "XML External Entity injection vulnerability found in OpenText™ iManager 3.2.6.0200. This could lead to information disclosure and remote code execution.\n\n",
    "published": "2024-05-15T17:15:13.773",
    "keywords": "remote,execution"
  },
  "CVE-2024-3487": {
    "cvss": 3.5,
    "description": "Broken Authentication vulnerability discovered in OpenText™ iManager 3.2.6.0200. This\nvulnerability allows an attacker to manipulate certain parameters to bypass\nauthentication.\n\n",
    "published": "2024-05-15T17:15:14.003",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-3488": {
    "cvss": 5.6,
    "description": "File Upload vulnerability in unauthenticated\nsession found in OpenText™ iManager 3.2.6.0200. The vulnerability could allow ant attacker to upload a\nfile without authentication.\n\n",
    "published": "2024-05-15T17:15:14.250",
    "keywords": "unauthenticated,authentication"
  },
  "CVE-2024-3967": {
    "cvss": 7.6,
    "description": "Remote Code\nExecution has been discovered in\nOpenText™ iManager 3.2.6.0200. The vulnerability can\ntrigger remote code execution unisng unsafe java object deserialization.\n\n",
    "published": "2024-05-15T17:15:14.703",
    "keywords": "remote,execution"
  },
  "CVE-2024-3968": {
    "cvss": 7.8,
    "description": "Remote Code\nExecution has been discovered in\nOpenText™ iManager 3.2.6.0200. The vulnerability can\ntrigger remote code execution using custom file upload task.",
    "published": "2024-05-15T17:15:14.910",
    "keywords": "remote,execution"
  },
  "CVE-2024-20256": {
    "cvss": 4.8,
    "description": "A vulnerability in the web-based management interface of Cisco AsyncOS Software for Cisco Secure Email and Web Manager and Secure Web Appliance could allow an authenticated, remote attacker to conduct an XSS attack against a user of the interface.\r\n\rThis vulnerability is due to insufficient validation of user input. An attacker could exploit this vulnerability by persuading a user of an affected interface to click a crafted link. A successful exploit could allow the attacker to execute arbitrary script code in the context of the affected interface or access sensitive, browser-based information.",
    "published": "2024-05-15T18:15:08.720",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-20257": {
    "cvss": 4.8,
    "description": "A vulnerability in the web-based management interface of Cisco AsyncOS Software for Cisco Secure Email Gateway could allow an authenticated, remote attacker to conduct an XSS attack against a user of the interface.r\n\r This vulnerability is due to insufficient validation of user input. An attacker could exploit this vulnerability by persuading a user of an affected interface to click a crafted link. A successful exploit could allow the attacker to execute arbitrary script code in the context of the affected interface or access sensitive, browser-based information.",
    "published": "2024-05-15T18:15:08.967",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-20258": {
    "cvss": 6.1,
    "description": "A vulnerability in the web-based management interface of Cisco AsyncOS Software for Cisco Secure Email and Web Manager and Secure Email Gateway could allow an unauthenticated, remote attacker to conduct an XSS attack against a user of the interface.\r\n\r This vulnerability is due to insufficient validation of user input. An attacker could exploit this vulnerability by persuading a user of an affected interface to click a crafted link. A successful exploit could allow the attacker to execute arbitrary script code in the context of the affected interface or access sensitive, browser-based information.",
    "published": "2024-05-15T18:15:09.193",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-20369": {
    "cvss": 4.7,
    "description": "A vulnerability in the web-based management interface of Cisco Crosswork Network Services Orchestrator (NSO) could allow an unauthenticated, remote attacker to redirect a user to a malicious web page.\r\n\r\n\r This vulnerability is due to improper input validation of a parameter in an HTTP request. An attacker could exploit this vulnerability by persuading a user to click a crafted link. A successful exploit could allow the attacker to redirect a user to a malicious website.",
    "published": "2024-05-15T18:15:09.673",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20391": {
    "cvss": 6.8,
    "description": "A vulnerability in the Network Access Manager (NAM) module of Cisco Secure Client could allow an unauthenticated attacker with physical access to an affected device to elevate privileges to SYSTEM.\r\n\r This vulnerability is due to a lack of authentication on a specific function. A successful exploit could allow the attacker to execute arbitrary code with SYSTEM privileges on an affected device.",
    "published": "2024-05-15T18:15:10.153",
    "keywords": "unauthenticated,authentication"
  },
  "CVE-2024-20392": {
    "cvss": 6.1,
    "description": "A vulnerability in the web-based management API of Cisco AsyncOS Software for Cisco Secure Email Gateway could allow an unauthenticated, remote attacker to conduct an HTTP response splitting attack. \r\n\r This vulnerability is due to insufficient input validation of some parameters that are passed to the web-based management API of the affected system. An attacker could exploit this vulnerability by persuading a user of an affected interface to click a crafted link. A successful exploit could allow the attacker to perform cross-site scripting (XSS) attacks, resulting in the execution of arbitrary script code in the browser of the targeted user, or could allow the attacker to access sensitive, browser-based information.",
    "published": "2024-05-15T18:15:10.390",
    "keywords": "remote,execution,unauthenticated,sensitive"
  },
  "CVE-2024-33615": {
    "cvss": 8.8,
    "description": "A specially crafted Zip file containing path traversal characters can be\n imported to the \nCyberPower PowerPanel \n\nserver, which allows file writing to the server outside\n the intended scope, and could allow an attacker to achieve remote code \nexecution.",
    "published": "2024-05-15T20:15:12.687",
    "keywords": "remote,execution"
  },
  "CVE-2024-33625": {
    "cvss": 9.8,
    "description": "CyberPower PowerPanel business \napplication code contains a hard-coded JWT signing key. This could \nresult in an attacker forging JWT tokens to bypass authentication.",
    "published": "2024-05-15T20:15:12.927",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-34025": {
    "cvss": 9.8,
    "description": "CyberPower PowerPanel business application code contains a hard-coded set of authentication \ncredentials. This could result in an attacker bypassing authentication \nand gaining administrator privileges.",
    "published": "2024-05-15T20:15:13.190",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-34906": {
    "url": "https://github.com/kuaifan/dootask/issues/210",
    "cvss": "-",
    "description": "An arbitrary file upload vulnerability in dootask v0.30.13 allows attackers to execute arbitrary code via uploading a crafted PDF file.",
    "published": "2024-05-15T20:15:13.460"
  },
  "CVE-2024-35184": {
    "cvss": 5.5,
    "description": "Paperless-ngx is a document management system that transforms physical documents into a searchable online archive. Starting in version 2.5.0 and prior to version 2.8.6, remote user authentication allows API access even if API access is explicitly disabled. Version 2.8.6 contains a patchc for the issue.",
    "published": "2024-05-15T22:15:08.867",
    "keywords": "remote,authentication"
  },
  "CVE-2024-4965": {
    "cvss": 6.3,
    "description": "** UNSUPPORTED WHEN ASSIGNED ** A vulnerability was found in D-Link DAR-7000-40 V31R02B1413C and classified as critical. This issue affects some unknown processing of the file /useratte/resmanage.php. The manipulation of the argument load leads to os command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-264533 was assigned to this vulnerability. NOTE: This vulnerability only affects products that are no longer supported by the maintainer. NOTE: Vendor was contacted early and confirmed immediately that the product is end-of-life. It should be retired and replaced.",
    "published": "2024-05-16T08:15:39.030",
    "keywords": "remote,command"
  },
  "CVE-2024-20793": {
    "cvss": 5.5,
    "description": "Illustrator versions 28.4, 27.9.3 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-05-16T09:15:09.560",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-2358": {
    "cvss": 9.8,
    "description": "A path traversal vulnerability in the '/apply_settings' endpoint of parisneo/lollms-webui allows attackers to execute arbitrary code. The vulnerability arises due to insufficient sanitization of user-supplied input in the configuration settings, specifically within the 'extensions' parameter. Attackers can exploit this by crafting a payload that includes relative path traversal sequences ('../../../'), enabling them to navigate to arbitrary directories. This flaw subsequently allows the server to load and execute a malicious '__init__.py' file, leading to remote code execution. The issue affects the latest version of parisneo/lollms-webui.",
    "published": "2024-05-16T09:15:09.800",
    "keywords": "remote,execution"
  },
  "CVE-2024-2366": {
    "cvss": 9.0,
    "description": "A remote code execution vulnerability exists in the parisneo/lollms-webui application, specifically within the reinstall_binding functionality in lollms_core/lollms/server/endpoints/lollms_binding_infos.py of the latest version. The vulnerability arises due to insufficient path sanitization, allowing an attacker to exploit path traversal to navigate to arbitrary directories. By manipulating the binding_path to point to a controlled directory and uploading a malicious __init__.py file, an attacker can execute arbitrary code on the server.",
    "published": "2024-05-16T09:15:10.287",
    "keywords": "remote,execution"
  },
  "CVE-2024-30281": {
    "cvss": 5.5,
    "description": "Substance3D - Designer versions 13.1.1 and earlier Answer: are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-05-16T09:15:11.007",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-30298": {
    "cvss": 5.5,
    "description": "Animate versions 24.0.2, 23.0.5 and earlier Answer: are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-05-16T09:15:12.680",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-30308": {
    "cvss": 5.5,
    "description": "Substance3D - Painter versions 9.1.2 and earlier Answer: are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-05-16T09:15:13.137",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-30309": {
    "cvss": 5.5,
    "description": "Substance3D - Painter versions 9.1.2 and earlier Answer: are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-05-16T09:15:13.377",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-3126": {
    "cvss": 8.4,
    "description": "A command injection vulnerability exists in the 'run_xtts_api_server' function of the parisneo/lollms-webui application, specifically within the 'lollms_xtts.py' script. The vulnerability arises due to the improper neutralization of special elements used in an OS command. The affected function utilizes 'subprocess.Popen' to execute a command constructed with a Python f-string, without adequately sanitizing the 'xtts_base_url' input. This flaw allows attackers to execute arbitrary commands remotely by manipulating the 'xtts_base_url' parameter. The vulnerability affects versions up to and including the latest version before 9.5. Successful exploitation could lead to arbitrary remote code execution (RCE) on the system where the application is deployed.",
    "published": "2024-05-16T09:15:13.840",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-3403": {
    "cvss": 7.5,
    "description": "imartinez/privategpt version 0.2.0 is vulnerable to a local file inclusion vulnerability that allows attackers to read arbitrary files from the filesystem. By manipulating file upload functionality to ingest arbitrary local files, attackers can exploit the 'Search in Docs' feature or query the AI to retrieve or disclose the contents of any file on the system. This vulnerability could lead to various impacts, including but not limited to remote code execution by obtaining private SSH keys, unauthorized access to private files, source code disclosure facilitating further attacks, and exposure of configuration files.",
    "published": "2024-05-16T09:15:14.053",
    "keywords": "remote,execution"
  },
  "CVE-2024-3435": {
    "cvss": 8.4,
    "description": "A path traversal vulnerability exists in the 'save_settings' endpoint of the parisneo/lollms-webui application, affecting versions up to the latest release before 9.5. The vulnerability arises due to insufficient sanitization of the 'config' parameter in the 'apply_settings' function, allowing an attacker to manipulate the application's configuration by sending specially crafted JSON payloads. This could lead to remote code execution (RCE) by bypassing existing patches designed to mitigate such vulnerabilities.",
    "published": "2024-05-16T09:15:14.290",
    "keywords": "remote,execution,bypass"
  },
  "CVE-2024-3848": {
    "cvss": 7.5,
    "description": "A path traversal vulnerability exists in mlflow/mlflow version 2.11.0, identified as a bypass for the previously addressed CVE-2023-6909. The vulnerability arises from the application's handling of artifact URLs, where a '#' character can be used to insert a path into the fragment, effectively skipping validation. This allows an attacker to construct a URL that, when processed, ignores the protocol scheme and uses the provided path for filesystem access. As a result, an attacker can read arbitrary files, including sensitive information such as SSH and cloud keys, by exploiting the way the application converts the URL into a filesystem path. The issue stems from insufficient validation of the fragment portion of the URL, leading to arbitrary file read through path traversal.",
    "published": "2024-05-16T09:15:14.543",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-4078": {
    "cvss": 9.8,
    "description": "A vulnerability in the parisneo/lollms, specifically in the `/unInstall_binding` endpoint, allows for arbitrary code execution due to insufficient sanitization of user input. The issue arises from the lack of path sanitization when handling the `name` parameter in the `unInstall_binding` function, allowing an attacker to traverse directories and execute arbitrary code by loading a malicious `__init__.py` file. This vulnerability affects the latest version of the software. The exploitation of this vulnerability could lead to remote code execution on the system where parisneo/lollms is deployed.",
    "published": "2024-05-16T09:15:15.313",
    "keywords": "remote,execution"
  },
  "CVE-2024-4321": {
    "cvss": 7.5,
    "description": "A Local File Inclusion (LFI) vulnerability exists in the gaizhenbiao/chuanhuchatgpt application, specifically within the functionality for uploading chat history. The vulnerability arises due to improper input validation when handling file paths during the chat history upload process. An attacker can exploit this vulnerability by intercepting requests and manipulating the 'name' parameter to specify arbitrary file paths. This allows the attacker to read sensitive files on the server, leading to information leakage, including API keys and private information. The issue affects version 20240310 of the application.",
    "published": "2024-05-16T09:15:16.327",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-4326": {
    "cvss": 9.8,
    "description": "A vulnerability in parisneo/lollms-webui versions up to 9.3 allows remote attackers to execute arbitrary code. The vulnerability stems from insufficient protection of the `/apply_settings` and `/execute_code` endpoints. Attackers can bypass protections by setting the host to localhost, enabling code execution, and disabling code validation through the `/apply_settings` endpoint. Subsequently, arbitrary commands can be executed remotely via the `/execute_code` endpoint, exploiting the delay in settings enforcement. This issue was addressed in version 9.5.",
    "published": "2024-05-16T09:15:16.887",
    "keywords": "remote,execution,command,bypass"
  },
  "CVE-2024-4642": {
    "cvss": 7.7,
    "description": "A Server-Side Request Forgery (SSRF) vulnerability exists in the wandb/wandb repository due to improper handling of HTTP 302 redirects. This issue allows team members with access to the 'User settings -> Webhooks' function to exploit this vulnerability to access internal HTTP(s) servers. In severe cases, such as on AWS instances, this could potentially be abused to achieve remote code execution on the victim's machine. The vulnerability is present in the latest version of the repository.",
    "published": "2024-05-16T09:15:17.360",
    "keywords": "remote,execution"
  },
  "CVE-2024-30283": {
    "cvss": 5.5,
    "description": "Adobe Framemaker versions 2020.5, 2022.3 and earlier Answer: are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-05-16T12:15:08.407",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-30286": {
    "cvss": 5.5,
    "description": "Adobe Framemaker versions 2020.5, 2022.3 and earlier Answer: are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-05-16T12:15:09.097",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-30287": {
    "cvss": 5.5,
    "description": "Adobe Framemaker versions 2020.5, 2022.3 and earlier Answer: are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-05-16T12:15:09.700",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-30314": {
    "cvss": 9.3,
    "description": "Dreamweaver Desktop versions 21.3 and earlier are affected by an Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection') vulnerability that could lead in arbitrary code execution by an attacker. Exploitation of this issue does require user interaction.",
    "published": "2024-05-16T12:15:13.280",
    "keywords": "execution,command"
  },
  "CVE-2024-4999": {
    "cvss": "-",
    "description": "A vulnerability in the web-based management interface of multiple Ligowave devices could allow an authenticated remote attacker to execute arbitrary commands with elevated privileges.This issue affects UNITY: through 6.95-2; PRO: through 6.95-1.Rt3883; MIMO: through 6.95-1.Rt2880; APC Propeller: through 2-5.95-4.Rt3352.",
    "published": "2024-05-16T13:15:48.357",
    "keywords": "remote,command"
  },
  "CVE-2024-34905": {
    "url": "https://github.com/cloudwise-opensource/flyfish/issues/191",
    "cvss": "-",
    "description": "FlyFish v3.0.0 was discovered to contain a buffer overflow via the password parameter on the login page. This vulnerability allows attackers to cause a Denial of Service (DoS) via a crafted input.",
    "published": "2024-05-16T15:15:47.887"
  },
  "CVE-2024-3640": {
    "cvss": "-",
    "description": "An unquoted executable path exists in the Rockwell Automation FactoryTalk® Remote Access™ possibly resulting in remote code execution if exploited. While running the FTRA installer package, the executable path is not properly quoted, which could allow a threat actor to enter a malicious executable and run it as a System user. A threat actor needs admin privileges to exploit this vulnerability.",
    "published": "2024-05-16T16:15:10.477",
    "keywords": "remote,execution"
  },
  "CVE-2024-4603": {
    "url": "https://github.com/openssl/openssl/commit/da343d0605c826ef197aceedc67e8e04f065f740",
    "cvss": "-",
    "description": "Issue summary: Checking excessively long DSA keys or parameters may be very\nslow.\n\nImpact summary: Applications that use the functions EVP_PKEY_param_check()\nor EVP_PKEY_public_check() to check a DSA public key or DSA parameters may\nexperience long delays. Where the key or parameters that are being checked\nhave been obtained from an untrusted source this may lead to a Denial of\nService.\n\nThe functions EVP_PKEY_param_check() or EVP_PKEY_public_check() perform\nvarious checks on DSA parameters. Some of those computations take a long time\nif the modulus (`p` parameter) is too large.\n\nTrying to use a very large modulus is slow and OpenSSL will not allow using\npublic keys with a modulus which is over 10,000 bits in length for signature\nverification. However the key and parameter check functions do not limit\nthe modulus size when performing the checks.\n\nAn application that calls EVP_PKEY_param_check() or EVP_PKEY_public_check()\nand supplies a key or parameters obtained from an untrusted source could be\nvulnerable to a Denial of Service attack.\n\nThese functions are not called by OpenSSL itself on untrusted DSA keys so\nonly applications that directly call these functions may be vulnerable.\n\nAlso vulnerable are the OpenSSL pkey and pkeyparam command line applications\nwhen using the `-check` option.\n\nThe OpenSSL SSL/TLS implementation is not affected by this issue.\n\nThe OpenSSL 3.0 and 3.1 FIPS providers are affected by this issue.",
    "published": "2024-05-16T16:15:10.643"
  },
  "CVE-2024-4609": {
    "cvss": "-",
    "description": "A vulnerability exists in the Rockwell Automation FactoryTalk® View SE Datalog function that could allow a threat actor to inject a malicious SQL statement if the SQL database has no authentication in place or if legitimate credentials were stolen. If exploited, the attack could result in information exposure, revealing sensitive information. Additionally, a threat actor could potentially modify and delete the data in a remote database. An attack would only affect the HMI design time, not runtime.",
    "published": "2024-05-16T16:15:10.750",
    "keywords": "remote,authentication,sensitive"
  },
  "CVE-2024-22476": {
    "cvss": 10.0,
    "description": "Improper input validation in some Intel(R) Neural Compressor software before version 2.5.0 may allow an unauthenticated user to potentially enable escalation of privilege via remote access.",
    "published": "2024-05-16T21:16:07.350",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-3551": {
    "cvss": 9.8,
    "description": "The Penci Soledad Data Migrator plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 1.3.0 via the 'data' parameter. This makes it possible for unauthenticated attackers to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included. This is limited to just PHP files.",
    "published": "2024-05-17T03:15:08.463",
    "keywords": "execution,unauthenticated,sensitive,bypass"
  },
  "CVE-2024-35110": {
    "url": "https://github.com/yzmcms/yzmcms/issues/68",
    "cvss": "-",
    "description": "A reflected XSS vulnerability has been found in YzmCMS 7.1. The vulnerability exists in yzmphp/core/class/application.class.php: when logged-in users access a malicious link, their cookies can be captured by an attacker.",
    "published": "2024-05-17T08:15:06.073"
  },
  "CVE-2024-21746": {
    "cvss": 5.3,
    "description": "Authentication Bypass by Spoofing vulnerability in Wpmet Wp Ultimate Review allows Functionality Bypass.This issue affects Wp Ultimate Review: from n/a through 2.3.2.",
    "published": "2024-05-17T09:15:20.363",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-22139": {
    "cvss": 3.7,
    "description": "Authentication Bypass by Spoofing vulnerability in Filipe Seabra WordPress Manutenção allows Functionality Bypass.This issue affects WordPress Manutenção: from n/a through 1.0.6.",
    "published": "2024-05-17T09:15:20.930",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-25595": {
    "cvss": 5.3,
    "description": "Authentication Bypass by Spoofing vulnerability in WPMU DEV Defender Security allows Functionality Bypass.This issue affects Defender Security: from n/a through 4.4.1.",
    "published": "2024-05-17T09:15:25.920",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-25906": {
    "cvss": 4.3,
    "description": "Authentication Bypass by Spoofing vulnerability in WP Happy Coders Comments Like Dislike allows Functionality Bypass.This issue affects Comments Like Dislike: from n/a through 1.2.2.",
    "published": "2024-05-17T09:15:26.370",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-30479": {
    "cvss": 5.3,
    "description": "Authentication Bypass by Spoofing vulnerability in LionScripts IP Blocker Lite allows Functionality Bypass.This issue affects IP Blocker Lite: from n/a through 11.1.1.",
    "published": "2024-05-17T09:15:28.283",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-30480": {
    "cvss": 3.7,
    "description": "Authentication Bypass by Spoofing vulnerability in Pippin Williamson CGC Maintenance Mode allows Functionality Bypass.This issue affects CGC Maintenance Mode: from n/a through 1.2.",
    "published": "2024-05-17T09:15:28.807",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-30522": {
    "cvss": 5.3,
    "description": "Authentication Bypass by Spoofing vulnerability in Stefano Lissa & The Newsletter Team Newsletter allows Functionality Bypass.This issue affects Newsletter: from n/a through 8.2.0.",
    "published": "2024-05-17T09:15:29.813",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-32131": {
    "cvss": 5.3,
    "description": "Exposure of Sensitive Information to an Unauthorized Actor vulnerability in W3 Eden Inc. Download Manager allows Functionality Bypass.This issue affects Download Manager: from n/a through 3.2.82.",
    "published": "2024-05-17T09:15:35.797",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-33917": {
    "cvss": 5.3,
    "description": "Authentication Bypass by Spoofing vulnerability in webtechideas WTI Like Post allows Functionality Bypass.This issue affects WTI Like Post: from n/a through 1.4.6.",
    "published": "2024-05-17T09:15:43.250",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-22120": {
    "cvss": 9.1,
    "description": "Zabbix server can perform command execution for configured scripts. After command is executed, audit entry is added to \"Audit Log\". Due to \"clientip\" field is not sanitized, it is possible to injection SQL into \"clientip\" and exploit time based blind SQL injection.",
    "published": "2024-05-17T10:15:07.363",
    "keywords": "execution,command"
  },
  "CVE-2024-32708": {
    "cvss": 3.7,
    "description": "Authentication Bypass by Spoofing vulnerability in helderk Maintenance Mode allows Functionality Bypass.This issue affects Maintenance Mode: from n/a through 3.0.1.",
    "published": "2024-05-17T10:15:09.203",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-32786": {
    "cvss": 5.3,
    "description": "Authentication Bypass by Spoofing vulnerability in WP Royal Royal Elementor Addons allows Functionality Bypass.This issue affects Royal Elementor Addons: from n/a through 1.3.93.",
    "published": "2024-05-17T10:15:10.387",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-32827": {
    "cvss": 5.3,
    "description": "Authentication Bypass by Spoofing vulnerability in RafflePress Giveaways and Contests allows Functionality Bypass.This issue affects Giveaways and Contests: from n/a through 1.12.7.",
    "published": "2024-05-17T10:15:11.540",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-5044": {
    "cvss": 3.7,
    "description": "A vulnerability was found in Emlog Pro 2.3.4. It has been classified as problematic. This affects an unknown part of the component Cookie Handler. The manipulation of the argument AuthCookie leads to improper authentication. It is possible to initiate the attack remotely. The complexity of an attack is rather high. The exploitability is told to be difficult. The exploit has been disclosed to the public and may be used. The identifier VDB-264741 was assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-05-17T12:15:17.727",
    "keywords": "remote,authentication"
  },
  "CVE-2024-27435": {
    "cvss": "-",
    "description": "In the Linux kernel, the following vulnerability has been resolved:\n\nnvme: fix reconnection fail due to reserved tag allocation\n\nWe found a issue on production environment while using NVMe over RDMA,\nadmin_q reconnect failed forever while remote target and network is ok.\nAfter dig into it, we found it may caused by a ABBA deadlock due to tag\nallocation. In my case, the tag was hold by a keep alive request\nwaiting inside admin_q, as we quiesced admin_q while reset ctrl, so the\nrequest maked as idle and will not process before reset success. As\nfabric_q shares tagset with admin_q, while reconnect remote target, we\nneed a tag for connect command, but the only one reserved tag was held\nby keep alive command which waiting inside admin_q. As a result, we\nfailed to reconnect admin_q forever. In order to fix this issue, I\nthink we should keep two reserved tags for admin queue.",
    "published": "2024-05-17T13:15:58.073",
    "keywords": "remote,command"
  },
  "CVE-2024-35833": {
    "cvss": "-",
    "description": "In the Linux kernel, the following vulnerability has been resolved:\n\ndmaengine: fsl-qdma: Fix a memory leak related to the queue command DMA\n\nThis dma_alloc_coherent() is undone neither in the remove function, nor in\nthe error handling path of fsl_qdma_probe().\n\nSwitch to the managed version to fix both issues.",
    "published": "2024-05-17T14:15:19.930",
    "keywords": "command,leak"
  },
  "CVE-2024-34997": {
    "url": "https://github.com/joblib/joblib/issues/1582",
    "cvss": "-",
    "description": "joblib v1.4.2 was discovered to contain a deserialization vulnerability via the component joblib.numpy_pickle::NumpyArrayWrapper().read_array().",
    "published": "2024-05-17T19:15:07.373"
  },
  "CVE-2024-23554": {
    "cvss": 5.7,
    "description": "Cross-Site Request Forgery (CSRF) on Session Token vulnerability that could potentially lead to Remote Code Execution (RCE). \n",
    "published": "2024-05-18T00:15:07.337",
    "keywords": "remote,execution"
  },
  "CVE-2024-4264": {
    "cvss": 9.8,
    "description": "A remote code execution (RCE) vulnerability exists in the berriai/litellm project due to improper control of the generation of code when using the `eval` function unsafely in the `litellm.get_secret()` method. Specifically, when the server utilizes Google KMS, untrusted data is passed to the `eval` function without any sanitization. Attackers can exploit this vulnerability by injecting malicious values into environment variables through the `/config/update` endpoint, which allows for the update of settings in `proxy_server_config.yaml`.",
    "published": "2024-05-18T00:15:07.777",
    "keywords": "remote,execution"
  },
  "CVE-2024-3810": {
    "cvss": 8.8,
    "description": "The Salient Shortcodes plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 1.5.3 via the 'icon' shortcode 'image' attribute. This makes it possible for authenticated attackers, with contributor-level and above permissions, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where php file type can be uploaded and included.",
    "published": "2024-05-18T06:15:06.440",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-3812": {
    "cvss": 7.5,
    "description": "The Salient Core plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 2.0.7 via the 'nectar_icon' shortcode 'icon_linea' attribute. This makes it possible for authenticated attackers, with contributor-level and above permissions, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where php file type can be uploaded and included.",
    "published": "2024-05-18T06:15:08.000",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-3658": {
    "cvss": 9.8,
    "description": "The Build App Online plugin for WordPress is vulnerable to authentication bypass in versions up to, and including, 1.0.21. This is due to missing authentication checking in the 'set_user_cart' function with the 'user_id' header value. This makes it possible for unauthenticated attackers to log in as any existing user on the site, such as an administrator, if they have access to the user id.",
    "published": "2024-05-18T10:15:07.053",
    "keywords": "unauthenticated,authentication,bypass"
  }
}