{
  "CVE-2025-43578": {
    "cvss": 5.5,
    "description": "Acrobat Reader versions 24.001.30235, 20.005.30763, 25.001.20521 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2025-06-10T19:15:33.050",
    "keywords": "sensitive,bypass"
  },
  "CVE-2025-43579": {
    "cvss": 5.5,
    "description": "Acrobat Reader versions 24.001.30235, 20.005.30763, 25.001.20521 and earlier are affected by an Information Exposure vulnerability that could result in a Security feature bypass. An attacker could leverage this vulnerability to gain unauthorized access to sensitive information. Exploitation of this issue does not require user interaction.",
    "published": "2025-06-10T19:15:33.200",
    "keywords": "sensitive,bypass"
  },
  "CVE-2025-47112": {
    "cvss": 5.5,
    "description": "Acrobat Reader versions 24.001.30235, 20.005.30763, 25.001.20521 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2025-06-10T19:15:33.667",
    "keywords": "sensitive,bypass"
  },
  "CVE-2025-36852": {
    "cvss": "-",
    "description": "A critical security vulnerability exists in remote cache extensions for common build systems utilizing bucket-based remote cache (such as those using Amazon S3, Google Cloud Storage, or similar object storage) that allows any contributor with pull request privileges to inject compromised artifacts from an untrusted environment into trusted production environments without detection. \n\n\n\n\nThe vulnerability exploits a fundamental design flaw in the \"first-to-cache wins\" principle, where artifacts built in untrusted environments (feature branches, pull requests) can poison the cache used by trusted environments (protected branches, production deployments). \n\n\n\n\nThis attack bypasses all traditional security measures including encryption, access controls, and checksum validation because the poisoning occurs during the artifact construction phase, before any security measures are applied.",
    "published": "2025-06-10T20:15:22.877",
    "keywords": "remote,bypass"
  },
  "CVE-2025-3052": {
    "cvss": 8.2,
    "description": "An arbitrary write vulnerability in Microsoft signed UEFI firmware allows for code execution of untrusted software. This allows an attacker to control its value, leading to arbitrary memory writes, including modification of critical firmware settings stored in NVRAM. Exploiting this vulnerability could enable security bypasses, persistence mechanisms, or full system compromise.",
    "published": "2025-06-10T20:15:23.037",
    "keywords": "execution,bypass"
  },
  "CVE-2025-35940": {
    "cvss": 8.1,
    "description": "The ArchiverSpaApi ASP.NET  application uses a hard-coded JWT signing key. An unauthenticated remote attacker can generate and use a verifiable JWT token to access protected ArchiverSpaApi URL endpoints.",
    "published": "2025-06-10T21:15:22.210",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-49091": {
    "cvss": 8.2,
    "description": "KDE Konsole before 25.04.2 allows remote code execution in a certain scenario. It supports loading URLs from the scheme handlers such as a ssh:// or telnet:// or rlogin:// URL. This can be executed regardless of whether the ssh, telnet, or rlogin binary is available. In this mode, there is a code path where if that binary is not available, Konsole falls back to using /bin/bash for the given arguments (i.e., the URL) provided. This allows an attacker to execute arbitrary code.",
    "published": "2025-06-11T01:15:20.547",
    "keywords": "remote,execution"
  },
  "CVE-2025-4799": {
    "cvss": 7.2,
    "description": "The WP-DownloadManager plugin for WordPress is vulnerable to arbitrary file deletion due to lack of restriction on the directory a file can be deleted from in all versions up to, and including, 1.68.10. This makes it possible for authenticated attackers, with Administrator-level access and above, to delete arbitrary files on the server, which can easily lead to remote code execution when the right file is deleted (such as wp-config.php). This vulnerability can be paired with CVE-2025-4798 to delete any file within the WordPress root directory.",
    "published": "2025-06-11T04:15:59.223",
    "keywords": "remote,execution"
  },
  "CVE-2025-5395": {
    "cvss": 8.8,
    "description": "The WordPress Automatic Plugin plugin for WordPress is vulnerable to arbitrary file uploads due to insufficient file type validation in the 'core.php' file in all versions up to, and including, 3.115.0. This makes it possible for authenticated attackers, with Author-level access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2025-06-11T07:15:24.800",
    "keywords": "remote,execution"
  },
  "CVE-2025-26412": {
    "cvss": 6.8,
    "description": "The SIMCom SIM7600G modem supports an undocumented AT command, which allows an attacker to execute system commands with root permission on the modem. An attacker needs either physical access or remote shell access to a device that interacts directly with the modem via AT commands.",
    "published": "2025-06-11T09:15:22.067",
    "keywords": "remote,command"
  },
  "CVE-2025-41661": {
    "cvss": 8.8,
    "description": "An unauthenticated remote attacker can execute arbitrary commands with root privileges on affected devices due to lack of Cross-Site Request Forgery (CSRF) protection in the Main Web Interface (endpoint event_mail_test).",
    "published": "2025-06-11T09:15:22.257",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2025-41662": {
    "cvss": 8.8,
    "description": "An unauthenticated remote attacker can execute arbitrary commands with root privileges on affected devices due to lack of Cross-Site Request Forgery (CSRF) protection in the Main Web Interface (endpoint tls_iotgen_setting).",
    "published": "2025-06-11T09:15:22.480",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2025-41663": {
    "cvss": 8.1,
    "description": "An unauthenticated remote attacker in a man-in-the-middle position can inject arbitrary commands in responses returned by WWH servers and gain arbitrary command execution with elevated privileges.",
    "published": "2025-06-11T09:15:22.700",
    "keywords": "remote,execution,unauthenticated,command"
  },
  "CVE-2025-4673": {
    "cvss": 6.8,
    "description": "Proxy-Authorization and Proxy-Authenticate headers persisted on cross-origin redirects potentially leaking sensitive information.",
    "published": "2025-06-11T17:15:42.993",
    "keywords": "sensitive,leak"
  },
  "CVE-2025-6002": {
    "cvss": 7.2,
    "description": "An unrestricted file upload vulnerability exists in the Product Image section of the VirtueMart backend. Authenticated attackers can upload files with arbitrary extensions, including executable or malicious files, potentially leading to remote code execution or other security impacts depending on server configuration.",
    "published": "2025-06-11T17:15:43.253",
    "keywords": "remote,execution"
  },
  "CVE-2025-40912": {
    "url": "https://github.com/libtom/libtomcrypt/issues/507",
    "cvss": 9.8,
    "description": "CryptX for Perl before version 0.065 contains a dependency that may be susceptible to malformed unicode.\n\nCryptX embeds the tomcrypt library. The versions of that library in CryptX before 0.065 may be susceptible to CVE-2019-17362.",
    "published": "2025-06-11T18:15:25.550"
  },
  "CVE-2025-30085": {
    "cvss": "-",
    "description": "Remote code execution vulnerability in RSForm!pro component 3.0.0 - 3.3.14 for Joomla was discovered. The issue occurs within the submission export feature and requires administrative access to the export feature.",
    "published": "2025-06-11T20:15:22.870",
    "keywords": "remote,execution"
  },
  "CVE-2025-4973": {
    "cvss": 9.8,
    "description": "The Workreap plugin for WordPress, used by the Workreap - Freelance Marketplace WordPress Theme, is vulnerable to authentication bypass in all versions up to, and including, 3.3.1. This is due to the plugin not properly verifying a user's identity prior to logging them in when verifying an account with an email address. This makes it possible for unauthenticated attackers to log in as registered users, including administrators, if they know user's email address. This is only exploitable fi the user's confirmation_key has not already been set by the plugin.",
    "published": "2025-06-12T06:15:23.440",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2025-5012": {
    "cvss": 8.8,
    "description": "The Workreap plugin for WordPress, used by the Workreap - Freelance Marketplace WordPress Theme, is vulnerable to arbitrary file uploads due to missing file type validation in the 'workreap_temp_upload_to_media' function in all versions up to, and including, 3.3.2. This makes it possible for authenticated attackers, with Subscriber-level access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2025-06-12T06:15:23.640",
    "keywords": "remote,execution"
  },
  "CVE-2025-4613": {
    "cvss": "-",
    "description": "Path traversal in Google Web Designer's template handling versions prior to 16.3.0.0407 on Windows allows attacker to achieve remote code execution by tricking users into downloading a malicious ad template",
    "published": "2025-06-12T09:15:22.390",
    "keywords": "remote,execution"
  },
  "CVE-2025-6003": {
    "cvss": 5.3,
    "description": "The WordPress Single Sign-On (SSO) plugin for WordPress is vulnerable to unauthorized access due to a misconfigured capability check on a function in all versions up to, and including, the *.5.3 versions of the plugin. This makes it possible for unauthenticated attackers to extract sensitive data including site content that has been restricted to certain users and/or roles.",
    "published": "2025-06-12T09:15:22.743",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-49184": {
    "cvss": 7.5,
    "description": "A remote unauthorized attacker may gather sensitive information of the application, due to missing authorization of configuration settings of the product.",
    "published": "2025-06-12T14:15:30.720",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-46035": {
    "cvss": 7.5,
    "description": "Buffer Overflow vulnerability in Tenda AC6 v.15.03.05.16 allows a remote attacker to cause a denial of service via the oversized schedStartTime and schedEndTime parameters in an unauthenticated HTTP GET request to the /goform/openSchedWifi endpoint",
    "published": "2025-06-12T16:15:23.167",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-5982": {
    "cvss": 3.7,
    "description": "An issue has been discovered in GitLab EE affecting all versions from 12.0 before 17.10.8, 17.11 before 17.11.4, and 18.0 before 18.0.2. Under certain conditions users could bypass IP access restrictions and view sensitive information.",
    "published": "2025-06-12T17:15:29.440",
    "keywords": "sensitive,bypass"
  },
  "CVE-2025-6031": {
    "cvss": 7.5,
    "description": "Amazon Cloud Cam is a home security camera that was deprecated on December 2, 2022, is end of life, and is no longer actively supported. \n\nWhen a user powers on the Amazon Cloud Cam, the device attempts to connect to a remote service infrastructure that has been deprecated due to end-of-life status. The device defaults to a pairing status in which an arbitrary user can bypass SSL pinning to associate the device to an arbitrary network, allowing for network traffic interception and modification.\n\nWe recommend customers discontinue usage of any remaining Amazon Cloud Cams.",
    "published": "2025-06-12T20:15:22.450",
    "keywords": "remote,bypass"
  },
  "CVE-2025-41234": {
    "cvss": 6.5,
    "description": "Description\n\nIn Spring Framework, versions 6.0.x as of 6.0.5, versions 6.1.x and 6.2.x, an application is vulnerable to a reflected file download (RFD) attack when it sets a “Content-Disposition” header with a non-ASCII charset, where the filename attribute is derived from user-supplied input.\n\nSpecifically, an application is vulnerable when all the following are true:\n\n  *  The header is prepared with org.springframework.http.ContentDisposition.\n  *  The filename is set via ContentDisposition.Builder#filename(String, Charset).\n  *  The value for the filename is derived from user-supplied input.\n  *  The application does not sanitize the user-supplied input.\n  *  The downloaded content of the response is injected with malicious commands by the attacker (see RFD paper reference for details).\n\n\nAn application is not vulnerable if any of the following is true:\n\n  *  The application does not set a “Content-Disposition” response header.\n  *  The header is not prepared with org.springframework.http.ContentDisposition.\n  *  The filename is set via one of:  *  ContentDisposition.Builder#filename(String), or\n  *  ContentDisposition.Builder#filename(String, ASCII)\n\n\n\n  *  The filename is not derived from user-supplied input.\n  *  The filename is derived from user-supplied input but sanitized by the application.\n  *  The attacker cannot inject malicious content in the downloaded content of the response.\n\n\nAffected Spring Products and VersionsSpring Framework:\n\n  *  6.2.0 - 6.2.7\n  *  6.1.0 - 6.1.20\n  *  6.0.5 - 6.0.28\n  *  Older, unsupported versions are not affected\n\n\nMitigationUsers of affected versions should upgrade to the corresponding fixed version.\n\nAffected version(s)Fix versionAvailability6.2.x6.2.8OSS6.1.x6.1.21OSS6.0.x6.0.29 Commercial https://enterprise.spring.io/ No further mitigation steps are necessary.\n\n\nCWE-113 in `Content-Disposition` handling in VMware Spring Framework versions 6.0.5 to 6.2.7 allows remote attackers to launch Reflected File Download (RFD) attacks via unsanitized user input in `ContentDisposition.Builder#filename(String, Charset)` with non-ASCII charsets.",
    "published": "2025-06-12T22:15:21.090",
    "keywords": "remote,command"
  },
  "CVE-2025-4230": {
    "cvss": "-",
    "description": "A command injection vulnerability in Palo Alto Networks PAN-OS® software enables an authenticated administrator to bypass system restrictions and run arbitrary commands as a root user. To be able to exploit this issue, the user must have access to the PAN-OS CLI.\n\nThe security risk posed by this issue is significantly minimized when CLI access is restricted to a limited group of administrators. \n\nCloud NGFW and Prisma® Access are not affected by this vulnerability.",
    "published": "2025-06-13T00:15:23.380",
    "keywords": "command,bypass"
  },
  "CVE-2025-5491": {
    "cvss": 8.8,
    "description": "Acer ControlCenter contains Remote Code Execution vulnerability. The program exposes a Windows Named Pipe that uses a custom protocol to invoke internal functions. However, this Named Pipe is misconfigured, allowing remote users with low privileges to interact with it and access its features. One such feature enables the execution of arbitrary programs as NT AUTHORITY/SYSTEM. By leveraging this, remote attackers can execute arbitrary code on the target system with elevated privileges.",
    "published": "2025-06-13T03:15:52.300",
    "keywords": "remote,execution"
  },
  "CVE-2025-39240": {
    "cvss": 7.2,
    "description": "Some Hikvision Wireless Access Point are vulnerable to authenticated remote command execution due to insufficient input validation. Attackers with valid credentials can exploit this flaw by sending crafted packets containing malicious commands to affected devices, leading to arbitrary command execution.",
    "published": "2025-06-13T08:15:19.377",
    "keywords": "remote,execution,command"
  },
  "CVE-2025-29902": {
    "cvss": 10.0,
    "description": "Remote code execution that allows unauthorized users to execute arbitrary code on the server machine.",
    "published": "2025-06-13T10:15:20.693",
    "keywords": "remote,execution"
  },
  "CVE-2025-49468": {
    "cvss": "-",
    "description": "A SQL injection vulnerability in No Boss Calendar component before 5.0.7 for Joomla was discovered. The vulnerability allows remote authenticated users to execute arbitrary SQL commands via the id_module parameter.",
    "published": "2025-06-13T10:15:21.073",
    "keywords": "remote,command"
  },
  "CVE-2025-46096": {
    "url": "https://github.com/opensolon/solon/issues/357",
    "cvss": 6.1,
    "description": "Directory Traversal vulnerability in solon v.3.1.2 allows a remote attacker to conduct XSS attacks via the solon-faas-luffy component",
    "published": "2025-06-13T13:15:21.710"
  },
  "CVE-2025-28386": {
    "cvss": "-",
    "description": "A remote code execution (RCE) vulnerability in the Plugin Management component of OpenC3 COSMOS v6.0.0 allows attackers to execute arbitrary code via uploading a crafted .txt file.",
    "published": "2025-06-13T14:15:20.713",
    "keywords": "remote,execution"
  },
  "CVE-2025-28389": {
    "cvss": 9.8,
    "description": "Weak password requirements in OpenC3 COSMOS v6.0.0 allow attackers to bypass authentication via a brute force attack.",
    "published": "2025-06-13T14:15:21.010",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-49582": {
    "cvss": "-",
    "description": "XWiki is a generic wiki platform. When editing content that contains \"dangerous\" macros like malicious script macros that were authored by a user with fewer rights, XWiki warns about the execution of these macros since XWiki 15.9RC1. These required rights analyzers that trigger these warnings are incomplete, allowing an attacker to hide malicious content. For most macros, the existing analyzers don't consider non-lowercase parameters. Further, most macro parameters that can contain XWiki syntax like titles of information boxes weren't analyzed at all. Similarly, the \"source\" parameters of the content and context macro weren't anylzed even though they could contain arbitrary XWiki syntax. In the worst case, this could allow a malicious to add malicious script macros including Groovy or Python macros to a page that are then executed after another user with programming righs edits the page, thus allowing remote code execution. The required rights analyzers have been made more robust and extended to cover those cases in XWiki 16.4.7, 16.10.3 and 17.0.0.",
    "published": "2025-06-13T17:15:23.180",
    "keywords": "remote,execution"
  },
  "CVE-2025-49586": {
    "cvss": "-",
    "description": "XWiki is an open-source wiki software platform. Any XWiki user with edit right on at least one App Within Minutes application (the default for all users XWiki) can obtain programming right/perform remote code execution by editing the application. This vulnerability has been fixed in XWiki 17.0.0, 16.4.7, and 16.10.3.",
    "published": "2025-06-13T18:15:22.737",
    "keywords": "remote,execution"
  }
}