{
  "CVE-2024-1069": {
    "cvss": 7.2,
    "description": "The Contact Form Entries plugin for WordPress is vulnerable to arbitrary file uploads due to insufficient file validation on the 'view_page' function in versions up to, and including, 1.3.2. This makes it possible for authenticated attackers with administrator-level capabilities or above, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-01-31T03:15:08.573",
    "keywords": "remote,execution"
  },
  "CVE-2024-23637": {
    "url": "https://github.com/octoprint/octoprint/commit/1729d167b4ae4a5835bbc7211b92c6828b1c4125",
    "cvss": 4.2,
    "description": "OctoPrint is a web interface for 3D printer.s OctoPrint versions up until and including 1.9.3 contain a vulnerability that allows malicious admins to change the password of other admin accounts, including their own, without having to repeat their password. An attacker who managed to hijack an admin account might use this to lock out actual admins from their OctoPrint instance. The vulnerability will be patched in version 1.10.0.",
    "published": "2024-01-31T18:15:49.810"
  },
  "CVE-2024-1115": {
    "cvss": 9.8,
    "description": "A vulnerability was found in openBI up to 1.0.8 and classified as critical. This issue affects the function dlfile of the file /application/websocket/controller/Setting.php. The manipulation of the argument phpPath leads to os command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-252473 was assigned to this vulnerability.",
    "published": "2024-01-31T20:15:45.590",
    "keywords": "remote,command"
  },
  "CVE-2024-21626": {
    "url": "https://github.com/opencontainers/runc/commit/02120488a4c0fc487d1ed2867e901eeed7ce8ecf",
    "cvss": 8.6,
    "description": "runc is a CLI tool for spawning and running containers on Linux according to the OCI specification. In runc 1.1.11 and earlier, due to an internal file descriptor leak, an attacker could cause a newly-spawned container process (from runc exec) to have a working directory in the host filesystem namespace, allowing for a container escape by giving access to the host filesystem (\"attack 2\"). The same attack could be used by a malicious image to allow a container process to gain access to the host filesystem through runc run (\"attack 1\"). Variants of attacks 1 and 2 could be also be used to overwrite semi-arbitrary host binaries, allowing for complete container escapes (\"attack 3a\" and \"attack 3b\"). runc 1.1.12 includes patches for this issue. ",
    "published": "2024-01-31T22:15:53.780"
  },
  "CVE-2024-23650": {
    "url": "https://github.com/moby/buildkit/pull/4601",
    "cvss": 5.3,
    "description": "BuildKit is a toolkit for converting source code to build artifacts in an efficient, expressive and repeatable manner. A malicious BuildKit client or frontend could craft a request that could lead to BuildKit daemon crashing with a panic. The issue has been fixed in v0.12.5. As a workaround, avoid using BuildKit frontends from untrusted sources.\n",
    "published": "2024-01-31T22:15:53.990"
  },
  "CVE-2024-24571": {
    "url": "https://github.com/willyxj/facilemanager/commit/0aa850d4b518f10143a4c675142b15caa5872877",
    "cvss": 5.4,
    "description": "facileManager is a modular suite of web apps built with the sysadmin in mind. For the facileManager web application versions 4.5.0 and earlier, we have found that XSS was present in almost all of the input fields as there is insufficient input validation.",
    "published": "2024-01-31T23:15:08.110"
  },
  "CVE-2024-24572": {
    "url": "https://github.com/willyxj/facilemanager/commit/0aa850d4b518f10143a4c675142b15caa5872877",
    "cvss": 6.5,
    "description": "facileManager is a modular suite of web apps built with the sysadmin in mind. In versions 4.5.0 and earlier, the $_REQUEST global array was unsafely called inside an extract() function in admin-logs.php. The PHP file fm-init.php prevents arbitrary manipulation of $_SESSION via the GET/POST parameters. However, it does not prevent manipulation of any other sensitive variables such as $search_sql. Knowing this, an authenticated user with privileges to view site logs can manipulate the search_sql\nvariable by appending a GET parameter search_sql in the URL. The information above means that the checks and SQL injection prevention attempts were rendered unusable.",
    "published": "2024-01-31T23:15:08.337"
  },
  "CVE-2024-24573": {
    "url": "https://github.com/willyxj/facilemanager/commit/0aa850d4b518f10143a4c675142b15caa5872877",
    "cvss": 8.8,
    "description": "facileManager is a modular suite of web apps built with the sysadmin in mind. In versions 4.5.0 and earlier, when a user updates their profile, a POST request containing user information is sent to the endpoint server/fm-modules/facileManager/ajax/processPost.php. It was found that non-admins can arbitrarily set their permissions and grant their non-admin accounts with super user privileges.",
    "published": "2024-01-31T23:15:08.560"
  },
  "CVE-2024-24548": {
    "cvss": "-",
    "description": "Payment EX Ver1.1.5b and earlier allows a remote unauthenticated attacker to obtain the information of the user who purchases merchandise using Payment EX.",
    "published": "2024-02-01T07:15:09.040",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-23832": {
    "cvss": 9.4,
    "description": "Mastodon is a free, open-source social network server based on ActivityPub Mastodon allows configuration of LDAP for authentication. Due to insufficient origin validation in all Mastodon, attackers can impersonate and take over any remote account. Every Mastodon version prior to 3.5.17 is vulnerable, as well as 4.0.x versions prior to 4.0.13, 4.1.x version prior to 4.1.13, and 4.2.x versions prior to 4.2.5.",
    "published": "2024-02-01T17:15:10.677",
    "keywords": "remote,authentication"
  },
  "CVE-2024-24561": {
    "url": "https://github.com/vyperlang/vyper/issues/3756",
    "cvss": 9.8,
    "description": "Vyper is a pythonic Smart Contract Language for the ethereum virtual machine. In versions 0.3.10 and earlier, the bounds check for slices does not account for the ability for start + length to overflow when the values aren't literals. If a slice() function uses a non-literal argument for the start or length variable, this creates the ability for an attacker to overflow the bounds check. This issue can be used to do OOB access to storage, memory or calldata addresses. It can also be used to corrupt the length slot of the respective array.\n\n",
    "published": "2024-02-01T17:15:11.180"
  },
  "CVE-2024-21852": {
    "cvss": 8.8,
    "description": "In Rapid Software LLC's Rapid SCADA versions prior to Version 5.8.4, an attacker can supply a malicious configuration file by utilizing a Zip Slip vulnerability in the unpacking routine to achieve remote code execution.\n",
    "published": "2024-02-01T23:15:10.730",
    "keywords": "remote,execution"
  },
  "CVE-2024-22927": {
    "url": "https://github.com/weng-xianhu/eyoucms/issues/57",
    "cvss": 6.1,
    "description": "Cross Site Scripting (XSS) vulnerability in the func parameter in eyoucms v.1.6.5 allows a remote attacker to run arbitrary code via crafted URL.",
    "published": "2024-02-01T23:15:10.960"
  },
  "CVE-2024-23031": {
    "url": "https://github.com/weng-xianhu/eyoucms/issues/57",
    "cvss": 6.1,
    "description": "Cross Site Scripting (XSS) vulnerability in is_water parameter in eyoucms v.1.6.5 allows a remote attacker to run arbitrary code via crafted URL.",
    "published": "2024-02-01T23:15:11.020"
  },
  "CVE-2024-23032": {
    "url": "https://github.com/weng-xianhu/eyoucms/issues/57",
    "cvss": 6.1,
    "description": "Cross Site Scripting vulnerability in num parameter in eyoucms v.1.6.5 allows a remote attacker to run arbitrary code via crafted URL.",
    "published": "2024-02-01T23:15:11.067"
  },
  "CVE-2024-23033": {
    "url": "https://github.com/weng-xianhu/eyoucms/issues/57",
    "cvss": 6.1,
    "description": "Cross Site Scripting vulnerability in the path parameter in eyoucms v.1.6.5 allows a remote attacker to run arbitrary code via crafted URL.",
    "published": "2024-02-01T23:15:11.113"
  },
  "CVE-2024-23034": {
    "url": "https://github.com/weng-xianhu/eyoucms/issues/57",
    "cvss": 6.1,
    "description": "Cross Site Scripting vulnerability in the input parameter in eyoucms v.1.6.5 allows a remote attacker to run arbitrary code via crafted URL.",
    "published": "2024-02-01T23:15:11.160"
  },
  "CVE-2024-21399": {
    "cvss": 8.3,
    "description": "Microsoft Edge (Chromium-based) Remote Code Execution Vulnerability",
    "published": "2024-02-02T01:15:08.970",
    "keywords": "remote,execution"
  },
  "CVE-2024-22899": {
    "cvss": "-",
    "description": "Vinchin Backup & Recovery v7.2 was discovered to contain an authenticated remote code execution (RCE) vulnerability via the syncNtpTime function.",
    "published": "2024-02-02T02:15:18.073",
    "keywords": "remote,execution"
  },
  "CVE-2024-22900": {
    "cvss": "-",
    "description": "Vinchin Backup & Recovery v7.2 was discovered to contain an authenticated remote code execution (RCE) vulnerability via the setNetworkCardInfo function.",
    "published": "2024-02-02T02:15:18.127",
    "keywords": "remote,execution"
  },
  "CVE-2024-22903": {
    "cvss": "-",
    "description": "Vinchin Backup & Recovery v7.2 was discovered to contain an authenticated remote code execution (RCE) vulnerability via the deleteUpdateAPK function.",
    "published": "2024-02-02T02:15:18.277",
    "keywords": "remote,execution"
  },
  "CVE-2024-22533": {
    "cvss": "-",
    "description": "Before Beetl v3.15.12, the rendering template has a server-side template injection (SSTI) vulnerability. When the incoming template is controllable, it will be filtered by the DefaultNativeSecurityManager blacklist. Because blacklist filtering is not strict, the blacklist can be bypassed, leading to arbitrary code execution.",
    "published": "2024-02-02T03:15:11.210",
    "keywords": "execution,bypass"
  },
  "CVE-2024-1143": {
    "cvss": "-",
    "description": "Central Dogma versions prior to 0.64.0 is vulnerable to Cross-Site Scripting (XSS), which could allow for the leakage of user sessions and subsequent authentication bypass.",
    "published": "2024-02-02T06:15:45.360",
    "keywords": "authentication,bypass,leak"
  },
  "CVE-2024-22851": {
    "cvss": "-",
    "description": "Directory Traversal Vulnerability in LiveConfig before v.2.5.2 allows a remote attacker to obtain sensitive information via a crafted request to the /static/ endpoint.",
    "published": "2024-02-02T09:15:37.473",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-24388": {
    "cvss": "-",
    "description": "Cross-site scripting (XSS) vulnerability in XunRuiCMS versions v4.6.2 and before, allows remote attackers to obtain sensitive information via crafted malicious requests to the background login.",
    "published": "2024-02-02T10:15:08.870",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-0844": {
    "cvss": 4.7,
    "description": "The Popup More Popups, Lightboxes, and more popup modules plugin for WordPress is vulnerable to Local File Inclusion in version 2.1.6 via the ycfChangeElementData() function. This makes it possible for authenticated attackers, with administrator-level access and above, to include and execute arbitrary files ending with \"Form.php\" on the server , allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-02-02T12:15:49.000",
    "keywords": "execution,sensitive,bypass"
  }
}