{
  "CVE-2025-31998": {
    "cvss": 3.5,
    "description": "HCL Unica Centralized Offer Management is vulnerable to poor unhandled exceptions which exposes sensitive information.  An attacker can exploit use this information to exploit known vulnerabilities launch targeted attacks, such as remote code execution or denial of service.",
    "published": "2025-10-12T03:15:34.557",
    "keywords": "remote,execution,sensitive"
  },
  "CVE-2025-11645": {
    "cvss": 2.4,
    "description": "A security vulnerability has been detected in Tomofun Furbo Mobile App up to 7.57.0a on Android. This affects an unknown part of the component Authentication Token Handler. The manipulation leads to insecure storage of sensitive information. It is possible to launch the attack on the physical device. The exploit has been disclosed publicly and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2025-10-12T21:15:33.303",
    "keywords": "authentication,sensitive"
  },
  "CVE-2025-0636": {
    "cvss": 8.4,
    "description": "EMCLI contains a high severity vulnerability where improper neutralization of special elements used in an OS command could be exploited leading to Arbitrary Code Execution.",
    "published": "2025-10-13T07:15:48.883",
    "keywords": "execution,command"
  },
  "CVE-2025-11665": {
    "cvss": 4.7,
    "description": "A vulnerability was detected in D-Link DAP-2695 2.00RC131. This affects the function fwupdater_main of the file rgbin of the component Firmware Update Handler. Performing manipulation results in os command injection. The attack may be initiated remotely. This vulnerability only affects products that are no longer supported by the maintainer.",
    "published": "2025-10-13T07:15:52.023",
    "keywords": "remote,command"
  },
  "CVE-2025-9265": {
    "cvss": "-",
    "description": "A broken authorization vulnerability in Kiloview NDI N30 allows a remote unauthenticated attacker to deactivate user verification, giving them access to state changing actions that should only be initiated by administratorsThis issue affects \n\n Kiloview NDI N30\n\nand was fixed in Firmware version later than  2.02.0246",
    "published": "2025-10-13T07:15:56.677",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-11671": {
    "cvss": 5.3,
    "description": "Uniweb/SoliPACS WebServer developed by EBM Technologies has a Missing Authentication vulnerability, allowing unauthenticated remote attackers to access a specific page to obtain information such as account names and IP addresses.",
    "published": "2025-10-13T08:15:40.333",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2025-11672": {
    "cvss": 5.3,
    "description": "Uniweb/SoliPACS WebServer developed by EBM Technologies has a Missing Authentication vulnerability, allowing unauthenticated remote attackers to access a specific page to obtain user group names.",
    "published": "2025-10-13T08:15:40.550",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2025-11675": {
    "cvss": 7.2,
    "description": "Enterprise Cloud Database developed by Ragic has an Arbitrary File Upload vulnerability, allowing privileged remote attackers to upload and execute web shell backdoors, thereby enabling arbitrary code execution on the server.",
    "published": "2025-10-13T08:15:41.137",
    "keywords": "remote,execution"
  },
  "CVE-2025-10720": {
    "cvss": "-",
    "description": "The WP Private Content Plus through 3.6.2 provides a global content protection feature that requires a password. However, the access control check is based only on the presence of an unprotected client-side cookie. As a result, an unauthenticated attacker can completely bypass the password protection by manually setting the cookie value in their browser.",
    "published": "2025-10-13T10:15:45.590",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2025-37729": {
    "cvss": 9.1,
    "description": "Improper neutralization of special elements used in a template engine in Elastic Cloud Enterprise (ECE) can lead to a malicious actor with Admin access exfiltrating sensitive information and issuing commands via a specially crafted string where Jinjava variables are evaluated.",
    "published": "2025-10-13T14:15:34.533",
    "keywords": "command,sensitive"
  },
  "CVE-2025-62170": {
    "url": "https://github.com/rathena/rathena/commit/af2f3ba33fc03dc6dd510f8cfe84cd9185af748d",
    "cvss": 7.5,
    "description": "rAthena is an open-source cross-platform MMORPG server. A use-after-free vulnerability exists in the RODEX functionality of rAthena's map-server in versions prior to commit af2f3ba. An unauthenticated attacker can exploit this vulnerability via a specific attacking scenario to cause a denial of service by crashing the map-server. This issue has been patched in commit af2f3ba. There are no known workarounds aside from manually applying the patch.",
    "published": "2025-10-13T18:15:34.980"
  },
  "CVE-2025-59836": {
    "cvss": 5.3,
    "description": "Omni manages Kubernetes on bare metal, virtual machines, or in a cloud. Prior to 1.1.5 and 1.0.2, there is a nil pointer dereference vulnerability in the Omni Resource Service allows unauthenticated users to cause a server panic and denial of service by sending empty create/update resource requests through the API endpoints. The vulnerability exists in the isSensitiveSpec function which calls grpcomni.CreateResource without checking if the resource's metadata field is nil. When a resource is created with an empty Metadata field, the CreateResource function attempts to access resource.Metadata.Version causing a segmentation fault. This vulnerability is fixed in 1.1.5 and 1.0.2.",
    "published": "2025-10-13T21:15:34.457",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-61688": {
    "cvss": 8.6,
    "description": "Omni manages Kubernetes on bare metal, virtual machines, or in a cloud. Prior to 1.1.5 and 1.0.2, Omni might leak sensitive information via an API.",
    "published": "2025-10-13T21:15:34.613",
    "keywords": "sensitive,leak"
  },
  "CVE-2025-62174": {
    "url": "https://github.com/mastodon/mastodon/commit/1631fb80e8029d2c5425a03a2297b93f7e225217",
    "cvss": 3.5,
    "description": "Mastodon is a free, open-source social network server based on ActivityPub.  In Mastodon before 4.4.6, 4.3.14, and 4.2.27, when an administrator resets a user account's password via the command-line interface using `bin/tootctl accounts modify --reset-password`, active sessions and access tokens for that account are not revoked. This allows an attacker with access to a previously compromised session or token to continue using the account after the password has been reset. This issue has been patched in versions 4.2.27, 4.3.14, and 4.4.6. No known workarounds exist.",
    "published": "2025-10-13T21:15:34.770"
  },
  "CVE-2025-62364": {
    "cvss": 6.2,
    "description": "text-generation-webui is an open-source web interface for running Large Language Models. In versions through 3.13, a Local File Inclusion vulnerability exists in the character picture upload feature. An attacker can upload a text file containing a symbolic link to an arbitrary file path. When the application processes the upload, it follows the symbolic link and serves the contents of the targeted file through the web interface. This allows an unauthenticated attacker to read sensitive files on the server, potentially exposing system configurations, credentials, and other confidential information. This vulnerability is fixed in 3.14. No known workarounds exist.",
    "published": "2025-10-13T21:15:35.560",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-9713": {
    "cvss": 8.8,
    "description": "Path traversal in Ivanti Endpoint Manager allows a remote unauthenticated attacker to achieve remote code execution. User interaction is required.",
    "published": "2025-10-13T21:15:35.727",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2025-59889": {
    "cvss": 8.6,
    "description": "Improper authentication of library files in the Eaton IPP software installer could lead to arbitrary code execution of an attacker with the access to the software package.",
    "published": "2025-10-14T06:15:34.810",
    "keywords": "execution,authentication"
  },
  "CVE-2025-41703": {
    "cvss": 7.5,
    "description": "An unauthenticated remote attacker can cause a Denial of Service by turning off the output of the UPS via Modbus command.",
    "published": "2025-10-14T08:15:34.763",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2025-41705": {
    "cvss": 6.8,
    "description": "An unauthenticated remote attacker (MITM) can intercept the websocket messages to gain access to the login credentials for the Webfrontend.",
    "published": "2025-10-14T08:15:35.650",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-41706": {
    "cvss": 5.3,
    "description": "The webserver is vulnerable to a denial of service condition. An unauthenticated remote attacker can craft a special GET request with an over-long content-length to trigger the issue without affecting the core functionality.",
    "published": "2025-10-14T08:15:35.820",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-41707": {
    "cvss": 5.3,
    "description": "The websocket handler is vulnerable to a denial of service condition. An unauthenticated remote attacker can send a crafted websocket message to trigger the issue without affecting the core functionality.",
    "published": "2025-10-14T08:15:36.000",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-41699": {
    "cvss": 8.8,
    "description": "An low privileged remote attacker with an account for the Web-based management can change the system configuration to perform a command injection as root, resulting in a total loss of confidentiality, availability and integrity due to improper control of generation of code ('Code Injection').",
    "published": "2025-10-14T09:15:32.830",
    "keywords": "remote,command"
  },
  "CVE-2025-41718": {
    "cvss": 7.5,
    "description": "A cleartext transmission of sensitive information vulnerability in the affected products allows an unauthorized remote attacker to gain login credentials and access the Web-UI.",
    "published": "2025-10-14T09:15:33.040",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-46581": {
    "cvss": 9.8,
    "description": "ZTE's ZXCDN product  is affected by a Struts remote code execution (RCE) vulnerability. An unauthenticated attacker can remotely execute commands with non-root privileges.",
    "published": "2025-10-14T09:15:33.227",
    "keywords": "remote,execution,unauthenticated,command"
  },
  "CVE-2025-20709": {
    "cvss": 8.8,
    "description": "In wlan AP driver, there is a possible out of bounds write due to an incorrect bounds check. This could lead to remote (proximal/adjacent) escalation of privilege with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: WCNCR00415809; Issue ID: MSV-3405.",
    "published": "2025-10-14T10:15:35.300",
    "keywords": "remote,execution"
  },
  "CVE-2025-20710": {
    "cvss": 8.8,
    "description": "In wlan AP driver, there is a possible out of bounds write due to an integer overflow. This could lead to remote (proximal/adjacent) escalation of privilege with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: WCNCR00418785; Issue ID: MSV-3515.",
    "published": "2025-10-14T10:15:35.443",
    "keywords": "remote,execution"
  },
  "CVE-2025-20711": {
    "cvss": 8.8,
    "description": "In wlan AP driver, there is a possible out of bounds write due to an incorrect bounds check. This could lead to remote (proximal/adjacent) escalation of privilege with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: WCNCR00422399; Issue ID: MSV-3748.",
    "published": "2025-10-14T10:15:35.580",
    "keywords": "remote,execution"
  },
  "CVE-2025-20712": {
    "cvss": 8.8,
    "description": "In wlan AP driver, there is a possible out of bounds write due to an incorrect bounds check. This could lead to remote (proximal/adjacent) escalation of privilege with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: WCNCR00422323; Issue ID: MSV-3810.",
    "published": "2025-10-14T10:15:35.717",
    "keywords": "remote,execution"
  },
  "CVE-2025-20719": {
    "cvss": 8.8,
    "description": "In wlan AP driver, there is a possible out of bounds write due to an incorrect bounds check. This could lead to remote (proximal/adjacent) escalation of privilege with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: WCNCR00418955; Issue ID: MSV-3570.",
    "published": "2025-10-14T10:15:36.637",
    "keywords": "remote,execution"
  },
  "CVE-2025-20720": {
    "cvss": 8.8,
    "description": "In wlan AP driver, there is a possible out of bounds write due to an incorrect bounds check. This could lead to remote (proximal/adjacent) escalation of privilege with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: WCNCR00418954; Issue ID: MSV-3569.",
    "published": "2025-10-14T10:15:36.777",
    "keywords": "remote,execution"
  },
  "CVE-2025-40765": {
    "cvss": 9.8,
    "description": "A vulnerability has been identified in TeleControl Server Basic V3.1 (All versions >= V3.1.2.2 < V3.1.2.3). The affected application contains an information disclosure vulnerability. This could allow an unauthenticated remote attacker to obtain password hashes of users and to login to and perform authenticated operations of the database service.",
    "published": "2025-10-14T10:15:38.127",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-40771": {
    "cvss": 9.8,
    "description": "A vulnerability has been identified in SIMATIC CP 1542SP-1 (6GK7542-6UX00-0XE0) (All versions < V2.4.24), SIMATIC CP 1542SP-1 IRC (6GK7542-6VX00-0XE0) (All versions < V2.4.24), SIMATIC CP 1543SP-1 (6GK7543-6WX00-0XE0) (All versions < V2.4.24), SIPLUS ET 200SP CP 1542SP-1 IRC TX RAIL (6AG2542-6VX00-4XE0) (All versions < V2.4.24), SIPLUS ET 200SP CP 1543SP-1 ISEC (6AG1543-6WX00-7XE0) (All versions < V2.4.24), SIPLUS ET 200SP CP 1543SP-1 ISEC TX RAIL (6AG2543-6WX00-4XE0) (All versions < V2.4.24). Affected devices do not properly authenticate configuration connections. This could allow an unauthenticated remote attacker to access the configuration data.",
    "published": "2025-10-14T10:15:38.297",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-9063": {
    "cvss": "-",
    "description": "An authentication bypass security issue exists within FactoryTalk View Machine Edition  Web Browser ActiveX control. Exploitation of this vulnerability allows unauthorized access to the PanelView Plus 7 Series B, including access to the file system, retrieval of diagnostic information, event logs, and more.",
    "published": "2025-10-14T13:15:39.480",
    "keywords": "authentication,bypass"
  }
}