{
  "CVE-2024-5431": {
    "cvss": 8.8,
    "description": "The WPCafe – Online Food Ordering, Restaurant Menu, Delivery, and Reservations for WooCommerce plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 2.2.25 via the reservation_extra_field shortcode parameter. This makes it possible for authenticated attackers, with Contributor-level access and above, to include remote files on the server, potentially resulting in code execution",
    "published": "2024-06-25T06:15:11.800",
    "keywords": "remote,execution"
  },
  "CVE-2024-6028": {
    "cvss": 9.8,
    "description": "The Quiz Maker plugin for WordPress is vulnerable to time-based SQL Injection via the 'ays_questions' parameter in all versions up to, and including, 6.5.8.3 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-06-25T09:15:57.760",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-5216": {
    "url": "https://github.com/mintplex-labs/anything-llm/commit/3ef009de73c837f9025df8bba62572885c70c72f",
    "cvss": 7.5,
    "description": "A vulnerability in mintplex-labs/anything-llm allows for a Denial of Service (DoS) condition due to uncontrolled resource consumption. Specifically, the issue arises from the application's failure to limit the size of usernames, enabling attackers to create users with excessively bulky texts in the username field. This exploit results in the user management panel becoming unresponsive, preventing administrators from performing critical user management actions such as editing, suspending, or deleting users. The impact of this vulnerability includes administrative paralysis, compromised security, and operational disruption, as it allows malicious users to perpetuate their presence within the system indefinitely, undermines the system's security posture, and degrades overall system performance.",
    "published": "2024-06-25T11:15:50.193"
  },
  "CVE-2024-4846": {
    "cvss": "-",
    "description": "Authentication bypass in the 2FA feature in Devolutions Server 2024.1.14.0 and earlier allows an authenticated attacker to authenticate to another user without being asked for the 2FA via another browser tab.",
    "published": "2024-06-25T13:15:50.120",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-21827": {
    "cvss": 7.2,
    "description": "A leftover debug code vulnerability exists in the cli_server debug functionality of Tp-Link ER7206 Omada Gigabit VPN Router 1.4.1 Build 20240117 Rel.57421. A specially crafted series of network requests can lead to arbitrary command execution. An attacker can send a sequence of requests to trigger this vulnerability.",
    "published": "2024-06-25T14:15:10.940",
    "keywords": "execution,command,vpn"
  },
  "CVE-2024-38951": {
    "url": "https://github.com/px4/px4-autopilot/issues/23251",
    "cvss": "-",
    "description": "A buffer overflow in PX4-Autopilot v1.12.3 allows attackers to cause a Denial of Service (DoS) via a crafted MavLink message.",
    "published": "2024-06-25T14:15:12.403"
  },
  "CVE-2024-38952": {
    "url": "https://github.com/px4/px4-autopilot/issues/23258",
    "cvss": "-",
    "description": "PX4-Autopilot v1.14.3 was discovered to contain a buffer overflow via the topic_name parameter at /logger/logged_topics.cpp.",
    "published": "2024-06-25T14:15:12.517"
  },
  "CVE-2024-37085": {
    "cvss": 6.8,
    "description": "VMware ESXi contains an authentication bypass vulnerability. A malicious actor with sufficient Active Directory (AD) permissions can gain full access to an ESXi host that was previously  configured to use AD for user management https://blogs.vmware.com/vsphere/2012/09/joining-vsphere-hosts-to-active-directory.html  by re-creating the configured AD group ('ESXi Admins' by default) after it was deleted from AD.",
    "published": "2024-06-25T15:15:12.377",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-5805": {
    "cvss": 9.1,
    "description": "Improper Authentication vulnerability in Progress MOVEit Gateway (SFTP modules) allows Authentication Bypass.This issue affects MOVEit Gateway: 2024.0.0.",
    "published": "2024-06-25T15:15:15.603",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-5806": {
    "cvss": 9.1,
    "description": "Improper Authentication vulnerability in Progress MOVEit Transfer (SFTP module) can lead to Authentication Bypass.This issue affects MOVEit Transfer: from 2023.0.0 before 2023.0.11, from 2023.1.0 before 2023.1.6, from 2024.0.0 before 2024.0.2.",
    "published": "2024-06-25T15:15:15.850",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-5988": {
    "cvss": "-",
    "description": "Due to an improper input validation, an unauthenticated threat actor can send a malicious message to invoke a local or remote executable and cause a remote code execution condition on the Rockwell Automation ThinManager® ThinServer™.",
    "published": "2024-06-25T16:15:24.937",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-5989": {
    "cvss": "-",
    "description": "Due to an improper input validation, an unauthenticated threat actor can send a malicious message to invoke SQL injection into the program and cause a remote code execution condition on the Rockwell Automation ThinManager® ThinServer™.",
    "published": "2024-06-25T16:15:25.363",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-6238": {
    "url": "https://github.com/pgadmin-org/pgadmin4/issues/7605",
    "cvss": 7.4,
    "description": "pgAdmin <= 8.8 has an installation Directory permission issue. Because of this issue, attackers can gain unauthorised access to the installation directory on the Debian or RHEL 8 platforms.",
    "published": "2024-06-25T16:15:25.727"
  },
  "CVE-2024-36819": {
    "url": "https://github.com/ramonsilva20/mapos/commit/3559bae4782162faab94670f503fd35b0f331929",
    "cvss": "-",
    "description": "MAP-OS 4.45.0 and earlier is vulnerable to Cross-Site Scripting (XSS). This vulnerability allows malicious users to insert a malicious payload into the \"Client Name\" input. When a service order from this client is created, the malicious payload is displayed on the administrator and employee dashboards, resulting in unauthorized script execution whenever the dashboard is loaded.",
    "published": "2024-06-25T19:15:11.837"
  },
  "CVE-2024-37820": {
    "url": "https://github.com/pingcap/tidb/issues/53580",
    "cvss": "-",
    "description": "A nil pointer dereference in PingCAP TiDB v8.2.0-alpha-216-gfe5858b allows attackers to crash the application via expression.inferCollation.",
    "published": "2024-06-25T19:15:11.943"
  },
  "CVE-2024-4498": {
    "cvss": 7.7,
    "description": "A Path Traversal and Remote File Inclusion (RFI) vulnerability exists in the parisneo/lollms-webui application, affecting versions v9.7 to the latest. The vulnerability arises from insufficient input validation in the `/apply_settings` function, allowing an attacker to manipulate the `discussion_db_name` parameter to traverse the file system and include arbitrary files. This issue is compounded by the bypass of input filtering in the `install_binding`, `reinstall_binding`, and `unInstall_binding` endpoints, despite the presence of a `sanitize_path_from_endpoint(data.name)` filter. Successful exploitation enables an attacker to upload and execute malicious code on the victim's system, leading to Remote Code Execution (RCE).",
    "published": "2024-06-25T20:15:12.127",
    "keywords": "remote,execution,bypass"
  },
  "CVE-2024-4883": {
    "cvss": 9.8,
    "description": "In WhatsUp Gold versions released before 2023.1.3, a Remote Code Execution issue exists in Progress WhatsUp Gold. This vulnerability allows an unauthenticated attacker to achieve the RCE as a service account through NmApi.exe.",
    "published": "2024-06-25T20:15:12.320",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-4884": {
    "cvss": 9.8,
    "description": "In WhatsUp Gold versions released before 2023.1.3, an unauthenticated Remote Code Execution vulnerability in Progress WhatsUpGold.  The Apm.UI.Areas.APM.Controllers.CommunityController\n\n allows execution of commands with iisapppool\\nmconsole privileges.",
    "published": "2024-06-25T20:15:12.547",
    "keywords": "remote,execution,unauthenticated,command"
  },
  "CVE-2024-4885": {
    "cvss": 9.8,
    "description": "In WhatsUp Gold versions released before 2023.1.3, an unauthenticated Remote Code Execution vulnerability in Progress WhatsUpGold.  The \n\nWhatsUp.ExportUtilities.Export.GetFileWithoutZip\n\n\n\n allows execution of commands with iisapppool\\nmconsole privileges.",
    "published": "2024-06-25T20:15:12.970",
    "keywords": "remote,execution,unauthenticated,command"
  },
  "CVE-2024-5010": {
    "cvss": 7.5,
    "description": "In WhatsUp Gold versions released before 2023.1.3, a vulnerability exists in the TestController functionality.  A specially crafted \n\nunauthenticated\n\nHTTP request can lead to a disclosure of sensitive information.",
    "published": "2024-06-25T20:15:13.617",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-37855": {
    "cvss": "-",
    "description": "An issue in Nepstech Wifi Router xpon (terminal) NTPL-Xpon1GFEVN, hardware verstion 1.0 firmware 2.0.1 allows a remote attacker to execute arbitrary code via the router's Telnet port 2345 without requiring authentication credentials.",
    "published": "2024-06-25T21:15:59.867",
    "keywords": "remote,authentication"
  },
  "CVE-2024-5012": {
    "cvss": 8.6,
    "description": "In WhatsUp Gold versions released before 2023.1.3, there is a missing authentication vulnerability in WUGDataAccess.Credentials. This vulnerability allows unauthenticated attackers to disclose Windows Credentials stored in the product Credential Library.",
    "published": "2024-06-25T21:16:00.320",
    "keywords": "unauthenticated,authentication"
  },
  "CVE-2024-5016": {
    "cvss": 7.2,
    "description": "In WhatsUp Gold versions released before 2023.1.3, Distributed Edition installations can be exploited by using a deserialization tool to achieve a Remote Code Execution as SYSTEM. \nThe vulnerability exists in the main message processing routines NmDistributed.DistributedServiceBehavior.OnMessage for server and NmDistributed.DistributedClient.OnMessage for clients.",
    "published": "2024-06-25T21:16:01.163",
    "keywords": "remote,execution"
  },
  "CVE-2024-29954": {
    "cvss": 5.9,
    "description": "A vulnerability in a password management API in Brocade Fabric OS versions before v9.2.1, v9.2.0b, v9.1.1d, and v8.2.3e prints sensitive information in log files. This could allow an authenticated user to view the server passwords for protocols such as scp and sftp.\n\nDetail.\nWhen the firmwaredownload command is incorrectly entered or points to an erroneous file, the firmware download log captures the failed command, including any password entered in the command line.",
    "published": "2024-06-26T00:15:10.263",
    "keywords": "command,sensitive"
  },
  "CVE-2024-29174": {
    "cvss": 4.4,
    "description": "Dell Data Domain, versions prior to 7.13.0.0, LTS 7.7.5.30, LTS 7.10.1.20 contain an SQL Injection vulnerability. A local low privileged attacker could potentially exploit this vulnerability, leading to the execution of certain SQL commands on the application's backend database causing unauthorized access to application data.",
    "published": "2024-06-26T03:15:10.100",
    "keywords": "execution,command"
  },
  "CVE-2024-29175": {
    "cvss": 5.9,
    "description": "Dell PowerProtect Data Domain, versions prior to 7.13.0.0, LTS 7.7.5.40, LTS 7.10.1.30 contain an weak cryptographic algorithm vulnerability. A remote unauthenticated attacker could potentially exploit this vulnerability, leading to man-in-the-middle attack that exposes sensitive session information.",
    "published": "2024-06-26T03:15:10.303",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-29176": {
    "cvss": 8.8,
    "description": "Dell PowerProtect DD, versions prior to 8.0, LTS 7.13.1.0, LTS 7.10.1.30, LTS 7.7.5.40 contain a buffer overflow vulnerability. A remote low privileged attacker could potentially exploit this vulnerability, leading to an application crash or execution of arbitrary code on the vulnerable application's underlying operating system with privileges of the vulnerable application.",
    "published": "2024-06-26T03:15:10.533",
    "keywords": "remote,execution"
  },
  "CVE-2024-29177": {
    "cvss": 2.7,
    "description": "Dell PowerProtect DD, versions prior to 8.0, LTS 7.13.1.0, LTS 7.10.1.30, LTS 7.7.5.40 contain a disclosure of temporary sensitive information vulnerability. A remote high privileged attacker could potentially exploit this vulnerability, leading to the reuse of disclosed information to gain unauthorized access to the application report.",
    "published": "2024-06-26T03:15:10.767",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-5181": {
    "cvss": 9.8,
    "description": "A command injection vulnerability exists in the mudler/localai version 2.14.0. The vulnerability arises from the application's handling of the backend parameter in the configuration file, which is used in the name of the initialized process. An attacker can exploit this vulnerability by manipulating the path of the vulnerable binary file specified in the backend parameter, allowing the execution of arbitrary code on the system. This issue is due to improper neutralization of special elements used in an OS command, leading to potential full control over the affected system.",
    "published": "2024-06-26T03:15:10.987",
    "keywords": "execution,command"
  },
  "CVE-2024-37140": {
    "cvss": 8.8,
    "description": "Dell PowerProtect DD, versions prior to 8.0, LTS 7.13.1.0, LTS 7.10.1.30, LTS 7.7.5.40 contain an OS command injection vulnerability in an admin operation. A remote low privileged attacker could potentially exploit this vulnerability, leading to the execution of arbitrary OS commands on the system application's underlying OS with the privileges of the vulnerable application. Exploitation may lead to a system take over by an attacker.",
    "published": "2024-06-26T04:15:13.667",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-4228": {
    "cvss": 9.8,
    "description": "Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection'), CWE - 200 - Exposure of Sensitive Information to an Unauthorized Actor, CWE - 522 - Insufficiently Protected Credentials vulnerability in Magarsus Consultancy SSO (Single Sign On) allows SQL Injection.This issue affects SSO (Single Sign On): from 1.0 before 1.1.",
    "published": "2024-06-26T15:15:19.977",
    "keywords": "command,sensitive"
  },
  "CVE-2024-38271": {
    "url": "https://github.com/google/nearby/pull/2433",
    "cvss": "-",
    "description": "There exists a vulnerability in Quickshare/Nearby where an attacker can force the a victim to stay connected to a temporary hotspot created for the share. As part of the sequence of packets in a QuickShare connection over Bluetooth, the attacker forces the victim to connect to the attacker’s WiFi network and then sends an OfflineFrame that crashes Quick Share.\nThis makes the Wifi connection to the attacker’s network last instead of returning to the old network when the Quick Share session is done allowing the attacker to be a MiTM. We recommend upgrading to version 1.0.1724.0 of Quickshare or above",
    "published": "2024-06-26T16:15:11.560"
  },
  "CVE-2024-38272": {
    "url": "https://github.com/google/nearby/pull/2402",
    "cvss": "-",
    "description": "There exists a vulnerability in Quickshare/Nearby where an attacker can bypass the accept file dialog on QuickShare Windows. Normally in QuickShare Windows app we can't send a file without the user accept from the receiving device if the visibility is set to everyone mode or contacts mode. We recommend upgrading to version 1.0.1724.0 of Quickshare or above",
    "published": "2024-06-26T16:15:11.733"
  },
  "CVE-2024-6354": {
    "cvss": "-",
    "description": "Improper access control in PAM dashboard in Devolutions Remote Desktop Manager 2024.2.11 and earlier on Windows allows an authenticated user to bypass the execute permission via the use of the PAM dashboard.",
    "published": "2024-06-26T17:15:27.497",
    "keywords": "remote,bypass"
  },
  "CVE-2024-35545": {
    "url": "https://github.com/ramonsilva20/mapos/commit/3559bae4782162faab94670f503fd35b0f331929",
    "cvss": "-",
    "description": "MAP-OS v4.45.0 and earlier was discovered to contain a cross-site scripting (XSS) vulnerability.",
    "published": "2024-06-26T18:15:14.940"
  },
  "CVE-2024-33329": {
    "cvss": "-",
    "description": "A hardcoded privileged ID within Lumisxp v15.0.x to v16.1.x allows attackers to bypass authentication and access internal pages and other sensitive information.",
    "published": "2024-06-26T19:15:13.453",
    "keywords": "authentication,sensitive,bypass"
  },
  "CVE-2024-38949": {
    "url": "https://github.com/strukturag/libde265/issues/460",
    "cvss": "-",
    "description": "Heap Buffer Overflow vulnerability in Libde265 v1.0.15 allows attackers to crash the application via crafted payload to display444as420 function at sdl.cc",
    "published": "2024-06-26T20:15:16.263"
  },
  "CVE-2024-38950": {
    "url": "https://github.com/strukturag/libde265/issues/460",
    "cvss": "-",
    "description": "Heap Buffer Overflow vulnerability in Libde265 v1.0.15 allows attackers to crash the application via crafted payload to __interceptor_memcpy function.",
    "published": "2024-06-26T20:15:16.367"
  },
  "CVE-2024-1839": {
    "cvss": 10.0,
    "description": "Intrado 911 Emergency Gateway login form is vulnerable to an unauthenticated blind time-based SQL injection, which may allow an unauthenticated remote attacker to execute malicious code, exfiltrate data, or manipulate the database.",
    "published": "2024-06-26T21:15:12.597",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-6054": {
    "cvss": 8.8,
    "description": "The Auto Featured Image plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the 'create_post_attachment_from_url' function in all versions up to, and including, 1.2. This makes it possible for authenticated attackers, with contributor-level and above permissions, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-06-27T03:15:50.890",
    "keywords": "remote,execution"
  },
  "CVE-2024-6367": {
    "cvss": 3.5,
    "description": "A vulnerability was found in LabVantage LIMS 2017. It has been declared as problematic. This vulnerability affects unknown code of the file /labvantage/rc?command=file&file=WEB-CORE/elements/files/filesembedded.jsp of the component POST Request Handler. The manipulation of the argument sdcid/keyid1/keyid2/keyid3 leads to cross site scripting. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-269800. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-06-27T12:15:29.653",
    "keywords": "remote,command"
  },
  "CVE-2024-6368": {
    "cvss": 3.5,
    "description": "A vulnerability was found in LabVantage LIMS 2017. It has been rated as problematic. This issue affects some unknown processing of the file /labvantage/rc?command=page of the component POST Request Handler. The manipulation of the argument param1 leads to cross site scripting. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-269801 was assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-06-27T12:15:30.240",
    "keywords": "remote,command"
  },
  "CVE-2024-6369": {
    "cvss": 3.5,
    "description": "A vulnerability classified as problematic has been found in LabVantage LIMS 2017. Affected is an unknown function of the file /labvantage/rc?command=page&sdcid=LV_ReagentLot of the component POST Request Handler. The manipulation of the argument mode leads to cross site scripting. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. VDB-269802 is the identifier assigned to this vulnerability.",
    "published": "2024-06-27T12:15:30.750",
    "keywords": "remote,command"
  },
  "CVE-2024-6370": {
    "cvss": 3.5,
    "description": "A vulnerability classified as problematic was found in LabVantage LIMS 2017. Affected by this vulnerability is an unknown functionality of the file /labvantage/rc?command=file&file=WEB-OPAL/pagetypes/bulletins/sendbulletin.jsp of the component POST Request Handler. The manipulation of the argument bulletinbody leads to cross site scripting. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-269803.",
    "published": "2024-06-27T12:15:31.207",
    "keywords": "remote,command"
  },
  "CVE-2024-28820": {
    "url": "https://github.com/threerings/openvpn-auth-ldap/pull/92",
    "cvss": "-",
    "description": "Buffer overflow in the extract_openvpn_cr function in openvpn-cr.c in openvpn-auth-ldap (aka the Three Rings Auth-LDAP plugin for OpenVPN) 2.0.4 allows attackers with a valid LDAP username and who can control the challenge/response password field to pass a string with more than 14 colons into this field and cause a buffer overflow.",
    "published": "2024-06-27T16:15:10.950"
  },
  "CVE-2024-39375": {
    "cvss": "-",
    "description": "TELSAT marKoni FM Transmitters are vulnerable to an attacker bypassing authentication and gaining administrator privileges.",
    "published": "2024-06-27T16:15:11.733",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-31916": {
    "cvss": 7.5,
    "description": "IBM OpenBMC FW1050.00 through FW1050.10 BMCWeb HTTPS server component could disclose sensitive URI content to an unauthorized actor that bypasses authentication channels.  IBM X-ForceID:  290026.",
    "published": "2024-06-27T18:15:17.857",
    "keywords": "authentication,sensitive,bypass"
  },
  "CVE-2024-35260": {
    "cvss": 8.0,
    "description": "Microsoft Dataverse Remote Code Execution Vulnerability",
    "published": "2024-06-27T18:15:18.973",
    "keywords": "remote,execution"
  },
  "CVE-2024-5334": {
    "url": "https://github.com/stitionai/devika/commit/6acce21fb08c3d1123ef05df6a33912bf0ee77c2",
    "cvss": 7.5,
    "description": "External Control of File Name or Path in GitHub repository stitionai/devika prior to -.",
    "published": "2024-06-27T18:15:20.223"
  },
  "CVE-2024-5547": {
    "url": "https://github.com/stitionai/devika/commit/6acce21fb08c3d1123ef05df6a33912bf0ee77c2",
    "cvss": 7.5,
    "description": "Relative Path Traversal in GitHub repository stitionai/devika prior to -.",
    "published": "2024-06-27T18:15:20.493"
  },
  "CVE-2024-5548": {
    "url": "https://github.com/stitionai/devika/commit/6acce21fb08c3d1123ef05df6a33912bf0ee77c2",
    "cvss": 7.5,
    "description": "Path Traversal in GitHub repository stitionai/devika prior to -.",
    "published": "2024-06-27T18:15:20.733"
  },
  "CVE-2024-2882": {
    "cvss": "-",
    "description": "SDG Technologies PnPSCADA allows a remote attacker to attach various entities without requiring system authentication. This breach could potentially lead to unauthorized control, data manipulation, and access to sensitive information within the SCADA system.",
    "published": "2024-06-27T19:15:13.667",
    "keywords": "remote,authentication,sensitive"
  },
  "CVE-2024-5751": {
    "cvss": 9.8,
    "description": "BerriAI/litellm version v1.35.8 contains a vulnerability where an attacker can achieve remote code execution. The vulnerability exists in the `add_deployment` function, which decodes and decrypts environment variables from base64 and assigns them to `os.environ`. An attacker can exploit this by sending a malicious payload to the `/config/update` endpoint, which is then processed and executed by the server when the `get_secret` function is triggered. This requires the server to use Google KMS and a database to store a model.",
    "published": "2024-06-27T19:15:16.160",
    "keywords": "remote,execution"
  },
  "CVE-2024-5822": {
    "cvss": 7.3,
    "description": "A Server-Side Request Forgery (SSRF) vulnerability exists in the upload processing interface of gaizhenbiao/ChuanhuChatGPT versions <= ChuanhuChatGPT-20240410-git.zip. This vulnerability allows attackers to send crafted requests from the vulnerable server to internal or external resources, potentially bypassing security controls and accessing sensitive data.",
    "published": "2024-06-27T19:15:16.880",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-5824": {
    "cvss": 7.4,
    "description": "A path traversal vulnerability in the `/set_personality_config` endpoint of parisneo/lollms version 9.4.0 allows an attacker to overwrite the `configs/config.yaml` file. This can lead to remote code execution by changing server configuration properties such as `force_accept_remote_access` and `turn_on_code_validation`.",
    "published": "2024-06-27T19:15:17.117",
    "keywords": "remote,execution"
  },
  "CVE-2024-5826": {
    "cvss": 9.8,
    "description": "In the latest version of vanna-ai/vanna, the `vanna.ask` function is vulnerable to remote code execution due to prompt injection. The root cause is the lack of a sandbox when executing LLM-generated code, allowing an attacker to manipulate the code executed by the `exec` function in `src/vanna/base/base.py`. This vulnerability can be exploited by an attacker to achieve remote code execution on the app backend server, potentially gaining full control of the server.",
    "published": "2024-06-27T19:15:17.350",
    "keywords": "remote,execution"
  },
  "CVE-2024-5980": {
    "cvss": 9.1,
    "description": "A vulnerability in the /v1/runs API endpoint of lightning-ai/pytorch-lightning v2.2.4 allows attackers to exploit path traversal when extracting tar.gz files. When the LightningApp is running with the plugin_server, attackers can deploy malicious tar.gz plugins that embed arbitrary files with path traversal vulnerabilities. This can result in arbitrary files being written to any directory in the victim's local file system, potentially leading to remote code execution.",
    "published": "2024-06-27T19:15:18.803",
    "keywords": "remote,execution"
  },
  "CVE-2024-6085": {
    "cvss": 8.6,
    "description": "A path traversal vulnerability exists in the XTTS server included in the lollms package, version v9.6. This vulnerability arises from the ability to perform an unauthenticated root folder settings change. Although the read file endpoint is protected against path traversals, this protection can be bypassed by changing the root folder to '/'. This allows attackers to read arbitrary files on the system. Additionally, the output folders can be changed to write arbitrary audio files to any location on the system.",
    "published": "2024-06-27T19:15:19.287",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2024-39129": {
    "url": "https://github.com/wangf1978/dumpts/issues/19",
    "cvss": "-",
    "description": "Heap Buffer Overflow vulnerability in DumpTS v0.1.0-nightly allows attackers to cause a denial of service via the function PushTSBuf() at /src/PayloadBuf.cpp.",
    "published": "2024-06-27T20:15:22.277"
  },
  "CVE-2024-39130": {
    "url": "https://github.com/wangf1978/dumpts/issues/20",
    "cvss": "-",
    "description": "A NULL Pointer Dereference discovered in DumpTS v0.1.0-nightly allows attackers to cause a denial of service via the function DumpOneStream() at /src/DumpStream.cpp.",
    "published": "2024-06-27T20:15:22.370"
  },
  "CVE-2024-39133": {
    "url": "https://github.com/gdraheim/zziplib/issues/164",
    "cvss": "-",
    "description": "Heap Buffer Overflow vulnerability in zziplib v0.13.77 allows attackers to cause a denial of service via the __zzip_parse_root_directory() function at /zzip/zip.c.",
    "published": "2024-06-27T20:15:22.463"
  },
  "CVE-2024-6127": {
    "cvss": 9.8,
    "description": "BC Security Empire before 5.9.3 is vulnerable to a path traversal issue that can lead to remote code execution. A remote, unauthenticated attacker can exploit this vulnerability over HTTP by acting as a normal agent, completing all cryptographic handshakes, and then triggering an upload of payload data containing a malicious path.",
    "published": "2024-06-27T20:15:23.093",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-2973": {
    "cvss": 10.0,
    "description": "An Authentication Bypass Using an Alternate Path or Channel vulnerability in Juniper Networks Session Smart Router or conductor running with a redundant peer allows a network based attacker to bypass authentication and take full control of the device.\nOnly routers or conductors that are running in high-availability redundant configurations are affected by this vulnerability.\n\n\n\n\nNo other Juniper Networks products or platforms are affected by this issue.\n\n\n\n\n\nThis issue affects:\n\nSession Smart Router: \n\n\n\n  *  All versions before 5.6.15, \n  *  from 6.0 before 6.1.9-lts, \n  *  from 6.2 before 6.2.5-sts.\n\n\n\nSession Smart Conductor: \n\n\n\n  *  All versions before 5.6.15, \n  *  from 6.0 before 6.1.9-lts, \n  *  from 6.2 before 6.2.5-sts. \n\n\n\nWAN Assurance Router: \n\n\n\n  *  6.0 versions before 6.1.9-lts, \n  *  6.2 versions before 6.2.5-sts.",
    "published": "2024-06-27T21:15:15.037",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-36072": {
    "cvss": "-",
    "description": "Netwrix CoSoSys Endpoint Protector through 5.9.3 and CoSoSys Unify through 7.0.6 contain a remote code execution vulnerability in the logging component of the Endpoint Protector and Unify server application which allows an unauthenticated remote attacker to send a malicious request, resulting in the ability to execute system commands with root privileges.",
    "published": "2024-06-27T21:15:15.327",
    "keywords": "remote,execution,unauthenticated,command"
  },
  "CVE-2024-36073": {
    "cvss": "-",
    "description": "Netwrix CoSoSys Endpoint Protector through 5.9.3 and CoSoSys Unify through 7.0.6 contain a remote code execution vulnerability in the shadowing component of the Endpoint Protector and Unify agent which allows an attacker with administrative access to the Endpoint Protector or Unify server to overwrite sensitive configuration and subsequently execute system commands with SYSTEM/root privileges on a chosen client endpoint.",
    "published": "2024-06-27T21:15:15.420",
    "keywords": "remote,execution,command,sensitive"
  },
  "CVE-2024-36074": {
    "cvss": "-",
    "description": "Netwrix CoSoSys Endpoint Protector through 5.9.3 and CoSoSys Unify through 7.0.6 contain a remote code execution vulnerability in the Endpoint Protector and Unify agent in the way that the EasyLock dependency is acquired from the server. An attacker with administrative access to the Endpoint Protector or Unify server can cause a client to acquire and execute a malicious file resulting in remote code execution.",
    "published": "2024-06-27T21:15:15.520",
    "keywords": "remote,execution"
  },
  "CVE-2024-36075": {
    "cvss": "-",
    "description": "Netwrix CoSoSys Endpoint Protector through 5.9.3 and CoSoSys Unify through 7.0.6 contain a remote code execution vulnerability in the application configuration component of the Endpoint Protector and Unify agent which allows a remote, unauthenticated attacker to manipulate the configuration of either their own or another client endpoint resulting in the bypass of certain configuration options. Manipulation of the application configuration can result in local policy bypass and in some scenarios remote code execution.",
    "published": "2024-06-27T21:15:15.610",
    "keywords": "remote,execution,unauthenticated,bypass"
  },
  "CVE-2024-39132": {
    "url": "https://github.com/wangf1978/dumpts/issues/22",
    "cvss": "-",
    "description": "A NULL Pointer Dereference vulnerability in DumpTS v0.1.0-nightly allows attackers to cause a denial of service via the function VerifyCommandLine() at /src/DumpTS.cpp.",
    "published": "2024-06-27T21:15:15.790"
  },
  "CVE-2024-39134": {
    "url": "https://github.com/gdraheim/zziplib/issues/165",
    "cvss": "-",
    "description": "A Stack Buffer Overflow vulnerability in zziplibv 0.13.77 allows attackers to cause a denial of service via the __zzip_fetch_disk_trailer() function at /zzip/zip.c.",
    "published": "2024-06-27T21:15:15.883"
  },
  "CVE-2024-39705": {
    "cvss": "-",
    "description": "NLTK through 3.8.1 allows remote code execution if untrusted packages have pickled Python code, and the integrated data package download functionality is used. This affects, for example, averaged_perceptron_tagger and punkt.",
    "published": "2024-06-27T22:15:10.543",
    "keywords": "remote,execution"
  },
  "CVE-2024-6071": {
    "cvss": 10.0,
    "description": "PTC Creo Elements/Direct License Server exposes a web interface which can be used by unauthenticated remote attackers to execute arbitrary OS commands on the server.",
    "published": "2024-06-27T23:15:50.470",
    "keywords": "remote,unauthenticated,command"
  }
}