{
  "CVE-2025-29902": {
    "cvss": 10.0,
    "description": "Remote code execution that allows unauthorized users to execute arbitrary code on the server machine.",
    "published": "2025-06-13T10:15:20.693",
    "keywords": "remote,execution"
  },
  "CVE-2025-49468": {
    "cvss": "-",
    "description": "A SQL injection vulnerability in No Boss Calendar component before 5.0.7 for Joomla was discovered. The vulnerability allows remote authenticated users to execute arbitrary SQL commands via the id_module parameter.",
    "published": "2025-06-13T10:15:21.073",
    "keywords": "remote,command"
  },
  "CVE-2025-46096": {
    "url": "https://github.com/opensolon/solon/issues/357",
    "cvss": 6.1,
    "description": "Directory Traversal vulnerability in solon v.3.1.2 allows a remote attacker to conduct XSS attacks via the solon-faas-luffy component",
    "published": "2025-06-13T13:15:21.710"
  },
  "CVE-2025-28386": {
    "cvss": "-",
    "description": "A remote code execution (RCE) vulnerability in the Plugin Management component of OpenC3 COSMOS v6.0.0 allows attackers to execute arbitrary code via uploading a crafted .txt file.",
    "published": "2025-06-13T14:15:20.713",
    "keywords": "remote,execution"
  },
  "CVE-2025-28389": {
    "cvss": 9.8,
    "description": "Weak password requirements in OpenC3 COSMOS v6.0.0 allow attackers to bypass authentication via a brute force attack.",
    "published": "2025-06-13T14:15:21.010",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-49582": {
    "cvss": "-",
    "description": "XWiki is a generic wiki platform. When editing content that contains \"dangerous\" macros like malicious script macros that were authored by a user with fewer rights, XWiki warns about the execution of these macros since XWiki 15.9RC1. These required rights analyzers that trigger these warnings are incomplete, allowing an attacker to hide malicious content. For most macros, the existing analyzers don't consider non-lowercase parameters. Further, most macro parameters that can contain XWiki syntax like titles of information boxes weren't analyzed at all. Similarly, the \"source\" parameters of the content and context macro weren't anylzed even though they could contain arbitrary XWiki syntax. In the worst case, this could allow a malicious to add malicious script macros including Groovy or Python macros to a page that are then executed after another user with programming righs edits the page, thus allowing remote code execution. The required rights analyzers have been made more robust and extended to cover those cases in XWiki 16.4.7, 16.10.3 and 17.0.0.",
    "published": "2025-06-13T17:15:23.180",
    "keywords": "remote,execution"
  },
  "CVE-2025-49586": {
    "cvss": "-",
    "description": "XWiki is an open-source wiki software platform. Any XWiki user with edit right on at least one App Within Minutes application (the default for all users XWiki) can obtain programming right/perform remote code execution by editing the application. This vulnerability has been fixed in XWiki 17.0.0, 16.4.7, and 16.10.3.",
    "published": "2025-06-13T18:15:22.737",
    "keywords": "remote,execution"
  },
  "CVE-2025-49596": {
    "cvss": "-",
    "description": "The MCP inspector is a developer tool for testing and debugging MCP servers. Versions of MCP Inspector below 0.14.1 are vulnerable to remote code execution due to lack of authentication between the Inspector client and proxy, allowing unauthenticated requests to launch MCP commands over stdio. Users should immediately upgrade to version 0.14.1 or later to address these vulnerabilities.",
    "published": "2025-06-13T20:15:23.133",
    "keywords": "remote,execution,unauthenticated,authentication,command"
  },
  "CVE-2025-24919": {
    "cvss": 8.1,
    "description": "A deserialization of untrusted input vulnerability exists in the cvhDecapsulateCmd functionality of Dell ControlVault3 prior to 5.15.10.14 and ControlVault3 Plus prior to 6.2.26.36. A specially crafted ControlVault response to a command can lead to arbitrary code execution. An attacker can compromise a ControlVault firmware and have it craft a malicious response to trigger this vulnerability.",
    "published": "2025-06-13T22:15:18.320",
    "keywords": "execution,command"
  },
  "CVE-2025-3234": {
    "cvss": 7.2,
    "description": "The File Manager Pro – Filester plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in all versions up to, and including, 1.8.8. This makes it possible for authenticated attackers, with Administrator-level access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible. Administrators have the ability to extend file manager usage privileges to lower-level users including subscribers, which would make this vulnerability more severe on such sites.",
    "published": "2025-06-14T06:15:18.117",
    "keywords": "remote,execution"
  },
  "CVE-2025-4187": {
    "cvss": 5.9,
    "description": "The UserPro - Community and User Profile WordPress Plugin plugin for WordPress is vulnerable to Directory Traversal in all versions up to, and including, 5.1.10 via the userpro_fbconnect() function. This makes it possible for unauthenticated attackers to read the contents of arbitrary files on the server, which can contain sensitive information.",
    "published": "2025-06-14T09:15:22.050",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-4200": {
    "cvss": 8.1,
    "description": "The Zagg - Electronics & Accessories WooCommerce WordPress Theme theme for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 1.4.1 via the load_view() function that is called via at least three AJAX actions: 'load_more_post', 'load_shop', and 'load_more_product. This makes it possible for unauthenticated attackers to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2025-06-14T09:15:22.990",
    "keywords": "execution,unauthenticated,sensitive,bypass"
  },
  "CVE-2025-6065": {
    "cvss": 9.1,
    "description": "The Image Resizer On The Fly plugin for WordPress is vulnerable to arbitrary file deletion due to insufficient file path validation in the 'delete' task in all versions up to, and including, 1.1. This makes it possible for unauthenticated attackers to delete arbitrary files on the server, which can easily lead to remote code execution when the right file is deleted (such as wp-config.php).",
    "published": "2025-06-14T09:15:25.020",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2025-1411": {
    "cvss": 7.8,
    "description": "IBM Security Verify Directory Container 10.0.0.0 through 10.0.3.1 could allow a local user to execute commands as root due to execution with unnecessary privileges.",
    "published": "2025-06-15T13:15:32.027",
    "keywords": "execution,command"
  },
  "CVE-2025-6093": {
    "url": "https://github.com/uyanki/board-stm32f103rc-berial/issues/3",
    "cvss": 5.5,
    "description": "A vulnerability classified as critical was found in uYanki board-stm32f103rc-berial up to 84daed541609cb7b46854cc6672a275d1007e295. This vulnerability affects the function heartrate1_i2c_hal_write of the file 7.Example/hal/i2c/max30100/Manual/demo2/2/heartrate1_hal.c. The manipulation of the argument num leads to stack-based buffer overflow. Continious delivery with rolling releases is used by this product. Therefore, no version details of affected nor updated releases are available.",
    "published": "2025-06-15T22:15:19.483"
  },
  "CVE-2025-6099": {
    "url": "https://github.com/szluyu99/gin-vue-blog/issues/28",
    "cvss": 5.3,
    "description": "A vulnerability was found in szluyu99 gin-vue-blog up to 61dd11ccd296e8642a318ada3ef7b3f7776d2410. It has been declared as critical. This vulnerability affects unknown code of the file gin-blog-server/internal/manager.go of the component PATCH Request Handler. The manipulation leads to improper authorization. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. This product is using a rolling release to provide continious delivery. Therefore, no version details for affected nor updated releases are available.",
    "published": "2025-06-16T01:15:18.350"
  },
  "CVE-2025-6101": {
    "url": "https://github.com/letta-ai/letta/issues/2613",
    "cvss": 5.5,
    "description": "A vulnerability classified as critical has been found in letta-ai letta up to 0.4.1. Affected is the function function_message of the file letta/letta/interface.py. The manipulation of the argument function_name/function_args leads to improper neutralization of directives in dynamically evaluated code. The exploit has been disclosed to the public and may be used.",
    "published": "2025-06-16T03:15:41.920"
  },
  "CVE-2025-6102": {
    "cvss": 8.8,
    "description": "A vulnerability classified as critical was found in Wifi-soft UniBox Controller up to 20250506. Affected by this vulnerability is an unknown functionality of the file /authentication/logout.php. The manipulation of the argument mac_address leads to os command injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2025-06-16T03:15:42.100",
    "keywords": "remote,authentication,command"
  },
  "CVE-2025-6103": {
    "cvss": 8.8,
    "description": "A vulnerability, which was classified as critical, has been found in Wifi-soft UniBox Controller up to 20250506. Affected by this issue is some unknown functionality of the file /billing/test_accesscodelogin.php. The manipulation of the argument Password leads to os command injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2025-06-16T03:15:42.283",
    "keywords": "remote,command"
  },
  "CVE-2025-6104": {
    "cvss": 8.8,
    "description": "A vulnerability, which was classified as critical, was found in Wifi-soft UniBox Controller up to 20250506. This affects an unknown part of the file /billing/pms_check.php. The manipulation of the argument ipaddress leads to os command injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2025-06-16T04:15:19.227",
    "keywords": "remote,command"
  },
  "CVE-2025-6169": {
    "cvss": 9.8,
    "description": "The WIMP website co-construction management platform from HAMASTAR Technology has a SQL Injection vulnerability, allowing unauthenticated remote attackers to inject arbitrary SQL commands to read, modify, and delete database contents.",
    "published": "2025-06-16T07:15:20.077",
    "keywords": "remote,unauthenticated,command"
  }
}