{
  "CVE-2025-15129": {
    "url": "https://github.com/chenjinchuang/lin-cms-tp5/issues/65",
    "cvss": 6.3,
    "description": "A flaw has been found in ChenJinchuang Lin-CMS-TP5 up to 0.3.3. This vulnerability affects the function Upload of the file application/lib/file/LocalUploader.php of the component File Upload Handler. Executing manipulation of the argument File can lead to code injection. The attack can be executed remotely. The exploit has been published and may be used. The project was informed of the problem early through an issue report but has not responded yet.",
    "published": "2025-12-28T09:15:41.707"
  },
  "CVE-2025-15134": {
    "url": "https://github.com/yourmaileyes/mooc/issues/12#issue-3722197285",
    "cvss": 3.5,
    "description": "A security flaw has been discovered in yourmaileyes MOOC up to 1.17. This affects the function subreview of the file mooc/controller/MainController.java of the component Submission Handler. Performing manipulation of the argument review results in cross site scripting. The attack can be initiated remotely. The exploit has been released to the public and may be exploited. The project was informed of the problem early through an issue report but has not responded yet.",
    "published": "2025-12-28T12:15:40.480"
  },
  "CVE-2025-15135": {
    "cvss": 6.3,
    "description": "A weakness has been identified in joey-zhou xiaozhi-esp32-server-java up to 3.0.0. This impacts the function tryAuthenticateWithCookies of the file AuthenticationInterceptor.java of the component Cookie Handler. Executing manipulation can lead to improper authentication. The attack can be launched remotely. The exploit has been made available to the public and could be exploited. Upgrading to version 4.0.0 will fix this issue. It is recommended to upgrade the affected component.",
    "published": "2025-12-28T12:15:41.310",
    "keywords": "remote,authentication"
  },
  "CVE-2025-15136": {
    "cvss": 8.8,
    "description": "A security vulnerability has been detected in TRENDnet TEW-800MB 1.0.1.0. Affected is the function do_setWizard_asp of the file /goform/wizardset of the component Management Interface. The manipulation of the argument WizardConfigured leads to command injection. The attack may be initiated remotely. The exploit has been disclosed publicly and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2025-12-28T13:15:39.897",
    "keywords": "remote,command"
  },
  "CVE-2025-15137": {
    "cvss": 8.8,
    "description": "A vulnerability was detected in TRENDnet TEW-800MB 1.0.1.0. Affected by this vulnerability is the function sub_F934  of the file NTPSyncWithHost.cgi. The manipulation results in command injection. The attack may be launched remotely. The exploit is now public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2025-12-28T14:16:26.753",
    "keywords": "remote,command"
  },
  "CVE-2025-15139": {
    "cvss": 6.3,
    "description": "A vulnerability has been found in TRENDnet TEW-822DRE 1.00B21/1.01B06. This affects the function sub_43ACF4  of the file /boafrm/formWsc. Such manipulation of the argument peerPin leads to command injection. The attack can be executed remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2025-12-28T14:16:27.603",
    "keywords": "remote,command"
  },
  "CVE-2025-15145": {
    "url": "https://github.com/sohutv/cachecloud/issues/365#issue-3733522215",
    "cvss": 2.4,
    "description": "A security vulnerability has been detected in SohuTV CacheCloud up to 3.2.0. This affects the function doTotalList of the file src/main/java/com/sohu/cache/web/controller/TotalManageController.java. Such manipulation leads to cross site scripting. The attack can be launched remotely. The exploit has been disclosed publicly and may be used. The project was informed of the problem early through an issue report but has not responded yet.",
    "published": "2025-12-28T17:16:01.310"
  },
  "CVE-2025-15146": {
    "url": "https://github.com/sohutv/cachecloud/issues/366#issue-3733542570",
    "cvss": 2.4,
    "description": "A vulnerability was detected in SohuTV CacheCloud up to 3.2.0. This impacts the function doUserList of the file src/main/java/com/sohu/cache/web/controller/UserManageController.java. Performing manipulation results in cross site scripting. The attack may be initiated remotely. The exploit is now public and may be used. The project was informed of the problem early through an issue report but has not responded yet.",
    "published": "2025-12-28T18:15:47.197"
  },
  "CVE-2025-15150": {
    "url": "https://github.com/px4/px4-autopilot/pull/26124",
    "cvss": 5.3,
    "description": "A vulnerability was found in PX4 PX4-Autopilot up to 1.16.0. Affected by this issue is the function MavlinkLogHandler::state_listing/MavlinkLogHandler::log_entry_from_id of the file src/modules/mavlink/mavlink_log_handler.cpp. The manipulation results in stack-based buffer overflow. The attack is only possible with local access. The patch is identified as 338595edd1d235efd885fd5e9f45e7f9dcf4013d. It is best practice to apply a patch to resolve this issue.",
    "published": "2025-12-28T19:15:48.570"
  },
  "CVE-2025-15156": {
    "url": "https://github.com/omec-project/upf/issues/979",
    "cvss": 4.3,
    "description": "A flaw has been found in omec-project UPF up to 2.1.3-dev. This affects the function handleSessionEstablishmentRequest of the file /pfcpiface/pfcpiface/messages_session.go of the component PFCP Session Establishment Request Handler. This manipulation causes null pointer dereference. The attack may be initiated remotely. The exploit has been published and may be used. The project was informed of the problem early through an issue report but has not responded yet.",
    "published": "2025-12-28T22:15:43.910"
  },
  "CVE-2025-52691": {
    "cvss": 10.0,
    "description": "Successful exploitation of the vulnerability could allow an unauthenticated attacker to upload arbitrary files to any location on the mail server, potentially enabling remote code execution.",
    "published": "2025-12-29T03:15:42.837",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2025-15171": {
    "url": "https://github.com/sohutv/cachecloud/issues/367#issue-3733551662",
    "cvss": 3.5,
    "description": "A vulnerability was identified in SohuTV CacheCloud up to 3.2.0. This affects the function index of the file src/main/java/com/sohu/cache/web/controller/ServerController.java. The manipulation leads to cross site scripting. Remote exploitation of the attack is possible. The exploit is publicly available and might be used. The project was informed of the problem early through an issue report but has not responded yet.",
    "published": "2025-12-29T05:15:57.627"
  },
  "CVE-2025-15172": {
    "url": "https://github.com/sohutv/cachecloud/issues/368#issue-3733556724",
    "cvss": 3.5,
    "description": "A security flaw has been discovered in SohuTV CacheCloud up to 3.2.0. This impacts the function preview of the file src/main/java/com/sohu/cache/web/controller/RedisConfigTemplateController.java. The manipulation results in cross site scripting. The attack can be executed remotely. The exploit has been released to the public and may be exploited. The project was informed of the problem early through an issue report but has not responded yet.",
    "published": "2025-12-29T05:15:59.187"
  },
  "CVE-2025-15173": {
    "url": "https://github.com/sohutv/cachecloud/issues/369#issue-3733560985",
    "cvss": 3.5,
    "description": "A weakness has been identified in SohuTV CacheCloud up to 3.2.0. Affected is the function advancedAnalysis of the file src/main/java/com/sohu/cache/web/controller/InstanceController.java. This manipulation causes cross site scripting. The attack is possible to be carried out remotely. The exploit has been made available to the public and could be exploited. The project was informed of the problem early through an issue report but has not responded yet.",
    "published": "2025-12-29T05:16:01.743"
  },
  "CVE-2025-15070": {
    "cvss": 5.5,
    "description": "Exposure of Sensitive Information to an Unauthorized Actor, Missing Authorization vulnerability in Gmission Web Fax allows Authentication Abuse.This issue affects Web Fax: from 3.0 before 4.0.",
    "published": "2025-12-29T06:15:51.947",
    "keywords": "authentication,sensitive"
  },
  "CVE-2025-15174": {
    "url": "https://github.com/sohutv/cachecloud/issues/370#issue-3733566371",
    "cvss": 3.5,
    "description": "A security vulnerability has been detected in SohuTV CacheCloud up to 3.2.0. Affected by this vulnerability is the function doAppAuditList of the file src/main/java/com/sohu/cache/web/controller/AppManageController.java. Such manipulation leads to cross site scripting. The attack may be performed from remote. The exploit has been disclosed publicly and may be used. The project was informed of the problem early through an issue report but has not responded yet.",
    "published": "2025-12-29T06:15:52.107"
  },
  "CVE-2025-15175": {
    "cvss": 3.5,
    "description": "A vulnerability was detected in SohuTV CacheCloud up to 3.2.0. Affected by this issue is the function doAppList/appCommandAnalysis of the file src/main/java/com/sohu/cache/web/controller/AppController.java. Performing manipulation results in cross site scripting. It is possible to initiate the attack remotely. The exploit is now public and may be used. The project was informed of the problem early through an issue report but has not responded yet.",
    "published": "2025-12-29T06:15:52.350",
    "keywords": "remote,command"
  },
  "CVE-2025-15176": {
    "url": "https://github.com/open5gs/open5gs/commit/b72d8349980076e2c033c8324f07747a86eea4f8",
    "cvss": 5.3,
    "description": "A flaw has been found in Open5GS up to 2.7.5. This affects the function decode_ipv6_header/ogs_pfcp_pdr_rule_find_by_packet of the file lib/pfcp/rule-match.c of the component PFCP Session Establishment Request Handler. Executing manipulation can lead to reachable assertion. It is possible to launch the attack remotely. The exploit has been published and may be used. This patch is called b72d8349980076e2c033c8324f07747a86eea4f8. Applying a patch is advised to resolve this issue.",
    "published": "2025-12-29T07:15:54.153"
  },
  "CVE-2025-15225": {
    "cvss": 7.5,
    "description": "WMPro developed by Sunnet has an Arbitrary File Read vulnerability, allowing unauthenticated remote attackers to exploit Relative Path Traversal to read arbitrary system files.",
    "published": "2025-12-29T07:15:56.333",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-15226": {
    "cvss": 9.8,
    "description": "WMPro developed by Sunnet has a Arbitrary File Upload vulnerability, allowing unauthenticated remote attackers to upload and execute web shell backdoors, thereby enabling arbitrary code execution on the server.",
    "published": "2025-12-29T07:15:56.567",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2025-15227": {
    "cvss": 7.5,
    "description": "BPMFlowWebkit developed by WELLTEND TECHNOLOGY has a Arbitrary File Read vulnerability, allowing unauthenticated remote attackers to exploit Absolute Path Traversal to download arbitrary system files.",
    "published": "2025-12-29T08:15:51.650",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-15228": {
    "cvss": 9.8,
    "description": "BPMFlowWebkit developed by WELLTEND TECHNOLOGY has a Arbitrary File Upload vulnerability, allowing unauthenticated remote attackers to upload and execute web shell backdoors, thereby enabling arbitrary code execution on the server.",
    "published": "2025-12-29T08:15:51.820",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2025-15191": {
    "cvss": 8.8,
    "description": "A weakness has been identified in D-Link DWR-M920 up to 1.1.50. The affected element is the function sub_4155B4 of the file /boafrm/formLtefotaUpgradeFibocom. This manipulation of the argument fota_url causes command injection. Remote exploitation of the attack is possible. The exploit has been made available to the public and could be exploited.",
    "published": "2025-12-29T14:15:56.427",
    "keywords": "remote,command"
  },
  "CVE-2025-15192": {
    "cvss": 8.8,
    "description": "A security vulnerability has been detected in D-Link DWR-M920 up to 1.1.50. The impacted element is the function sub_415328 of the file /boafrm/formLtefotaUpgradeQuectel. Such manipulation of the argument fota_url leads to command injection. The attack can be executed remotely. The exploit has been disclosed publicly and may be used.",
    "published": "2025-12-29T15:16:00.377",
    "keywords": "remote,command"
  },
  "CVE-2025-65442": {
    "cvss": 6.1,
    "description": "DOM-based Cross-Site Scripting (XSS) vulnerability in 201206030 novel V3.5.0 allows remote attackers to execute arbitrary JavaScript code or disclose sensitive information (e.g., user session cookies) via a crafted \"wvstest\" parameter in the URL or malicious script injection into window.localStorage. The vulnerability arises from insufficient validation and encoding of user-controllable data in the book comment module: unfiltered user input is stored in the backend database (book_comment table, commentContent field) and returned via API, then rendered directly into the page DOM via Vue 3's v-html directive without sanitization. Even if modern browsers' built-in XSS filters block pop-up alerts, attackers can use concealed payloads to bypass interception and achieve actual harm.",
    "published": "2025-12-29T15:16:01.637",
    "keywords": "remote,sensitive,bypass"
  },
  "CVE-2025-68929": {
    "cvss": 9.0,
    "description": "Frappe is a full-stack web application framework. Prior to versions 14.99.6 and 15.88.1, an authenticated user with specific permissions could be tricked into accessing a specially crafted link. This could lead to a malicious template being executed on the server, resulting in remote code execution. Versions 14.99.6 and 15.88.1 fix the issue. No known workarounds are available.",
    "published": "2025-12-29T15:16:02.033",
    "keywords": "remote,execution"
  },
  "CVE-2025-69200": {
    "cvss": 7.5,
    "description": "phpMyFAQ is an open source FAQ web application. In versions prior to 4.0.16, an unauthenticated remote attacker can trigger generation of a configuration backup ZIP via `POST /api/setup/backup` and then download the generated ZIP from a web-accessible location. The ZIP contains sensitive configuration files (e.g., `database.php` with database credentials), leading to high-impact information disclosure and potential follow-on compromise. Version 4.0.16 fixes the issue.",
    "published": "2025-12-29T16:15:43.793",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2025-69211": {
    "cvss": "-",
    "description": "Nest is a framework for building scalable Node.js server-side applications. Versions prior to 11.1.11 have a Fastify URL encoding middleware bypass. A NestJS application is vulnerable if it uses `@nestjs/platform-fastify`; relies on `NestMiddleware` (via `MiddlewareConsumer`) for security checks (authentication, authorization, etc.), or through `app.use()`; and applies middleware to specific routes using string paths or controllers (e.g., `.forRoutes('admin')`). Exploitation can result in unauthenticated users accessing protected routes, restricted administrative endpoints becoming accessible to lower-privileged users, and/or middleware performing sanitization or validation being skipped. This issue is patched in `@nestjs/platform-fastify@11.1.11`.",
    "published": "2025-12-29T16:15:44.237",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2025-66869": {
    "url": "https://github.com/libming/libming/issues/366",
    "cvss": 7.5,
    "description": "Buffer overflow vulnerability in function strcat in asan_interceptors.cpp in libming 0.4.8.",
    "published": "2025-12-29T17:15:46.603"
  },
  "CVE-2025-66877": {
    "url": "https://github.com/libming/libming/issues/367",
    "cvss": 7.5,
    "description": "Buffer overflow vulnerability in function dcputchar in decompile.c in libming 0.4.8.",
    "published": "2025-12-29T18:15:43.633"
  },
  "CVE-2025-13592": {
    "cvss": 7.2,
    "description": "The Advanced Ads plugin for WordPress is vulnerable to Remote Code Execution in versions up to, and including, 2.0.14 via the 'change-ad__content' shortcode parameter. This allows authenticated attackers with editor-level permissions or above, to execute code on the server.",
    "published": "2025-12-29T19:15:54.687",
    "keywords": "remote,execution"
  },
  "CVE-2025-14280": {
    "cvss": 5.3,
    "description": "The PixelYourSite plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 11.1.5 through publicly exposed log files. This makes it possible for unauthenticated attackers to view potentially sensitive information contained in the exposed log files, when the \"Meta API logs\" setting is enabled (disabled by default). The vulnerability was partially patched in version 11.1.5 and fully patched in version 11.1.5.1.",
    "published": "2025-12-29T19:15:54.870",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-15200": {
    "cvss": 2.4,
    "description": "A vulnerability was detected in SohuTV CacheCloud up to 3.2.0. The affected element is the function getExceptionStatisticsByClient/getCommandStatisticsByClient/doIndex of the file src/main/java/com/sohu/cache/web/controller/AppClientDataShowController.java. The manipulation results in cross site scripting. The attack can be executed remotely. The exploit is now public and may be used. The project was informed of the problem early through an issue report but has not responded yet.",
    "published": "2025-12-29T19:15:56.187",
    "keywords": "remote,command"
  },
  "CVE-2025-15201": {
    "url": "https://github.com/sohutv/cachecloud/issues/373",
    "cvss": 3.5,
    "description": "A flaw has been found in SohuTV CacheCloud up to 3.2.0. The impacted element is the function redirectNoPower of the file src/main/java/com/sohu/cache/web/controller/WebResourceController.java. This manipulation causes cross site scripting. The attack is possible to be carried out remotely. The exploit has been published and may be used. The project was informed of the problem early through an issue report but has not responded yet.",
    "published": "2025-12-29T19:15:56.370"
  },
  "CVE-2025-15202": {
    "url": "https://github.com/sohutv/cachecloud/issues/374",
    "cvss": 2.4,
    "description": "A vulnerability has been found in SohuTV CacheCloud up to 3.2.0. This affects the function taskQueueList of the file src/main/java/com/sohu/cache/web/controller/TaskController.java. Such manipulation leads to cross site scripting. The attack may be performed from remote. The exploit has been disclosed to the public and may be used. The project was informed of the problem early through an issue report but has not responded yet.",
    "published": "2025-12-29T20:15:41.737"
  },
  "CVE-2025-15203": {
    "url": "https://github.com/sohutv/cachecloud/issues/375",
    "cvss": 2.4,
    "description": "A vulnerability was found in SohuTV CacheCloud up to 3.2.0. This impacts the function index of the file src/main/java/com/sohu/cache/web/controller/ResourceController.java. Performing manipulation results in cross site scripting. It is possible to initiate the attack remotely. The exploit has been made public and could be used. The project was informed of the problem early through an issue report but has not responded yet.",
    "published": "2025-12-29T20:15:41.920"
  },
  "CVE-2025-69202": {
    "cvss": "-",
    "description": "Axios Cache Interceptor is a cache interceptor for axios. Prior to version 1.11.1, when a server calls an upstream service using different auth tokens, axios-cache-interceptor returns incorrect cached responses, leading to authorization bypass. The cache key is generated only from the URL, ignoring request headers like `Authorization`. When the server responds with `Vary: Authorization` (indicating the response varies by auth token), the library ignores this, causing all requests to share the same cache regardless of authorization. Server-side applications (APIs, proxies, backend services) that use axios-cache-interceptor to cache requests to upstream services, handle requests from multiple users with different auth tokens, and upstream services replies on `Vary` to differentiate caches are affected. Browser/client-side applications (single user per browser session) are not affected. Services using different auth tokens to call upstream services will return incorrect cached data, bypassing authorization checks and leaking user data across different authenticated sessions. After `v1.11.1`, automatic `Vary` header support is now enabled by default. When server responds with `Vary: Authorization`, cache keys now include the authorization header value. Each user gets their own cache.",
    "published": "2025-12-29T20:15:42.107",
    "keywords": "bypass,leak"
  },
  "CVE-2025-15204": {
    "url": "https://github.com/sohutv/cachecloud/issues/376",
    "cvss": 2.4,
    "description": "A vulnerability was determined in SohuTV CacheCloud up to 3.2.0. Affected is the function doQuartzList of the file src/main/java/com/sohu/cache/web/controller/QuartzManageController.java. Executing manipulation can lead to cross site scripting. It is possible to launch the attack remotely. The exploit has been publicly disclosed and may be utilized. The project was informed of the problem early through an issue report but has not responded yet.",
    "published": "2025-12-29T21:15:43.157"
  },
  "CVE-2025-68860": {
    "cvss": 9.8,
    "description": "Authentication Bypass Using an Alternate Path or Channel vulnerability in Mobile Builder Mobile builder allows Authentication Abuse.This issue affects Mobile builder: from n/a through 1.4.2.",
    "published": "2025-12-29T22:15:43.597",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-15284": {
    "cvss": 7.5,
    "description": "Improper Input Validation vulnerability in qs (parse modules) allows HTTP DoS.This issue affects qs: < 6.14.1.\n\n\nSummaryThe arrayLimit option in qs does not enforce limits for bracket notation (a[]=1&a[]=2), allowing attackers to cause denial-of-service via memory exhaustion. Applications using arrayLimit for DoS protection are vulnerable.\n\nDetailsThe arrayLimit option only checks limits for indexed notation (a[0]=1&a[1]=2) but completely bypasses it for bracket notation (a[]=1&a[]=2).\n\nVulnerable code (lib/parse.js:159-162):\n\nif (root === '[]' && options.parseArrays) {\n    obj = utils.combine([], leaf);  // No arrayLimit check\n}\n\n\n\n\n\nWorking code (lib/parse.js:175):\n\nelse if (index <= options.arrayLimit) {  // Limit checked here\n    obj = [];\n    obj[index] = leaf;\n}\n\n\n\n\n\nThe bracket notation handler at line 159 uses utils.combine([], leaf) without validating against options.arrayLimit, while indexed notation at line 175 checks index <= options.arrayLimit before creating arrays.\n\nPoCTest 1 - Basic bypass:\n\nnpm install qs\n\n\n\n\n\nconst qs = require('qs');\nconst result = qs.parse('a[]=1&a[]=2&a[]=3&a[]=4&a[]=5&a[]=6', { arrayLimit: 5 });\nconsole.log(result.a.length);  // Output: 6 (should be max 5)\n\n\n\n\n\nTest 2 - DoS demonstration:\n\nconst qs = require('qs');\nconst attack = 'a[]=' + Array(10000).fill('x').join('&a[]=');\nconst result = qs.parse(attack, { arrayLimit: 100 });\nconsole.log(result.a.length);  // Output: 10000 (should be max 100)\n\n\n\n\n\nConfiguration:\n\n  *  arrayLimit: 5 (test 1) or arrayLimit: 100 (test 2)\n  *  Use bracket notation: a[]=value (not indexed a[0]=value)\n\n\nImpactDenial of Service via memory exhaustion. Affects applications using qs.parse() with user-controlled input and arrayLimit for protection.\n\nAttack scenario:\n\n  *  Attacker sends HTTP request: GET /api/search?filters[]=x&filters[]=x&...&filters[]=x (100,000+ times)\n  *  Application parses with qs.parse(query, { arrayLimit: 100 })\n  *  qs ignores limit, parses all 100,000 elements into array\n  *  Server memory exhausted → application crashes or becomes unresponsive\n  *  Service unavailable for all users\nReal-world impact:\n\n  *  Single malicious request can crash server\n  *  No authentication required\n  *  Easy to automate and scale\n  *  Affects any endpoint parsing query strings with bracket notation",
    "published": "2025-12-29T23:15:42.703",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-69217": {
    "cvss": 7.7,
    "description": "coturn is a free open source implementation of TURN and STUN Server. Versions 4.6.2r5 through 4.7.0-r4 have a bad random number generator for nonces and port randomization after refactoring. Additionally, random numbers aren't generated with openssl's RAND_bytes but libc's random() (if it's not running on Windows). When fetching about 50 sequential nonces (i.e., through sending 50 unauthenticated allocations requests) it is possible to completely reconstruct the current state of the random number generator, thereby predicting the next nonce. This allows authentication while spoofing IPs. An attacker can send authenticated messages without ever receiving the responses, including the nonce (requires knowledge of the credentials, which is e.g., often the case in IoT settings). Since the port randomization is deterministic given the pseudorandom seed, an attacker can exactly reconstruct the ports and, hence predict the randomization of the ports. If an attacker allocates a relay port, they know the current port, and they are able to predict the next relay port (at least if it is not used before). Commit 11fc465f4bba70bb0ad8aae17d6c4a63a29917d9 contains a fix.",
    "published": "2025-12-30T01:15:41.390",
    "keywords": "unauthenticated,authentication"
  },
  "CVE-2025-15219": {
    "url": "https://github.com/sohutv/cachecloud/issues/378",
    "cvss": 3.5,
    "description": "A security vulnerability has been detected in SohuTV CacheCloud up to 3.2.0. Affected by this issue is the function doMachineList/doPodList of the file src/main/java/com/sohu/cache/web/controller/MachineManageController.java. The manipulation leads to cross site scripting. The attack may be initiated remotely. The exploit has been disclosed publicly and may be used. The project was informed of the problem early through an issue report but has not responded yet.",
    "published": "2025-12-30T04:15:49.470"
  },
  "CVE-2025-15220": {
    "url": "https://github.com/sohutv/cachecloud/issues/379",
    "cvss": 4.3,
    "description": "A vulnerability was detected in SohuTV CacheCloud up to 3.2.0. This affects the function init of the file src/main/java/com/sohu/cache/web/controller/LoginController.java. The manipulation results in cross site scripting. The attack may be launched remotely. The exploit is now public and may be used. The project was informed of the problem early through an issue report but has not responded yet.",
    "published": "2025-12-30T05:16:00.933"
  },
  "CVE-2025-15221": {
    "url": "https://github.com/sohutv/cachecloud/issues/380",
    "cvss": 3.5,
    "description": "A flaw has been found in SohuTV CacheCloud up to 3.2.0. This vulnerability affects the function index of the file src/main/java/com/sohu/cache/web/controller/AppDataMigrateController.java. This manipulation causes cross site scripting. Remote exploitation of the attack is possible. The exploit has been published and may be used. The project was informed of the problem early through an issue report but has not responded yet.",
    "published": "2025-12-30T05:16:05.260"
  },
  "CVE-2025-15355": {
    "cvss": 6.1,
    "description": "ISOinsight developed by NetVision Information has a Reflected Cross-site Scripting vulnerability, allowing unauthenticated remote attackers to execute arbitrary JavaScript codes in user's browser through phishing attacks.",
    "published": "2025-12-30T08:15:43.480",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-15103": {
    "cvss": 8.1,
    "description": "DVP-12SE11T - Authentication Bypass via Partial Password Disclosure",
    "published": "2025-12-30T09:15:52.463",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-15253": {
    "cvss": 8.8,
    "description": "A vulnerability has been found in Tenda M3 1.0.0.13(4903). The impacted element is an unknown function of the file /goform/exeCommand. Such manipulation of the argument cmdinput leads to stack-based buffer overflow. The attack can be launched remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2025-12-30T15:15:44.460",
    "keywords": "remote,command"
  },
  "CVE-2025-15254": {
    "cvss": 6.3,
    "description": "A vulnerability was found in Tenda W6-S 1.0.0.4(510). This affects the function TendaAte of the file /goform/ate of the component ATE Service. Performing manipulation results in os command injection. The attack may be initiated remotely. The exploit has been made public and could be used.",
    "published": "2025-12-30T16:15:44.237",
    "keywords": "remote,command"
  },
  "CVE-2025-67746": {
    "cvss": "-",
    "description": "Composer is a dependency manager for PHP. In versions on the 2.x branch prior to 2.2.26 and 2.9.3, attackers controlling remote sources that Composer downloads from might in some way inject ANSI control characters in the terminal output of various Composer commands, causing mangled output and potentially leading to confusion or DoS of the terminal application. There is no proven exploit and this has thus a low severity but we still publish a CVE as it has potential for abuse, and we want to be on the safe side informing users that they should upgrade. Versions 2.2.26 and 2.9.3 contain a patch for the issue.",
    "published": "2025-12-30T16:15:47.170",
    "keywords": "remote,command"
  },
  "CVE-2025-15256": {
    "cvss": 7.3,
    "description": "A vulnerability was identified in Edimax BR-6208AC 1.02/1.03. Affected is the function formStaDrvSetup of the file /goform/formStaDrvSetup of the component Web-based Configuration Interface. The manipulation of the argument rootAPmac leads to command injection. Remote exploitation of the attack is possible. The exploit is publicly available and might be used. Edimax confirms this issue: \"The product mentioned, EDIMAX BR-6208AC V2, has reached its End of Life (EOL) status. It is no longer supported or maintained by Edimax, and it is no longer available for purchase in the market. Consequently, there will be no further firmware updates or patches for this device. We recommend users upgrade to newer models for better security.\" This vulnerability only affects products that are no longer supported by the maintainer.",
    "published": "2025-12-30T17:15:41.027",
    "keywords": "remote,command"
  },
  "CVE-2025-15257": {
    "cvss": 7.3,
    "description": "A security flaw has been discovered in Edimax BR-6208AC 1.02/1.03. Affected by this vulnerability is the function formRoute of the file /gogorm/formRoute of the component Web-based Configuration Interface. The manipulation of the argument strIp/strMask/strGateway results in command injection. The attack can be executed remotely. The exploit has been released to the public and may be exploited. Edimax confirms this issue: \"The product mentioned, EDIMAX BR-6208AC V2, has reached its End of Life (EOL) status. It is no longer supported or maintained by Edimax, and it is no longer available for purchase in the market. Consequently, there will be no further firmware updates or patches for this device. We recommend users upgrade to newer models for better security.\" This vulnerability only affects products that are no longer supported by the maintainer.",
    "published": "2025-12-30T17:15:42.003",
    "keywords": "remote,command"
  },
  "CVE-2025-66848": {
    "cvss": "-",
    "description": "JD Cloud NAS routers AX1800 (4.3.1.r4308 and earlier), AX3000 (4.3.1.r4318 and earlier), AX6600 (4.5.1.r4533 and earlier), BE6500 (4.4.1.r4308 and earlier), ER1 (4.5.1.r4518 and earlier), and ER2 (4.5.1.r4518 and earlier) contain an unauthorized remote command execution vulnerability.",
    "published": "2025-12-30T17:15:43.357",
    "keywords": "remote,execution,command"
  },
  "CVE-2025-56332": {
    "cvss": "-",
    "description": "Authentication Bypass in fosrl/pangolin v1.6.2 and before allows attackers to access Pangolin resource via Insecure Default Configuration",
    "published": "2025-12-30T18:15:46.703",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-69256": {
    "cvss": 7.5,
    "description": "The Serverless Framework is a framework for using AWS Lambda and other managed cloud services to build applications. Starting in version 4.29.0 and prior to version 4.29.3, a command injection vulnerability exists in the Serverless Framework's built-in MCP server package (@serverless/mcp). This vulnerability only affects users of the experimental MCP server feature (serverless mcp), which represents less than 0.1% of Serverless Framework users. The core Serverless Framework CLI and deployment functionality are not affected. The vulnerability is caused by the unsanitized use of input parameters within a call to `child_process.exec`, enabling an attacker to inject arbitrary system commands. Successful exploitation can lead to remote code execution under the server process's privileges. The server constructs and executes shell commands using unvalidated user input directly within command-line strings. This introduces the possibility of shell metacharacter injection (`|`, `>`, `&&`, etc.). Version 4.29.3 fixes the issue.",
    "published": "2025-12-30T19:15:45.180",
    "keywords": "remote,execution,command"
  },
  "CVE-2025-50343": {
    "url": "https://github.com/tbeu/matio/issues/275",
    "cvss": "-",
    "description": "An issue was discovered in matio 1.5.28. A heap-based memory corruption can occur in Mat_VarCreateStruct() when the nfields value does not match the actual number of strings in the fields array. This leads to out-of-bounds reads and invalid memory frees during cleanup, potentially causing a segmentation fault or heap corruption.",
    "published": "2025-12-30T20:16:00.217"
  }
}