{
  "CVE-2024-5335": {
    "cvss": 9.8,
    "description": "The Ultimate Store Kit Elementor Addons, Woocommerce Builder, EDD Builder, Elementor Store Builder, Product Grid, Product Table, Woocommerce Slider plugin is vulnerable to PHP Object Injection via deserialization of untrusted input via the _ultimate_store_kit_compare_products cookie in versions up to , and including, 1.6.4. This makes it possible for an unauthenticated attacker to inject a PHP Object.\r\n\r\nNo POP chain is present in the vulnerable plugin. If a POP chain is present via an additional plugin or theme installed on the target system, it could allow the attacker or above to delete arbitrary files, retrieve sensitive data, or execute code.",
    "published": "2024-08-21T09:15:04.563",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-6811": {
    "cvss": 7.8,
    "description": "IrfanView WSQ File Parsing Out-Of-Bounds Write Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of IrfanView. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of WSQ files. The issue results from the lack of proper validation of user-supplied data, which can result in a write past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-24192.",
    "published": "2024-08-21T16:15:08.783",
    "keywords": "remote,execution"
  },
  "CVE-2024-6812": {
    "cvss": 7.8,
    "description": "IrfanView WSQ File Parsing Out-Of-Bounds Write Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of IrfanView. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of WSQ files. The issue results from the lack of proper validation of user-supplied data, which can result in a write past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-23273.",
    "published": "2024-08-21T16:15:08.970",
    "keywords": "remote,execution"
  },
  "CVE-2024-6813": {
    "cvss": 8.8,
    "description": "NETGEAR ProSAFE Network Management System getSortString SQL Injection Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of NETGEAR ProSAFE Network Management System. Authentication is required to exploit this vulnerability.\n\nThe specific flaw exists within the getSortString method. The issue results from the lack of proper validation of a user-supplied string before using it to construct SQL queries. An attacker can leverage this vulnerability to execute code in the context of SYSTEM. Was ZDI-CAN-23207.",
    "published": "2024-08-21T16:15:09.163",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2024-6814": {
    "cvss": 8.8,
    "description": "NETGEAR ProSAFE Network Management System getFilterString SQL Injection Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of NETGEAR ProSAFE Network Management System. Authentication is required to exploit this vulnerability.\n\nThe specific flaw exists within the getFilterString method. The issue results from the lack of proper validation of a user-supplied string before using it to construct SQL queries. An attacker can leverage this vulnerability to execute code in the context of SYSTEM. Was ZDI-CAN-23399.",
    "published": "2024-08-21T16:15:09.357",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2024-7600": {
    "cvss": 8.1,
    "description": "Logsign Unified SecOps Platform Directory Traversal Arbitrary File Deletion Vulnerability. This vulnerability allows remote attackers to delete arbitrary files on affected installations of Logsign Unified SecOps Platform. Authentication is required to exploit this vulnerability.\n\nThe specific flaw exists within the HTTP API service, which listens on TCP port 443 by default. The issue results from the lack of proper validation of a user-supplied path prior to using it in file operations. An attacker can leverage this vulnerability to delete files in the context of root. Was ZDI-CAN-25025.",
    "published": "2024-08-21T16:15:09.570",
    "keywords": "remote,authentication"
  },
  "CVE-2024-7601": {
    "cvss": 8.1,
    "description": "Logsign Unified SecOps Platform Directory data_export_delete_all Traversal Arbitrary File Deletion Vulnerability. This vulnerability allows remote attackers to delete arbitrary files on affected installations of Logsign Unified SecOps Platform. Authentication is required to exploit this vulnerability.\n\nThe specific flaw exists within the HTTP API service, which listens on TCP port 443 by default. The issue results from the lack of proper validation of a user-supplied path prior to using it in file operations. An attacker can leverage this vulnerability to delete files in the context of root. Was ZDI-CAN-25026.",
    "published": "2024-08-21T16:15:09.757",
    "keywords": "remote,authentication"
  },
  "CVE-2024-7602": {
    "cvss": 6.5,
    "description": "Logsign Unified SecOps Platform Directory Traversal Information Disclosure Vulnerability. This vulnerability allows remote attackers to disclose sensitive information on affected installations of Logsign Unified SecOps Platform. Authentication is required to exploit this vulnerability.\n\nThe specific flaw exists within the HTTP API service, which listens on TCP port 443 by default. The issue results from the lack of proper validation of a user-supplied path prior to using it in file operations. An attacker can leverage this vulnerability to disclose information in the context of root. Was ZDI-CAN-25027.",
    "published": "2024-08-21T16:15:09.940",
    "keywords": "remote,authentication,sensitive"
  },
  "CVE-2024-7603": {
    "cvss": 8.1,
    "description": "Logsign Unified SecOps Platform Directory Traversal Arbitrary Directory Deletion Vulnerability. This vulnerability allows remote attackers to delete arbitrary directories on affected installations of Logsign Unified SecOps Platform. Authentication is required to exploit this vulnerability.\n\nThe specific flaw exists within the HTTP API service, which listens on TCP port 443 by default. The issue results from the lack of proper validation of a user-supplied path prior to using it in file operations. An attacker can leverage this vulnerability to delete directories in the context of root. Was ZDI-CAN-25028.",
    "published": "2024-08-21T16:15:10.123",
    "keywords": "remote,authentication"
  },
  "CVE-2024-7604": {
    "cvss": 7.8,
    "description": "Logsign Unified SecOps Platform Incorrect Authorization Authentication Bypass Vulnerability. This vulnerability allows local attackers to bypass authentication on affected installations of Logsign Unified SecOps Platform. Authentication is required to exploit this vulnerability.\n\nThe specific flaw exists within the HTTP API service, which listens on TCP port 443 by default. The issue results from the lack of proper validation of the user's license expiration date. An attacker can leverage this vulnerability to bypass authentication on the system. Was ZDI-CAN-25029.",
    "published": "2024-08-21T16:15:10.330",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-7722": {
    "cvss": 3.3,
    "description": "Foxit PDF Reader Doc Object Use-After-Free Information Disclosure Vulnerability. This vulnerability allows remote attackers to disclose sensitive information on affected installations of Foxit PDF Reader. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the handling of Doc objects. The issue results from the lack of validating the existence of an object prior to performing operations on the object. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-23702.",
    "published": "2024-08-21T16:15:10.580",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-7723": {
    "cvss": 7.8,
    "description": "Foxit PDF Reader AcroForm Use-After-Free Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Foxit PDF Reader. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the handling of AcroForms. The issue results from the lack of validating the existence of an object prior to performing operations on the object. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-23736.",
    "published": "2024-08-21T16:15:10.760",
    "keywords": "remote,execution"
  },
  "CVE-2024-7724": {
    "cvss": 7.8,
    "description": "Foxit PDF Reader AcroForm Use-After-Free Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Foxit PDF Reader. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the handling of AcroForms. The issue results from the lack of validating the existence of an object prior to performing operations on the object. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-23900.",
    "published": "2024-08-21T16:15:10.933",
    "keywords": "remote,execution"
  },
  "CVE-2024-7725": {
    "cvss": 7.8,
    "description": "Foxit PDF Reader AcroForm Use-After-Free Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Foxit PDF Reader. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the handling of AcroForms. The issue results from the lack of validating the existence of an object prior to performing operations on the object. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-23928.",
    "published": "2024-08-21T16:15:11.120",
    "keywords": "remote,execution"
  },
  "CVE-2024-7795": {
    "cvss": 8.8,
    "description": "Autel MaxiCharger AC Elite Business C50 AppAuthenExchangeRandomNum Stack-Based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of Autel MaxiCharger AC Elite Business C50 EV chargers. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the handling of the AppAuthenExchangeRandomNum BLE command. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a fixed-length stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of the device. Was ZDI-CAN-23384.",
    "published": "2024-08-21T16:15:11.380",
    "keywords": "remote,execution,authentication,command"
  },
  "CVE-2024-20375": {
    "cvss": 8.6,
    "description": "A vulnerability in the SIP call processing function of Cisco Unified Communications Manager (Unified CM) and Cisco Unified Communications Manager Session Management Edition (Unified CM SME) could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition on an affected device.\r\n\r This vulnerability is due to improper parsing of SIP messages. An attacker could exploit this vulnerability by sending a crafted SIP message to an affected Cisco Unified CM or Cisco Unified CM SME device. A successful exploit could allow the attacker to cause the device to reload, resulting in a DoS condition that interrupts the communications of reliant voice and video devices.",
    "published": "2024-08-21T17:15:07.303",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-33656": {
    "cvss": 7.8,
    "description": "The DXE module SmmComputrace contains a vulnerability that allows local attackers to leak stack or global memory. This could lead to privilege escalation, arbitrary code execution, and bypassing OS security mechanisms",
    "published": "2024-08-21T17:15:07.567",
    "keywords": "execution,bypass,leak"
  },
  "CVE-2024-5723": {
    "cvss": 8.8,
    "description": "Centreon updateServiceHost SQL Injection Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Centreon. Authentication is required to exploit this vulnerability.\n\nThe specific flaw exists within the updateServiceHost function. The issue results from the lack of proper validation of a user-supplied string before using it to construct SQL queries. An attacker can leverage this vulnerability to execute code in the context of the apache user. Was ZDI-CAN-23294.",
    "published": "2024-08-21T17:15:08.413",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2024-5725": {
    "cvss": 8.8,
    "description": "Centreon initCurveList SQL Injection Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Centreon. Authentication is required to exploit this vulnerability.\n\nThe specific flaw exists within the initCurveList function. The issue results from the lack of proper validation of a user-supplied string before using it to construct SQL queries. An attacker can leverage this vulnerability to execute code in the context of the apache user. Was ZDI-CAN-22683.",
    "published": "2024-08-21T17:15:08.607",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2024-5762": {
    "cvss": 8.1,
    "description": "Zen Cart findPluginAdminPage Local File Inclusion Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Zen Cart. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the findPluginAdminPage function. The issue results from the lack of proper validation of user-supplied data prior to passing it to a PHP include function. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the service account. Was ZDI-CAN-21408.",
    "published": "2024-08-21T17:15:08.810",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2024-7448": {
    "cvss": 8.0,
    "description": "Magnet Forensics AXIOM Command Injection Remote Code Execution Vulnerability. This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of Magnet Forensics AXIOM. User interaction is required to exploit this vulnerability in that the target must acquire data from a malicious mobile device.\n\nThe specific flaw exists within the Android device image acquisition functionality. The issue results from the lack of proper validation of a user-supplied string before using it to execute a system call. An attacker can leverage this vulnerability to execute code in the context of the current user. Was ZDI-CAN-23964.",
    "published": "2024-08-21T17:15:09.860",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-42781": {
    "cvss": 9.8,
    "description": "A SQL injection vulnerability in \"/music/ajax.php?action=login\" of Kashipara Music Management System v1.0 allows remote attackers to execute arbitrary SQL commands and bypass Login via the email parameter.",
    "published": "2024-08-21T18:15:10.227",
    "keywords": "remote,command,bypass"
  },
  "CVE-2024-20488": {
    "cvss": 6.1,
    "description": "A vulnerability in the web-based management interface of Cisco Unified Communications Manager (Unified CM) and Cisco Unified Communications Manager Session Management Edition (Unified CM SME) could allow an unauthenticated, remote attacker to conduct a cross-site scripting (XSS) attack against a user of the interface.\r\n\r\nThis vulnerability exists because the web-based management interface does not properly validate user-supplied input. An attacker could exploit this vulnerability by persuading a user of the interface to click a crafted link. A successful exploit could allow the attacker to execute arbitrary script code in the context of the affected interface or access sensitive, browser-based information.",
    "published": "2024-08-21T19:15:13.163",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-20466": {
    "cvss": 6.5,
    "description": "A vulnerability in the web-based management interface of Cisco Identity Services Engine (ISE) could allow an authenticated, remote attacker to obtain sensitive information from an affected device.\r\n\r\nThis vulnerability is due to improper enforcement of administrative privilege levels for high-value sensitive data. An attacker with read-only Administrator privileges for the web-based management interface on an affected device could exploit this vulnerability by browsing to a page that contains sensitive data. A successful exploit could allow the attacker to collect sensitive information regarding the configuration of the system.",
    "published": "2024-08-21T20:15:08.737",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-20486": {
    "cvss": 6.5,
    "description": "A vulnerability in the web-based management interface of Cisco Identity Services Engine (ISE) could allow an unauthenticated, remote attacker to conduct a cross-site request forgery (CSRF) attack and perform arbitrary actions on an affected device.\r\n\r\nThis vulnerability is due to insufficient CSRF protections for the web-based management interface of an affected device. An attacker could exploit this vulnerability by persuading a user of the interface to follow a crafted link. A successful exploit could allow the attacker to perform arbitrary actions on the affected device with the privileges of the targeted user.",
    "published": "2024-08-21T20:15:08.933",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-6386": {
    "cvss": 9.9,
    "description": "The WPML plugin for WordPress is vulnerable to Remote Code Execution in all versions up to, and including, 4.6.12 via the Twig Server-Side Template Injection. This is due to missing input validation and sanitization on the render function. This makes it possible for authenticated attackers, with Contributor-level access and above, to execute code on the server.",
    "published": "2024-08-21T21:15:08.577",
    "keywords": "remote,execution"
  },
  "CVE-2024-7978": {
    "cvss": 4.3,
    "description": "Insufficient policy enforcement in Data Transfer in Google Chrome prior to 128.0.6613.84 allowed a remote attacker who convinced a user to engage in specific UI gestures to leak cross-origin data via a crafted HTML page. (Chromium security severity: Medium)",
    "published": "2024-08-21T21:15:09.697",
    "keywords": "remote,leak"
  },
  "CVE-2024-28987": {
    "cvss": 9.1,
    "description": "The SolarWinds Web Help Desk (WHD) software is affected by a hardcoded credential vulnerability, allowing remote unauthenticated user to access internal functionality and modify data.",
    "published": "2024-08-21T22:15:04.350",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-43033": {
    "url": "https://github.com/jpressprojects/jpress/issues/188",
    "cvss": 8.8,
    "description": "JPress through 5.1.1 on Windows has an arbitrary file upload vulnerability that could cause arbitrary code execution via ::$DATA to AttachmentController, such as a .jsp::$DATA file to io.jpress.web.commons.controller.AttachmentController#upload. NOTE: this is unrelated to the attack vector for CVE-2024-32358.",
    "published": "2024-08-22T01:15:03.540"
  },
  "CVE-2024-7384": {
    "cvss": 7.5,
    "description": "The AcyMailing – An Ultimate Newsletter Plugin and Marketing Automation Solution for WordPress plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the acym_extractArchive function in all versions up to, and including, 9.7.2. This makes it possible for authenticated attackers, with Subscriber-level access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-08-22T03:15:04.130",
    "keywords": "remote,execution"
  },
  "CVE-2024-45163": {
    "cvss": 9.1,
    "description": "The Mirai botnet through 2024-08-19 mishandles simultaneous TCP connections to the CNC (command and control) server. Unauthenticated sessions remain open, causing resource consumption. For example, an attacker can send a recognized username (such as root), or can send arbitrary data.",
    "published": "2024-08-22T04:15:20.247",
    "keywords": "unauthenticated,command"
  },
  "CVE-2024-45166": {
    "cvss": 9.8,
    "description": "An issue was discovered in UCI IDOL 2 (aka uciIDOL or IDOL2) through 2.12. Due to improper input validation, improper deserialization, and improper restriction of operations within the bounds of a memory buffer, IDOL2 is vulnerable to Denial-of-Service (DoS) attacks and possibly remote code execution. There is an access violation and EIP overwrite after five logins.",
    "published": "2024-08-22T04:15:24.467",
    "keywords": "remote,execution"
  },
  "CVE-2024-45167": {
    "cvss": 9.8,
    "description": "An issue was discovered in UCI IDOL 2 (aka uciIDOL or IDOL2) through 2.12. Due to improper input validation, improper deserialization, and improper restriction of operations within the bounds of a memory buffer, IDOL2 is vulnerable to Denial-of-Service (DoS) attacks and possibly remote code execution. A certain XmlMessage document causes 100% CPU consumption.",
    "published": "2024-08-22T04:15:25.710",
    "keywords": "remote,execution"
  },
  "CVE-2024-45169": {
    "cvss": 9.8,
    "description": "An issue was discovered in UCI IDOL 2 (aka uciIDOL or IDOL2) through 2.12. Due to improper input validation, improper deserialization, and improper restriction of operations within the bounds of a memory buffer, IDOL2 is vulnerable to Denial-of-Service (DoS) attacks and possibly remote code execution via the \\xB0\\x00\\x3c byte sequence.",
    "published": "2024-08-22T04:15:27.583",
    "keywords": "remote,execution"
  },
  "CVE-2024-8072": {
    "cvss": 5.3,
    "description": "Mage AI allows remote unauthenticated attackers to leak the terminal server command history of arbitrary users",
    "published": "2024-08-22T08:15:04.360",
    "keywords": "remote,unauthenticated,command,leak"
  },
  "CVE-2024-39746": {
    "cvss": 5.9,
    "description": "IBM Sterling Connect:Direct Web Services 6.0, 6.1, 6.2, and 6.3 could allow a remote attacker to obtain sensitive information, caused by the failure to properly enable HTTP Strict Transport Security. An attacker could exploit this vulnerability to obtain sensitive information using man in the middle techniques.",
    "published": "2024-08-22T11:15:13.920",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-36445": {
    "cvss": 9.8,
    "description": "Swissphone DiCal-RED 4009 devices allow a remote attacker to gain a root shell via TELNET without authentication.",
    "published": "2024-08-22T15:15:16.187",
    "keywords": "remote,authentication"
  },
  "CVE-2024-43787": {
    "cvss": 5.0,
    "description": "Hono is a Web application framework that provides support for any JavaScript runtime. Hono CSRF middleware can be bypassed using crafted Content-Type header. MIME types are case insensitive, but isRequestedByFormElementRe only matches lower-case. As a result, attacker can bypass csrf middleware using upper-case form-like MIME type. This vulnerability is fixed in 4.5.8.",
    "published": "2024-08-22T15:15:16.857",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-8088": {
    "url": "https://github.com/python/cpython/pull/122906",
    "cvss": 7.5,
    "description": "There is a HIGH severity vulnerability affecting the CPython \"zipfile\"\nmodule.\n\n\n\n\n\nWhen iterating over names of entries in a zip archive (for example, methods\nof \"zipfile.ZipFile\" like \"namelist()\", \"iterdir()\", \"extractall()\", etc)\nthe process can be put into an infinite loop with a maliciously crafted\nzip archive. This defect applies when reading only metadata or extracting\nthe contents of the zip archive. Programs that are not handling\nuser-controlled zip archives are not affected.",
    "published": "2024-08-22T19:15:09.720"
  },
  "CVE-2024-42599": {
    "cvss": "-",
    "description": "SeaCMS 13.0 has a remote code execution vulnerability. The reason for this vulnerability is that although admin_files.php imposes restrictions on edited files, attackers can still bypass these restrictions and write code, allowing authenticated attackers to exploit the vulnerability to execute arbitrary commands and gain system privileges.",
    "published": "2024-08-22T20:15:09.730",
    "keywords": "remote,execution,command,bypass"
  },
  "CVE-2024-8075": {
    "cvss": 6.3,
    "description": "A vulnerability has been found in TOTOLINK AC1200 T8 4.1.5cu.862_B20230228 and classified as critical. Affected by this vulnerability is the function setDiagnosisCfg. The manipulation leads to os command injection. The attack can be launched remotely. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-08-22T20:15:10.210",
    "keywords": "remote,command"
  },
  "CVE-2024-8077": {
    "cvss": 6.3,
    "description": "A vulnerability was found in TOTOLINK AC1200 T8 4.1.5cu.862_B20230228. It has been classified as critical. This affects the function setTracerouteCfg. The manipulation leads to os command injection. It is possible to initiate the attack remotely. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-08-22T20:15:11.690",
    "keywords": "remote,command"
  },
  "CVE-2024-8079": {
    "cvss": 8.8,
    "description": "A vulnerability was found in TOTOLINK AC1200 T8 4.1.5cu.862_B20230228. It has been rated as critical. This issue affects the function exportOvpn. The manipulation leads to buffer overflow. The attack may be initiated remotely. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-08-22T21:15:17.910",
    "keywords": "remote,vpn"
  },
  "CVE-2024-38209": {
    "cvss": 7.8,
    "description": "Microsoft Edge (Chromium-based) Remote Code Execution Vulnerability",
    "published": "2024-08-22T23:15:07.740",
    "keywords": "remote,execution"
  },
  "CVE-2024-38210": {
    "cvss": 7.8,
    "description": "Microsoft Edge (Chromium-based) Remote Code Execution Vulnerability",
    "published": "2024-08-22T23:15:07.933",
    "keywords": "remote,execution"
  },
  "CVE-2024-7559": {
    "cvss": 8.8,
    "description": "The File Manager Pro plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation and capability checks in the mk_file_folder_manager AJAX action in all versions up to, and including, 8.3.7. This makes it possible for authenticated attackers, with Subscriber-level access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-08-23T03:15:04.060",
    "keywords": "remote,execution"
  },
  "CVE-2024-7258": {
    "cvss": 8.8,
    "description": "The WooCommerce Google Feed Manager plugin for WordPress is vulnerable to unauthorized loss of data due to a missing capability check on the 'wppfm_removeFeedFile' function in all versions up to, and including, 2.8.0. This makes it possible for authenticated attackers, with Contributor-level access and above, to delete arbitrary files on the server, which can easily lead to remote code execution when the right file is deleted (such as wp-config.php).",
    "published": "2024-08-23T05:15:15.437",
    "keywords": "remote,execution"
  },
  "CVE-2024-5466": {
    "cvss": 8.8,
    "description": "Zohocorp ManageEngine OpManager and Remote Monitoring and Management versions 128329 and below are vulnerable to the authenticated remote code execution in the deploy agent option.",
    "published": "2024-08-23T14:15:11.073",
    "keywords": "remote,execution"
  },
  "CVE-2024-42765": {
    "cvss": 9.8,
    "description": "A SQL injection vulnerability in \"/login.php\" of the Kashipara Bus Ticket Reservation System v1.0 allows remote attackers to execute arbitrary SQL commands and bypass Login via the \"email\" or \"password\" Login page parameters.",
    "published": "2024-08-23T15:15:16.447",
    "keywords": "remote,command,bypass"
  },
  "CVE-2024-8113": {
    "cvss": "-",
    "description": "Stored XSS in organizer and event settings of pretix up to 2024.7.0 allows malicious event organizers to inject HTML tags into e-mail previews on settings page. The default Content Security Policy of pretix prevents execution of attacker-provided scripts, making exploitation unlikely. However, combined with a CSP bypass (which is not currently known) the vulnerability could be used to impersonate other organizers or staff users.",
    "published": "2024-08-23T15:15:17.593",
    "keywords": "execution,bypass"
  },
  "CVE-2024-43032": {
    "cvss": 4.3,
    "description": "autMan v2.9.6 allows attackers to bypass authentication via a crafted web request.",
    "published": "2024-08-23T16:15:06.953",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-44381": {
    "cvss": 8.8,
    "description": "D-Link DI_8004W 16.07.26A1 contains a command execution vulnerability in jhttpd msp_info_htm function.",
    "published": "2024-08-23T16:15:07.013",
    "keywords": "execution,command"
  },
  "CVE-2024-44382": {
    "cvss": 8.8,
    "description": "D-Link DI_8004W 16.07.26A1 contains a command execution vulnerability in the jhttpd upgrade_filter_asp function.",
    "published": "2024-08-23T16:15:07.070",
    "keywords": "execution,command"
  },
  "CVE-2024-7954": {
    "cvss": 9.8,
    "description": "The porte_plume plugin used by SPIP before 4.30-alpha2, 4.2.13, and 4.1.16 is vulnerable to an arbitrary code execution vulnerability. A remote and unauthenticated attacker can execute arbitrary PHP as the SPIP user by sending a crafted HTTP request.",
    "published": "2024-08-23T18:15:07.677",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-45188": {
    "cvss": 6.5,
    "description": "Mage AI allows remote users with the \"Viewer\" role to leak arbitrary files from the Mage server due to a path traversal in the \"File Content\" request",
    "published": "2024-08-23T20:15:07.937",
    "keywords": "remote,leak"
  },
  "CVE-2024-45189": {
    "cvss": 6.5,
    "description": "Mage AI allows remote users with the \"Viewer\" role to leak arbitrary files from the Mage server due to a path traversal in the \"Git Content\" request",
    "published": "2024-08-23T20:15:08.197",
    "keywords": "remote,leak"
  },
  "CVE-2024-45190": {
    "cvss": 6.5,
    "description": "Mage AI allows remote users with the \"Viewer\" role to leak arbitrary files from the Mage server due to a path traversal in the \"Pipeline Interaction\" request",
    "published": "2024-08-23T20:15:08.403",
    "keywords": "remote,leak"
  }
}