{
  "CVE-2024-2577": {
    "cvss": 7.3,
    "description": "A vulnerability has been found in SourceCodester Employee Task Management System 1.0 and classified as critical. This vulnerability affects unknown code of the file /update-employee.php. The manipulation of the argument admin_id leads to authorization bypass. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-257080.",
    "published": "2024-03-18T03:15:06.123",
    "keywords": "remote,bypass"
  },
  "CVE-2024-29156": {
    "cvss": "-",
    "description": "In OpenStack Murano through 16.0.0, when YAQL before 3.0.0 is used, the Murano service's MuranoPL extension to the YAQL language fails to sanitize the supplied environment, leading to potential leakage of sensitive service account information.",
    "published": "2024-03-18T07:15:05.880",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-22475": {
    "cvss": "-",
    "description": "Cross-site request forgery vulnerability in multiple printers and scanners which implement Web Based Management provided by BROTHER INDUSTRIES, LTD. allows a remote unauthenticated attacker to perform unintended operations on the affected product. As for the details of affected product names, model numbers, and versions, refer to the information provided by the respective vendors listed under [References].",
    "published": "2024-03-18T08:15:06.173",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-23604": {
    "cvss": "-",
    "description": "Cross-site scripting vulnerability exists in FitNesse all releases, which may allow a remote unauthenticated attacker to execute an arbitrary script on the web browser of the user who is using the product and accessing a link with specially crafted multiple parameters.",
    "published": "2024-03-18T08:15:06.233",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-27974": {
    "cvss": "-",
    "description": "Cross-site request forgery vulnerability in FUJIFILM printers which implement CentreWare Internet Services or Internet Services allows a remote unauthenticated attacker to alter user information. In the case the user is an administrator, the settings such as the administrator's ID, password, etc. may be altered. As for the details of affected product names, model numbers, and versions, refer to the information provided by the vendor listed under [References].",
    "published": "2024-03-18T08:15:06.287",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-28125": {
    "cvss": "-",
    "description": "FitNesse all releases allows a remote authenticated attacker to execute arbitrary OS commands.",
    "published": "2024-03-18T08:15:06.347",
    "keywords": "remote,command"
  },
  "CVE-2024-28128": {
    "cvss": "-",
    "description": "Cross-site scripting vulnerability exists in FitNesse releases prior to 20220319, which may allow a remote unauthenticated attacker to execute an arbitrary script on the web browser of the user who is using the product and accessing a link with a specially crafted certain parameter.",
    "published": "2024-03-18T08:15:06.400",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-28039": {
    "cvss": "-",
    "description": "Improper restriction of XML external entity references vulnerability exists in FitNesse all releases, which allows a remote unauthenticated attacker to obtain sensitive information, alter data, or cause a denial-of-service (DoS) condition.",
    "published": "2024-03-18T09:15:06.483",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-1013": {
    "url": "https://github.com/lurcher/unixodbc/pull/157",
    "cvss": 7.1,
    "description": "An out-of-bounds stack write flaw was found in unixODBC on 64-bit architectures where the caller has 4 bytes and callee writes 8 bytes. This issue may go unnoticed on little-endian architectures, while big-endian architectures can be broken.",
    "published": "2024-03-18T11:15:09.227"
  },
  "CVE-2024-20767": {
    "cvss": 8.2,
    "description": "ColdFusion versions 2023.6, 2021.12 and earlier are affected by an Improper Access Control vulnerability that could lead to arbitrary file system read. An attacker could leverage this vulnerability to bypass security measures and gain unauthorized access to sensitive files and perform arbitrary file system write. Exploitation of this issue does not require user interaction.",
    "published": "2024-03-18T12:15:06.870",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-27767": {
    "cvss": 10.0,
    "description": "\nCWE-287: Improper Authentication may allow Authentication Bypass\n\n",
    "published": "2024-03-18T14:15:08.050",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-20757": {
    "cvss": 5.5,
    "description": "Bridge versions 13.0.5, 14.0.1 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-03-18T16:15:08.193",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-2229": {
    "cvss": 7.8,
    "description": "\nCWE-502: Deserialization of Untrusted Data vulnerability exists that could cause remote code\nexecution when a malicious project file is loaded into the application by a valid user.\n\n",
    "published": "2024-03-18T16:15:09.580",
    "keywords": "remote,execution"
  },
  "CVE-2024-20762": {
    "cvss": 5.5,
    "description": "Animate versions 24.0, 23.0.3 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-03-18T18:15:08.777",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-20763": {
    "cvss": 5.5,
    "description": "Animate versions 24.0, 23.0.3 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-03-18T18:15:09.017",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-20764": {
    "cvss": 5.5,
    "description": "Animate versions 24.0, 23.0.3 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-03-18T18:15:09.237",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-26063": {
    "cvss": 5.3,
    "description": "Adobe Experience Manager versions 6.5.19 and earlier are affected by an Information Exposure vulnerability that could result in a Security feature bypass. An attacker could leverage this vulnerability to gain unauthorized access to sensitive information, potentially bypassing security measures. Exploitation of this issue does not require user interaction.",
    "published": "2024-03-18T18:15:14.973",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-24578": {
    "cvss": 10.0,
    "description": "RaspberryMatic is an open-source operating system for HomeMatic internet-of-things devices. RaspberryMatic / OCCU prior to version 3.75.6.20240316 contains a unauthenticated remote code execution (RCE) vulnerability, caused by multiple issues within the Java based `HMIPServer.jar` component. RaspberryMatric includes a Java based `HMIPServer`, that can be accessed through URLs starting with `/pages/jpages`. The `FirmwareController` class does however not perform any session id checks, thus this feature can be accessed without a valid session. Due to this issue, attackers can gain remote code execution as root user, allowing a full system compromise. Version 3.75.6.20240316 contains a patch.",
    "published": "2024-03-18T22:15:07.683",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-28855": {
    "cvss": 8.1,
    "description": "ZITADEL, open source authentication management software, uses Go templates to render the login UI. Due to a improper use of the `text/template` instead of the `html/template` package, the Login UI did not sanitize input parameters prior to versions 2.47.3, 2.46.1, 2.45.1, 2.44.3, 2.43.9, 2.42.15, and 2.41.15. An attacker could create a malicious link, where he injected code which would be rendered as part of the login screen. While it was possible to inject HTML including JavaScript, the execution of such scripts would be prevented by the Content Security Policy. Versions 2.47.3, 2.46.1, 2.45.1, 2.44.3, 2.43.9, 2.42.15, and 2.41.15 contain a patch for this issue. No known workarounds are available.",
    "published": "2024-03-18T22:15:08.963",
    "keywords": "execution,authentication"
  },
  "CVE-2024-28865": {
    "url": "https://github.com/django-wiki/django-wiki/commit/8e280fd6c0bd27ce847c67b2d216c6cbf920f88c",
    "cvss": 7.5,
    "description": "django-wiki is a wiki system for Django. Installations of django-wiki prior to version 0.10.1 are vulnerable to maliciously crafted article content that can cause severe use of server CPU through a regular expression loop. Version 0.10.1 fixes this issue. As a workaround, close off access to create and edit articles by anonymous users.",
    "published": "2024-03-18T22:15:09.510"
  },
  "CVE-2024-2620": {
    "cvss": 6.3,
    "description": "A vulnerability has been found in Fujian Kelixin Communication Command and Dispatch Platform up to 20240318 and classified as critical. Affected by this vulnerability is an unknown functionality of the file api/client/down_file.php. The manipulation of the argument uuid leads to sql injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-257197 was assigned to this vulnerability.",
    "published": "2024-03-19T01:15:44.953",
    "keywords": "remote,command"
  },
  "CVE-2024-2621": {
    "cvss": 6.3,
    "description": "A vulnerability was found in Fujian Kelixin Communication Command and Dispatch Platform up to 20240318 and classified as critical. Affected by this issue is some unknown functionality of the file api/client/user/pwd_update.php. The manipulation of the argument uuid leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. VDB-257198 is the identifier assigned to this vulnerability.",
    "published": "2024-03-19T01:15:45.180",
    "keywords": "remote,command"
  },
  "CVE-2024-2622": {
    "cvss": 6.3,
    "description": "A vulnerability was found in Fujian Kelixin Communication Command and Dispatch Platform up to 20240318. It has been classified as critical. This affects an unknown part of the file /api/client/editemedia.php. The manipulation of the argument number/enterprise_uuid leads to sql injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-257199.",
    "published": "2024-03-19T02:15:05.980",
    "keywords": "remote,command"
  },
  "CVE-2024-24042": {
    "url": "https://github.com/devan-kerman/arrp/commit/7ea80db462c8bf66a0565e84fa49c1f2ecb9287b",
    "cvss": 8.8,
    "description": "Directory Traversal vulnerability in Devan-Kerman ARRP v.0.8.1 and before allows a remote attacker to execute arbitrary code via the dumpDirect in RuntimeResourcePackImpl component.",
    "published": "2024-03-19T07:15:09.097"
  },
  "CVE-2024-29027": {
    "cvss": 9.0,
    "description": "Parse Server is an open source backend that can be deployed to any infrastructure that can run Node.js. Prior to versions 6.5.5 and 7.0.0-alpha.29, calling an invalid Parse Server Cloud Function name or Cloud Job name crashes the server and may allow for code injection, internal store manipulation or remote code execution. The patch in versions 6.5.5 and 7.0.0-alpha.29 added string sanitation for Cloud Function name and Cloud Job name. As a workaround, sanitize the Cloud Function name and Cloud Job name before it reaches Parse Server.",
    "published": "2024-03-19T19:15:06.980",
    "keywords": "remote,execution"
  },
  "CVE-2024-28283": {
    "cvss": "-",
    "description": "There is stack-based buffer overflow vulnerability in pc_change_act function in Linksys E1000 router firmware version v.2.1.03 and before, leading to remote code execution.",
    "published": "2024-03-19T21:15:07.770",
    "keywords": "remote,execution"
  },
  "CVE-2024-28389": {
    "cvss": "-",
    "description": "SQL injection vulnerability in KnowBand spinwheel v.3.0.3 and before allows a remote attacker to gain escalated privileges and obtain sensitive information via the SpinWheelFrameSpinWheelModuleFrontController::sendEmail() method.",
    "published": "2024-03-19T21:15:07.820",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-2642": {
    "cvss": 7.3,
    "description": "A vulnerability was found in Ruijie RG-NBS2009G-P up to 20240305. It has been declared as critical. Affected by this vulnerability is an unknown functionality of the file /EXCU_SHELL. The manipulation of the argument Command1 leads to command injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-257281 was assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-03-19T22:15:06.897",
    "keywords": "remote,command"
  },
  "CVE-2024-2645": {
    "cvss": 4.3,
    "description": "A vulnerability classified as problematic has been found in Netentsec NS-ASG Application Security Gateway 6.3. This affects an unknown part of the file /vpnweb/resetpwd/resetpwd.php. The manipulation of the argument UserId leads to improper neutralization of data within xpath expressions. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-257283. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-03-19T23:15:09.560",
    "keywords": "remote,vpn"
  },
  "CVE-2024-2646": {
    "cvss": 6.3,
    "description": "A vulnerability classified as critical was found in Netentsec NS-ASG Application Security Gateway 6.3. This vulnerability affects unknown code of the file /vpnweb/index.php?para=index. The manipulation of the argument check_VirtualSiteId leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-257284. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-03-19T23:15:09.883",
    "keywords": "remote,vpn"
  },
  "CVE-2024-2384": {
    "cvss": 4.3,
    "description": "The WooCommerce POS plugin for WordPress is vulnerable to information disclosure in all versions up to, and including, 1.4.11. This is due to the plugin not properly verifying the authentication and authorization of the current user This makes it possible for authenticated attackers, with customer-level access and above, to view potentially sensitive information about other users by leveraging their order id",
    "published": "2024-03-20T03:15:08.327",
    "keywords": "authentication,sensitive"
  },
  "CVE-2024-1181": {
    "cvss": 5.3,
    "description": "The Coming Soon, Under Construction & Maintenance Mode By Dazzler plugin for WordPress is vulnerable to maintenance mode bypass in all versions up to, and including, 2.1.2. This is due to the plugin relying on the REQUEST_URI to determine if the page being accesses is an admin area.  This makes it possible for unauthenticated attackers to bypass maintenance mode and access the site which may be considered confidential when in maintenance mode.",
    "published": "2024-03-20T07:15:09.167",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2024-1205": {
    "cvss": 8.8,
    "description": "The Management App for WooCommerce – Order notifications, Order management, Lead management, Uptime Monitoring plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the nouvello_upload_csv_file function in all versions up to, and including, 1.2.0. This makes it possible for authenticated attackers, with subscriber-level access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-03-20T07:15:09.467",
    "keywords": "remote,execution"
  },
  "CVE-2024-1473": {
    "cvss": 5.3,
    "description": "The Coming Soon & Maintenance Mode by Colorlib plugin for WordPress is vulnerable to Information Exposure in all versions up to, and including, 1.0.99 via the REST API. This makes it possible for unauthenticated attackers to obtain post and page contents via REST API thus bypassing maintenance mode protection provided by the plugin.",
    "published": "2024-03-20T07:15:10.133",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2024-1477": {
    "cvss": 5.3,
    "description": "The Easy Maintenance Mode plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 1.4.2 via the REST API. This makes it possible for authenticated attackers to obtain post and page content via REST API thus bypassign the protection provided by the plugin.",
    "published": "2024-03-20T07:15:10.330",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-1711": {
    "cvss": 9.8,
    "description": "The Create by Mediavine plugin for WordPress is vulnerable to SQL Injection via the 'id' parameter in all versions up to, and including, 1.9.4 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-03-20T07:15:10.550",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-1800": {
    "cvss": 9.9,
    "description": "\nIn Progress® Telerik® Report Server versions prior to 2024 Q1 (10.0.24.130), a remote code execution attack is possible through an insecure deserialization vulnerability.",
    "published": "2024-03-20T13:15:11.980",
    "keywords": "remote,execution"
  },
  "CVE-2024-1856": {
    "cvss": 8.5,
    "description": "\nIn Progress® Telerik® Reporting versions prior to 2024 Q1 (18.0.24.130), a code execution attack is possible by a remote threat actor through an insecure deserialization vulnerability.",
    "published": "2024-03-20T13:15:15.563",
    "keywords": "remote,execution"
  },
  "CVE-2024-2630": {
    "cvss": "-",
    "description": "Inappropriate implementation in iOS in Google Chrome prior to 123.0.6312.58 allowed a remote attacker to leak cross-origin data via a crafted HTML page. (Chromium security severity: Medium)",
    "published": "2024-03-20T17:15:07.660",
    "keywords": "remote,leak"
  },
  "CVE-2024-2707": {
    "cvss": 6.3,
    "description": "A vulnerability has been found in Tenda AC10U 15.03.06.49 and classified as critical. This vulnerability affects the function formWriteFacMac of the file /goform/WriteFacMac. The manipulation of the argument mac leads to os command injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. VDB-257458 is the identifier assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-03-20T17:15:08.243",
    "keywords": "remote,command"
  },
  "CVE-2024-2708": {
    "cvss": 8.8,
    "description": "A vulnerability was found in Tenda AC10U 15.03.06.49 and classified as critical. This issue affects the function formexeCommand of the file /goform/execCommand. The manipulation of the argument cmdinput leads to stack-based buffer overflow. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-257459. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-03-20T18:15:10.843",
    "keywords": "remote,command"
  },
  "CVE-2024-28179": {
    "cvss": 9.0,
    "description": "Jupyter Server Proxy allows users to run arbitrary external processes alongside their Jupyter notebook servers and provides authenticated web access. Prior to versions 3.2.3 and 4.1.1, Jupyter Server Proxy did not check user authentication appropriately when proxying websockets, allowing unauthenticated access to anyone who had network access to the Jupyter server endpoint. This vulnerability can allow unauthenticated remote access to any websocket endpoint set up to be accessible via Jupyter Server Proxy. In many cases, this leads to remote unauthenticated arbitrary code execution, due to how affected instances use websockets. The websocket endpoints exposed by `jupyter_server` itself is not affected. Projects that do not rely on websockets are also not affected. Versions 3.2.3 and 4.1.1 contain a fix for this issue.",
    "published": "2024-03-20T20:15:08.680",
    "keywords": "remote,execution,unauthenticated,authentication"
  },
  "CVE-2024-25294": {
    "cvss": "-",
    "description": "An SSRF issue in REBUILD v.3.5 allows a remote attacker to obtain sensitive information and execute arbitrary code via the FileDownloader.java, proxyDownload,URL parameters.",
    "published": "2024-03-20T21:15:30.877",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-29018": {
    "url": "https://github.com/moby/moby/pull/46609",
    "cvss": 5.9,
    "description": "Moby is an open source container framework that is a key component of Docker Engine, Docker Desktop, and other distributions of container tooling or runtimes. Moby's networking implementation allows for many networks, each with their own IP address range and gateway, to be defined. This feature is frequently referred to as custom networks, as each network can have a different driver, set of parameters and thus behaviors. When creating a network, the `--internal` flag is used to designate a network as _internal_. The `internal` attribute in a docker-compose.yml file may also be used to mark a network _internal_, and other API clients may specify the `internal` parameter as well.\n\nWhen containers with networking are created, they are assigned unique network interfaces and IP addresses. The host serves as a router for non-internal networks, with a gateway IP that provides SNAT/DNAT to/from container IPs.\n\nContainers on an internal network may communicate between each other, but are precluded from communicating with any networks the host has access to (LAN or WAN) as no default route is configured, and firewall rules are set up to drop all outgoing traffic. Communication with the gateway IP address (and thus appropriately configured host services) is possible, and the host may communicate with any container IP directly.\n\nIn addition to configuring the Linux kernel's various networking features to enable container networking, `dockerd` directly provides some services to container networks. Principal among these is serving as a resolver, enabling service discovery, and resolution of names from an upstream resolver.\n\nWhen a DNS request for a name that does not correspond to a container is received, the request is forwarded to the configured upstream resolver. This request is made from the container's network namespace: the level of access and routing of traffic is the same as if the request was made by the container itself.\n\nAs a consequence of this design, containers solely attached to an internal network will be unable to resolve names using the upstream resolver, as the container itself is unable to communicate with that nameserver. Only the names of containers also attached to the internal network are able to be resolved.\n\nMany systems run a local forwarding DNS resolver. As the host and any containers have separate loopback devices, a consequence of the design described above is that containers are unable to resolve names from the host's configured resolver, as they cannot reach these addresses on the host loopback device. To bridge this gap, and to allow containers to properly resolve names even when a local forwarding resolver is used on a loopback address, `dockerd` detects this scenario and instead forward DNS requests from the host namework namespace. The loopback resolver then forwards the requests to its configured upstream resolvers, as expected.\n\nBecause `dockerd` forwards DNS requests to the host loopback device, bypassing the container network namespace's normal routing semantics entirely, internal networks can unexpectedly forward DNS requests to an external nameserver. By registering a domain for which they control the authoritative nameservers, an attacker could arrange for a compromised container to exfiltrate data by encoding it in DNS queries that will eventually be answered by their nameservers.\n\nDocker Desktop is not affected, as Docker Desktop always runs an internal resolver on a RFC 1918 address.\n\nMoby releases 26.0.0, 25.0.4, and 23.0.11 are patched to prevent forwarding any DNS requests from internal networks. As a workaround, run containers intended to be solely attached to internal networks with a custom upstream address, which will force all upstream DNS queries to be resolved from the container's network namespace.",
    "published": "2024-03-20T21:15:31.113"
  },
  "CVE-2024-29036": {
    "cvss": 4.3,
    "description": "Saleor Storefront is software for building e-commerce experiences. Prior to commit 579241e75a5eb332ccf26e0bcdd54befa33f4783, when any user authenticates in the storefront, anonymous users are able to access their data. The session is leaked through cache and can be accessed by anyone. Users should upgrade to a version that incorporates commit 579241e75a5eb332ccf26e0bcdd54befa33f4783 or later to receive a patch. A possible workaround is to temporarily disable authentication by changing the usage of `createSaleorAuthClient()`.",
    "published": "2024-03-20T21:15:31.817",
    "keywords": "authentication,leak"
  },
  "CVE-2024-29026": {
    "url": "https://github.com/owncast/owncast/commit/9215d9ba0f29d62201d3feea9e77dcd274581624",
    "cvss": 8.2,
    "description": "Owncast is an open source, self-hosted, decentralized, single user live video streaming and chat server. In versions 0.1.2 and prior, a lenient CORS policy allows attackers to make a cross origin request, reading privileged information. This can be used to leak the admin password. Commit 9215d9ba0f29d62201d3feea9e77dcd274581624 fixes this issue.",
    "published": "2024-03-20T22:15:08.557"
  },
  "CVE-2024-2469": {
    "cvss": 8.0,
    "description": "An attacker with an Administrator role in GitHub Enterprise Server could gain SSH root access via remote code execution. This vulnerability affected GitHub Enterprise Server version 3.8.0 and above and was fixed in version 3.8.17, 3.9.12, 3.10.9, 3.11.7 and 3.12.1. This vulnerability was reported via the GitHub Bug Bounty program.",
    "published": "2024-03-20T23:15:07.430",
    "keywords": "remote,execution"
  }
}