{
  "CVE-2024-36082": {
    "cvss": "-",
    "description": "SQL injection vulnerability in Music Store - WordPress eCommerce versions prior to 1.1.14 allows a remote authenticated attacker with an administrative privilege to execute arbitrary SQL commands. Information stored in the database may be obtained or altered by the attacker.",
    "published": "2024-06-07T04:15:30.357",
    "keywords": "remote,command"
  },
  "CVE-2024-4887": {
    "cvss": 7.5,
    "description": "The Qi Addons For Elementor plugin for WordPress is vulnerable to Remote File Inclusion in all versions up to, and including, 1.7.2 via the 'behavior' attributes found in the qi_addons_for_elementor_blog_list shortcode. This makes it possible for authenticated attackers, with Contributor-level access and above, to include remote files on the server, resulting in code execution. Please note that this requires an attacker to create a non-existent directory or target an instance where file_exists won't return false with a non-existent directory in the path, in order to successfully exploit.",
    "published": "2024-06-07T04:15:31.777",
    "keywords": "remote,execution"
  },
  "CVE-2024-5732": {
    "cvss": 7.3,
    "description": "A vulnerability was found in Clash up to 0.20.1 on Windows. It has been declared as critical. This vulnerability affects unknown code of the component Proxy Port. The manipulation leads to improper authentication. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. It is recommended to change the configuration settings. VDB-267406 is the identifier assigned to this vulnerability.",
    "published": "2024-06-07T10:15:12.293",
    "keywords": "remote,authentication"
  },
  "CVE-2024-5599": {
    "cvss": 7.5,
    "description": "The FileOrganizer – Manage WordPress and Website Files plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 1.0.7 via the 'fileorganizer_ajax_handler' function. This makes it possible for unauthenticated attackers to extract sensitive data including backups or other sensitive information if the files have been moved to the built-in Trash folder.",
    "published": "2024-06-07T13:15:50.943",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-36787": {
    "cvss": "-",
    "description": "An issue in Netgear WNR614 JNR1010V2 N300-V1.1.0.54_1.0.1 allows attackers to bypass authentication and access the administrative interface via unspecified vectors.",
    "published": "2024-06-07T15:15:50.140",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-30162": {
    "cvss": "-",
    "description": "Invision Community through 4.7.16 allows remote code execution via the applications/core/modules/admin/editor/toolbar.php IPS\\core\\modules\\admin\\editor\\_toolbar::addPlugin() method. This method handles uploaded ZIP files that are extracted into the applications/core/interface/ckeditor/ckeditor/plugins/ directory without properly verifying their content. This can be exploited by admin users (with the toolbar_manage permission) to write arbitrary PHP files into that directory, leading to execution of arbitrary PHP code in the context of the web server user.",
    "published": "2024-06-07T17:15:50.170",
    "keywords": "remote,execution"
  },
  "CVE-2024-0444": {
    "cvss": 7.5,
    "description": "GStreamer AV1 Video Parsing Stack-based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of GStreamer. Interaction with this library is required to exploit this vulnerability but attack vectors may vary depending on the implementation.\n\nThe specific flaw exists within the parsing of tile list data within AV1-encoded video files. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a fixed-length stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-22873.",
    "published": "2024-06-07T23:15:47.267",
    "keywords": "remote,execution"
  },
  "CVE-2024-5771": {
    "cvss": 6.3,
    "description": "A vulnerability classified as critical was found in LabVantage LIMS 2017. This vulnerability affects unknown code of the file /labvantage/rc?command=page&page=SampleList&_iframename=list of the component POST Request Handler. The manipulation of the argument param1 leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. VDB-267454 is the identifier assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-06-08T22:15:48.660",
    "keywords": "remote,command"
  },
  "CVE-2024-37568": {
    "url": "https://github.com/lepture/authlib/issues/654",
    "cvss": "-",
    "description": "lepture Authlib before 1.3.1 has algorithm confusion with asymmetric public keys. Unless an algorithm is specified in a jwt.decode call, HMAC verification is allowed with any asymmetric public key. (This is similar to CVE-2022-29217 and CVE-2024-33663.)",
    "published": "2024-06-09T19:15:52.323"
  },
  "CVE-2024-37569": {
    "cvss": "-",
    "description": "An issue was discovered on Mitel 6869i through 4.5.0.41 and 5.x through 5.0.0.1018 devices. A command injection vulnerability exists in the hostname parameter taken in by the provis.html endpoint. The provis.html endpoint performs no sanitization on the hostname parameter (sent by an authenticated user), which is subsequently written to disk. During boot, the hostname parameter is executed as part of a series of shell commands. Attackers can achieve remote code execution in the root context by placing shell metacharacters in the hostname parameter.",
    "published": "2024-06-09T20:15:09.377",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-37570": {
    "cvss": "-",
    "description": "On Mitel 6869i 4.5.0.41 devices, the Manual Firmware Update (upgrade.html) page does not perform sanitization on the username and path parameters (sent by an authenticated user) before appending flags to the busybox ftpget command. This leads to $() command execution.",
    "published": "2024-06-09T20:15:09.460",
    "keywords": "execution,command"
  },
  "CVE-2024-4577": {
    "url": "https://github.com/rapid7/metasploit-framework/pull/19247",
    "cvss": 9.8,
    "description": "In PHP versions 8.1.* before 8.1.29, 8.2.* before 8.2.20, 8.3.* before 8.3.8, when using Apache and PHP-CGI on Windows, if the system is set up to use certain code pages, Windows may use \"Best-Fit\" behavior to replace characters in command line given to Win32 API functions. PHP CGI module may misinterpret those characters as PHP options, which may allow a malicious user to pass options to PHP binary being run, and thus reveal the source code of scripts, run arbitrary PHP code on the server, etc.",
    "published": "2024-06-09T20:15:09.550"
  },
  "CVE-2024-37880": {
    "url": "https://github.com/pq-crystals/kyber/commit/9b8d30698a3e7449aeb34e62339d4176f11e3c6c",
    "cvss": "-",
    "description": "The Kyber reference implementation before 9b8d306, when compiled by LLVM Clang through 18.x with some common optimization options, has a timing side channel that allows attackers to recover an ML-KEM 512 secret key in minutes. This occurs because poly_frommsg in poly.c does not prevent Clang from emitting a vulnerable secret-dependent branch.",
    "published": "2024-06-10T02:15:47.160"
  }
}