{
  "CVE-2024-6345": {
    "cvss": 8.8,
    "description": "A vulnerability in the package_index module of pypa/setuptools versions up to 69.1.1 allows for remote code execution via its download functions. These functions, which are used to download packages from URLs provided by users or retrieved from package index servers, are susceptible to code injection. If these functions are exposed to user-controlled inputs, such as package URLs, they can execute arbitrary commands on the system. The issue is fixed in version 70.0.",
    "published": "2024-07-15T01:15:01.730",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-39737": {
    "cvss": 5.4,
    "description": "IBM Datacap Navigator 9.1.5, 9.1.6, 9.1.7, 9.1.8, and 9.1.9 could allow a remote attacker to obtain sensitive information when a detailed technical error message is returned in the browser.  This information could be used in further attacks against the system.  IBM X-Force ID:  296004.",
    "published": "2024-07-15T02:15:06.173",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-6738": {
    "cvss": 5.3,
    "description": "The tumbnail API of Tronclass from WisdomGarden lacks proper access control, allowing unauthenticated remote attackers to obtain certain specific files by modifying the URL.",
    "published": "2024-07-15T03:15:03.293",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-21513": {
    "cvss": 8.5,
    "description": "Versions of the package langchain-experimental from 0.0.15 and before 0.0.21 are vulnerable to Arbitrary Code Execution when retrieving values from the database, the code will attempt to call 'eval' on all values. An attacker can exploit this vulnerability and execute arbitrary python code if they can control the input prompt and the server is configured with VectorSQLDatabaseChain.\r\r**Notes:**\r\rImpact on the Confidentiality, Integrity and Availability of the vulnerable component:\r\rConfidentiality: Code execution happens within the impacted component, in this case langchain-experimental, so all resources are necessarily accessible.\r\rIntegrity: There is nothing protected by the impacted component inherently. Although anything returned from the component counts as 'information' for which the trustworthiness can be compromised.\r\rAvailability: The loss of availability isn't caused by the attack itself, but it happens as a result during the attacker's post-exploitation steps.\r\r\rImpact on the Confidentiality, Integrity and Availability of the subsequent system:\r\rAs a legitimate low-privileged user of the package (PR:L) the attacker does not have more access to data owned by the package as a result of this vulnerability than they did with normal usage (e.g. can query the DB). The unintended action that one can perform by breaking out of the app environment and exfiltrating files, making remote connections etc. happens during the post exploitation phase in the subsequent system - in this case, the OS.\r\rAT:P: An attacker needs to be able to influence the input prompt, whilst the server is configured with the VectorSQLDatabaseChain plugin.",
    "published": "2024-07-15T05:15:01.857",
    "keywords": "remote,execution"
  },
  "CVE-2024-6743": {
    "cvss": 9.8,
    "description": "AguardNet's Space Management System does not properly validate user input, allowing unauthenticated remote attackers to inject arbitrary SQL commands to read, modify, and delete database contents.",
    "published": "2024-07-15T07:15:25.310",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-6744": {
    "cvss": 9.8,
    "description": "The SMTP Listener of Secure Email Gateway from Cellopoint does not properly validate user input, leading to a Buffer Overflow vulnerability. An unauthenticated remote attacker can exploit this vulnerability to execute arbitrary system commands on the remote server.",
    "published": "2024-07-15T07:15:25.573",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-6740": {
    "cvss": 6.1,
    "description": "Openfind's Mail2000 does not properly validate email atachments, allowing unauthenticated remote attackers to inject JavaScript code within the attachment and perform Stored Cross-site scripting attacks.",
    "published": "2024-07-15T08:15:03.087",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-6741": {
    "cvss": 5.8,
    "description": "Openfind's Mail2000 has a vulnerability that allows the HttpOnly flag to be bypassed. Unauthenticated remote attackers can exploit this vulnerability using specific JavaScript code to obtain the session cookie with the HttpOnly flag enabled.",
    "published": "2024-07-15T09:15:03.117",
    "keywords": "remote,unauthenticated,bypass"
  },
  "CVE-2024-6746": {
    "url": "https://github.com/naibowang/easyspider/issues/466",
    "cvss": 4.3,
    "description": "A vulnerability classified as problematic was found in NaiboWang EasySpider 0.6.2 on Windows. Affected by this vulnerability is an unknown functionality of the file \\EasySpider\\resources\\app\\server.js of the component HTTP GET Request Handler. The manipulation with the input /../../../../../../../../../Windows/win.ini leads to path traversal: '../filedir'. The attack needs to be done within the local network. The exploit has been disclosed to the public and may be used. The identifier VDB-271477 was assigned to this vulnerability. NOTE: The code maintainer explains, that this is not a big issue \"because the default is that the software runs locally without going through the Internet\".",
    "published": "2024-07-15T12:15:02.707"
  },
  "CVE-2024-36455": {
    "cvss": "-",
    "description": "An improper input validation allows an unauthenticated attacker to achieve remote command execution on the affected PAM system by sending a specially crafted HTTP request.",
    "published": "2024-07-15T14:15:02.700",
    "keywords": "remote,execution,unauthenticated,command"
  },
  "CVE-2024-36456": {
    "cvss": "-",
    "description": "This vulnerability allows an unauthenticated attacker to achieve remote command execution on the affected PAM system by uploading a specially crafted PAM upgrade file.",
    "published": "2024-07-15T14:15:02.827",
    "keywords": "remote,execution,unauthenticated,command"
  },
  "CVE-2024-36457": {
    "cvss": "-",
    "description": "The vulnerability allows an attacker to bypass the authentication requirements for a specific PAM endpoint.",
    "published": "2024-07-15T14:15:02.917",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-38492": {
    "cvss": "-",
    "description": "This vulnerability allows an unauthenticated attacker to achieve remote command execution on the affected PAM system by uploading a specially crafted PAM upgrade file.",
    "published": "2024-07-15T14:15:03.240",
    "keywords": "remote,execution,unauthenticated,command"
  },
  "CVE-2024-38494": {
    "cvss": "-",
    "description": "This vulnerability allows a high-privileged authenticated PAM user to achieve remote command execution on the affected PAM system by sending a specially crafted HTTP request.",
    "published": "2024-07-15T14:15:03.420",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-37016": {
    "cvss": "-",
    "description": "Mengshen Wireless Door Alarm M70 2024-05-24 allows Authentication Bypass via a Capture-Replay approach.",
    "published": "2024-07-15T18:15:04.337",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-40624": {
    "url": "https://github.com/torrentpier/torrentpier/commit/ed37e6e522f345f2b46147c6f53c1ab6dec1db9e",
    "cvss": 9.8,
    "description": "TorrentPier is an open source BitTorrent Public/Private tracker engine, written in php. In `torrentpier/library/includes/functions.php`, `get_tracks()` uses the unsafe native PHP serialization format to deserialize user-controlled cookies. One can use phpggc and the chain Guzzle/FW1 to write PHP code to an arbitrary file, and execute commands on the system. For instance, the cookie bb_t will be deserialized when browsing to viewforum.php. This issue has been addressed in commit `ed37e6e52` which is expected to be included in release version 2.4.4. Users are advised to upgrade as soon as the new release is available. There are no known workarounds for this vulnerability.",
    "published": "2024-07-15T20:15:04.810"
  },
  "CVE-2024-40627": {
    "cvss": 5.8,
    "description": "Fastapi OPA is an opensource fastapi middleware which includes auth flow. HTTP `OPTIONS` requests are always allowed by `OpaMiddleware`, even when they lack authentication, and are passed through directly to the application. `OpaMiddleware` allows all HTTP `OPTIONS` requests without evaluating it against any policy. If an application provides different responses to HTTP `OPTIONS` requests based on an entity existing (such as to indicate whether an entity is writable on a system level), an unauthenticated attacker could discover which entities exist within an application. This issue has been addressed in release version 2.0.1. All users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-07-15T20:15:05.033",
    "keywords": "unauthenticated,authentication"
  },
  "CVE-2024-39887": {
    "cvss": 4.3,
    "description": "An SQL Injection vulnerability in Apache Superset exists due to improper neutralization of special elements used in SQL commands. Specifically, certain engine-specific functions are not checked, which allows attackers to bypass Apache Superset's SQL authorization. To mitigate this, a new configuration key named DISALLOWED_SQL_FUNCTIONS has been introduced. This key disallows the use of the following PostgreSQL functions: version, query_to_xml, inet_server_addr, and inet_client_addr. Additional functions can be added to this list for increased protection.\n\nThis issue affects Apache Superset: before 4.0.2.\n\nUsers are recommended to upgrade to version 4.0.2, which fixes the issue.\n\n",
    "published": "2024-07-16T10:15:03.380",
    "keywords": "command,bypass"
  },
  "CVE-2024-6457": {
    "cvss": 9.8,
    "description": "The HUSKY – Products Filter Professional for WooCommerce plugin for WordPress is vulnerable to time-based SQL Injection via the ‘woof_author’ parameter in all versions up to, and including, 1.3.6 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-07-16T11:15:10.097",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-22442": {
    "cvss": 9.8,
    "description": "The vulnerability could be remotely exploited to bypass authentication.",
    "published": "2024-07-16T16:15:04.017",
    "keywords": "remote,authentication,bypass"
  }
}