{
  "CVE-2024-5138": {
    "url": "https://github.com/snapcore/snapd/commit/68ee9c6aa916ab87dbfd9a26030690f2cabf1e14",
    "cvss": "-",
    "description": "The snapctl component within snapd allows a confined snap to interact with the snapd daemon to take certain privileged actions on behalf of the snap. It was found that snapctl did not properly parse command-line arguments, allowing an unprivileged user to trigger an authorised action on behalf of the snap that would normally require administrator privileges to perform. This could possibly allow an unprivileged user to perform a denial of service or similar.",
    "published": "2024-05-31T21:15:09.930"
  },
  "CVE-2024-3564": {
    "cvss": 8.8,
    "description": "The Content Blocks (Custom Post Widget) plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 3.3.0 via the plugin's 'content_block' shortcode. This makes it possible for authenticated attackers, with contributor-level access and above, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-06-01T04:15:08.743",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-1324": {
    "cvss": 5.3,
    "description": "The QQWorld Auto Save Images plugin for WordPress is vulnerable to unauthorized access of data due to a missing capability check on the save_remote_images_get_auto_saved_results() function hooked via a norpriv AJAX in all versions up to, and including, 1.9.8. This makes it possible for unauthenticated attackers to retrieve the contents of arbitrary posts that may not be public.",
    "published": "2024-06-01T07:15:07.850",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-3820": {
    "cvss": 10.0,
    "description": "The wpDataTables – WordPress Data Table, Dynamic Tables & Table Charts Plugin plugin for WordPress is vulnerable to SQL Injection via the 'id_key' parameter of the wdt_delete_table_row AJAX action in all versions up to, and including, 6.3.1 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database. Please note this only affects the premium version of the plugin.",
    "published": "2024-06-01T09:15:09.660",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-5348": {
    "cvss": 8.8,
    "description": "The Elements For Elementor plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 2.1 via the 'beforeafter_layout' attribute of the beforeafter widget, the 'eventsgrid_layout' attribute of the eventsgrid and list widgets, the 'marquee_layout' attribute of the marquee widget, the 'postgrid_layout' attribute of the postgrid widget, the 'woocart_layout'  attribute of the woocart widget, and the 'woogrid_layout' attribute of the woogrid widget. This makes it possible for authenticated attackers, with Contributor-level access and above, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-06-01T09:15:10.063",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-36389": {
    "cvss": 9.8,
    "description": "MileSight DeviceHub - \n\n\n\n\n\nCWE-330 Use of Insufficiently Random Values may allow Authentication Bypass",
    "published": "2024-06-02T14:15:08.933",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-36391": {
    "cvss": 9.1,
    "description": "MileSight DeviceHub - CWE-320: Key Management Errors may allow Authentication Bypass and Man-In-The-Middle Traffic",
    "published": "2024-06-02T14:15:09.413",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-20066": {
    "cvss": "-",
    "description": "In modem, there is a possible out of bounds write due to an incorrect bounds check. This could lead to remote denial of service with no additional execution privileges needed. User interaction is no needed for exploitation. Patch ID: MOLY01267281; Issue ID: MSV-1477.",
    "published": "2024-06-03T02:15:08.630",
    "keywords": "remote,execution"
  },
  "CVE-2024-20067": {
    "cvss": "-",
    "description": "In modem, there is a possible out of bounds write due to improper input invalidation. This could lead to remote denial of service with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: MOLY01267285; Issue ID: MSV-1462.",
    "published": "2024-06-03T02:15:08.770",
    "keywords": "remote,execution"
  },
  "CVE-2024-20068": {
    "cvss": "-",
    "description": "In modem, there is a possible system crash due to improper input validation. This could lead to remote denial of service with no additional execution privileges needed. User interaction is no needed for exploitation. Patch ID: MOLY01270721; Issue ID: MSV-1479.",
    "published": "2024-06-03T02:15:08.873",
    "keywords": "remote,execution"
  },
  "CVE-2024-20069": {
    "cvss": "-",
    "description": "In modem, there is a possible selection of less-secure algorithm during the VoWiFi IKE due to a missing DH downgrade check. This could lead to remote information disclosure with no additional execution privileges needed. User interaction is needed for exploitation. Patch ID: MOLY01286330; Issue ID: MSV-1430.",
    "published": "2024-06-03T02:15:08.977",
    "keywords": "remote,execution"
  },
  "CVE-2024-20070": {
    "cvss": "-",
    "description": "In modem, there is a possible information disclosure due to using risky cryptographic algorithm during connection establishment negotiation. This could lead to remote information disclosure, when weak encryption algorithm is used, with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: MOLY00942482; Issue ID: MSV-1469.",
    "published": "2024-06-03T02:15:09.093",
    "keywords": "remote,execution"
  },
  "CVE-2024-36042": {
    "cvss": "-",
    "description": "Silverpeas before 6.3.5 allows authentication bypass by omitting the Password field to AuthenticationServlet, often providing an unauthenticated user with superadmin access.",
    "published": "2024-06-03T06:15:09.293",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-5311": {
    "cvss": 9.8,
    "description": "DigiWin EasyFlow .NET lacks validation for certain input parameters. An unauthenticated remote attacker can inject arbitrary SQL commands to read, modify, and delete database records.",
    "published": "2024-06-03T07:15:10.163",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-23107": {
    "cvss": 5.5,
    "description": "An exposure of sensitive information to an unauthorized actor vulnerability [CWE-200] in FortiWeb version 7.4.0, version 7.2.4 and below, version 7.0.8 and below, 6.3 all versions may allow an authenticated attacker to read password hashes of other administrators via CLI commands.",
    "published": "2024-06-03T08:15:08.837",
    "keywords": "command,sensitive"
  },
  "CVE-2024-5404": {
    "cvss": 9.8,
    "description": "An unauthenticated remote attacker can change the admin password in a moneo appliance due to weak password recovery mechanism.\n",
    "published": "2024-06-03T09:15:10.193",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-3829": {
    "url": "https://github.com/qdrant/qdrant/commit/ee7a31ec3459a6a4219200234615c1817ab82260",
    "cvss": 9.8,
    "description": "qdrant/qdrant version 1.9.0-dev is vulnerable to arbitrary file read and write during the snapshot recovery process. Attackers can exploit this vulnerability by manipulating snapshot files to include symlinks, leading to arbitrary file read by adding a symlink that points to a desired file on the filesystem and arbitrary file write by including a symlink and a payload file in the snapshot's directory structure. This vulnerability allows for the reading and writing of arbitrary files on the server, which could potentially lead to a full takeover of the system. The issue is fixed in version v1.9.0.",
    "published": "2024-06-03T10:15:14.267"
  },
  "CVE-2024-36674": {
    "url": "https://github.com/lylme/lylme_spage/issues/91",
    "cvss": "-",
    "description": "LyLme_spage v1.9.5 is vulnerable to Cross Site Scripting (XSS) via admin/link.php.",
    "published": "2024-06-03T16:15:08.897"
  },
  "CVE-2024-4332": {
    "cvss": "-",
    "description": "An authentication bypass vulnerability has been identified in the REST and SOAP API components of Tripwire Enterprise (TE) 9.1.0 when TE is configured to use LDAP/Active Directory SAML authentication and its optional \"Auto-synchronize LDAP Users, Roles, and Groups\" feature is enabled. This vulnerability allows unauthenticated attackers to bypass authentication if a valid username is known. Exploitation of this vulnerability could allow remote attackers to gain privileged access to the APIs and lead to unauthorized information disclosure or modification.",
    "published": "2024-06-03T18:15:09.060",
    "keywords": "remote,unauthenticated,authentication,bypass"
  },
  "CVE-2024-31684": {
    "cvss": "-",
    "description": "Incorrect access control in the fingerprint authentication mechanism of Bitdefender Mobile Security v4.11.3-gms allows attackers to bypass fingerprint authentication due to the use of a deprecated API.",
    "published": "2024-06-03T19:15:09.260",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-31682": {
    "cvss": "-",
    "description": "Incorrect access control in the fingerprint authentication mechanism of Phone Cleaner: Boost & Clean v2.2.0 allows attackers to bypass fingerprint authentication due to the use of a deprecated API.",
    "published": "2024-06-03T20:15:09.010",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-34987": {
    "cvss": "-",
    "description": "A SQL Injection vulnerability exists in the `ofrs/admin/index.php` script of PHPGurukul Online Fire Reporting System 1.2. The vulnerability allows attackers to bypass authentication and gain unauthorized access by injecting SQL commands into the username input field during the login process.",
    "published": "2024-06-03T20:15:09.273",
    "keywords": "authentication,command,bypass"
  }
}