{
  "CVE-2024-47651": {
    "cvss": "-",
    "description": "This vulnerability exists in Shilpi Client Dashboard due to improper handling of multiple parameters in the API endpoint. An authenticated remote attacker could exploit this vulnerability by including multiple “userid” parameters in the API request body leading to unauthorized access of sensitive information belonging to other users.",
    "published": "2024-10-04T12:15:12.710",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-47652": {
    "cvss": "-",
    "description": "This vulnerability exists in Shilpi Client Dashboard due to implementation of inadequate authentication mechanism in the login module wherein access to any users account is granted with just their corresponding mobile number. A remote attacker could exploit this vulnerability by providing mobile number of targeted user, to obtain complete access to the targeted user account.",
    "published": "2024-10-04T13:15:11.417",
    "keywords": "remote,authentication"
  },
  "CVE-2024-47654": {
    "cvss": "-",
    "description": "This vulnerability exists in Shilpi Client Dashboard due to lack of rate limiting and Captcha protection for OTP requests in certain API endpoint. An unauthenticated remote attacker could exploit this vulnerability by sending multiple OTP request through vulnerable API endpoints, which could lead to the OTP bombing on the targeted system.",
    "published": "2024-10-04T13:15:11.680",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-47655": {
    "cvss": "-",
    "description": "This vulnerability exists in the Shilpi Client Dashboard due to improper validation of files being uploaded other than the specified extension. An authenticated remote attacker could exploit this vulnerability by uploading malicious file, which could lead to remote code execution on targeted application.",
    "published": "2024-10-04T13:15:11.797",
    "keywords": "remote,execution"
  },
  "CVE-2024-47657": {
    "cvss": "-",
    "description": "This vulnerability exists in the Shilpi Net Back Office due to improper access controls on certain API endpoints. An authenticated remote attacker could exploit this vulnerability by manipulating a parameter dfclientid through API request URLs which could lead to unauthorized access to sensitive information belonging to other users.",
    "published": "2024-10-04T13:15:12.023",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-47789": {
    "cvss": "-",
    "description": "** UNSUPPORTED WHEN ASSIGNED ** This vulnerability exists in D3D Security IP Camera due to usage of weak authentication scheme of the HTTP header protocol where authorization tag contain a Base-64 encoded username and password. A remote attacker could exploit this vulnerability by crafting a HTTP packet leading to exposure of user credentials of the targeted device. NOTE: This vulnerability only affects products that are no longer supported by the maintainer.",
    "published": "2024-10-04T13:15:12.137",
    "keywords": "remote,authentication"
  },
  "CVE-2024-47769": {
    "url": "https://github.com/idurar/idurar-erp-crm/commit/949bc6fe31f3175c9e1864d30cf6c8110179ac14",
    "cvss": 7.5,
    "description": "IDURAR is open source ERP CRM accounting invoicing software. The vulnerability exists in the corePublicRouter.js file. Using the reference usage here, it is identified that the public endpoint is accessible to an unauthenticated user. The user's input is directly appended to the join statement without additional checks. This allows an attacker to send URL encoded malicious payload. The directory structure can be escaped to read system files by adding an encoded string (payload) at subpath location.",
    "published": "2024-10-04T15:15:13.427"
  },
  "CVE-2024-46486": {
    "cvss": "-",
    "description": "TP-LINK TL-WDR5620 v2.3 was discovered to contain a remote code execution (RCE) vulnerability via the httpProcDataSrv function.",
    "published": "2024-10-04T17:15:17.173",
    "keywords": "remote,execution"
  },
  "CVE-2024-25691": {
    "cvss": 6.1,
    "description": "There is a reflected XSS vulnerability in Esri Portal for ArcGIS versions 11.1, 10.9.1 and 10.8.1 which may allow a remote, unauthenticated attacker to create a crafted link which when clicked could potentially execute arbitrary JavaScript code in the victim’s browser.",
    "published": "2024-10-04T18:15:05.840",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-38036": {
    "cvss": 4.6,
    "description": "There is a reflected XSS vulnerability in Esri Portal for ArcGIS versions 10.9.1, 10.8.1 and 10.7.1 which may allow a remote, unauthenticated attacker to create a crafted link which when clicked could potentially execute arbitrary JavaScript code in the victim’s browser.",
    "published": "2024-10-04T18:15:06.973",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-38037": {
    "cvss": 6.1,
    "description": "There is an unvalidated redirect vulnerability in Esri Portal for ArcGIS 11.0 and 10.9.1 that may allow a remote, unauthenticated attacker to craft a URL that could redirect a victim to an arbitrary website, simplifying phishing attacks.",
    "published": "2024-10-04T18:15:07.207",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-38038": {
    "cvss": 6.1,
    "description": "There is a reflected XSS vulnerability in Esri Portal for ArcGIS versions 10.9.1, 10.8.1 and 10.7.1 which may allow a remote, unauthenticated attacker to create a crafted link which when clicked could potentially execute arbitrary JavaScript code in the victim’s browser.",
    "published": "2024-10-04T18:15:07.413",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-38040": {
    "cvss": 7.5,
    "description": "There is a local file inclusion vulnerability in Esri Portal for ArcGIS 11.2. 11.1, 11.0 and 10.9.1 that may allow a remote, unauthenticated attacker to craft a URL that could potentially disclose sensitive configuration information by reading internal files.",
    "published": "2024-10-04T18:15:07.897",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-41512": {
    "cvss": "-",
    "description": "A SQL Injection vulnerability in \"ccHandler.aspx\" in all versions of CADClick v.1.11.0 and before allows remote attackers to execute arbitrary SQL commands via the \"bomid\" parameter.",
    "published": "2024-10-04T18:15:08.153",
    "keywords": "remote,command"
  },
  "CVE-2024-8148": {
    "cvss": 6.1,
    "description": "There is an unvalidated redirect vulnerability in Esri Portal for ArcGIS 10.8.1 - 11.2 that may allow a remote, unauthenticated attacker to craft a URL that could redirect a victim to an arbitrary website, simplifying phishing attacks.",
    "published": "2024-10-04T18:15:08.633",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-8149": {
    "cvss": 4.6,
    "description": "There is a reflected XSS vulnerability in Esri Portal for ArcGIS versions 11.1 and 11.2 which may allow a remote, unauthenticated attacker to create a crafted link which when clicked could potentially execute arbitrary JavaScript code in the victim’s browser.",
    "published": "2024-10-04T18:15:08.833",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-9054": {
    "cvss": "-",
    "description": "Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection'), Exposure of Sensitive Information to an Unauthorized Actor vulnerability in Microchip TimeProvider 4100 (Configuration modules) allows Command Injection.This issue affects TimeProvider 4100: from 1.0 before 2.4.7.",
    "published": "2024-10-04T20:15:07.587",
    "keywords": "command,sensitive"
  },
  "CVE-2024-47848": {
    "cvss": "-",
    "description": "Exposure of Sensitive Information to an Unauthorized Actor vulnerability in The Wikimedia Foundation Mediawiki - PageTriage allows Authentication Bypass.This issue affects Mediawiki - PageTriage: from 1.39.X before 1.39.9, from 1.41.X before 1.41.3, from 1.42.X before 1.42.2.",
    "published": "2024-10-05T00:15:02.800",
    "keywords": "authentication,sensitive,bypass"
  },
  "CVE-2024-9554": {
    "cvss": 3.7,
    "description": "A vulnerability classified as problematic was found in Sovell Smart Canteen System up to 3.0.7303.30513. Affected by this vulnerability is the function Check_ET_CheckPwdz201 of the file suanfa.py of the component Password Reset Handler. The manipulation leads to authorization bypass. The attack can be launched remotely. The complexity of an attack is rather high. The exploitation appears to be difficult. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-10-06T12:15:08.117",
    "keywords": "remote,bypass"
  },
  "CVE-2024-9560": {
    "cvss": 6.3,
    "description": "A vulnerability was found in ESAFENET CDG V5. It has been rated as critical. Affected by this issue is the function delCatelogs of the file /CDGServer3/document/Catelogs;logindojojs?command=DelCatelogs. The manipulation of the argument id leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2024-10-06T22:15:02.677",
    "keywords": "remote,command"
  }
}