{
  "CVE-2024-32034": {
    "url": "https://github.com/decidim/decidim/commit/ff755e23814aeb56e9089fc08006a5d3faee47b6",
    "cvss": 6.8,
    "description": "decidim is a Free Open-Source participatory democracy, citizen participation and open government for cities and organizations. The admin panel is subject to potential Cross-site scripting (XSS) attach in case an admin assigns a valuator to a proposal, or does any other action that generates an admin activity log where one of the resources has an XSS crafted. This issue has been addressed in release version 0.27.7, 0.28.2, and newer. Users are advised to upgrade. Users unable to upgrade may redirect the pages /admin and /admin/logs to other admin pages to prevent this access (i.e. `/admin/organization/edit`).",
    "published": "2024-09-16T19:16:10.300"
  },
  "CVE-2024-39910": {
    "url": "https://github.com/decidim/decidim/commit/47adca81cabea898005ec07b130b008f2a2be99f",
    "cvss": 5.4,
    "description": "decidim is a Free Open-Source participatory democracy, citizen participation and open government for cities and organizations. The WYSWYG editor QuillJS is subject to potential XSS attach in case the attacker manages to modify the HTML before being uploaded to the server. The attacker is able to change e.g. to <svg onload=alert('XSS')> if they know how to craft these requests themselves. This issue has been addressed in release version 0.27.7. All users are advised to upgrade. Users unable to upgrade should review the user accounts that have access to the admin panel (i.e. general Administrators, and participatory space's Administrators) and remove access to them if they don't need it. Disable the \"Enable rich text editor for participants\" setting in the admin dashboard",
    "published": "2024-09-16T19:16:10.540"
  },
  "CVE-2024-40863": {
    "cvss": "-",
    "description": "This issue was addressed with improved data protection. This issue is fixed in iOS 18 and iPadOS 18. An app may be able to leak sensitive user information.",
    "published": "2024-09-17T00:15:49.793",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-44125": {
    "cvss": "-",
    "description": "The issue was addressed with improved checks. This issue is fixed in macOS Sonoma 14.7, macOS Sequoia 15. A malicious application may be able to leak sensitive user information.",
    "published": "2024-09-17T00:15:49.940",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-44129": {
    "cvss": "-",
    "description": "The issue was addressed with improved checks. This issue is fixed in macOS Ventura 13.7, macOS Sequoia 15. An app may be able to leak sensitive user information.",
    "published": "2024-09-17T00:15:50.090",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-44165": {
    "cvss": "-",
    "description": "A logic issue was addressed with improved checks. This issue is fixed in macOS Ventura 13.7, iOS 17.7 and iPadOS 17.7, visionOS 2, iOS 18 and iPadOS 18, macOS Sonoma 14.7, macOS Sequoia 15. Network traffic may leak outside a VPN tunnel.",
    "published": "2024-09-17T00:15:51.207",
    "keywords": "vpn,leak"
  },
  "CVE-2024-45496": {
    "cvss": 9.9,
    "description": "A flaw was found in OpenShift. This issue occurs due to the misuse of elevated privileges in the OpenShift Container Platform's build process. During the build initialization step, the git-clone container is run with a privileged security context, allowing unrestricted access to the node. An attacker with developer-level access can provide a crafted .gitconfig file containing commands executed during the cloning process, leading to arbitrary command execution on the worker node. An attacker running code in a privileged container could escalate their permissions on the node running the container.",
    "published": "2024-09-17T00:15:52.433",
    "keywords": "execution,command"
  },
  "CVE-2024-5998": {
    "cvss": 5.2,
    "description": "A vulnerability in the FAISS.deserialize_from_bytes function of langchain-ai/langchain allows for pickle deserialization of untrusted data. This can lead to the execution of arbitrary commands via the os.system function. The issue affects the latest version of the product.",
    "published": "2024-09-17T12:15:02.977",
    "keywords": "execution,command"
  },
  "CVE-2024-38812": {
    "cvss": 9.8,
    "description": "The vCenter Server contains a heap-overflow vulnerability in the implementation of the DCERPC protocol. A malicious actor with network access to vCenter Server may trigger this vulnerability by sending a specially crafted network packet potentially leading to remote code execution.",
    "published": "2024-09-17T18:15:03.920",
    "keywords": "remote,execution"
  },
  "CVE-2024-42503": {
    "cvss": 7.2,
    "description": "Authenticated command execution vulnerability exist in the  ArubaOS command line interface (CLI). Successful exploitation of this vulnerabilities result in the ability to run arbitrary commands as a priviledge user on the underlying operating system.",
    "published": "2024-09-17T18:15:04.710",
    "keywords": "execution,command"
  },
  "CVE-2024-45803": {
    "cvss": "-",
    "description": "Wire UI is a library of components and resources to empower Laravel and Livewire application development. A potential Cross-Site Scripting (XSS) vulnerability has been identified in the `/wireui/button` endpoint, specifically through the `label` query parameter. Malicious actors could exploit this vulnerability by injecting JavaScript into the `label` parameter, leading to the execution of arbitrary code in the victim's browser. The `/wireui/button` endpoint dynamically renders button labels based on user-provided input via the `label` query parameter. Due to insufficient sanitization or escaping of this input, an attacker can inject malicious JavaScript. By crafting such a request, an attacker can inject arbitrary code that will be executed by the browser when the endpoint is accessed. If exploited, this vulnerability could allow an attacker to execute arbitrary JavaScript code in the context of the affected website. This could lead to: **Session Hijacking**: Stealing session cookies, tokens, or other sensitive information. **User Impersonation**: Performing unauthorized actions on behalf of authenticated users. **Phishing**: Redirecting users to malicious websites. **Content Manipulation**: Altering the appearance or behavior of the affected page to mislead users or execute further attacks. The severity of this vulnerability depends on the context of where the affected component is used, but in all cases, it poses a significant risk to user security. This issue has been addressed in release versions 1.19.3 and 2.1.3. Users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-09-17T19:15:28.660",
    "keywords": "execution,sensitive"
  },
  "CVE-2024-8946": {
    "url": "https://github.com/micropython/micropython/commit/29943546343c92334e8518695a11fc0e2ceea68b",
    "cvss": 7.3,
    "description": "A vulnerability was found in MicroPython 1.23.0. It has been classified as critical. Affected is the function mp_vfs_umount of the file extmod/vfs.c of the component VFS Unmount Handler. The manipulation leads to heap-based buffer overflow. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The name of the patch is 29943546343c92334e8518695a11fc0e2ceea68b. It is recommended to apply a patch to fix this issue. In the VFS unmount process, the comparison between the mounted path string and the unmount requested string is based solely on the length of the unmount string, which can lead to a heap buffer overflow read.",
    "published": "2024-09-17T19:15:29.220"
  },
  "CVE-2024-8948": {
    "url": "https://github.com/micropython/micropython/commit/908ab1ceca15ee6fd0ef82ca4cba770a3ec41894",
    "cvss": 7.3,
    "description": "A vulnerability was found in MicroPython 1.23.0. It has been rated as critical. Affected by this issue is the function mpz_as_bytes of the file py/objint.c. The manipulation leads to heap-based buffer overflow. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The patch is identified as 908ab1ceca15ee6fd0ef82ca4cba770a3ec41894. It is recommended to apply a patch to fix this issue. In micropython objint component, converting zero from int to bytes leads to heap buffer-overflow-write at mpz_as_bytes.",
    "published": "2024-09-17T19:15:29.747"
  },
  "CVE-2024-8956": {
    "cvss": 9.1,
    "description": "PTZOptics PT30X-SDI/NDI-xx before firmware 6.3.40 is vulnerable to an insufficient authentication issue. The camera does not properly enforce authentication to /cgi-bin/param.cgi when requests are sent without an HTTP Authorization header. The result is a remote and unauthenticated attacker can leak sensitive data such as usernames, password hashes, and configurations details. Additionally, the attacker can update individual configuration values or overwrite the whole file.",
    "published": "2024-09-17T20:15:07.287",
    "keywords": "remote,unauthenticated,authentication,sensitive,leak"
  },
  "CVE-2024-45816": {
    "cvss": 6.5,
    "description": "Backstage is an open framework for building developer portals. When using the AWS S3 or GCS storage provider for TechDocs it is possible to access content in the entire storage bucket. This can leak contents of the bucket that are not intended to be accessible, as well as bypass permission checks in Backstage. This has been fixed in the 1.10.13 release of the `@backstage/plugin-techdocs-backend` package. All users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-09-17T21:15:12.553",
    "keywords": "bypass,leak"
  },
  "CVE-2024-8957": {
    "cvss": 7.2,
    "description": "PTZOptics PT30X-SDI/NDI-xx before firmware 6.3.40 is vulnerable to an OS command injection issue. The camera does not sufficiently validate the ntp_addr configuration value which may lead to arbitrary command execution when ntp_client is started. When chained with CVE-2024-8956, a remote and unauthenticated attacker can execute arbitrary OS commands on affected devices.",
    "published": "2024-09-17T21:15:13.423",
    "keywords": "remote,execution,unauthenticated,command"
  },
  "CVE-2024-6641": {
    "cvss": 5.3,
    "description": "The WP Hardening – Fix Your WordPress Security plugin for WordPress is vulnerable to Security Feature Bypass in all versions up to, and including, 1.2.6. This is due to use of an incorrect regular expression within the \"Stop User Enumeration\" feature. This makes it possible for unauthenticated attackers to bypass intended security restrictions and expose site usernames.",
    "published": "2024-09-18T06:15:02.490",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2024-41929": {
    "cvss": 8.8,
    "description": "Improper authentication vulnerability in multiple digital video recorders provided by TAKENAKA ENGINEERING CO., LTD. allows a remote authenticated attacker to execute an arbitrary OS command on the device or alter the device settings.",
    "published": "2024-09-18T07:15:02.847",
    "keywords": "remote,authentication,command"
  },
  "CVE-2024-43778": {
    "cvss": 8.8,
    "description": "OS command injection vulnerability in multiple digital video recorders provided by TAKENAKA ENGINEERING CO., LTD. allows a remote authenticated attacker to execute an arbitrary OS command on the device or alter the device settings.",
    "published": "2024-09-18T07:15:03.007",
    "keywords": "remote,command"
  },
  "CVE-2024-47001": {
    "cvss": 8.8,
    "description": "Hidden functionality issue in multiple digital video recorders provided by TAKENAKA ENGINEERING CO., LTD. allows a remote authenticated attacker to execute an arbitrary OS command on the device or alter the device settings.",
    "published": "2024-09-18T07:15:04.220",
    "keywords": "remote,command"
  },
  "CVE-2024-8969": {
    "cvss": 6.5,
    "description": "OMFLOW from The SYSCOM Group has a vulnerability involving the exposure of sensitive data. This allows remote attackers who have logged into the system to obtain password hashes of all users and administrators.",
    "published": "2024-09-18T07:15:04.657",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-8887": {
    "cvss": 10.0,
    "description": "CIRCUTOR Q-SMT in its firmware version 1.0.4, could be affected by a denial of service (DoS) attack if an attacker with access to the web service bypasses the authentication mechanisms on the login page, allowing the attacker to use all the functionalities implemented at web level that allow interacting with the device.",
    "published": "2024-09-18T11:15:10.530",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-34026": {
    "cvss": 9.0,
    "description": "A stack-based buffer overflow vulnerability exists in the OpenPLC Runtime EtherNet/IP parser functionality of OpenPLC _v3 b4702061dc14d1024856f71b4543298d77007b88. A specially crafted EtherNet/IP request can lead to remote code execution. An attacker can send a series of EtherNet/IP requests to trigger this vulnerability.",
    "published": "2024-09-18T15:15:14.623",
    "keywords": "remote,execution"
  },
  "CVE-2024-5958": {
    "cvss": "-",
    "description": "Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection') vulnerability in Eliz Software Panel allows Command Line Execution through SQL Injection.This issue affects Panel: before v2.3.24.",
    "published": "2024-09-18T15:15:18.510",
    "keywords": "execution,command"
  },
  "CVE-2024-34399": {
    "cvss": 9.8,
    "description": "**UNSUPPORTED WHEN ASSIGNED** An issue was discovered in BMC Remedy Mid Tier 7.6.04. An unauthenticated remote attacker is able to access any user account without using any password. NOTE: This vulnerability only affects products that are no longer supported by the maintainer and the impacted version for this vulnerability is 7.6.04 only.",
    "published": "2024-09-18T18:15:06.163",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-45523": {
    "cvss": "-",
    "description": "An issue was discovered in Bravura Security Fabric versions 12.3.x before 12.3.5.32784, 12.4.x before 12.4.3.35110, 12.5.x before 12.5.2.35950, 12.6.x before 12.6.2.37183, and 12.7.x before 12.7.1.38241. An unauthenticated attacker can cause a resource leak by issuing multiple failed login attempts through API SOAP.",
    "published": "2024-09-18T18:15:06.420",
    "keywords": "unauthenticated,leak"
  },
  "CVE-2024-46986": {
    "cvss": 9.9,
    "description": "Camaleon CMS is a dynamic and advanced content management system based on Ruby on Rails. An arbitrary file write vulnerability accessible via the upload method of the MediaController allows authenticated users to write arbitrary files to any location on the web server Camaleon CMS is running on (depending on the permissions of the underlying filesystem). E.g. This can lead to a delayed remote code execution in case an attacker is able to write a Ruby file into the config/initializers/ subfolder of the Ruby on Rails application. This issue has been addressed in release version 2.8.2. Users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-09-18T18:15:07.223",
    "keywords": "remote,execution"
  },
  "CVE-2024-39339": {
    "cvss": "-",
    "description": "A vulnerability has been discovered in all versions of Smartplay headunits, which are widely used in Suzuki and Toyota cars. This misconfiguration can lead to information disclosure, leaking sensitive details such as diagnostic log traces, system logs, headunit passwords, and personally identifiable information (PII). The exposure of such information may have serious implications for user privacy and system integrity.",
    "published": "2024-09-18T20:15:03.197",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-47085": {
    "cvss": "-",
    "description": "This vulnerability exists in Apex Softcell LD DP Back Office due to improper validation of certain parameters “cCdslClicentcode” and “cLdClientCode” in the API endpoint. An authenticated remote attacker could exploit this vulnerability by manipulating parameters in the API request body leading to exposure of sensitive information belonging to other users.",
    "published": "2024-09-19T06:15:02.960",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-47086": {
    "cvss": "-",
    "description": "This vulnerability exists in Apex Softcell LD DP Back Office due to improper implementation of OTP validation mechanism in certain API endpoints. An authenticated remote attacker could exploit this vulnerability by providing arbitrary OTP value for authentication and subsequently changing its API response.  \n\nSuccessful exploitation of this vulnerability could allow the attacker to bypass OTP verification for other user accounts.",
    "published": "2024-09-19T06:15:03.227",
    "keywords": "remote,authentication,bypass"
  },
  "CVE-2024-47087": {
    "cvss": "-",
    "description": "This vulnerability exists in Apex Softcell LD Geo due to improper validation of the certain parameters (Client ID, DPID or BOID) in the API endpoint. An authenticated remote attacker could exploit this vulnerability by manipulating parameters in the API request body leading to exposure of sensitive information belonging to other users.",
    "published": "2024-09-19T07:15:02.360",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-47088": {
    "cvss": "-",
    "description": "This vulnerability exists in Apex Softcell LD Geo due to missing restrictions for excessive failed authentication attempts on its API based login. A remote attacker could exploit this vulnerability by conducting a brute force attack on login OTP, which could lead to gain unauthorized access to other user accounts.",
    "published": "2024-09-19T07:15:02.507",
    "keywords": "remote,authentication"
  },
  "CVE-2024-46382": {
    "cvss": 6.5,
    "description": "A SQL injection vulnerability in linlinjava litemall 1.8.0 allows a remote attacker to obtain sensitive information via the goodsId, goodsSn, and name parameters in AdminGoodscontroller.java.",
    "published": "2024-09-19T13:15:04.007",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-8375": {
    "url": "https://github.com/google-deepmind/reverb/commit/6a0dcf4c9e842b7f999912f792aaa6f6bd261a25",
    "cvss": "-",
    "description": "There exists a use after free vulnerability in Reverb. Reverb supports the VARIANT datatype, which is supposed to represent an arbitrary object in C++. When a tensor proto of type VARIANT is unpacked, memory is first allocated to store the entire tensor, and a ctor is called on each instance. Afterwards, Reverb copies the content in tensor_content to the previously mentioned pre-allocated memory, which results in the bytes in tensor_content overwriting the vtable pointers of all the objects which were previously allocated. Reverb exposes 2 relevant gRPC endpoints: InsertStream and SampleStream. The attacker can insert this stream into the server’s database, then when the client next calls SampleStream they will unpack the tensor into RAM, and when any method on that object is called (including its destructor) the attacker gains control of the Program Counter. We recommend upgrading past git commit  https://github.com/google-deepmind/reverb/commit/6a0dcf4c9e842b7f999912f792aaa6f6bd261a25",
    "published": "2024-09-19T16:15:06.023"
  },
  "CVE-2024-38016": {
    "cvss": 7.8,
    "description": "Microsoft Office Visio Remote Code Execution Vulnerability",
    "published": "2024-09-19T17:15:12.947",
    "keywords": "remote,execution"
  }
}