{
  "CVE-2024-5211": {
    "url": "https://github.com/mintplex-labs/anything-llm/commit/e208074ef4c240fe03e4147ab097ec3b52b97619",
    "cvss": 9.1,
    "description": "A path traversal vulnerability in mintplex-labs/anything-llm allowed a manager to bypass the `normalizePath()` function, intended to defend against path traversal attacks. This vulnerability enables the manager to read, delete, or overwrite the 'anythingllm.db' database file and other files stored in the 'storage' directory, such as internal communication keys and .env secrets. Exploitation of this vulnerability could lead to application compromise, denial of service (DoS) attacks, and unauthorized admin account takeover. The issue stems from improper validation of user-supplied input in the process of setting a custom logo for the app, which can be manipulated to achieve arbitrary file read, deletion, or overwrite, and to execute a DoS attack by deleting critical files required for the application's operation.",
    "published": "2024-06-12T12:15:10.520"
  },
  "CVE-2024-1577": {
    "cvss": "-",
    "description": "Remote Code Execution vulnerability in MegaBIP software allows to execute arbitrary code on the server without requiring authentication by saving crafted by the attacker PHP code to one of the website files. This issue affects all versions of MegaBIP software.",
    "published": "2024-06-12T14:15:10.683",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2024-36263": {
    "url": "https://github.com/apache/submarine/pull/1121",
    "cvss": "-",
    "description": "** UNSUPPORTED WHEN ASSIGNED ** Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection') vulnerability in Apache Submarine Server Core.\n\nThis issue affects Apache Submarine Server Core: all versions.\n\nAs this project is retired, we do not plan to release a version that fixes this issue. Users are recommended to find an alternative or restrict access to the instance to trusted users.\n\nNOTE: This vulnerability only affects products that are no longer supported by the maintainer.\n\n",
    "published": "2024-06-12T14:15:11.740"
  },
  "CVE-2024-36264": {
    "url": "https://github.com/apache/submarine/pull/1125",
    "cvss": "-",
    "description": "** UNSUPPORTED WHEN ASSIGNED ** Improper Authentication vulnerability in Apache Submarine Commons Utils.\n\nThis issue affects Apache Submarine Commons Utils: from 0.8.0.\n\nAs this project is retired, we do not plan to release a version that fixes this issue. Users are recommended to find an alternative or restrict access to the instance to trusted users.\n\nNOTE: This vulnerability only affects products that are no longer supported by the maintainer.\n\n",
    "published": "2024-06-12T14:15:11.983"
  },
  "CVE-2024-28964": {
    "cvss": 7.8,
    "description": "Dell Common Event Enabler, version 8.9.10.0 and prior, contain an insecure deserialization vulnerability in CAVATools. A local unauthenticated attacker could potentially exploit this vulnerability, leading to arbitrary code execution in the context of the logged in user. Exploitation of this issue requires a victim to open a malicious file.",
    "published": "2024-06-12T15:15:50.647",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-34065": {
    "cvss": 7.1,
    "description": "Strapi is an open-source content management system. By combining two vulnerabilities (an `Open Redirect` and `session token sent as URL query parameter`) in @strapi/plugin-users-permissions before version 4.24.2, is its possible of an unauthenticated attacker to bypass authentication mechanisms and retrieve the 3rd party tokens. The attack requires user interaction (one click). Unauthenticated attackers can leverage two vulnerabilities to obtain an 3rd party token and the bypass authentication of Strapi apps. Users should upgrade @strapi/plugin-users-permissions to version 4.24.2 to receive a patch.",
    "published": "2024-06-12T15:15:51.460",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-36840": {
    "cvss": "-",
    "description": "SQL Injection vulnerability in Boelter Blue System Management v.1.3 allows a remote attacker to execute arbitrary code and obtain sensitive information via the id parameter to news_details.php and location_details.php; and the section parameter to services.php.",
    "published": "2024-06-12T15:15:52.493",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-36761": {
    "url": "https://github.com/gfx-rs/naga/issues/2591",
    "cvss": "-",
    "description": "naga v0.14.0 was discovered to contain a stack overflow via the component /wgsl/parse/mod.rs.",
    "published": "2024-06-12T16:15:11.983"
  },
  "CVE-2024-37036": {
    "cvss": 9.8,
    "description": "CWE-787: Out-of-bounds Write vulnerability exists that could result in an authentication bypass\nwhen sending a malformed POST request and particular configuration parameters are set.",
    "published": "2024-06-12T17:15:50.637",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-37629": {
    "url": "https://github.com/summernote/summernote/issues/4642",
    "cvss": "-",
    "description": "SummerNote 0.8.18 is vulnerable to Cross Site Scripting (XSS) via the Code View Function.",
    "published": "2024-06-12T18:15:12.293"
  },
  "CVE-2024-36523": {
    "url": "https://github.com/648540858/wvp-gb28181-pro/issues/1456",
    "cvss": "-",
    "description": "An access control issue in Wvp GB28181 Pro 2.0 allows users to continue to access information in the application after deleting their own or administrator accounts. This is provided that the users do not log out of their deleted accounts.",
    "published": "2024-06-12T21:15:50.407"
  },
  "CVE-2024-3922": {
    "cvss": 10.0,
    "description": "The Dokan Pro plugin for WordPress is vulnerable to SQL Injection via the 'code' parameter in all versions up to, and including, 3.10.3 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-06-13T02:15:08.833",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-38293": {
    "cvss": "-",
    "description": "ALCASAR before 3.6.1 allows CSRF and remote code execution in activity.php.",
    "published": "2024-06-13T05:15:50.517",
    "keywords": "remote,execution"
  },
  "CVE-2024-38294": {
    "cvss": "-",
    "description": "ALCASAR before 3.6.1 allows email_registration_back.php remote code execution.",
    "published": "2024-06-13T05:15:50.667",
    "keywords": "remote,execution"
  },
  "CVE-2024-38295": {
    "cvss": "-",
    "description": "ALCASAR before 3.6.1 allows still_connected.php remote code execution.",
    "published": "2024-06-13T05:15:50.760",
    "keywords": "remote,execution"
  },
  "CVE-2024-30276": {
    "cvss": 5.5,
    "description": "Audition versions 24.2, 23.6.4 and earlier Answer: are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-06-13T09:15:09.760",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-4371": {
    "cvss": 9.0,
    "description": "The CoDesigner WooCommerce Builder for Elementor – Customize Checkout, Shop, Email, Products & More plugin for WordPress is vulnerable to PHP Object Injection in all versions up to, and including, 4.4.1 via deserialization of untrusted input from the recently_viewed_products cookie. This makes it possible for unauthenticated attackers to inject a PHP Object. No known POP chain is present in the vulnerable plugin. If a POP chain is present via an additional plugin or theme installed on the target system, it could allow the attacker to delete arbitrary files, retrieve sensitive data, or execute code.",
    "published": "2024-06-13T09:15:14.617",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-30278": {
    "cvss": 5.5,
    "description": "Media Encoder versions 23.6.5, 24.3 and earlier Answer: are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-06-13T10:15:09.110",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-30472": {
    "cvss": 7.5,
    "description": "Telemetry Dashboard v1.0.0.8 for Dell ThinOS 2402 contains a sensitive information disclosure vulnerability. An unauthenticated user with local access to the device could exploit this vulnerability leading to information disclosure.",
    "published": "2024-06-13T12:15:10.410",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-36647": {
    "url": "https://github.com/churchcrm/crm/issues/7029",
    "cvss": "-",
    "description": "A stored cross-site scripting (XSS) vulnerability in Church CRM v5.8.0 allows attackers to execute arbitrary web scripts or HTML via a crafted payload injected into the Family Name parameter under the Register a New Family page.",
    "published": "2024-06-13T14:15:12.590"
  },
  "CVE-2024-28965": {
    "cvss": 5.4,
    "description": "Dell SCG, versions prior to 5.24.00.00, contain an Improper Access Control vulnerability in the SCG exposed for an internal enable REST API (if enabled by Admin user from UI). A remote low privileged attacker could potentially exploit this vulnerability, leading to the execution of certain Internal APIs applicable only for Admin Users on the application's backend database that could potentially allow an unauthorized user access to restricted resources and change of state.",
    "published": "2024-06-13T15:15:51.033",
    "keywords": "remote,execution"
  },
  "CVE-2024-28966": {
    "cvss": 5.4,
    "description": "Dell SCG, versions prior to 5.24.00.00, contain an Improper Access Control vulnerability in the SCG exposed for an internal update REST API (if enabled by Admin user from UI). A remote low privileged attacker could potentially exploit this vulnerability, leading to the execution of certain APIs applicable only for Admin Users on the application's backend database that could potentially allow an unauthorized user access to restricted resources and change of state.",
    "published": "2024-06-13T15:15:51.423",
    "keywords": "remote,execution"
  },
  "CVE-2024-28967": {
    "cvss": 5.4,
    "description": "Dell SCG, versions prior to 5.24.00.00, contain an Improper Access Control vulnerability in the SCG exposed for an internal maintenance REST API (if enabled by Admin user from UI). A remote low privileged attacker could potentially exploit this vulnerability, leading to the execution of certain APIs applicable only for Admin Users on the application's backend database that could potentially allow an unauthorized user access to restricted resources and change of state.",
    "published": "2024-06-13T15:15:51.660",
    "keywords": "remote,execution"
  },
  "CVE-2024-28968": {
    "cvss": 5.4,
    "description": "Dell SCG, versions prior to 5.24.00.00, contain an Improper Access Control vulnerability in the SCG exposed for internal email and collection settings REST APIs (if enabled by Admin user from UI). A remote low privileged attacker could potentially exploit this vulnerability, leading to the execution of certain APIs applicable only for Admin Users on the application's backend database that could potentially allow an unauthorized user access to restricted resources and change of state.",
    "published": "2024-06-13T15:15:51.890",
    "keywords": "remote,execution"
  },
  "CVE-2024-28969": {
    "cvss": 4.3,
    "description": "Dell SCG, versions prior to 5.24.00.00, contain an Improper Access Control vulnerability in the SCG exposed for an internal update REST API (if enabled by Admin user from UI). A remote low privileged attacker could potentially exploit this vulnerability, leading to the execution of certain APIs applicable only for Admin Users on the application's backend database that could potentially allow an unauthorized user access to restricted resources.",
    "published": "2024-06-13T15:15:52.183",
    "keywords": "remote,execution"
  },
  "CVE-2024-29168": {
    "cvss": 5.4,
    "description": "Dell SCG, versions prior to 5.22.00.00, contain a SQL Injection Vulnerability in the SCG UI for an internal assets REST API. A remote authenticated attacker could potentially exploit this vulnerability, leading to the execution of certain SQL commands on the application's backend database causing potential unauthorized access and modification of application data.",
    "published": "2024-06-13T15:15:52.433",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-37131": {
    "cvss": 7.5,
    "description": "SCG Policy Manager, all versions, contains an overly permissive Cross-Origin Resource Policy (CORP) vulnerability. A remote unauthenticated attacker could potentially exploit this vulnerability, leading to the execution of malicious actions on the application in the context of the authenticated user.",
    "published": "2024-06-13T15:15:52.740",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-22441": {
    "cvss": "-",
    "description": "HPE Cray Parallel Application Launch Service (PALS) is subject to an authentication bypass.",
    "published": "2024-06-13T16:15:10.493",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-29169": {
    "cvss": 5.4,
    "description": "Dell SCG, versions prior to 5.22.00.00, contain a SQL Injection Vulnerability in the SCG UI for an internal audit REST API. A remote authenticated attacker could potentially exploit this vulnerability, leading to the execution of certain SQL commands on the application's backend database causing potential unauthorized access and modification of application data.",
    "published": "2024-06-13T16:15:10.610",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-37307": {
    "url": "https://github.com/cilium/cilium/commit/bf9a1ae1b2d2b2c9cca329d7aa96aa4858032a61",
    "cvss": 7.9,
    "description": "Cilium is a networking, observability, and security solution with an eBPF-based dataplane. Starting in version 1.13.0 and prior to versions 1.13.7, 1.14.12, and 1.15.6, the output of `cilium-bugtool` can contain sensitive data when the tool is run (with the `--envoy-dump` flag set) against Cilium deployments with the Envoy proxy enabled. Users of the TLS inspection, Ingress with TLS termination, Gateway API with TLS termination, and Kafka network policies with API key filtering features are affected. The sensitive data includes the CA certificate, certificate chain, and private key used by Cilium HTTP Network Policies, and when using Ingress/Gateway API and the API keys used in Kafka-related network policy. `cilium-bugtool` is a debugging tool that is typically invoked manually and does not run during the normal operation of a Cilium cluster. This issue has been patched in Cilium v1.15.6, v1.14.12, and v1.13.17. There is no workaround to this issue.",
    "published": "2024-06-13T16:15:11.180"
  },
  "CVE-2024-38279": {
    "cvss": "-",
    "description": "The affected product is vulnerable to an attacker modifying the bootloader by using custom arguments to bypass authentication and gain access to the file system and obtain password hashes.",
    "published": "2024-06-13T17:15:51.193",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-5924": {
    "cvss": 8.8,
    "description": "Dropbox Desktop Folder Sharing Mark-of-the-Web Bypass Vulnerability. This vulnerability allows remote attackers to bypass the Mark-of-the-Web protection mechanism on affected installations of Dropbox Desktop. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the handling of shared folders. When syncing files from a shared folder belonging to an untrusted account, the Dropbox desktop application does not apply the Mark-of-the-Web to the local files. An attacker can leverage this vulnerability to execute arbitrary code in the context of the current user. Was ZDI-CAN-23991.",
    "published": "2024-06-13T20:15:16.000",
    "keywords": "remote,bypass"
  },
  "CVE-2024-5947": {
    "cvss": 6.5,
    "description": "Deep Sea Electronics DSE855 Configuration Backup Missing Authentication Information Disclosure Vulnerability. This vulnerability allows network-adjacent attackers to disclose sensitive information on affected installations of Deep Sea Electronics DSE855 devices. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the web-based UI. The issue results from the lack of authentication prior to allowing access to functionality. An attacker can leverage this vulnerability to disclose stored credentials, leading to further compromise. Was ZDI-CAN-22679.",
    "published": "2024-06-13T20:15:16.277",
    "keywords": "authentication,sensitive"
  },
  "CVE-2024-5948": {
    "cvss": 8.8,
    "description": "Deep Sea Electronics DSE855 Multipart Boundary Stack-Based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of Deep Sea Electronics DSE855 devices. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the handling of multipart boundaries. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a fixed-length stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of the device. Was ZDI-CAN-23170.",
    "published": "2024-06-13T20:15:16.497",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2024-5950": {
    "cvss": 8.8,
    "description": "Deep Sea Electronics DSE855 Multipart Value Handling Stack-Based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of Deep Sea Electronics DSE855 devices. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the handling of multipart form variables. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a fixed-length stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of the device. Was ZDI-CAN-23172.",
    "published": "2024-06-13T20:15:16.923",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2024-5951": {
    "cvss": 7.1,
    "description": "Deep Sea Electronics DSE855 Factory Reset Missing Authentication Denial-of-Service Vulnerability. This vulnerability allows network-adjacent attackers to bypass authentication on affected installations of Deep Sea Electronics DSE855 devices. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the web-based UI. The issue results from the lack of authentication prior to allowing access to functionality. An attacker can leverage this vulnerability to create a denial-of-service condition on the system. Was ZDI-CAN-23173.",
    "published": "2024-06-13T20:15:17.140",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-5952": {
    "cvss": 4.3,
    "description": "Deep Sea Electronics DSE855 Restart Missing Authentication Denial-of-Service Vulnerability. This vulnerability allows network-adjacent attackers to bypass authentication on affected installations of Deep Sea Electronics DSE855 devices. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the web-based UI. The issue results from the lack of authentication prior to allowing access to functionality. An attacker can leverage this vulnerability to create a denial-of-service condition on the system. Was ZDI-CAN-23174.",
    "published": "2024-06-13T20:15:17.350",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-29781": {
    "cvss": "-",
    "description": "In ss_AnalyzeOssReturnResUssdArgIe of ss_OssAsnManagement.c, there is a possible out of bounds read due to improper input validation. This could lead to remote information disclosure with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-06-13T21:15:52.027",
    "keywords": "remote,execution"
  },
  "CVE-2024-29786": {
    "cvss": "-",
    "description": "In pktproc_fill_data_addr_without_bm of link_rx_pktproc.c, there is a possible out of bounds write due to a missing bounds check. This could lead to remote code execution with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-06-13T21:15:52.257",
    "keywords": "remote,execution"
  },
  "CVE-2024-32894": {
    "cvss": "-",
    "description": "In bc_get_converted_received_bearer of bc_utilities.c, there is a possible out of bounds read due to a missing bounds check. This could lead to remote information disclosure with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-06-13T21:15:53.923",
    "keywords": "remote,execution"
  },
  "CVE-2024-32896": {
    "cvss": 7.8,
    "description": "there is a possible way to bypass  due to a logic error in the code. This could lead to local escalation of privilege with no additional execution privileges needed. User interaction is needed for exploitation.",
    "published": "2024-06-13T21:15:54.080",
    "keywords": "execution,bypass"
  },
  "CVE-2024-32905": {
    "cvss": "-",
    "description": "In circ_read of link_device_memory_legacy.c, there is a possible out of bounds write due to an incorrect bounds check. This could lead to remote code execution with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-06-13T21:15:54.730",
    "keywords": "remote,execution"
  },
  "CVE-2024-32908": {
    "cvss": "-",
    "description": "In sec_media_protect of media.c, there is a possible permission bypass due to a race condition. This could lead to local escalation of privilege with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-06-13T21:15:54.957",
    "keywords": "execution,bypass"
  },
  "CVE-2024-32911": {
    "cvss": "-",
    "description": "There is a possible escalation of privilege due to improperly used crypto. This could lead to remote escalation of privilege with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-06-13T21:15:55.173",
    "keywords": "remote,execution"
  },
  "CVE-2024-32913": {
    "cvss": "-",
    "description": "In wl_notify_rx_mgmt_frame of wl_cfg80211.c, there is a possible out of bounds write due to an integer overflow. This could lead to remote code execution with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-06-13T21:15:55.327",
    "keywords": "remote,execution"
  },
  "CVE-2024-32923": {
    "cvss": "-",
    "description": "there is a possible cellular denial of service due to a logic error in the code. This could lead to remote denial of service with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-06-13T21:15:56.040",
    "keywords": "remote,execution"
  },
  "CVE-2024-32924": {
    "cvss": "-",
    "description": "In DeregAcceptProcINT of cn_NrmmStateDeregInit.cpp, there is a possible denial of service due to a logic error in the code. This could lead to remote denial of service with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-06-13T21:15:56.113",
    "keywords": "remote,execution"
  },
  "CVE-2024-32925": {
    "cvss": "-",
    "description": "In dhd_prot_txstatus_process of dhd_msgbuf.c, there is a possible out of bounds write due to a missing bounds check. This could lead to remote code execution with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-06-13T21:15:56.187",
    "keywords": "remote,execution"
  },
  "CVE-2024-0095": {
    "cvss": 9.0,
    "description": "NVIDIA Triton Inference Server for Linux and Windows contains a vulnerability where a user can inject forged logs and executable commands by injecting arbitrary data as a new log entry. A successful exploit of this vulnerability might lead to code execution, denial of service, escalation of privileges, information disclosure, and data tampering.",
    "published": "2024-06-13T22:15:13.347",
    "keywords": "execution,command"
  },
  "CVE-2024-27143": {
    "cvss": 9.8,
    "description": "Toshiba printers use SNMP for configuration. Using the private community, it is possible to remotely execute commands as root on the remote printer. Using this vulnerability will allow any attacker to get a root access on a remote Toshiba printer. This vulnerability can be executed in combination with other vulnerabilities and  difficult to execute alone. So, the CVSS score for this vulnerability alone is lower than the score listed in the \"Base Score\" of this vulnerability. For detail on related other vulnerabilities, please ask to the below contact point.\n https://www.toshibatec.com/contacts/products/ \nAs for the affected products/models/versions, see the reference URL.",
    "published": "2024-06-14T03:15:10.243",
    "keywords": "remote,command"
  },
  "CVE-2024-27144": {
    "cvss": 9.8,
    "description": "The Toshiba printers provide several ways to upload files using the web interface without authentication. An attacker can overwrite any insecure files. And the Toshiba printers are vulnerable to a Local Privilege Escalation vulnerability. An attacker can remotely compromise any Toshiba printer. The programs can be replaced by malicious programs by any local or remote attacker. This vulnerability can be executed in combination with other vulnerabilities and  difficult to execute alone. So, the CVSS score for this vulnerability alone is lower than the score listed in the \"Base Score\" of this vulnerability. For detail on related other vulnerabilities, please ask to the below contact point.\n https://www.toshibatec.com/contacts/products/ \nAs for the affected products/models/versions, see the reference URL.",
    "published": "2024-06-14T03:15:10.483",
    "keywords": "remote,authentication"
  },
  "CVE-2024-3079": {
    "cvss": 7.2,
    "description": "Certain models of ASUS routers have buffer overflow vulnerabilities, allowing remote attackers with administrative privileges to execute arbitrary commands on the device.",
    "published": "2024-06-14T03:15:13.540",
    "keywords": "remote,command"
  },
  "CVE-2024-3080": {
    "cvss": 9.8,
    "description": "Certain ASUS router models have authentication bypass vulnerability, allowing unauthenticated remote attackers to log in the device.",
    "published": "2024-06-14T03:15:13.807",
    "keywords": "remote,unauthenticated,authentication,bypass"
  },
  "CVE-2024-27156": {
    "cvss": 6.8,
    "description": "The session cookies, used for authentication, are stored in clear-text logs. An attacker can retrieve authentication sessions. A remote attacker can retrieve the credentials and bypass the authentication mechanism. As for the affected products/models/versions, see the reference URL.",
    "published": "2024-06-14T04:15:18.743",
    "keywords": "remote,authentication,bypass"
  },
  "CVE-2024-27157": {
    "cvss": 6.8,
    "description": "The sessions are stored in clear-text logs. An attacker can retrieve authentication sessions. A remote attacker can retrieve the credentials and bypass the authentication mechanism. As for the affected products/models/versions, see the reference URL.",
    "published": "2024-06-14T04:15:26.607",
    "keywords": "remote,authentication,bypass"
  },
  "CVE-2024-27168": {
    "cvss": 7.1,
    "description": "It appears that some hardcoded keys are used for authentication to internal API. Knowing these private keys may allow attackers to bypass authentication and reach administrative interfaces. As for the affected products/models/versions, see the reference URL.",
    "published": "2024-06-14T04:15:34.900",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-27169": {
    "cvss": 8.4,
    "description": "Toshiba printers provides API without authentication for internal access. A local attacker can bypass authentication in applications, providing administrative access. As for the affected products/models/versions, see the reference URL.",
    "published": "2024-06-14T04:15:35.183",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-27171": {
    "cvss": 7.4,
    "description": "A remote attacker using the insecure upload functionality will be able to overwrite any Python file and get Remote Code Execution. As for the affected products/models/versions, see the reference URL.",
    "published": "2024-06-14T04:15:35.910",
    "keywords": "remote,execution"
  },
  "CVE-2024-27172": {
    "cvss": 9.8,
    "description": "Remote Command program allows an attacker to get Remote Code Execution. As for the affected products/models/versions, see the reference URL.",
    "published": "2024-06-14T04:15:36.257",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-27173": {
    "cvss": 9.8,
    "description": "Remote Command program allows an attacker to get Remote Code Execution by overwriting existing Python files containing executable code. This vulnerability can be executed in combination with other vulnerabilities and  difficult to execute alone. So, the CVSS score for this vulnerability alone is lower than the score listed in the \"Base Score\" of this vulnerability. For detail on related other vulnerabilities, please ask to the below contact point.\n https://www.toshibatec.com/contacts/products/ \nAs for the affected products/models/versions, see the reference URL.",
    "published": "2024-06-14T04:15:36.540",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-27174": {
    "cvss": 9.8,
    "description": "Remote Command program allows an attacker to get Remote Code Execution. This vulnerability can be executed in combination with other vulnerabilities and  difficult to execute alone. So, the CVSS score for this vulnerability alone is lower than the score listed in the \"Base Score\" of this vulnerability. For detail on related other vulnerabilities, please ask to the below contact point.\n https://www.toshibatec.com/contacts/products/ \nAs for the affected products/models/versions, see the reference URL.",
    "published": "2024-06-14T04:15:36.907",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-27175": {
    "cvss": 4.4,
    "description": "Remote Command program allows an attacker to read any file using a Local File Inclusion vulnerability. An attacker can read any file on the printer. As for the affected products/models/versions, see the reference URL.",
    "published": "2024-06-14T04:15:37.280",
    "keywords": "remote,command"
  },
  "CVE-2024-27176": {
    "cvss": 7.2,
    "description": "An attacker can get Remote Code Execution by overwriting files. Overwriting files is enable by falsifying session ID variable. This vulnerability can be executed in combination with other vulnerabilities and  difficult to execute alone. So, the CVSS score for this vulnerability alone is lower than the score listed in the \"Base Score\" of this vulnerability. For detail on related other vulnerabilities, please ask to the below contact point.\n https://www.toshibatec.com/contacts/products/ \nAs for the affected products/models/versions, see the reference URL.",
    "published": "2024-06-14T04:15:37.640",
    "keywords": "remote,execution"
  },
  "CVE-2024-27177": {
    "cvss": 7.2,
    "description": "An attacker can get Remote Code Execution by overwriting files.  Overwriting files is enable by falsifying package name variable. This vulnerability can be executed in combination with other vulnerabilities and  difficult to execute alone. So, the CVSS score for this vulnerability alone is lower than the score listed in the \"Base Score\" of this vulnerability. For detail on related other vulnerabilities, please ask to the below contact point.\n https://www.toshibatec.com/contacts/products/ \nAs for the affected products/models/versions, see the reference URL.",
    "published": "2024-06-14T04:15:38.500",
    "keywords": "remote,execution"
  },
  "CVE-2024-27178": {
    "cvss": 7.2,
    "description": "An attacker can get Remote Code Execution by overwriting files.  Overwriting files is enable by falsifying file name variable. This vulnerability can be executed in combination with other vulnerabilities and  difficult to execute alone. So, the CVSS score for this vulnerability alone is lower than the score listed in the \"Base Score\" of this vulnerability. For detail on related other vulnerabilities, please ask to the below contact point.\n https://www.toshibatec.com/contacts/products/ \nAs for the affected products/models/versions, see the reference URL.",
    "published": "2024-06-14T04:15:38.907",
    "keywords": "remote,execution"
  },
  "CVE-2024-27179": {
    "cvss": 4.7,
    "description": "Admin cookies are written in clear-text in logs. An attacker can retrieve them and bypass the authentication mechanism. As for the affected products/models/versions, see the reference URL.",
    "published": "2024-06-14T04:15:39.153",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-31161": {
    "cvss": 7.2,
    "description": "The upload functionality of ASUS Download Master does not properly filter user input. Remote attackers with administrative privilege can exploit this vulnerability to upload any file to any location. They may even upload malicious web page files to the website directory, allowing arbitrary system commands to be executed upon browsing the webpage.",
    "published": "2024-06-14T04:15:42.323",
    "keywords": "remote,command"
  },
  "CVE-2024-3496": {
    "cvss": 8.8,
    "description": "Attackers can bypass the web login authentication process to gain access to the printer's system information and upload malicious drivers to the printer. As for the affected products/models/versions, see the reference URL.",
    "published": "2024-06-14T05:15:48.713",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-4936": {
    "cvss": 9.8,
    "description": "The Canto plugin for WordPress is vulnerable to Remote File Inclusion in all versions up to, and including, 3.0.8 via the abspath parameter. This makes it possible for unauthenticated attackers to include remote files on the server, resulting in code execution. This required allow_url_include to be enabled on the target site in order to exploit.",
    "published": "2024-06-14T05:15:49.400",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-31162": {
    "cvss": 7.2,
    "description": "The specific function parameter of ASUS Download Master does not properly filter user input. An unauthenticated remote attacker with administrative privileges can exploit this vulnerability to execute arbitrary system commands on the device.",
    "published": "2024-06-14T07:15:50.153",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-31163": {
    "cvss": 7.2,
    "description": "ASUS Download Master has a buffer overflow vulnerability. An unauthenticated remote attacker with administrative privileges can exploit this vulnerability to execute arbitrary system commands on the device.",
    "published": "2024-06-14T07:15:50.713",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-5577": {
    "cvss": 9.8,
    "description": "The Where I Was, Where I Will Be plugin for WordPress is vulnerable to Remote File Inclusion in version <= 1.1.1 via the WIW_HEADER parameter of the /system/include/include_user.php file. This makes it possible for unauthenticated attackers to include and execute arbitrary files hosted on external servers, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution. This requires allow_url_include to be set to true in order to exploit, which is not commonly enabled.",
    "published": "2024-06-14T08:15:42.157",
    "keywords": "remote,execution,unauthenticated,sensitive,bypass"
  },
  "CVE-2024-3912": {
    "cvss": 9.8,
    "description": "Certain models of ASUS routers have an arbitrary firmware upload vulnerability. An unauthenticated remote attacker can exploit this vulnerability to execute arbitrary system commands on the device.",
    "published": "2024-06-14T10:15:10.513",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-2024": {
    "cvss": 8.8,
    "description": "The Folders Pro plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the 'handle_folders_file_upload' function in all versions up to, and including, 3.0.2. This makes it possible for authenticated attackers, with author access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-06-14T13:15:51.223",
    "keywords": "remote,execution"
  },
  "CVE-2024-5671": {
    "cvss": 9.8,
    "description": "Insecure Deserialization in some workflows of the IPS Manager allows unauthenticated remote attackers to perform arbitrary code execution and access to the vulnerable Trellix IPS Manager.",
    "published": "2024-06-14T14:15:11.213",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-36656": {
    "url": "https://github.com/minthcm/minthcm/issues/67",
    "cvss": "-",
    "description": "In MintHCM 4.0.3, a registered user can execute arbitrary JavaScript code and achieve a reflected Cross-site Scripting (XSS) attack.",
    "published": "2024-06-14T15:15:50.873"
  },
  "CVE-2024-37367": {
    "cvss": "-",
    "description": "A user authentication vulnerability exists in the Rockwell Automation FactoryTalk® View SE v12. The vulnerability allows a user from a remote system with FTView to send a packet to the customer’s server to view an HMI project.  This action is allowed without proper authentication verification.",
    "published": "2024-06-14T15:15:51.940",
    "keywords": "remote,authentication"
  },
  "CVE-2024-37368": {
    "cvss": "-",
    "description": "A user authentication vulnerability exists in the Rockwell Automation FactoryTalk® View SE. The vulnerability allows a user from a remote system with FTView to send a packet to the customer’s server to view an HMI project. Due to the lack of proper authentication, this action is allowed without proper authentication verification.",
    "published": "2024-06-14T15:15:52.100",
    "keywords": "remote,authentication"
  },
  "CVE-2024-33373": {
    "cvss": "-",
    "description": "An issue in the LB-LINK BL-W1210M v2.0 router allows attackers to bypass password complexity requirements and set single digit passwords for authentication. This vulnerability can allow attackers to access the router via a brute-force attack.",
    "published": "2024-06-14T16:15:11.223",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-24320": {
    "cvss": "-",
    "description": "Directory Traversal vulnerability in Mgt-commerce CloudPanel v.2.0.0 thru v.2.4.0 allows a remote attacker to obtain sensitive information and execute arbitrary code via the service parameter of the load-logfiles function.",
    "published": "2024-06-14T18:15:27.200",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-37889": {
    "url": "https://github.com/treyww/myfinances/commit/2c1e6d5b7ec8b2d6f660b260e3c5f4d3eaaa613f",
    "cvss": 6.5,
    "description": "MyFinances is a web application for managing finances. MyFinances has a way to access other customer invoices while signed in as a user. This method allows an actor to access PII and financial information from another account. The vulnerability is fixed in 0.4.6.",
    "published": "2024-06-14T20:15:11.873"
  }
}