{
  "CVE-2024-8252": {
    "cvss": 8.8,
    "description": "The Clean Login plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 1.14.5 via the 'template' attribute of the clean-login-register shortcode. This makes it possible for authenticated attackers, with Contributor-level access and above, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-08-30T10:15:07.657",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-44916": {
    "cvss": 7.2,
    "description": "Vulnerability in admin_ip.php in Seacms v13.1, when action=set, allows attackers to control IP parameters that are written to the data/admin/ip.php file and could result in arbitrary command execution.",
    "published": "2024-08-30T16:15:09.623",
    "keywords": "execution,command"
  },
  "CVE-2024-0110": {
    "cvss": 4.4,
    "description": "NVIDIA CUDA Toolkit contains a vulnerability in command `cuobjdump` where a user may cause an out-of-bound write by passing in a malformed ELF file. A successful exploit of this vulnerability may lead to code execution or denial of service.",
    "published": "2024-08-31T09:15:05.990",
    "keywords": "execution,command"
  },
  "CVE-2024-45508": {
    "url": "https://github.com/michaelrsweet/htmldoc/commit/2d5b2ab9ddbf2aee2209010cebc11efdd1cab6e2",
    "cvss": "-",
    "description": "HTMLDOC before 1.9.19 has an out-of-bounds write in parse_paragraph in ps-pdf.cxx because of an attempt to strip leading whitespace from a whitespace-only node.",
    "published": "2024-09-01T22:15:13.987"
  },
  "CVE-2024-45509": {
    "url": "https://github.com/misp/misp/commit/3f3b9a574f349182a545636e12efa39267e9db04",
    "cvss": "-",
    "description": "In MISP through 2.4.196, app/Controller/BookmarksController.php does not properly restrict access to bookmarks data in the case where the user is not an org admin.",
    "published": "2024-09-01T22:15:14.053"
  },
  "CVE-2024-8370": {
    "cvss": 3.5,
    "description": "A vulnerability classified as problematic was found in Grocy up to 4.2.0. This vulnerability affects unknown code of the file /api/files/recipepictures/ of the component SVG File Upload Handler. The manipulation of the argument force_serve_as with the input picture' leads to cross site scripting. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The real existence of this vulnerability is still doubted at the moment. NOTE: The project maintainer explains that \"this is 'nonsense' and practically irrelevant according to the project's security policy\" which expects additional authentication for the software.",
    "published": "2024-09-01T22:15:14.117",
    "keywords": "remote,authentication"
  },
  "CVE-2024-45522": {
    "url": "https://github.com/linen-dev/linen.dev/commit/cd37c3e88ec29f4e7baae7e32fe80d0137848d10",
    "cvss": "-",
    "description": "Linen before cd37c3e does not verify that the domain is linen.dev or www.linen.dev when resetting a password. This occurs in create in apps/web/pages/api/forgot-password/index.ts.",
    "published": "2024-09-02T00:15:11.830"
  },
  "CVE-2024-20089": {
    "cvss": "-",
    "description": "In wlan, there is a possible denial of service due to incorrect error handling. This could lead to remote denial of service with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: ALPS08861558; Issue ID: MSV-1526.",
    "published": "2024-09-02T05:15:15.277",
    "keywords": "remote,execution"
  },
  "CVE-2024-39775": {
    "cvss": 6.5,
    "description": "in OpenHarmony v4.1.0 and prior versions allow a remote attacker cause information leak through out-of-bounds Read.",
    "published": "2024-09-02T05:15:16.160",
    "keywords": "remote,leak"
  },
  "CVE-2024-41157": {
    "cvss": 8.8,
    "description": "in OpenHarmony v4.1.0 and prior versions allow a local attacker cause the common permission is upgraded to root and sensitive information leak through use after free.",
    "published": "2024-09-02T05:15:16.740",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-41160": {
    "cvss": 8.8,
    "description": "in OpenHarmony v4.1.0 and prior versions allow a local attacker cause the common permission is upgraded to root and sensitive information leak through use after free.",
    "published": "2024-09-02T05:15:16.923",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-43772": {
    "cvss": "-",
    "description": "SQL Injection in download student learning course function of Easytest Online Test Platform ver.24E01 and earlier allow remote attackers to execute arbitrary SQL commands via the uid parameter.",
    "published": "2024-09-02T05:15:17.120",
    "keywords": "remote,command"
  },
  "CVE-2024-43773": {
    "cvss": "-",
    "description": "SQL Injection in download class learning course function of Easytest Online Test Platform ver.24E01 and earlier allow remote attackers to execute arbitrary SQL commands via the cstr parameter.",
    "published": "2024-09-02T05:15:17.237",
    "keywords": "remote,command"
  },
  "CVE-2024-43774": {
    "cvss": "-",
    "description": "SQL Injection in download personal learning course function of Easytest Online Test Platform ver.24E01 and earlier allow remote authenticated users to execute arbitrary SQL commands via the uid parameter.",
    "published": "2024-09-02T05:15:17.330",
    "keywords": "remote,command"
  },
  "CVE-2024-43775": {
    "cvss": "-",
    "description": "SQL Injection in search course titles function of Easytest Online Test Platform ver.24E01 and earlier allow remote authenticated users to execute arbitrary SQL commands via the search parameter.",
    "published": "2024-09-02T05:15:17.420",
    "keywords": "remote,command"
  },
  "CVE-2024-43776": {
    "cvss": "-",
    "description": "SQL Injection in mock exam function of Easytest Online Test Platform ver.24E01 and earlier allow remote authenticated users to execute arbitrary SQL commands via the qlevel parameter.",
    "published": "2024-09-02T05:15:17.520",
    "keywords": "remote,command"
  },
  "CVE-2024-7871": {
    "cvss": "-",
    "description": "SQL Injection in online dictionary function of Easytest Online Test Platform ver.24E01 and earlier allow remote authenticated users to execute arbitrary SQL commands via the word parameter.",
    "published": "2024-09-02T05:15:17.733",
    "keywords": "remote,command"
  }
}