{
  "CVE-2024-41870": {
    "cvss": 5.5,
    "description": "Media Encoder versions 24.5, 23.6.8 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-09-13T07:15:03.750",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-41872": {
    "cvss": 5.5,
    "description": "Media Encoder versions 24.5, 23.6.8 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-09-13T07:15:04.440",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-41873": {
    "cvss": 5.5,
    "description": "Media Encoder versions 24.5, 23.6.8 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-09-13T07:15:04.790",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-39382": {
    "cvss": 5.5,
    "description": "After Effects versions 23.6.6, 24.5 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-09-13T09:15:05.770",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-39385": {
    "cvss": 5.5,
    "description": "Premiere Pro versions 24.5, 23.6.8 and earlier are affected by a Use After Free vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-09-13T09:15:07.470",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-45111": {
    "cvss": 5.5,
    "description": "Illustrator versions 28.6, 27.9.5 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-09-13T09:15:13.263",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-8242": {
    "cvss": 4.3,
    "description": "The MStore API – Create Native Android & iOS Apps On The Cloud plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the update_user_profile() function in all versions up to, and including, 4.15.3. This makes it possible for authenticated attackers, with subscriber-level access and above, to upload arbitrary files (not including PHP files) on the affected site's server which may make remote code execution possible. This can be paired with a registration endpoint for unauthenticated users to exploit the issue.",
    "published": "2024-09-13T15:15:16.767",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-45368": {
    "cvss": 8.8,
    "description": "The H2-DM1E PLC's authentication protocol appears to utilize either a custom encoding scheme or a challenge-response protocol. However, there's an observed anomaly in the H2-DM1E PLC's protocol execution, namely its acceptance of multiple distinct packets as valid authentication responses. This behavior deviates from standard security practices where a single, specific response or encoding pattern is expected for successful authentication.",
    "published": "2024-09-13T17:15:12.800",
    "keywords": "execution,authentication"
  },
  "CVE-2024-39924": {
    "cvss": 7.5,
    "description": "An issue was discovered in Vaultwarden (formerly Bitwarden_RS) 1.30.3. A vulnerability has been identified in the authentication and authorization process of the endpoint responsible for altering the metadata of an emergency access. It permits an attacker with granted emergency access to escalate their privileges by changing the access level and modifying the wait time. Consequently, the attacker can gain full control over the vault (when only intended to have read access) while bypassing the necessary wait period.",
    "published": "2024-09-13T18:15:03.810",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-8271": {
    "cvss": 7.3,
    "description": "The The FOX – Currency Switcher Professional for WooCommerce plugin for WordPress is vulnerable to arbitrary shortcode execution in all versions up to, and including, 1.4.2.1. This is due to the software allowing users to execute an action that does not properly validate a value before running do_shortcode in the 'woocs_get_custom_price_html' function. This makes it possible for unauthenticated attackers to execute arbitrary shortcodes.",
    "published": "2024-09-14T03:15:08.730",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-8775": {
    "cvss": 5.5,
    "description": "A flaw was found in Ansible, where sensitive information stored in Ansible Vault files can be exposed in plaintext during the execution of a playbook. This occurs when using tasks such as include_vars to load vaulted variables without setting the no_log: true parameter, resulting in sensitive data being printed in the playbook output or logs. This can lead to the unintentional disclosure of secrets like passwords or API keys, compromising security and potentially allowing unauthorized access or actions.",
    "published": "2024-09-14T03:15:08.987",
    "keywords": "execution,sensitive"
  },
  "CVE-2024-8479": {
    "cvss": 7.3,
    "description": "The The Simple Spoiler plugin for WordPress is vulnerable to arbitrary shortcode execution in versions 1.2 to 1.3. This is due to the plugin adding the filter add_filter('comment_text', 'do_shortcode'); which will run all shortcodes in comments. This makes it possible for unauthenticated attackers to execute arbitrary shortcodes.",
    "published": "2024-09-14T04:15:04.733",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-8869": {
    "cvss": 5.0,
    "description": "A vulnerability classified as critical has been found in TOTOLINK A720R 4.1.5. Affected is the function exportOvpn. The manipulation leads to os command injection. It is possible to launch the attack remotely. The complexity of an attack is rather high. The exploitability is told to be difficult. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-09-15T11:15:13.323",
    "keywords": "remote,command,vpn"
  },
  "CVE-2024-8777": {
    "cvss": 7.5,
    "description": "OMFLOW from The SYSCOM Group has an information leakage vulnerability, allowing unauthorized remote attackers to read arbitrary system configurations. If LDAP authentication is enabled, attackers can obtain plaintext credentials.",
    "published": "2024-09-16T06:15:11.483",
    "keywords": "remote,authentication,leak"
  }
}