{
  "CVE-2024-0889": {
    "cvss": 5.3,
    "description": "A vulnerability was found in Kmint21 Golden FTP Server 2.02b and classified as problematic. This issue affects some unknown processing of the component PASV Command Handler. The manipulation leads to denial of service. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-252041 was assigned to this vulnerability.",
    "published": "2024-01-25T23:15:08.790",
    "keywords": "remote,command"
  },
  "CVE-2024-21619": {
    "cvss": 5.3,
    "description": "A Missing Authentication for Critical Function vulnerability combined with a Generation of Error Message Containing Sensitive Information vulnerability in J-Web of Juniper Networks Junos OS on SRX Series and EX Series allows an unauthenticated, network-based attacker to access sensitive system information.\n\nWhen a user logs in, a temporary file which contains the configuration of the device (as visible to that user) is created in the /cache folder. An unauthenticated attacker can then attempt to access such a file by sending a specific request to the device trying to guess the name of such a file. Successful exploitation will reveal configuration information.\n\nThis issue affects Juniper Networks Junos OS on SRX Series and EX Series:\n  *  All versions earlier than 20.4R3-S9;\n  *  21.2 versions earlier than 21.2R3-S7;\n  *  21.3 versions earlier than 21.3R3-S5;\n  *  21.4 versions earlier than 21.4R3-S6;\n  *  22.1 versions earlier than 22.1R3-S5;\n  *  22.2 versions earlier than 22.2R3-S3;\n  *  22.3 versions earlier than 22.3R3-S2;\n  *  22.4 versions earlier than 22.4R3;\n  *  23.2 versions earlier than 23.2R1-S2, 23.2R2.\n\n\n",
    "published": "2024-01-25T23:15:09.467",
    "keywords": "unauthenticated,authentication,sensitive"
  },
  "CVE-2024-23613": {
    "cvss": 10.0,
    "description": "A buffer overflow vulnerability exists in Symantec Deployment Solution version 7.9 when parsing UpdateComputer tokens. A remote, anonymous attacker can exploit this vulnerability to achieve remote code execution as SYSTEM.\n",
    "published": "2024-01-26T00:15:08.123",
    "keywords": "remote,execution"
  },
  "CVE-2024-23614": {
    "cvss": 10.0,
    "description": "A buffer overflow vulnerability exists in Symantec Messaging Gateway versions 9.5 and before. A remote, anonymous attacker can exploit this vulnerability to achieve remote code execution as root.\n",
    "published": "2024-01-26T00:15:08.373",
    "keywords": "remote,execution"
  },
  "CVE-2024-23615": {
    "cvss": 10.0,
    "description": "A buffer overflow vulnerability exists in Symantec Messaging Gateway versions 10.5 and before. A remote, anonymous attacker can exploit this vulnerability to achieve remote code execution as root.\n",
    "published": "2024-01-26T00:15:08.627",
    "keywords": "remote,execution"
  },
  "CVE-2024-23616": {
    "cvss": 10.0,
    "description": "A buffer overflow vulnerability exists in Symantec Server Management Suite version 7.9 and before. A remote, anonymous attacker can exploit this vulnerability to achieve remote code execution as SYSTEM.\n",
    "published": "2024-01-26T00:15:08.843",
    "keywords": "remote,execution"
  },
  "CVE-2024-23617": {
    "cvss": 9.6,
    "description": "A buffer overflow vulnerability exists in Symantec Data Loss Prevention version 14.0.2 and before. A remote, unauthenticated attacker can exploit this vulnerability by enticing a user to open a crafted document to achieve code execution.\n",
    "published": "2024-01-26T00:15:09.060",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-23618": {
    "cvss": 9.6,
    "description": "An arbitrary code execution vulnerability exists in Arris SURFboard SGB6950AC2 devices. An unauthenticated attacker can exploit this vulnerability to achieve code execution as root.\n",
    "published": "2024-01-26T00:15:09.263",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-23619": {
    "cvss": 9.8,
    "description": "A hardcoded credential vulnerability exists in IBM Merge Healthcare eFilm Workstation. A remote, unauthenticated attacker can exploit this vulnerability to achieve information disclosure or remote code execution.\n",
    "published": "2024-01-26T00:15:09.470",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-23621": {
    "cvss": 10.0,
    "description": "A buffer overflow exists in IBM Merge Healthcare eFilm Workstation license server. A remote, unauthenticated attacker can exploit this vulnerability to achieve remote code execution.",
    "published": "2024-01-26T00:15:09.957",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-23622": {
    "cvss": 10.0,
    "description": "A stack-based buffer overflow exists in IBM Merge Healthcare eFilm Workstation license server. A remote, unauthenticated attacker can exploit this vulnerability to achieve remote code execution with SYSTEM privileges.\n",
    "published": "2024-01-26T00:15:10.190",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-23624": {
    "cvss": 9.6,
    "description": "A command injection vulnerability exists in the gena.cgi module of D-Link DAP-1650 devices. An unauthenticated attacker can exploit this vulnerability to gain command execution on the device as root.\n",
    "published": "2024-01-26T00:15:10.397",
    "keywords": "execution,unauthenticated,command"
  },
  "CVE-2024-23625": {
    "cvss": 9.6,
    "description": "A command injection vulnerability exists in D-Link DAP-1650 devices when handling UPnP SUBSCRIBE messages. An unauthenticated attacker can exploit this vulnerability to gain command execution on the device as root.\n",
    "published": "2024-01-26T00:15:10.620",
    "keywords": "execution,unauthenticated,command"
  },
  "CVE-2024-23626": {
    "cvss": 9.0,
    "description": "A command injection vulnerability exists in the ‘SaveSysLogParams’ \nparameter of the Motorola MR2600. A remote attacker can exploit this \nvulnerability to achieve command execution. Authentication is required, \nhowever can be bypassed.\n",
    "published": "2024-01-26T00:15:10.820",
    "keywords": "remote,execution,authentication,command,bypass"
  },
  "CVE-2024-23627": {
    "cvss": 9.0,
    "description": "A command injection vulnerability exists in the 'SaveStaticRouteIPv4Params' parameter of the Motorola MR2600. A remote attacker can exploit this vulnerability to achieve command execution. Authentication is required, however can be bypassed.",
    "published": "2024-01-26T00:15:11.037",
    "keywords": "remote,execution,authentication,command,bypass"
  },
  "CVE-2024-23628": {
    "cvss": 9.0,
    "description": "A command injection vulnerability exists in the \n'SaveStaticRouteIPv6Params' parameter of the Motorola MR2600. A remote \nattacker can exploit this vulnerability to achieve command execution. \nAuthentication is required, however can be bypassed.",
    "published": "2024-01-26T00:15:11.273",
    "keywords": "remote,execution,authentication,command,bypass"
  },
  "CVE-2024-23629": {
    "cvss": 9.6,
    "description": "An authentication bypass vulnerability exists in the web component of the Motorola MR2600. An attacker can exploit this vulnerability to access protected URLs and retrieve sensitive information.\n",
    "published": "2024-01-26T00:15:11.650",
    "keywords": "authentication,sensitive,bypass"
  },
  "CVE-2024-23630": {
    "cvss": 9.0,
    "description": "An arbitrary firmware upload vulnerability exists in the Motorola \nMR2600. An attacker can exploit this vulnerability to achieve code \nexecution on the device. Authentication is required, however can be \nbypassed.",
    "published": "2024-01-26T00:15:12.187",
    "keywords": "execution,authentication,bypass"
  },
  "CVE-2024-0727": {
    "url": "https://github.com/openssl/openssl/commit/d135eeab8a5dbf72b3da5240bab9ddb7678dbd2c",
    "cvss": "-",
    "description": "Issue summary: Processing a maliciously formatted PKCS12 file may lead OpenSSL\nto crash leading to a potential Denial of Service attack\n\nImpact summary: Applications loading files in the PKCS12 format from untrusted\nsources might terminate abruptly.\n\nA file in PKCS12 format can contain certificates and keys and may come from an\nuntrusted source. The PKCS12 specification allows certain fields to be NULL, but\nOpenSSL does not correctly check for this case. This can lead to a NULL pointer\ndereference that results in OpenSSL crashing. If an application processes PKCS12\nfiles from an untrusted source using the OpenSSL APIs then that application will\nbe vulnerable to this issue.\n\nOpenSSL APIs that are vulnerable to this are: PKCS12_parse(),\nPKCS12_unpack_p7data(), PKCS12_unpack_p7encdata(), PKCS12_unpack_authsafes()\nand PKCS12_newpass().\n\nWe have also fixed a similar issue in SMIME_write_PKCS7(). However since this\nfunction is related to writing data we do not consider it security significant.\n\nThe FIPS modules in 3.2, 3.1 and 3.0 are not affected by this issue.",
    "published": "2024-01-26T09:15:07.637"
  },
  "CVE-2024-0918": {
    "cvss": 7.2,
    "description": "A vulnerability was found in TRENDnet TEW-800MB 1.0.1.0 and classified as critical. Affected by this issue is some unknown functionality of the component POST Request Handler. The manipulation of the argument DeviceURL leads to os command injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. VDB-252122 is the identifier assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-01-26T09:15:07.707",
    "keywords": "remote,command"
  },
  "CVE-2024-0919": {
    "cvss": 8.8,
    "description": "A vulnerability was found in TRENDnet TEW-815DAP 1.0.2.0. It has been classified as critical. This affects the function do_setNTP of the component POST Request Handler. The manipulation of the argument NtpDstStart/NtpDstEnd leads to command injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-252123. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-01-26T09:15:08.023",
    "keywords": "remote,command"
  },
  "CVE-2024-0920": {
    "cvss": 7.2,
    "description": "A vulnerability was found in TRENDnet TEW-822DRE 1.03B02. It has been declared as critical. This vulnerability affects unknown code of the file /admin_ping.htm of the component POST Request Handler. The manipulation of the argument ipv4_ping/ipv6_ping leads to command injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-252124. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-01-26T09:15:08.293",
    "keywords": "remote,command"
  },
  "CVE-2024-0921": {
    "cvss": 4.7,
    "description": "A vulnerability has been found in D-Link DIR-816 A2 1.10CNB04 and classified as critical. Affected by this vulnerability is an unknown functionality of the file /goform/setDeviceSettings of the component Web Interface. The manipulation of the argument statuscheckpppoeuser leads to os command injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-252139.",
    "published": "2024-01-26T14:15:50.237",
    "keywords": "remote,command"
  },
  "CVE-2024-20253": {
    "cvss": 9.9,
    "description": "A vulnerability in multiple Cisco Unified Communications and Contact Center Solutions products could allow an unauthenticated, remote attacker to execute arbitrary code on an affected device. This vulnerability is due to the improper processing of user-provided data that is being read into memory. An attacker could exploit this vulnerability by sending a crafted message to a listening port of an affected device. A successful exploit could allow the attacker to execute arbitrary commands on the underlying operating system with the privileges of the web services user. With access to the underlying operating system, the attacker could also establish root access on the affected device.",
    "published": "2024-01-26T18:15:10.970",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-20263": {
    "cvss": 5.8,
    "description": "A vulnerability with the access control list (ACL) management within a stacked switch configuration of Cisco Business 250 Series Smart Switches and Business 350 Series Managed Switches could allow an unauthenticated, remote attacker to bypass protection offered by a configured ACL on an affected device. This vulnerability is due to incorrect processing of ACLs on a stacked configuration when either the primary or backup switches experience a full stack reload or power cycle. An attacker could exploit this vulnerability by sending crafted traffic through an affected device. A successful exploit could allow the attacker to bypass configured ACLs, causing traffic to be dropped or forwarded in an unexpected manner. The attacker does not have control over the conditions that result in the device being in the vulnerable state. Note: In the vulnerable state, the ACL would be correctly applied on the primary devices but could be incorrectly applied to the backup devices.",
    "published": "2024-01-26T18:15:11.163",
    "keywords": "remote,unauthenticated,bypass"
  },
  "CVE-2024-20305": {
    "cvss": 4.8,
    "description": "A vulnerability in the web-based management interface of Cisco Unity Connection could allow an authenticated, remote attacker to conduct a cross-site scripting (XSS) attack against a user of the interface. This vulnerability exists because the web-based management interface does not properly validate user-supplied input. An attacker could exploit this vulnerability by persuading a user of the interface to click a crafted link. A successful exploit could allow the attacker to execute arbitrary script code in the context of the affected interface or access sensitive, browser-based information.",
    "published": "2024-01-26T18:15:11.350",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-0960": {
    "cvss": 5.0,
    "description": "A vulnerability was found in flink-extended ai-flow 0.3.1. It has been declared as critical. Affected by this vulnerability is the function cloudpickle.loads of the file \\ai_flow\\cli\\commands\\workflow_command.py. The manipulation leads to deserialization. The attack can be launched remotely. The complexity of an attack is rather high. The exploitation appears to be difficult. The exploit has been disclosed to the public and may be used. The identifier VDB-252205 was assigned to this vulnerability.",
    "published": "2024-01-27T12:15:07.903",
    "keywords": "remote,command"
  },
  "CVE-2024-0962": {
    "url": "https://github.com/obgm/libcoap/pull/1311",
    "cvss": 6.3,
    "description": "A vulnerability was found in obgm libcoap 4.3.4. It has been rated as critical. Affected by this issue is the function get_split_entry of the file src/coap_oscore.c of the component Configuration File Handler. The manipulation leads to stack-based buffer overflow. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. It is recommended to apply a patch to fix this issue. VDB-252206 is the identifier assigned to this vulnerability.",
    "published": "2024-01-27T13:15:07.973"
  }
}