{
  "CVE-2025-2294": {
    "cvss": 9.8,
    "description": "The Kubio AI Page Builder plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 2.5.1 via thekubio_hybrid_theme_load_template function. This makes it possible for unauthenticated attackers to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2025-03-28T05:15:41.507",
    "keywords": "execution,unauthenticated,sensitive,bypass"
  },
  "CVE-2025-2328": {
    "cvss": 8.8,
    "description": "The Drag and Drop Multiple File Upload for Contact Form 7 plugin for WordPress is vulnerable to arbitrary file deletion due to insufficient file path validation in the 'dnd_remove_uploaded_files' function in all versions up to, and including, 1.3.8.7. This makes it possible for unauthenticated attackers to add arbitrary file paths (such as ../../../../wp-config.php) to uploaded files on the server, which can easily lead to remote code execution when an Administrator deletes the message. Exploiting this vulnerability requires the Flamingo plugin to be installed and activated.",
    "published": "2025-03-28T07:15:39.243",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2025-2485": {
    "cvss": 7.5,
    "description": "The Drag and Drop Multiple File Upload for Contact Form 7 plugin for WordPress is vulnerable to PHP Object Injection in all versions up to, and including, 1.3.8.7 via deserialization of untrusted input from the 'dnd_upload_cf7_upload'\r\n function. This makes it possible for attackers to inject a PHP Object through a PHAR file. No known POP chain is present in the vulnerable software, which means this vulnerability has no impact unless another plugin or theme containing a POP chain is installed on the site. If a POP chain is present via an additional plugin or theme installed on the target system, it may allow the attacker to perform actions like delete arbitrary files, retrieve sensitive data, or execute code depending on the POP chain present. This vulnerability may be exploited by unauthenticated attackers when a form is present on the site with the file upload action. The Flamingo plugin must be installed and activated in order to exploit the vulnerability.",
    "published": "2025-03-28T07:15:39.450",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-28219": {
    "cvss": "-",
    "description": "Netgear DC112A V1.0.0.64 has an OS command injection vulnerability in the usb_adv.cgi, which allows remote attackers to execute arbitrary commands via parameter \"deviceName\" passed to the binary through a POST request.",
    "published": "2025-03-28T14:15:20.253",
    "keywords": "remote,command"
  },
  "CVE-2025-2858": {
    "cvss": "-",
    "description": "Privilege escalation vulnerability in the saTECH BCU firmware version 2.1.3. An attacker with access to the CLI of the device could make use of the nice command to bypass all restrictions and elevate privileges as a superuser.",
    "published": "2025-03-28T14:15:20.650",
    "keywords": "command,bypass"
  },
  "CVE-2025-30372": {
    "cvss": "-",
    "description": "Emlog is an open source website building system. Emlog Pro versions pro-2.5.7 and pro-2.5.8 contain an SQL injection vulnerability. `search_controller.php` does not use addslashes after urldecode, allowing the preceeding addslashes to be bypassed by URL double encoding. This could result in potential leakage of sensitive information from the user database. Version pro-2.5.9 fixes the issue.",
    "published": "2025-03-28T15:15:51.227",
    "keywords": "sensitive,bypass,leak"
  },
  "CVE-2025-2912": {
    "url": "https://github.com/hdfgroup/hdf5/issues/5370",
    "cvss": 3.3,
    "description": "A vulnerability was found in HDF5 up to 1.14.6. It has been declared as problematic. Affected by this vulnerability is the function H5O_msg_flush of the file src/H5Omessage.c. The manipulation of the argument oh leads to heap-based buffer overflow. The attack needs to be approached locally. The exploit has been disclosed to the public and may be used.",
    "published": "2025-03-28T16:15:30.540"
  },
  "CVE-2025-2913": {
    "url": "https://github.com/hdfgroup/hdf5/issues/5376",
    "cvss": 3.3,
    "description": "A vulnerability was found in HDF5 up to 1.14.6. It has been rated as problematic. Affected by this issue is the function H5FL__blk_gc_list of the file src/H5FL.c. The manipulation of the argument H5FL_blk_head_t leads to use after free. An attack has to be approached locally. The exploit has been disclosed to the public and may be used.",
    "published": "2025-03-28T17:15:30.260"
  },
  "CVE-2025-2914": {
    "url": "https://github.com/hdfgroup/hdf5/issues/5379",
    "cvss": 3.3,
    "description": "A vulnerability classified as problematic has been found in HDF5 up to 1.14.6. This affects the function H5FS__sinfo_Srialize_Sct_cb of the file src/H5FScache.c. The manipulation of the argument sect leads to heap-based buffer overflow. Local access is required to approach this attack. The exploit has been disclosed to the public and may be used.",
    "published": "2025-03-28T17:15:30.510"
  },
  "CVE-2025-2915": {
    "url": "https://github.com/hdfgroup/hdf5/issues/5380",
    "cvss": 3.3,
    "description": "A vulnerability classified as problematic was found in HDF5 up to 1.14.6. This vulnerability affects the function H5F__accum_free of the file src/H5Faccum.c. The manipulation of the argument overlap_size leads to heap-based buffer overflow. Attacking locally is a requirement. The exploit has been disclosed to the public and may be used.",
    "published": "2025-03-28T17:15:30.750"
  },
  "CVE-2025-2916": {
    "cvss": 6.3,
    "description": "A vulnerability, which was classified as critical, has been found in Aishida Call Center System up to 20250314. This issue affects some unknown processing of the file /doscall/weixin/open/amr2mp3. The manipulation of the argument File leads to command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2025-03-28T17:15:30.983",
    "keywords": "remote,command"
  },
  "CVE-2025-2923": {
    "url": "https://github.com/hdfgroup/hdf5/issues/5381",
    "cvss": 3.3,
    "description": "A vulnerability, which was classified as problematic, has been found in HDF5 up to 1.14.6. Affected by this issue is the function H5F_addr_encode_len of the file src/H5Fint.c. The manipulation of the argument pp leads to heap-based buffer overflow. Attacking locally is a requirement. The exploit has been disclosed to the public and may be used.",
    "published": "2025-03-28T19:15:24.003"
  },
  "CVE-2025-2924": {
    "url": "https://github.com/hdfgroup/hdf5/issues/5382",
    "cvss": 3.3,
    "description": "A vulnerability, which was classified as problematic, was found in HDF5 up to 1.14.6. This affects the function H5HL__fl_deserialize of the file src/H5HLcache.c. The manipulation of the argument free_block leads to heap-based buffer overflow. It is possible to launch the attack on the local host. The exploit has been disclosed to the public and may be used.",
    "published": "2025-03-28T20:15:26.147"
  },
  "CVE-2025-2925": {
    "url": "https://github.com/hdfgroup/hdf5/issues/5383",
    "cvss": 3.3,
    "description": "A vulnerability has been found in HDF5 up to 1.14.6 and classified as problematic. This vulnerability affects the function H5MM_realloc of the file src/H5MM.c. The manipulation of the argument mem leads to double free. The attack needs to be approached locally. The exploit has been disclosed to the public and may be used.",
    "published": "2025-03-28T20:15:26.440"
  },
  "CVE-2025-2926": {
    "url": "https://github.com/hdfgroup/hdf5/issues/5384",
    "cvss": 3.3,
    "description": "A vulnerability was found in HDF5 up to 1.14.6 and classified as problematic. This issue affects the function H5O__cache_chk_serialize of the file src/H5Ocache.c. The manipulation leads to null pointer dereference. An attack has to be approached locally. The exploit has been disclosed to the public and may be used.",
    "published": "2025-03-28T20:15:26.980"
  },
  "CVE-2025-22953": {
    "cvss": "-",
    "description": "A SQL injection vulnerability exists in the Epicor HCM 2021 1.9, specifically in the filter parameter of the JsonFetcher.svc endpoint. An attacker can exploit this vulnerability by injecting malicious SQL payloads into the filter parameter, enabling the unauthorized execution of arbitrary SQL commands on the backend database. If certain features (like xp_cmdshell) are enabled, this may lead to remote code execution.",
    "published": "2025-03-28T21:15:17.617",
    "keywords": "remote,execution,command"
  },
  "CVE-2025-2006": {
    "cvss": 8.8,
    "description": "The Inline Image Upload for BBPress plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the file uploading functionality in all versions up to, and including, 1.1.19. This makes it possible for authenticated attackers, with Subscriber-level access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible. This may be exploitable by unauthenticated attackers when the \"Allow guest users without accounts to create topics and replies\" setting is enabled.",
    "published": "2025-03-29T07:15:17.220",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2025-2249": {
    "cvss": 8.8,
    "description": "The SoJ SoundSlides plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the soj_soundslides_options_subpanel() function in all versions up to, and including, 1.2.2. This makes it possible for authenticated attackers, with Contributor-level access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2025-03-29T07:15:17.747",
    "keywords": "remote,execution"
  },
  "CVE-2025-2803": {
    "cvss": 7.3,
    "description": "The So-Called Air Quotes plugin for WordPress is vulnerable to arbitrary shortcode execution in all versions up to, and including, 0.1. This is due to the software allowing users to execute an action that does not properly validate a value before running do_shortcode. This makes it possible for unauthenticated attackers to execute arbitrary shortcodes.",
    "published": "2025-03-29T07:15:18.770",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2025-2840": {
    "cvss": 5.3,
    "description": "The DAP to Autoresponders Email Syncing plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 1.0 through the publicly accessible phpinfo.php script. This makes it possible for unauthenticated attackers to view potentially sensitive information contained in the exposed file.",
    "published": "2025-03-29T07:15:19.317",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-2953": {
    "url": "https://github.com/pytorch/pytorch/issues/149274#issue-2923122269",
    "cvss": 3.3,
    "description": "A vulnerability, which was classified as problematic, has been found in PyTorch 2.6.0+cu124. Affected by this issue is the function torch.mkldnn_max_pool2d. The manipulation leads to denial of service. An attack has to be approached locally. The exploit has been disclosed to the public and may be used.",
    "published": "2025-03-30T16:15:14.380"
  },
  "CVE-2025-3011": {
    "cvss": 9.8,
    "description": "SOOP-CLM from PiExtract has a SQL Injection vulnerability, allowing unauthenticated remote attackers to inject arbitrary SQL commands to read, modify, and delete database contents.",
    "published": "2025-03-31T04:15:19.037",
    "keywords": "remote,unauthenticated,command"
  }
}