{
  "CVE-2024-30891": {
    "cvss": "-",
    "description": "A command injection vulnerability exists in /goform/exeCommand in Tenda AC18 v15.03.05.05, which allows attackers to construct cmdinput parameters for arbitrary command execution.",
    "published": "2024-04-05T08:15:07.800",
    "keywords": "execution,command"
  },
  "CVE-2024-31220": {
    "cvss": 7.3,
    "description": "Sunshine is a self-hosted game stream host for Moonlight. Starting in version 0.16.0 and prior to version 0.18.0, an attacker may be able to remotely read arbitrary files without authentication due to a path traversal vulnerability. Users who exposed the Sunshine configuration web user interface outside of localhost may be affected, depending on firewall configuration. To exploit vulnerability, attacker could make an http/s request to the `node_modules` endpoint if user exposed Sunshine config web server to internet or attacker is on the LAN. Version 0.18.0 contains a patch for this issue. As a workaround, one may block access to Sunshine via firewall.",
    "published": "2024-04-05T15:15:08.060",
    "keywords": "remote,authentication"
  },
  "CVE-2024-3346": {
    "cvss": 6.3,
    "description": "A vulnerability was found in Byzro Smart S80 up to 20240328. It has been declared as critical. This vulnerability affects unknown code of the file /log/webmailattach.php. The manipulation of the argument mail_file_path leads to os command injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. VDB-259450 is the identifier assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-04-05T16:15:07.810",
    "keywords": "remote,command"
  },
  "CVE-2024-31848": {
    "cvss": 9.8,
    "description": "A path traversal vulnerability exists in the Java version of CData API Server < 23.4.8844 when running using the embedded Jetty server, which could allow an unauthenticated remote attacker to gain complete administrative access to the application.",
    "published": "2024-04-05T18:15:09.360",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-31849": {
    "cvss": 9.8,
    "description": "A path traversal vulnerability exists in the Java version of CData Connect < 23.4.8846 when running using the embedded Jetty server, which could allow an unauthenticated remote attacker to gain complete administrative access to the application.",
    "published": "2024-04-05T18:15:09.563",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-31850": {
    "cvss": 8.6,
    "description": "A path traversal vulnerability exists in the Java version of CData Arc < 23.4.8839 when running using the embedded Jetty server, which could allow an unauthenticated remote attacker to gain access to sensitive information and perform limited actions.",
    "published": "2024-04-05T18:15:09.753",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-31851": {
    "cvss": 8.6,
    "description": "A path traversal vulnerability exists in the Java version of CData Sync < 23.4.8843 when running using the embedded Jetty server, which could allow an unauthenticated remote attacker to gain access to sensitive information and perform limited actions.",
    "published": "2024-04-05T18:15:09.953",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-29741": {
    "cvss": "-",
    "description": "In pblS2mpuResume of s2mpu.c, there is a possible mitigation bypass due to a logic error in the code. This could lead to local escalation of privilege with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-04-05T20:15:08.060",
    "keywords": "execution,bypass"
  },
  "CVE-2024-29748": {
    "cvss": "-",
    "description": "there is a possible way to bypass  due to a logic error in the code. This could lead to local escalation of privilege with no additional execution privileges needed. User interaction is needed for exploitation.",
    "published": "2024-04-05T20:15:08.407",
    "keywords": "execution,bypass"
  },
  "CVE-2024-29757": {
    "cvss": "-",
    "description": "there is a possible permission bypass due to Debug certs being allowlisted. This could lead to local escalation of privilege with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-04-05T20:15:08.867",
    "keywords": "execution,bypass"
  },
  "CVE-2024-23592": {
    "cvss": 6.3,
    "description": "An authentication bypass vulnerability was reported in Lenovo devices with Synaptics fingerprint readers that could allow an attacker with physical access to replay fingerprints and bypass Windows Hello authentication.",
    "published": "2024-04-05T21:15:08.450",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-27910": {
    "cvss": 5.3,
    "description": "A vulnerability was reported in some Lenovo Printers that could allow an unauthenticated attacker to reboot the printer without authentication.",
    "published": "2024-04-05T21:15:09.060",
    "keywords": "unauthenticated,authentication"
  },
  "CVE-2024-2950": {
    "cvss": 5.3,
    "description": "The BoldGrid Easy SEO – Simple and Effective SEO plugin for WordPress is vulnerable to Information Exposure in all versions up to, and including, 1.6.14 via meta information (og:description) This makes it possible for unauthenticated attackers to view the first 130 characters of a password protected post which can contain sensitive information.",
    "published": "2024-04-06T04:15:11.463",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-3366": {
    "url": "https://github.com/xuxueli/xxl-job/issues/3391",
    "cvss": 3.5,
    "description": "A vulnerability classified as problematic was found in Xuxueli xxl-job up to 2.4.1. This vulnerability affects the function deserialize of the file com/xxl/job/core/util/JdkSerializeTool.java of the component Template Handler. The manipulation leads to injection. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-259480.",
    "published": "2024-04-06T11:15:08.740"
  },
  "CVE-2024-25029": {
    "cvss": 9.0,
    "description": "IBM Personal Communications 14.0.6 through 15.0.1 includes a Windows service that is vulnerable to remote code execution (RCE) and local privilege escalation (LPE). The vulnerability allows any unprivileged user with network access to a target computer to run commands with full privileges in the context of NT AUTHORITY\\SYSTEM. This allows for a low privileged attacker to move laterally to affected systems and to escalate their privileges.  IBM X-Force ID:  281619.",
    "published": "2024-04-06T12:15:08.400",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-3376": {
    "cvss": 7.3,
    "description": "A vulnerability classified as critical has been found in SourceCodester Computer Laboratory Management System 1.0. This affects an unknown part of the file config.php. The manipulation of the argument url leads to execution after redirect. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-259497 was assigned to this vulnerability.",
    "published": "2024-04-06T12:15:08.603",
    "keywords": "remote,execution"
  },
  "CVE-2024-27620": {
    "cvss": "-",
    "description": "An issue in Ladder v.0.0.1 thru v.0.0.21 allows a remote attacker to obtain sensitive information via a crafted request to the API.",
    "published": "2024-04-06T19:15:07.183",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-31948": {
    "url": "https://github.com/frrouting/frr/pull/15628",
    "cvss": "-",
    "description": "In FRRouting (FRR) through 9.1, an attacker using a malformed Prefix SID attribute in a BGP UPDATE packet can cause the bgpd daemon to crash.",
    "published": "2024-04-07T21:15:07.423"
  },
  "CVE-2024-31949": {
    "url": "https://github.com/frrouting/frr/pull/15640",
    "cvss": "-",
    "description": "In FRRouting (FRR) through 9.1, an infinite loop can occur when receiving a MP/GR capability as a dynamic capability because malformed data results in a pointer not advancing.",
    "published": "2024-04-07T21:15:07.480"
  },
  "CVE-2024-31950": {
    "url": "https://github.com/frrouting/frr/pull/15674/",
    "cvss": "-",
    "description": "In FRRouting (FRR) through 9.1, there can be a buffer overflow and daemon crash in ospf_te_parse_ri for OSPF LSA packets during an attempt to read Segment Routing subTLVs (their size is not validated).",
    "published": "2024-04-07T21:15:07.540"
  },
  "CVE-2024-31951": {
    "url": "https://github.com/frrouting/frr/pull/15674/",
    "cvss": "-",
    "description": "In the Opaque LSA Extended Link parser in FRRouting (FRR) through 9.1, there can be a buffer overflow and daemon crash in ospf_te_parse_ext_link for OSPF LSA packets during an attempt to read Segment Routing Adjacency SID subTLVs (lengths are not validated).",
    "published": "2024-04-07T21:15:07.600"
  },
  "CVE-2024-27488": {
    "cvss": "-",
    "description": "Incorrect Access Control vulnerability in ZLMediaKit versions 1.0 through 8.0, allows remote attackers to escalate privileges and obtain sensitive information. The application system enables the http API interface by default and uses the secret parameter method to authenticate the http restful api interface, but the secret is hardcoded by default.",
    "published": "2024-04-08T06:15:07.533",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-30661": {
    "cvss": "-",
    "description": "An unauthorized access vulnerability has been discovered in ROS Melodic Morenia versions where ROS_VERSION is 1 and ROS_PYTHON_VERSION is 3. This vulnerability could potentially allow a malicious user to gain unauthorized information access to multiple ROS nodes remotely. Unauthorized information access to these nodes could result in compromised system integrity, the execution of arbitrary commands, and disclosure of sensitive information.",
    "published": "2024-04-08T07:15:09.370",
    "keywords": "remote,execution,command,sensitive"
  },
  "CVE-2024-30665": {
    "cvss": "-",
    "description": "An OS command injection vulnerability has been discovered in ROS (Robot Operating System) Melodic Morenia in ROS_VERSION 1 and ROS_PYTHON_VERSION 3. This vulnerability primarily affects the command processing or system call components in ROS, making them susceptible to manipulation by malicious entities. Through this, unauthorized commands can be executed, leading to remote code execution (RCE), data theft, and malicious activities. The affected components include External Command Execution Modules, System Call Handlers, and Interface Scripts.",
    "published": "2024-04-08T07:15:09.643",
    "keywords": "remote,execution,command"
  }
}