{
  "CVE-2025-65113": {
    "cvss": 6.5,
    "description": "ClipBucket v5 is an open source video sharing platform. Prior to version 5.5.2 - #164, an authorization bypass vulnerability in the AJAX flagging system allows any unauthenticated user to flag any content (users, videos, photos, collections) on the platform. This can lead to mass flagging attacks, content disruption, and moderation system abuse. This issue has been patched in version 5.5.2 - #164.",
    "published": "2025-11-29T01:16:02.640",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2025-66034": {
    "cvss": 6.3,
    "description": "fontTools is a library for manipulating fonts, written in Python. In versions from 4.33.0 to before 4.60.2, the fonttools varLib (or python3 -m fontTools.varLib) script has an arbitrary file write vulnerability that leads to remote code execution when a malicious .designspace file is processed. The vulnerability affects the main() code path of fontTools.varLib, used by the fonttools varLib CLI and any code that invokes fontTools.varLib.main(). This issue has been patched in version 4.60.2.",
    "published": "2025-11-29T01:16:02.967",
    "keywords": "remote,execution"
  },
  "CVE-2025-66219": {
    "cvss": "-",
    "description": "willitmerge is a command line tool to check if pull requests are mergeable. In versions 0.2.1 and prior, there is a command Injection vulnerability in willitmerge. The vulnerability manifests in this package due to the use of insecure child process execution API (exec) to which it concatenates user input, whether provided to the command-line flag, or is in user control in the target repository. At time of publication, no known fix is public.",
    "published": "2025-11-29T02:15:52.577",
    "keywords": "execution,command"
  },
  "CVE-2025-66217": {
    "cvss": "-",
    "description": "AIS-catcher is a multi-platform AIS receiver. Prior to version 0.64, an integer underflow vulnerability exists in the MQTT parsing logic of AIS-catcher. This vulnerability allows an attacker to trigger a massive Heap Buffer Overflow by sending a malformed MQTT packet with a manipulated Topic Length field. This leads to an immediate Denial of Service (DoS) and, when used as a library, severe Memory Corruption that can be leveraged for Remote Code Execution (RCE). This issue has been patched in version 0.64.",
    "published": "2025-11-29T03:15:59.880",
    "keywords": "remote,execution"
  },
  "CVE-2025-65540": {
    "url": "https://github.com/exrick/xmall/issues/101",
    "cvss": 6.1,
    "description": "Multiple Cross-Site Scripting (XSS) vulnerabilities exist in xmall v1.1 due to improper handling of user-supplied data. User input fields such as username and description are directly rendered into HTML without proper sanitization or encoding, allowing attackers to inject and execute malicious scripts.",
    "published": "2025-11-29T04:15:56.417"
  },
  "CVE-2025-65892": {
    "cvss": 6.1,
    "description": "Reflected Cross-Site Scripting (rXSS) in krpano before version 1.23.2 allows a remote unauthenticated attacker to execute arbitrary JavaScript in the victim's browser via a crafted URL to the passQueryParameters function with the xml parameter enabled.",
    "published": "2025-11-29T04:15:57.367",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-66224": {
    "cvss": "-",
    "description": "OrangeHRM is a comprehensive human resource management (HRM) system. From version 5.0 to 5.7, the application contains an input-neutralization flaw in its mail configuration and delivery workflow that allows user-controlled values to flow directly into the system’s sendmail command. Because these values are not sanitized or constrained before being incorporated into the command execution path, certain sendmail behaviors can be unintentionally invoked during email processing. This makes it possible for the application to write files on the server as part of the mail-handling routine, and in deployments where those files end up in web-accessible locations, the behavior can be leveraged to achieve execution of attacker-controlled content. The issue stems entirely from constructing OS-level command strings using unsanitized input within the mail-sending logic. This issue has been patched in version 5.8.",
    "published": "2025-11-29T04:15:57.497",
    "keywords": "execution,command"
  },
  "CVE-2025-13615": {
    "cvss": 9.8,
    "description": "The StreamTube Core plugin for WordPress is vulnerable to Arbitrary User Password Change in versions up to, and including, 4.78. This is due to the plugin providing user-controlled access to objects, letting a user bypass authorization and access system resources. This makes it possible for unauthenticated attackers to change user passwords and potentially take over administrator accounts. Note: This can only be exploited if the 'registration password fields' enabled in theme options.",
    "published": "2025-11-30T02:15:58.233",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2025-66422": {
    "cvss": 4.3,
    "description": "Tryton trytond before 7.6.11 allows remote attackers to obtain sensitive trace-back (server setup) information. This is fixed in 7.6.11, 7.4.21, 7.0.40, and 6.0.70.",
    "published": "2025-11-30T03:15:47.970",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-35028": {
    "url": "https://github.com/0x4m4/hexstrike-ai/issues/115",
    "cvss": 9.1,
    "description": "By providing a command-line argument starting with a semi-colon ; to an API endpoint created by the EnhancedCommandExecutor class of the HexStrike AI MCP server, the resultant composed command is executed directly in the context of the MCP server’s normal privilege; typically, this is root. There is no attempt to sanitize these arguments in the default configuration of this MCP server at the affected version (as of commit 2f3a5512 in September of 2025).",
    "published": "2025-11-30T22:15:46.653"
  },
  "CVE-2025-13797": {
    "cvss": 6.3,
    "description": "A vulnerability was detected in ADSLR B-QE2W401 250814-r037c. Affected by this issue is the function parameterdel_swifimac of the file /send_order.cgi. Performing manipulation of the argument del_swifimac results in command injection. The attack is possible to be carried out remotely. The exploit is now public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2025-12-01T01:16:00.147",
    "keywords": "remote,command"
  },
  "CVE-2025-13798": {
    "cvss": 6.3,
    "description": "A flaw has been found in ADSLR NBR1005GPEV2 250814-r037c. This affects the function ap_macfilter_add of the file /send_order.cgi. Executing manipulation of the argument mac can lead to command injection. The attack may be performed from remote. The exploit has been published and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2025-12-01T01:16:00.383",
    "keywords": "remote,command"
  },
  "CVE-2025-13799": {
    "cvss": 6.3,
    "description": "A vulnerability has been found in ADSLR NBR1005GPEV2 250814-r037c. This vulnerability affects the function ap_macfilter_del of the file /send_order.cgi. The manipulation of the argument mac leads to command injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2025-12-01T01:16:00.620",
    "keywords": "remote,command"
  },
  "CVE-2025-13800": {
    "cvss": 6.3,
    "description": "A vulnerability was found in ADSLR NBR1005GPEV2 250814-r037c. This issue affects the function set_mesh_disconnect of the file /send_order.cgi. The manipulation of the argument mac results in command injection. It is possible to launch the attack remotely. The exploit has been made public and could be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2025-12-01T02:15:45.677",
    "keywords": "remote,command"
  },
  "CVE-2025-11131": {
    "cvss": 7.5,
    "description": "In nr modem, there is a possible system crash due to improper input validation. This could lead to remote denial of service with no additional execution privileges needed",
    "published": "2025-12-01T08:15:46.033",
    "keywords": "remote,execution"
  },
  "CVE-2025-11132": {
    "cvss": 7.5,
    "description": "In nr modem, there is a possible system crash due to improper input validation. This could lead to remote denial of service with no additional execution privileges needed",
    "published": "2025-12-01T08:15:47.350",
    "keywords": "remote,execution"
  },
  "CVE-2025-11133": {
    "cvss": 7.5,
    "description": "In nr modem, there is a possible system crash due to improper input validation. This could lead to remote denial of service with no additional execution privileges needed",
    "published": "2025-12-01T08:15:47.510",
    "keywords": "remote,execution"
  },
  "CVE-2025-3012": {
    "cvss": 7.5,
    "description": "In dpc modem, there is a possible system crash due to null pointer dereference. This could lead to remote denial of service with no additional execution privileges needed",
    "published": "2025-12-01T08:15:47.970",
    "keywords": "remote,execution"
  },
  "CVE-2025-61607": {
    "cvss": 7.5,
    "description": "In nr modem, there is a possible system crash due to improper input validation. This could lead to remote denial of service with no additional execution privileges needed",
    "published": "2025-12-01T08:15:48.140",
    "keywords": "remote,execution"
  },
  "CVE-2025-61608": {
    "cvss": 7.5,
    "description": "In nr modem, there is a possible system crash due to improper input validation. This could lead to remote denial of service with no additional execution privileges needed",
    "published": "2025-12-01T08:15:48.290",
    "keywords": "remote,execution"
  },
  "CVE-2025-61609": {
    "cvss": 7.5,
    "description": "In modem, there is a possible system crash due to improper input validation. This could lead to remote denial of service with no additional execution privileges needed",
    "published": "2025-12-01T08:15:48.437",
    "keywords": "remote,execution"
  },
  "CVE-2025-61610": {
    "cvss": 7.5,
    "description": "In nr modem, there is a possible system crash due to improper input validation. This could lead to remote denial of service with no additional execution privileges needed",
    "published": "2025-12-01T08:15:48.597",
    "keywords": "remote,execution"
  },
  "CVE-2025-61617": {
    "cvss": 7.5,
    "description": "In nr modem, there is a possible system crash due to improper input validation. This could lead to remote denial of service with no additional execution privileges needed",
    "published": "2025-12-01T08:15:48.740",
    "keywords": "remote,execution"
  },
  "CVE-2025-61618": {
    "cvss": 7.5,
    "description": "In nr modem, there is a possible system crash due to improper input validation. This could lead to remote denial of service with no additional execution privileges needed",
    "published": "2025-12-01T08:15:48.867",
    "keywords": "remote,execution"
  },
  "CVE-2025-61619": {
    "cvss": 7.5,
    "description": "In nr modem, there is a possible system crash due to improper input validation. This could lead to remote denial of service with no additional execution privileges needed",
    "published": "2025-12-01T08:15:49.010",
    "keywords": "remote,execution"
  },
  "CVE-2025-41738": {
    "cvss": 7.5,
    "description": "An unauthenticated remote attacker may cause the visualisation server of the CODESYS Control runtime system to access a resource with a pointer of wrong type, potentially leading to a denial-of-service (DoS) condition.",
    "published": "2025-12-01T10:16:01.130",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-41739": {
    "cvss": 5.9,
    "description": "An unauthenticated remote attacker, who beats a race condition, can exploit a flaw in the communication servers of the CODESYS Control runtime system on Linux and QNX to trigger an out-of-bounds read via crafted socket communication, potentially causing a denial of service.",
    "published": "2025-12-01T10:16:01.320",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-63520": {
    "url": "https://github.com/liufee/cms/issues/74",
    "cvss": 6.1,
    "description": "Cross Site Scripting (XSS) vulnerability in FeehiCMS 2.1.1 via the id parameter of the User Update function (?r=user%2Fupdate).",
    "published": "2025-12-01T15:15:50.713"
  },
  "CVE-2025-63522": {
    "url": "https://github.com/liufee/cms/issues/76",
    "cvss": 4.6,
    "description": "Reverse Tabnabbing vulnerability in FeehiCMS 2.1.1 in the Comments Management function",
    "published": "2025-12-01T15:15:50.847"
  },
  "CVE-2025-63523": {
    "url": "https://github.com/liufee/cms/issues/77",
    "cvss": 6.5,
    "description": "FeehiCMS version 2.1.1 fails to enforce server-side immutability for parameters that are presented to clients as \"read-only.\" An authenticated attacker can intercept and modify the parameter in transit and the backend accepts the changes. This can lead to unintended username changes.",
    "published": "2025-12-01T15:15:50.973"
  },
  "CVE-2025-63531": {
    "cvss": 10.0,
    "description": "A SQL injection vulnerability exists in the Blood Bank Management System 1.0 within the receiverLogin.php component. The application fails to properly sanitize user-supplied input in SQL queries, allowing an attacker to inject arbitrary SQL code. By manipulating the remail and rpassword fields, an attacker can bypass authentication and gain unauthorized access to the system.",
    "published": "2025-12-01T15:15:51.987",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-11699": {
    "url": "https://github.com/nopsolutions/nopcommerce/issues/7044",
    "cvss": 7.1,
    "description": "nopCommerce v4.70 and prior, and version 4.80.3, does not invalidate session cookies after logout or session termination, allowing an attacker who has a \r\na valid session cookie access to privileged endpoints (such as /admin) even after the legitimate user has logged out, enabling session hijacking. Any version above 4.70 that is not 4.80.3 fixes the vulnerability.",
    "published": "2025-12-01T16:15:51.017"
  },
  "CVE-2025-63532": {
    "cvss": 9.6,
    "description": "A SQL injection vulnerability exists in the Blood Bank Management System 1.0 within the cancel.php component. The application fails to properly sanitize user-supplied input in SQL queries, allowing an attacker to inject arbitrary SQL code. By manipulating the search field, an attacker can bypass authentication and gain unauthorized access to the system.",
    "published": "2025-12-01T16:15:55.800",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-63535": {
    "cvss": 9.6,
    "description": "A SQL injection vulnerability exists in the Blood Bank Management System 1.0 within the abs.php component. The application fails to properly sanitize usersupplied input in SQL queries, allowing an attacker to inject arbitrary SQL code. By manipulating the search field, an attacker can bypass authentication and gain unauthorized access to the system.",
    "published": "2025-12-01T16:15:56.277",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-13836": {
    "url": "https://github.com/python/cpython/pull/119454",
    "cvss": "-",
    "description": "When reading an HTTP response from a server, if no read amount is specified, the default behavior will be to use Content-Length. This allows a malicious server to cause the client to read large amounts of data into memory, potentially causing OOM or other DoS.",
    "published": "2025-12-01T18:16:04.200"
  },
  "CVE-2025-13837": {
    "url": "https://github.com/python/cpython/pull/119343",
    "cvss": "-",
    "description": "When loading a plist file, the plistlib module reads data in size specified by the file itself, meaning a malicious file can cause OOM and DoS issues",
    "published": "2025-12-01T18:16:04.380"
  },
  "CVE-2025-65836": {
    "url": "https://github.com/sanluan/publiccms/issues/99",
    "cvss": "-",
    "description": "PublicCMS V5.202506.b is vulnerable to SSRF. in the chat interface of SimpleAiAdminController.",
    "published": "2025-12-01T20:15:57.103"
  },
  "CVE-2025-65838": {
    "url": "https://github.com/sanluan/publiccms/issues/101",
    "cvss": "-",
    "description": "PublicCMS V5.202506.b is vulnerable to path traversal via the doUploadSitefile method.",
    "published": "2025-12-01T20:15:57.240"
  },
  "CVE-2025-65840": {
    "url": "https://github.com/sanluan/publiccms/issues/102",
    "cvss": "-",
    "description": "PublicCMS V5.202506.b is vulnerable to Cross Site Request Forgery (CSRF) in the CkEditorAdminController.",
    "published": "2025-12-01T21:15:52.320"
  },
  "CVE-2025-66294": {
    "cvss": "-",
    "description": "Grav is a file-based Web platform. Prior to 1.8.0-beta.27, a Server-Side Template Injection (SSTI) vulnerability exists in Grav that allows authenticated attackers with editor permissions to execute arbitrary commands on the server and, under certain conditions, may also be exploited by unauthenticated attackers. This vulnerability stems from weak regex validation in the cleanDangerousTwig method. This vulnerability is fixed in 1.8.0-beta.27.",
    "published": "2025-12-01T21:15:52.843",
    "keywords": "unauthenticated,command"
  },
  "CVE-2025-66297": {
    "cvss": "-",
    "description": "Grav is a file-based Web platform. Prior to 1.8.0-beta.27, a user with admin panel access and permissions to create or edit pages in Grav CMS can enable Twig processing in the page frontmatter. By injecting malicious Twig expressions, the user can escalate their privileges to admin or execute arbitrary system commands via the scheduler API. This results in both Privilege Escalation (PE) and Remote Code Execution (RCE) vulnerabilities. This vulnerability is fixed in 1.8.0-beta.27.",
    "published": "2025-12-01T21:15:53.327",
    "keywords": "remote,execution,command"
  },
  "CVE-2025-66299": {
    "cvss": 8.8,
    "description": "Grav is a file-based Web platform. Prior to 1.8.0-beta.27, Grav CMS is vulnerable to a Server-Side Template Injection (SSTI) that allows any authenticated user with editor permissions to execute arbitrary code on the remote server, bypassing the existing security sandbox. Since the security sandbox does not fully protect the Twig object, it is possible to interact with it (e.g., call methods, read/write attributes) through maliciously crafted Twig template directives injected into a web page. This allows an authenticated editor to add arbitrary functions to the Twig attribute system.twig.safe_filters, effectively bypassing the Grav CMS sandbox. This vulnerability is fixed in 1.8.0-beta.27.",
    "published": "2025-12-01T22:15:49.290",
    "keywords": "remote,bypass"
  },
  "CVE-2025-66307": {
    "cvss": 6.5,
    "description": "This admin plugin for Grav is an HTML user interface that provides a convenient way to configure Grav and easily create and modify pages. Prior to 1.11.0-beta.1, a user enumeration and email disclosure vulnerability exists in Grav. The \"Forgot Password\" functionality at /admin/forgot leaks information about valid usernames and their associated email addresses through distinct server responses. This allows an attacker to enumerate users and disclose sensitive email addresses, which can be leveraged for targeted attacks such as password spraying, phishing, or social engineering. This vulnerability is fixed in 1.11.0-beta.1.",
    "published": "2025-12-01T22:15:50.570",
    "keywords": "sensitive,leak"
  }
}