{
  "CVE-2024-22899": {
    "cvss": "-",
    "description": "Vinchin Backup & Recovery v7.2 was discovered to contain an authenticated remote code execution (RCE) vulnerability via the syncNtpTime function.",
    "published": "2024-02-02T02:15:18.073",
    "keywords": "remote,execution"
  },
  "CVE-2024-22900": {
    "cvss": "-",
    "description": "Vinchin Backup & Recovery v7.2 was discovered to contain an authenticated remote code execution (RCE) vulnerability via the setNetworkCardInfo function.",
    "published": "2024-02-02T02:15:18.127",
    "keywords": "remote,execution"
  },
  "CVE-2024-22903": {
    "cvss": "-",
    "description": "Vinchin Backup & Recovery v7.2 was discovered to contain an authenticated remote code execution (RCE) vulnerability via the deleteUpdateAPK function.",
    "published": "2024-02-02T02:15:18.277",
    "keywords": "remote,execution"
  },
  "CVE-2024-22533": {
    "cvss": "-",
    "description": "Before Beetl v3.15.12, the rendering template has a server-side template injection (SSTI) vulnerability. When the incoming template is controllable, it will be filtered by the DefaultNativeSecurityManager blacklist. Because blacklist filtering is not strict, the blacklist can be bypassed, leading to arbitrary code execution.",
    "published": "2024-02-02T03:15:11.210",
    "keywords": "execution,bypass"
  },
  "CVE-2024-1143": {
    "cvss": "-",
    "description": "Central Dogma versions prior to 0.64.0 is vulnerable to Cross-Site Scripting (XSS), which could allow for the leakage of user sessions and subsequent authentication bypass.",
    "published": "2024-02-02T06:15:45.360",
    "keywords": "authentication,bypass,leak"
  },
  "CVE-2024-22851": {
    "cvss": "-",
    "description": "Directory Traversal Vulnerability in LiveConfig before v.2.5.2 allows a remote attacker to obtain sensitive information via a crafted request to the /static/ endpoint.",
    "published": "2024-02-02T09:15:37.473",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-24388": {
    "cvss": "-",
    "description": "Cross-site scripting (XSS) vulnerability in XunRuiCMS versions v4.6.2 and before, allows remote attackers to obtain sensitive information via crafted malicious requests to the background login.",
    "published": "2024-02-02T10:15:08.870",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-0844": {
    "cvss": 4.7,
    "description": "The Popup More Popups, Lightboxes, and more popup modules plugin for WordPress is vulnerable to Local File Inclusion in version 2.1.6 via the ycfChangeElementData() function. This makes it possible for authenticated attackers, with administrator-level access and above, to include and execute arbitrary files ending with \"Form.php\" on the server , allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-02-02T12:15:49.000",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-1064": {
    "cvss": 7.5,
    "description": "A host header injection vulnerability in the HTTP handler component of Crafty Controller allows a remote, unauthenticated attacker to trigger a Denial of Service (DoS) condition via a modified host header",
    "published": "2024-02-03T09:15:11.250",
    "keywords": "remote,unauthenticated"
  }
}