{
  "CVE-2024-0324": {
    "cvss": 8.2,
    "description": "The User Profile Builder – Beautiful User Registration Forms, User Profiles & User Role Editor plugin for WordPress is vulnerable to unauthorized modification of data due to a missing capability check on the 'wppb_two_factor_authentication_settings_update' function in all versions up to, and including, 3.10.8. This makes it possible for unauthenticated attackers to enable or disable the 2FA functionality present in the Premium version of the plugin for arbitrary user roles.",
    "published": "2024-02-05T22:15:59.980",
    "keywords": "unauthenticated,authentication"
  },
  "CVE-2024-0699": {
    "cvss": 6.6,
    "description": "The AI Engine: Chatbots, Generators, Assistants, GPT 4 and more! plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the 'add_image_from_url' function in all versions up to, and including, 2.1.4. This makes it possible for authenticated attackers, with Editor access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-02-05T22:16:04.210",
    "keywords": "remote,execution"
  },
  "CVE-2024-0701": {
    "cvss": 5.3,
    "description": "The UserPro plugin for WordPress is vulnerable to Security Feature Bypass in all versions up to, and including, 5.1.6. This is due to the use of client-side restrictions to enforce the 'Disabled registration' Membership feature within the plugin's General settings. This makes it possible for unauthenticated attackers to register an account even when account registration has been disabled by an administrator.",
    "published": "2024-02-05T22:16:04.380",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2024-0709": {
    "cvss": 9.8,
    "description": "The Cryptocurrency Widgets – Price Ticker & Coins List plugin for WordPress is vulnerable to SQL Injection via the 'coinslist' parameter in versions 2.0 to 2.6.5 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-02-05T22:16:04.553",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-0761": {
    "cvss": 8.1,
    "description": "The File Manager plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 7.2.1 due to insufficient randomness in the backup filenames, which use a timestamp plus 4 random digits. This makes it possible for unauthenticated attackers, to extract sensitive data including site backups in configurations where the .htaccess file in the directory does not block access.",
    "published": "2024-02-05T22:16:04.733",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-0969": {
    "cvss": 5.3,
    "description": "The ARMember plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 1.0.21 via the REST API. This makes it possible for unauthenticated attackers to bypass the plugin's \"Default Restriction\" feature and view restricted post content.",
    "published": "2024-02-05T22:16:06.767",
    "keywords": "unauthenticated,sensitive,bypass"
  },
  "CVE-2024-1075": {
    "cvss": 3.7,
    "description": "The Minimal Coming Soon – Coming Soon Page plugin for WordPress is vulnerable to maintenance mode bypass and information disclosure in all versions up to, and including, 2.37. This is due to the plugin improperly validating the request path. This makes it possible for unauthenticated attackers to bypass maintenance mode and view pages that should be hidden.",
    "published": "2024-02-05T22:16:07.283",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2024-1208": {
    "cvss": 5.3,
    "description": "The LearnDash LMS plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 4.10.2 via API. This makes it possible for unauthenticated attackers to obtain access to quiz questions.",
    "published": "2024-02-05T22:16:07.977",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-1209": {
    "cvss": 5.3,
    "description": "The LearnDash LMS plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 4.10.1 via direct file access due to insufficient protection of uploaded assignments. This makes it possible for unauthenticated attackers to obtain those uploads.",
    "published": "2024-02-05T22:16:08.143",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-1210": {
    "cvss": 5.3,
    "description": "The LearnDash LMS plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 4.10.1 via API. This makes it possible for unauthenticated attackers to obtain access to quizzes.",
    "published": "2024-02-05T22:16:08.310",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-23049": {
    "url": "https://github.com/88250/symphony/issues/82",
    "cvss": "-",
    "description": "An issue in symphony v.3.6.3 and before allows a remote attacker to execute arbitrary code via the log4j component.",
    "published": "2024-02-05T23:15:08.463"
  },
  "CVE-2024-24112": {
    "url": "https://github.com/exrick/xmall/issues/78",
    "cvss": "-",
    "description": "xmall v1.1 was discovered to contain a SQL injection vulnerability via the orderDir parameter.",
    "published": "2024-02-06T01:15:09.700"
  },
  "CVE-2024-24808": {
    "url": "https://github.com/pyload/pyload/commit/fe94451dcc2be90b3889e2fd9d07b483c8a6dccd",
    "cvss": 4.7,
    "description": "pyLoad is an open-source Download Manager written in pure Python. There is an open redirect vulnerability due to incorrect validation of input values when redirecting users after login. pyLoad is validating URLs via the `get_redirect_url` function when redirecting users at login. This vulnerability has been patched with commit fe94451.",
    "published": "2024-02-06T04:15:08.260"
  },
  "CVE-2024-23304": {
    "cvss": "-",
    "description": "Cybozu KUNAI for Android 3.0.20 to 3.0.21 allows a remote unauthenticated attacker to cause a denial-of-service (DoS) condition by performing certain operations.",
    "published": "2024-02-06T05:15:10.630",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-22433": {
    "cvss": 8.8,
    "description": "\nDell Data Protection Search 19.2.0 and above contain an exposed password opportunity in plain text when using LdapSettings.get_ldap_info in DP Search. A remote unauthorized unauthenticated attacker could potentially exploit this vulnerability leading to a loss of Confidentiality, Integrity, Protection, and remote takeover of the system. This is a high-severity vulnerability as it allows an attacker to take complete control of DP Search to affect downstream protected devices.\n\n",
    "published": "2024-02-06T07:15:11.337",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-23917": {
    "cvss": 9.8,
    "description": "In JetBrains TeamCity before 2023.11.3 authentication bypass leading to RCE was possible",
    "published": "2024-02-06T10:15:09.280",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-24592": {
    "cvss": 9.8,
    "description": "Lack of authentication in all versions of the fileserver component of Allegro AI’s ClearML platform allows a remote attacker to arbitrarily access, create, modify and delete files. \n",
    "published": "2024-02-06T15:15:09.730",
    "keywords": "remote,authentication"
  },
  "CVE-2024-24593": {
    "cvss": 9.6,
    "description": "A cross-site request forgery (CSRF) vulnerability in all versions of the api and web server components of Allegro AI’s ClearML platform allows a remote attacker to impersonate a user by sending API requests via maliciously crafted html. Exploitation of the vulnerability allows an attacker to compromise confidential workspaces and files, leak sensitive information, and target instances of the ClearML platform within closed off networks.\n",
    "published": "2024-02-06T15:15:09.977",
    "keywords": "remote,sensitive,leak"
  },
  "CVE-2024-0955": {
    "cvss": 4.8,
    "description": "\nA stored XSS vulnerability exists where an authenticated, remote attacker with administrator privileges on the Nessus application could alter Nessus proxy settings, which could lead to the execution of remote arbitrary scripts. \n\n",
    "published": "2024-02-07T00:15:55.450",
    "keywords": "remote,execution"
  },
  "CVE-2024-24001": {
    "url": "https://github.com/jishenghua/jsherp/issues/99",
    "cvss": "-",
    "description": "jshERP v3.3 is vulnerable to SQL Injection. via the com.jsh.erp.controller.DepotHeadController: com.jsh.erp.utils.BaseResponseInfo findallocationDetail() function of jshERP which allows an attacker to construct malicious payload to bypass jshERP's protection mechanism.",
    "published": "2024-02-07T00:15:56.443"
  },
  "CVE-2024-24002": {
    "url": "https://github.com/jishenghua/jsherp/issues/99",
    "cvss": "-",
    "description": "jshERP v3.3 is vulnerable to SQL Injection. The com.jsh.erp.controller.MaterialController: com.jsh.erp.utils.BaseResponseInfo getListWithStock() function of jshERP does not filter `column` and `order` parameters well enough, and an attacker can construct malicious payload to bypass jshERP's protection mechanism in `safeSqlParse` method for sql injection.",
    "published": "2024-02-07T00:15:56.503"
  },
  "CVE-2024-24004": {
    "url": "https://github.com/jishenghua/jsherp/issues/99",
    "cvss": "-",
    "description": "jshERP v3.3 is vulnerable to SQL Injection. The com.jsh.erp.controller.DepotHeadController: com.jsh.erp.utils.BaseResponseInfo findInOutDetail() function of jshERP does not filter `column` and `order` parameters well enough, and an attacker can construct malicious payload to bypass jshERP's protection mechanism in `safeSqlParse` method for sql injection.",
    "published": "2024-02-07T00:15:56.550"
  },
  "CVE-2024-24810": {
    "url": "https://github.com/wixtoolset/issues/security/advisories/ghsa-7wh2-wxc7-9ph5",
    "cvss": 8.2,
    "description": "WiX toolset lets developers create installers for Windows Installer, the Windows installation engine. The .be TEMP folder is vulnerable to DLL redirection attacks that allow the attacker to escalate privileges. This impacts any installer built with the WiX installer framework. This issue has been patched in version 4.0.4.",
    "published": "2024-02-07T03:15:50.273"
  },
  "CVE-2024-24303": {
    "cvss": "-",
    "description": "SQL Injection vulnerability in HiPresta \"Gift Wrapping Pro\" (hiadvancedgiftwrapping) module for PrestaShop before version 1.4.1, allows remote attackers to escalate privileges and obtain sensitive information via the HiAdvancedGiftWrappingGiftWrappingModuleFrontController::addGiftWrappingCartValue() method.",
    "published": "2024-02-07T09:15:15.780",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-25200": {
    "url": "https://github.com/espruino/espruino/issues/2457",
    "cvss": "-",
    "description": "Espruino 2v20 (commit fcc9ba4) was discovered to contain a Stack Overflow via the jspeFactorFunctionCall at src/jsparse.c.",
    "published": "2024-02-07T14:15:53.013"
  },
  "CVE-2024-25201": {
    "url": "https://github.com/espruino/espruino/issues/2456",
    "cvss": "-",
    "description": "Espruino 2v20 (commit fcc9ba4) was discovered to contain an Out-of-bounds Read via jsvStringIteratorPrintfCallback at src/jsvar.c.",
    "published": "2024-02-07T14:15:53.060"
  },
  "CVE-2024-24771": {
    "cvss": 7.7,
    "description": "Open Forms allows users create and publish smart forms. Versions prior to 2.2.9, 2.3.7, 2.4.5, and 2.5.2 contain a non-exploitable multi-factor authentication weakness. Superusers who have their credentials (username + password) compromised could potentially have the second-factor authentication bypassed if an attacker somehow managed to authenticate to Open Forms. The maintainers of Open Forms do not believe it is or has been possible to perform this login. However, if this were possible, the victim's account may be abused to view (potentially sensitive) submission data or have been used to impersonate other staff accounts to view and/or modify data. Three mitigating factors to help prevent exploitation include: the usual login page (at `/admin/login/`) does not fully log in the user until the second factor was succesfully provided; the additional non-MFA protected login page at `/api/v2/api-authlogin/` was misconfigured and could not be used to log in; and there are no additional ways to log in. This also requires credentials of a superuser to be compromised to be exploitable. Versions 2.2.9, 2.3.7, 2.4.5, and 2.5.2 contain the following patches to address these weaknesses: Move and only enable the API auth endpoints (`/api/v2/api-auth/login/`) with `settings.DEBUG = True`. `settings.DEBUG = True` is insecure and should never be applied in production settings. Additionally, apply a custom permission check to the hijack flow to only allow second-factor-verified superusers to perform user hijacking.",
    "published": "2024-02-07T15:15:08.283",
    "keywords": "authentication,sensitive,bypass"
  },
  "CVE-2024-20252": {
    "cvss": 9.6,
    "description": "Multiple vulnerabilities in Cisco Expressway Series and Cisco TelePresence Video Communication Server (VCS) could allow an unauthenticated, remote attacker to conduct cross-site request forgery (CSRF) attacks that perform arbitrary actions on an affected device. \r\n\r Note: \"Cisco Expressway Series\" refers to Cisco Expressway Control (Expressway-C) devices and Cisco Expressway Edge (Expressway-E) devices.\r\n\r For more information about these vulnerabilities, see the Details [\"#details\"] section of this advisory.",
    "published": "2024-02-07T17:15:09.913",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20254": {
    "cvss": 9.6,
    "description": "Multiple vulnerabilities in Cisco Expressway Series and Cisco TelePresence Video Communication Server (VCS) could allow an unauthenticated, remote attacker to conduct cross-site request forgery (CSRF) attacks that perform arbitrary actions on an affected device. \r\n\r Note: \"Cisco Expressway Series\" refers to Cisco Expressway Control (Expressway-C) devices and Cisco Expressway Edge (Expressway-E) devices.\r\n\r For more information about these vulnerabilities, see the Details [\"#details\"] section of this advisory.",
    "published": "2024-02-07T17:15:10.130",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20255": {
    "cvss": 8.2,
    "description": "A vulnerability in the SOAP API of Cisco Expressway Series and Cisco TelePresence Video Communication Server could allow an unauthenticated, remote attacker to conduct a cross-site request forgery (CSRF) attack on an affected system.\r\n\r This vulnerability is due to insufficient CSRF protections for the web-based management interface of an affected system. An attacker could exploit this vulnerability by persuading a user of the REST API to follow a crafted link. A successful exploit could allow the attacker to cause the affected system to reload.",
    "published": "2024-02-07T17:15:10.327",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20290": {
    "cvss": 7.5,
    "description": "A vulnerability in the OLE2 file format parser of ClamAV could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition on an affected device.\r\n\r This vulnerability is due to an incorrect check for end-of-string values during scanning, which may result in a heap buffer over-read. An attacker could exploit this vulnerability by submitting a crafted file containing OLE2 content to be scanned by ClamAV on an affected device. A successful exploit could allow the attacker to cause the ClamAV scanning process to terminate, resulting in a DoS condition on the affected software and consuming available system resources.\r\n\r For a description of this vulnerability, see the ClamAV blog .",
    "published": "2024-02-07T17:15:10.517",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-24823": {
    "url": "https://github.com/graylog2/graylog2-server/commit/b93a66353f35a94a4e8f3f75ac4f5cdc5a2d4a6a",
    "cvss": 5.7,
    "description": "Graylog is a free and open log management platform. Starting in version 4.3.0 and prior to versions 5.1.11 and 5.2.4, reauthenticating with an existing session cookie would re-use that session id, even if for different user credentials. In this case, the pre-existing session could be used to gain elevated access to an existing Graylog login session, provided the malicious user could successfully inject their session cookie into someone else's browser. The complexity of such an attack is high, because it requires presenting a spoofed login screen and injection of a session cookie into an existing browser, potentially through a cross-site scripting attack. No such attack has been discovered. Graylog 5.1.11 and 5.2.4, and any versions of the 6.0 development branch, contain patches to not re-use sessions under any circumstances. Some workarounds are available. Using short session expiration and explicit log outs of unused sessions can help limiting the attack vector. Unpatched this vulnerability exists, but is relatively hard to exploit. A proxy could be leveraged to clear the `authentication` cookie for the Graylog server URL for the `/api/system/sessions` endpoint, as that is the only one vulnerable.",
    "published": "2024-02-07T18:15:54.870"
  },
  "CVE-2024-24824": {
    "url": "https://github.com/graylog2/graylog2-server/commit/7f8ef7fa8edf493106d5ef6f777d4da02c5194d9",
    "cvss": 8.8,
    "description": "Graylog is a free and open log management platform. Starting in version 2.0.0 and prior to versions 5.1.11 and 5.2.4, arbitrary classes can be loaded and instantiated using a HTTP PUT request to the `/api/system/cluster_config/` endpoint. Graylog's cluster config system uses fully qualified class names as config keys. To validate the existence of the requested class before using them, Graylog loads the class using the class loader. If a user with the appropriate permissions performs the request, arbitrary classes with 1-arg String constructors can be instantiated. This will execute arbitrary code that is run during class instantiation. In the specific use case of `java.io.File`, the behavior of the internal web-server stack will lead to information exposure by including the entire file content in the response to the REST request. Versions 5.1.11 and 5.2.4 contain a fix for this issue.",
    "published": "2024-02-07T18:15:55.330"
  },
  "CVE-2024-22394": {
    "cvss": "-",
    "description": "An improper authentication vulnerability has been identified in SonicWall SonicOS SSL-VPN feature, which in specific conditions could allow a remote attacker to bypass authentication. \n\nThis issue affects only firmware version SonicOS 7.1.1-7040.\n\n",
    "published": "2024-02-08T02:15:07.620",
    "keywords": "remote,authentication,vpn,bypass"
  },
  "CVE-2024-24003": {
    "url": "https://github.com/jishenghua/jsherp/issues/99",
    "cvss": "-",
    "description": "jshERP v3.3 is vulnerable to SQL Injection. The com.jsh.erp.controller.DepotHeadController: com.jsh.erp.utils.BaseResponseInfo findInOutMaterialCount() function of jshERP does not filter `column` and `order` parameters well enough, and an attacker can construct malicious payload to bypass jshERP's protection mechanism in `safeSqlParse` method for sql injection.",
    "published": "2024-02-08T02:15:07.763"
  },
  "CVE-2024-25148": {
    "cvss": 5.4,
    "description": "In Liferay Portal 7.2.0 through 7.4.1, and older unsupported versions, and Liferay DXP 7.3 before service pack 3, 7.2 before fix pack 15, and older unsupported versions the `doAsUserId` URL parameter may get leaked when creating linked content using the WYSIWYG editor and while impersonating a user. This may allow remote authenticated users to impersonate a user after accessing the linked content.",
    "published": "2024-02-08T04:15:08.240",
    "keywords": "remote,leak"
  },
  "CVE-2024-24216": {
    "cvss": "-",
    "description": "Zentao v18.0 to v18.10 was discovered to contain a remote code execution (RCE) vulnerability via the checkConnection method of /app/zentao/module/repo/model.php.",
    "published": "2024-02-08T06:15:51.750",
    "keywords": "remote,execution"
  },
  "CVE-2024-0965": {
    "cvss": 5.3,
    "description": "The Simple Page Access Restriction plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 1.0.21 via the REST API. This makes it possible for unauthenticated attackers to bypass the plugin's page restriction and view page content.",
    "published": "2024-02-08T09:15:46.047",
    "keywords": "unauthenticated,sensitive,bypass"
  },
  "CVE-2024-1207": {
    "cvss": 9.8,
    "description": "The WP Booking Calendar plugin for WordPress is vulnerable to SQL Injection via the 'calendar_request_params[dates_ddmmyy_csv]' parameter in all versions up to, and including, 9.9 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-02-08T09:15:46.253",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-22464": {
    "cvss": 6.2,
    "description": "\nDell EMC AppSync, versions from 4.2.0.0 to 4.6.0.0 including all Service Pack releases, contain an exposure of sensitive information vulnerability in AppSync server logs. A high privileged remote attacker could potentially exploit this vulnerability, leading to the disclosure of certain user credentials. The attacker may be able to use the exposed credentials to access the vulnerable system with privileges of the compromised account.\n\n",
    "published": "2024-02-08T10:15:14.183",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-24113": {
    "url": "https://github.com/xuxueli/xxl-job/issues/3375",
    "cvss": "-",
    "description": "xxl-job =< 2.4.1 has a Server-Side Request Forgery (SSRF) vulnerability, which causes low-privileged users to control executor to RCE.",
    "published": "2024-02-08T13:15:09.807"
  },
  "CVE-2024-25189": {
    "cvss": "-",
    "description": "libjwt 1.15.3 uses strcmp (which is not constant time) to verify authentication, which makes it easier to bypass authentication via a timing side channel.",
    "published": "2024-02-08T17:15:10.960",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-25190": {
    "cvss": "-",
    "description": "l8w8jwt 2.2.1 uses memcmp (which is not constant time) to verify authentication, which makes it easier to bypass authentication via a timing side channel.",
    "published": "2024-02-08T17:15:11.013",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-25191": {
    "cvss": "-",
    "description": "php-jwt 1.0.0 uses strcmp (which is not constant time) to verify authentication, which makes it easier to bypass authentication via a timing side channel.",
    "published": "2024-02-08T17:15:11.067",
    "keywords": "authentication,bypass"
  }
}