{
  "CVE-2024-2161": {
    "cvss": 9.8,
    "description": "Use of Hard-coded Credentials in Kiloview NDI allows un-authenticated users to bypass authenticationThis issue affects Kiloview NDI N3, N3-s, N4, N20, N30, N40 and was fixed in Firmware version 2.02.0227 .\n\n",
    "published": "2024-03-21T06:15:46.690",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-2162": {
    "cvss": 8.8,
    "description": "An OS Command Injection vulnerability in Kiloview NDI allows a low-privileged user to execute arbitrary code remotely on the device with high privileges.\n\nThis issue affects Kiloview NDI N3, N3-s, N4, N20, N30, N40 and was fixed in Firmware version 2.02.0227 .\n\n",
    "published": "2024-03-21T06:15:47.073",
    "keywords": "remote,command"
  },
  "CVE-2024-1147": {
    "cvss": 9.8,
    "description": "Weak access control in OpenText PVCS Version Manager allows potential bypassing of authentication and download of files.",
    "published": "2024-03-21T08:15:07.423",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-1148": {
    "cvss": 9.8,
    "description": "Weak access control in OpenText PVCS Version Manager allows potential bypassing of authentication and uploading of files.",
    "published": "2024-03-21T08:15:07.620",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-27438": {
    "cvss": "-",
    "description": "Download of Code Without Integrity Check vulnerability in Apache Doris.\nThe jdbc driver files used for JDBC catalog is not checked and may resulting in remote command execution.\nOnce the attacker is authorized to create a JDBC catalog, he/she can use arbitrary driver jar file with unchecked code snippet. This code snippet will be run when catalog is initializing without any check.\nThis issue affects Apache Doris: from 1.2.0 through 2.0.4.\n\nUsers are recommended to upgrade to version 2.0.5 or 2.1.x, which fixes the issue.\n\n",
    "published": "2024-03-21T10:15:08.370",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-29866": {
    "url": "https://github.com/datalust/seq-tickets/issues/2127",
    "cvss": "-",
    "description": "Datalust Seq before 2023.4.11151 and 2024 before 2024.1.11146 has Incorrect Access Control because a Project Owner or Organization Owner can escalate to System privileges.",
    "published": "2024-03-21T14:15:07.810"
  },
  "CVE-2024-24272": {
    "cvss": "-",
    "description": "An issue in iTop DualSafe Password Manager & Digital Vault before 1.4.24 allows a local attacker to obtain sensitive information via leaked credentials as plaintext in a log file that can be accessed by the local user without knowledge of the master secret.",
    "published": "2024-03-21T22:15:10.850",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-28116": {
    "cvss": 8.8,
    "description": "Grav is an open-source, flat-file content management system. Grav CMS prior to version 1.7.45 is vulnerable to a Server-Side Template Injection (SSTI), which allows any authenticated user (editor permissions are sufficient) to execute arbitrary code on the remote server bypassing the existing security sandbox. Version 1.7.45 contains a patch for this issue.",
    "published": "2024-03-21T22:15:11.577",
    "keywords": "remote,bypass"
  },
  "CVE-2024-28117": {
    "cvss": 8.8,
    "description": "Grav is an open-source, flat-file content management system. Prior to version 1.7.45, Grav validates accessible functions through the Utils::isDangerousFunction function, but does not impose restrictions on twig functions like twig_array_map, allowing attackers to bypass the validation and execute arbitrary commands. Twig processing of static pages can be enabled in the front matter by any administrative user allowed to create or edit pages. As the Twig processor runs unsandboxed, this behavior can be used to gain arbitrary code execution and elevate privileges on the instance. Upgrading to patched version 1.7.45 can mitigate this issue.\n",
    "published": "2024-03-21T22:15:11.820",
    "keywords": "execution,command,bypass"
  },
  "CVE-2024-28118": {
    "cvss": 8.8,
    "description": "Grav is an open-source, flat-file content management system. Prior to version 1.7.45, due to the unrestricted access to twig extension class from Grav context, an attacker can redefine config variable. As a result, attacker can bypass a previous SSTI mitigation. Twig processing of static pages can be enabled in the front matter by any administrative user allowed to create or edit pages. As the Twig processor runs unsandboxed, this behavior can be used to gain arbitrary code execution and elevate privileges on the instance. Version 1.7.45 contains a fix for this issue.\n",
    "published": "2024-03-21T22:15:12.037",
    "keywords": "execution,bypass"
  },
  "CVE-2024-28119": {
    "cvss": 8.8,
    "description": "Grav is an open-source, flat-file content management system. Prior to version 1.7.45, due to the unrestricted access to twig extension class from grav context, an attacker can redefine the escape function and execute arbitrary commands. Twig processing of static pages can be enabled in the front matter by any administrative user allowed to create or edit pages. As the Twig processor runs unsandboxed, this behavior can be used to gain arbitrary code execution and elevate privileges on the instance. Version 1.7.45 contains a patch for this issue.",
    "published": "2024-03-21T22:15:12.233",
    "keywords": "execution,command"
  },
  "CVE-2024-29031": {
    "cvss": 7.5,
    "description": "Meshery is an open source, cloud native manager that enables the design and management of Kubernetes-based infrastructure and applications. A SQL injection vulnerability in Meshery prior to version 0.7.17 allows a remote attacker to obtain sensitive information via the `order` parameter of `GetMeshSyncResources`. Version 0.7.17 contains a patch for this issue.",
    "published": "2024-03-21T23:15:11.167",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-29271": {
    "cvss": "-",
    "description": "Reflected Cross-Site Scripting (XSS) vulnerability in VvvebJs before version 1.7.7, allows remote attackers to execute arbitrary code and obtain sensitive information via the action parameter in save.php.",
    "published": "2024-03-22T04:15:11.573",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-29272": {
    "cvss": "-",
    "description": "Arbitrary File Upload vulnerability in VvvebJs before version 1.7.5, allows unauthenticated remote attackers to execute arbitrary code and obtain sensitive information via the sanitizeFileName parameter in save.php.",
    "published": "2024-03-22T04:15:11.663",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-29273": {
    "url": "https://github.com/zyx0814/dzzoffice/issues/244",
    "cvss": "-",
    "description": "There is Stored Cross-Site Scripting (XSS) in dzzoffice 2.02.1 SC UTF8 in uploadfile to index.php, with the XSS payload in an SVG document.",
    "published": "2024-03-22T04:15:11.857"
  },
  "CVE-2024-29275": {
    "cvss": "-",
    "description": "SQL injection vulnerability in SeaCMS version 12.9, allows remote unauthenticated attackers to execute arbitrary code and obtain sensitive information via the id parameter in class.php.",
    "published": "2024-03-22T05:15:47.583",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-2812": {
    "cvss": 6.3,
    "description": "A vulnerability was found in Tenda AC15 15.03.05.18/15.03.20_multi. It has been classified as critical. This affects the function formWriteFacMac of the file /goform/WriteFacMac. The manipulation of the argument mac leads to os command injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-257667. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-03-22T07:15:46.283",
    "keywords": "remote,command"
  },
  "CVE-2024-2815": {
    "cvss": 8.8,
    "description": "A vulnerability classified as critical has been found in Tenda AC15 15.03.20_multi. Affected is the function R7WebsSecurityHandler of the file /goform/execCommand of the component Cookie Handler. The manipulation of the argument password leads to stack-based buffer overflow. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. VDB-257670 is the identifier assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-03-22T08:15:09.750",
    "keywords": "remote,command"
  },
  "CVE-2024-1742": {
    "cvss": 3.8,
    "description": "Invocation of the sqlplus command with sensitive information in the command line in the mk_oracle Checkmk agent plugin before Checkmk 2.3.0b4 (beta), 2.2.0p24, 2.1.0p41 and 2.0.0 (EOL) allows the extraction of this information from the process list.",
    "published": "2024-03-22T11:15:46.457",
    "keywords": "command,sensitive"
  },
  "CVE-2024-28861": {
    "cvss": 9.8,
    "description": "Symfony 1 is a community-driven fork of the 1.x branch of Symfony, a PHP framework for web projects. Starting in version 1.1.0 and prior to version 1.5.19, Symfony 1 has a gadget chain due to dangerous deserialization in `sfNamespacedParameterHolder` class that would enable an attacker to get remote code execution if a developer deserializes user input in their project. Version 1.5.19 contains a patch for the issue.",
    "published": "2024-03-22T17:15:07.770",
    "keywords": "remote,execution"
  },
  "CVE-2024-29184": {
    "cvss": 8.0,
    "description": "FreeScout is a self-hosted help desk and shared mailbox. A Stored Cross-Site Scripting (XSS) vulnerability has been identified within the Signature Input Field of the FreeScout Application prior to version 1.8.128. Stored XSS occurs when user input is not properly sanitized and is stored on the server, allowing an attacker to inject malicious scripts that will be executed when other users access the affected page. In this case, the Support Agent User can inject malicious scripts into their signature, which will then be executed when viewed by the Administrator.\n\nThe application protects users against XSS attacks by enforcing a CSP policy, the CSP Policy is:  `script-src 'self' 'nonce-abcd'  `. The CSP policy only allows the inclusion of JS files that are present on the application server and doesn't allow any inline script or script other than nonce-abcd. The CSP policy was bypassed by uploading a JS file to the server by a POST request to /conversation/upload endpoint. After this, a working XSS payload was crafted by including the uploaded JS file link as the src of the script. This bypassed the CSP policy and XSS attacks became possible.\n\nThe impact of this vulnerability is severe as it allows an attacker to compromise the FreeScout Application. By exploiting this vulnerability, the attacker can perform various malicious actions such as forcing the Administrator to execute actions without their knowledge or consent. For instance, the attacker can force the Administrator to add a new administrator controlled by the attacker, thereby giving the attacker full control over the application. Alternatively, the attacker can elevate the privileges of a low-privileged user to Administrator, further compromising the security of the application. Attackers can steal sensitive information such as login credentials, session tokens, personal identifiable information (PII), and financial data. The vulnerability can also lead to defacement of the Application.\n\nVersion 1.8.128 contains a patch for this issue.",
    "published": "2024-03-22T17:15:08.203",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-29385": {
    "cvss": "-",
    "description": "DIR-845L router <= v1.01KRb03 has an Unauthenticated remote code execution vulnerability in the cgibin binary via soapcgi_main function.",
    "published": "2024-03-22T17:15:08.943",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-2824": {
    "url": "https://github.com/matthias-wandel/jhead/issues/84",
    "cvss": 6.3,
    "description": "A vulnerability was found in Matthias-Wandel jhead 3.08 and classified as critical. This issue affects the function PrintFormatNumber of the file exif.c. The manipulation leads to heap-based buffer overflow. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-257711.",
    "published": "2024-03-22T18:15:08.063"
  },
  "CVE-2024-29190": {
    "url": "https://github.com/mobsf/mobile-security-framework-mobsf/commit/5a8eeee73c5f504a6c3abdf2a139a13804efdb77",
    "cvss": 7.5,
    "description": "Mobile Security Framework (MobSF) is a pen-testing, malware analysis and security assessment framework capable of performing static and dynamic analysis. In version 3.9.5 Beta and prior, MobSF does not perform any input validation when extracting the hostnames in `android:host`, so requests can also be sent to local hostnames. This can lead to server-side request forgery. An attacker can cause the server to make a connection to internal-only services within the organization's infrastructure. Commit 5a8eeee73c5f504a6c3abdf2a139a13804efdb77 has a hotfix for this issue.\n",
    "published": "2024-03-22T23:15:07.123"
  },
  "CVE-2024-2851": {
    "cvss": 6.3,
    "description": "A vulnerability was found in Tenda AC15 15.03.05.18/15.03.20_multi. It has been classified as critical. This affects the function formSetSambaConf of the file /goform/setsambacfg. The manipulation of the argument usbName leads to os command injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-257775. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-03-24T03:15:09.177",
    "keywords": "remote,command"
  }
}