{
  "CVE-2024-53676": {
    "cvss": 9.8,
    "description": "A directory traversal vulnerability in Hewlett Packard Enterprise Insight Remote Support may allow remote code execution.",
    "published": "2024-11-27T01:15:05.250",
    "keywords": "remote,execution"
  },
  "CVE-2024-11083": {
    "cvss": 5.3,
    "description": "The ProfilePress plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 4.15.18 via the WordPress core search feature. This makes it possible for unauthenticated attackers to extract sensitive data from posts that have been restricted to higher-level roles such as administrator.",
    "published": "2024-11-27T06:15:17.707",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-11219": {
    "cvss": 5.3,
    "description": "The Otter Blocks – Gutenberg Blocks, Page Builder for Gutenberg Editor & FSE plugin for WordPress is vulnerable to Path Traversal in all versions up to, and including, 3.0.6 via the get_image function. This makes it possible for unauthenticated attackers to view arbitrary images on the server, which can contain sensitive information.",
    "published": "2024-11-27T06:15:18.110",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-52959": {
    "cvss": "-",
    "description": "A Improper Control of Generation of Code ('Code Injection') vulnerability in plugin management in iota C.ai Conversational Platform from 1.0.0 through 2.1.3 allows remote authenticated users to perform arbitrary system commands via a DLL file.",
    "published": "2024-11-27T06:15:19.083",
    "keywords": "remote,command"
  },
  "CVE-2024-31976": {
    "cvss": 8.0,
    "description": "EnGenius EWS356-FIR 1.1.30 and earlier devices allow a remote attacker to execute arbitrary OS commands via the Controller connectivity parameter.",
    "published": "2024-11-27T17:15:10.913",
    "keywords": "remote,command"
  },
  "CVE-2024-53260": {
    "cvss": 6.8,
    "description": "Autolab is a course management service that enables auto-graded programming assignments. A user can modify their first and or last name to include a valid excel / spreadsheet formula. When an instructor downloads their course's roster and opens, this name will then be evaluated as a formula. This could lead to leakage of information of students in the course roster by sending the data to a remote endpoint. This issue has been patched in the source code repository and the fix is expected to be released in the next version. Users are advised to manually patch their systems or to wait for the next release. There are no known workarounds for this vulnerability.",
    "published": "2024-11-27T22:15:05.353",
    "keywords": "remote,leak"
  },
  "CVE-2024-53858": {
    "cvss": 6.5,
    "description": "The gh cli is GitHub’s official command line tool. A security vulnerability has been identified in the GitHub CLI that could leak authentication tokens when cloning repositories containing `git` submodules hosted outside of GitHub.com and ghe.com. This vulnerability stems from several `gh` commands used to clone a repository with submodules from a non-GitHub host including `gh repo clone`, `gh repo fork`, and `gh pr checkout`. These GitHub CLI commands invoke git with instructions to retrieve authentication tokens using the `credential.helper` configuration variable for any host encountered. Prior to version `2.63.0`, hosts other than GitHub.com and ghe.com are treated as GitHub Enterprise Server hosts and have tokens sourced from the following environment variables before falling back to host-specific tokens stored within system-specific secured storage: 1. `GITHUB_ENTERPRISE_TOKEN`, 2. `GH_ENTERPRISE_TOKEN` and 3. `GITHUB_TOKEN` when the `CODESPACES` environment variable is set. The result being `git` sending authentication tokens when cloning submodules. In version `2.63.0`, these GitHub CLI commands will limit the hosts for which `gh` acts as a credential helper to source authentication tokens. Additionally, `GITHUB_TOKEN` will only be used for GitHub.com and ghe.com. Users are advised to upgrade. Additionally users are advised to revoke authentication tokens used with the GitHub CLI and to review their personal security log and any relevant audit logs for actions associated with their account or enterprise",
    "published": "2024-11-27T22:15:05.520",
    "keywords": "authentication,command,leak"
  },
  "CVE-2024-53859": {
    "cvss": 6.5,
    "description": "go-gh is a Go module for interacting with the `gh` utility and the GitHub API from the command line. A security vulnerability has been identified in `go-gh` that could leak authentication tokens intended for GitHub hosts to non-GitHub hosts when within a codespace. `go-gh` sources authentication tokens from different environment variables depending on the host involved: 1. `GITHUB_TOKEN`, `GH_TOKEN` for GitHub.com and ghe.com and 2. `GITHUB_ENTERPRISE_TOKEN`, `GH_ENTERPRISE_TOKEN` for GitHub Enterprise Server. Prior to version `2.11.1`, `auth.TokenForHost` could source a token from the `GITHUB_TOKEN` environment variable for a host other than GitHub.com or ghe.com when within a codespace. In version `2.11.1`, `auth.TokenForHost` will only source a token from the `GITHUB_TOKEN` environment variable for GitHub.com or ghe.com hosts. Successful exploitation could send authentication token to an unintended host. This issue has been addressed in version 2.11.1 and all users are advised to upgrade. Users are also advised to regenerate authentication tokens and to review their personal security log and any relevant audit logs for actions associated with their account or enterprise.",
    "published": "2024-11-27T22:15:05.673",
    "keywords": "authentication,command,leak"
  },
  "CVE-2024-11787": {
    "cvss": 7.8,
    "description": "Fuji Electric Monitouch V-SFT V10 File Parsing Stack-based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Fuji Electric Monitouch V-SFT. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of V10 files. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-24413.",
    "published": "2024-11-28T00:15:04.000",
    "keywords": "remote,execution"
  },
  "CVE-2024-11789": {
    "cvss": 7.8,
    "description": "Fuji Electric Monitouch V-SFT V10 File Parsing Stack-based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Fuji Electric Monitouch V-SFT. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of V10 files. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-24448.",
    "published": "2024-11-28T00:15:04.153",
    "keywords": "remote,execution"
  },
  "CVE-2024-11790": {
    "cvss": 7.8,
    "description": "Fuji Electric Monitouch V-SFT V10 File Parsing Stack-based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Fuji Electric Monitouch V-SFT. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of V10 files. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-24449.",
    "published": "2024-11-28T00:15:04.297",
    "keywords": "remote,execution"
  },
  "CVE-2024-11791": {
    "cvss": 7.8,
    "description": "Fuji Electric Monitouch V-SFT V8C File Parsing Stack-based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Fuji Electric Monitouch V-SFT. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of V8C files. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-24450.",
    "published": "2024-11-28T00:15:04.467",
    "keywords": "remote,execution"
  },
  "CVE-2024-11792": {
    "cvss": 7.8,
    "description": "Fuji Electric Monitouch V-SFT V8 File Parsing Stack-based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Fuji Electric Monitouch V-SFT. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of V8 files. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-24502.",
    "published": "2024-11-28T00:15:04.603",
    "keywords": "remote,execution"
  },
  "CVE-2024-11793": {
    "cvss": 7.8,
    "description": "Fuji Electric Monitouch V-SFT V9C File Parsing Out-Of-Bounds Write Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Fuji Electric Monitouch V-SFT. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of V9C files. The issue results from the lack of proper validation of user-supplied data, which can result in a write past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-24503.",
    "published": "2024-11-28T00:15:04.730",
    "keywords": "remote,execution"
  },
  "CVE-2024-11794": {
    "cvss": 7.8,
    "description": "Fuji Electric Monitouch V-SFT V10 File Parsing Out-Of-Bounds Write Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Fuji Electric Monitouch V-SFT. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of V10 files. The issue results from the lack of proper validation of user-supplied data, which can result in a write past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-24504.",
    "published": "2024-11-28T00:15:04.883",
    "keywords": "remote,execution"
  },
  "CVE-2024-11795": {
    "cvss": 7.8,
    "description": "Fuji Electric Monitouch V-SFT V8 File Parsing Stack-based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Fuji Electric Monitouch V-SFT. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of V8 files. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-24505.",
    "published": "2024-11-28T00:15:05.017",
    "keywords": "remote,execution"
  },
  "CVE-2024-11796": {
    "cvss": 7.8,
    "description": "Fuji Electric Monitouch V-SFT V9C File Parsing Out-Of-Bounds Write Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Fuji Electric Monitouch V-SFT. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of V9C files. The issue results from the lack of proper validation of user-supplied data, which can result in a write past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-24506.",
    "published": "2024-11-28T00:15:05.173",
    "keywords": "remote,execution"
  },
  "CVE-2024-11797": {
    "cvss": 7.8,
    "description": "Fuji Electric Monitouch V-SFT V8 File Parsing Out-Of-Bounds Write Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Fuji Electric Monitouch V-SFT. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of V8 files. The issue results from the lack of proper validation of user-supplied data, which can result in a write past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-24662.",
    "published": "2024-11-28T00:15:05.323",
    "keywords": "remote,execution"
  },
  "CVE-2024-11798": {
    "cvss": 7.8,
    "description": "Fuji Electric Monitouch V-SFT X1 File Parsing Out-Of-Bounds Write Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Fuji Electric Monitouch V-SFT. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of X1 files. The issue results from the lack of proper validation of user-supplied data, which can result in a write past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-24663.",
    "published": "2024-11-28T00:15:05.463",
    "keywords": "remote,execution"
  },
  "CVE-2024-11799": {
    "cvss": 7.8,
    "description": "Fuji Electric Tellus Lite V-Simulator 5 V8 File Parsing Stack-based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Fuji Electric Tellus Lite. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of V8 files in the V-Simulator 5 component. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a fixed-length stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-24664.",
    "published": "2024-11-28T00:15:05.603",
    "keywords": "remote,execution"
  },
  "CVE-2024-11800": {
    "cvss": 7.8,
    "description": "Fuji Electric Tellus Lite V-Simulator 5 V8 File Parsing Stack-based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Fuji Electric Tellus Lite. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of V8 files in the V-Simulator 5 component. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a fixed-length stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-24768.",
    "published": "2024-11-28T00:15:05.747",
    "keywords": "remote,execution"
  },
  "CVE-2024-11801": {
    "cvss": 7.8,
    "description": "Fuji Electric Tellus Lite V-Simulator 5 V8 File Parsing Out-Of-Bounds Write Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Fuji Electric Tellus Lite. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of V8 files in the V-Simulator 5 component. The issue results from the lack of proper validation of user-supplied data, which can result in a write past the end of an allocated data structure. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-24769.",
    "published": "2024-11-28T00:15:05.873",
    "keywords": "remote,execution"
  },
  "CVE-2024-11802": {
    "cvss": 7.8,
    "description": "Fuji Electric Tellus Lite V-Simulator 5 V8 File Parsing Stack-Based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Fuji Electric Tellus Lite. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of V8 files in the V-Simulator 5 component. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a fixed-length stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-24770.",
    "published": "2024-11-28T00:15:06.007",
    "keywords": "remote,execution"
  },
  "CVE-2024-11803": {
    "cvss": 7.8,
    "description": "Fuji Electric Tellus Lite V-Simulator 5 V8 File Parsing Out-Of-Bounds Write Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Fuji Electric Tellus Lite. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of V8 files in the V-Simulator 5 component. The issue results from the lack of proper validation of user-supplied data, which can result in a write past the end of an allocated data structure. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-24771.",
    "published": "2024-11-28T00:15:06.143",
    "keywords": "remote,execution"
  },
  "CVE-2024-11933": {
    "cvss": 7.8,
    "description": "Fuji Electric Monitouch V-SFT X1 File Parsing Heap-based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Fuji Electric Monitouch V-SFT. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of X1 files. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a heap-based buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-24548.",
    "published": "2024-11-28T00:15:06.283",
    "keywords": "remote,execution"
  },
  "CVE-2024-53008": {
    "cvss": 5.3,
    "description": "Inconsistent interpretation of HTTP requests ('HTTP Request/Response Smuggling') issue exists in HAProxy. If this vulnerability is exploited,  a remote attacker may access a path that is restricted by ACL (Access Control List) set on the product. As a result, the attacker may obtain sensitive information.",
    "published": "2024-11-28T03:15:16.363",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-8066": {
    "cvss": 7.5,
    "description": "The File Manager Pro – Filester plugin for WordPress is vulnerable to arbitrary file uploads due to missing validation in the 'fsConnector' function in all versions up to, and including, 1.8.4. This makes it possible for authenticated attackers, with Subscriber-level access and above, and granted permissions by an Administrator, to upload a new .htaccess file allowing them to subsequently upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-11-28T09:15:05.547",
    "keywords": "remote,execution"
  },
  "CVE-2024-9669": {
    "cvss": 7.2,
    "description": "The File Manager Pro – Filester plugin for WordPress is vulnerable to Local JavaScript File Inclusion in all versions up to, and including, 1.8.5 via the 'fm_locale' parameter. This makes it possible for authenticated attackers, with Administrator-level access and above, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included. The vulnerability was partially patched in version 1.8.5.",
    "published": "2024-11-28T09:15:05.710",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-11599": {
    "cvss": 8.2,
    "description": "Mattermost versions 10.0.x <= 10.0.1, 10.1.x <= 10.1.1, 9.11.x <= 9.11.3, 9.5.x <= 9.5.11 fail to properly validate email addresses which allows an unauthenticated user to bypass email domain restrictions via carefully crafted input on email registration.",
    "published": "2024-11-28T10:15:06.657",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2024-8672": {
    "cvss": 9.9,
    "description": "The Widget Options – The #1 WordPress Widget & Block Control Plugin plugin for WordPress is vulnerable to Remote Code Execution in all versions up to, and including, 4.0.7 via the display logic functionality that extends several page builders. This is due to the plugin allowing users to supply input that will be passed through eval() without any filtering or capability checks. This makes it possible for authenticated attackers, with contributor-level access and above, to execute code on the server. Special note: We suggested the vendor implement an allowlist of functions and limit the ability to execute commands to just administrators, however, they did not take our advice. We are considering this patched, however, we believe it could still be further hardened and there may be residual risk with how the issue is currently patched.",
    "published": "2024-11-28T10:15:08.870",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-52475": {
    "cvss": 9.8,
    "description": "Authentication Bypass Using an Alternate Path or Channel vulnerability in Automation Web Platform Wawp allows Authentication Bypass.This issue affects Wawp: from n/a before 3.0.18.",
    "published": "2024-11-28T11:15:49.230",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-11978": {
    "cvss": 7.5,
    "description": "DreamMaker from Interinfo has a Path Traversal vulnerability, allowing unauthenticated remote attackers to exploit this vulnerability to read arbitrary system files.",
    "published": "2024-11-29T03:15:14.700",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-11979": {
    "cvss": 9.8,
    "description": "DreamMaker from Interinfo has a Path Traversal vulnerability and does not restrict the types of uploaded files. This allows unauthenticated remote attackers to upload arbitrary files to any directory, leading to arbitrary code execution by uploading webshells.",
    "published": "2024-11-29T03:15:15.653",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-48651": {
    "url": "https://github.com/proftpd/proftpd/commit/cec01cc0a2523453e5da5a486bc6d977c3768db1",
    "cvss": 7.5,
    "description": "In ProFTPD through 1.3.8b before cec01cc, supplemental group inheritance grants unintended access to GID 0 because of the lack of supplemental groups from mod_sql.",
    "published": "2024-11-29T05:15:05.963"
  },
  "CVE-2024-11980": {
    "cvss": 8.6,
    "description": "Certain modes of routers from Billion Electric have a Missing Authentication vulnerability, allowing unauthenticated remote attackers to directly access the specific functionality to obtain partial device information, modify the WiFi SSID, and restart the device.",
    "published": "2024-11-29T06:15:06.747",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2024-11981": {
    "cvss": 7.5,
    "description": "Certain models of routers from Billion Electric has an Authentication Bypass vulnerability, allowing unautheticated attackers to retrive contents of arbitrary web pages.",
    "published": "2024-11-29T07:15:05.760",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-11481": {
    "cvss": 8.2,
    "description": "A vulnerability in ESM 11.6.10 allows unauthenticated access to the internal Snowservice API. This leads to improper handling of path traversal, insecure forwarding to an AJP backend without adequate validation, and lack of authentication for accessing internal API endpoints.",
    "published": "2024-11-29T08:15:04.270",
    "keywords": "unauthenticated,authentication"
  },
  "CVE-2024-11482": {
    "cvss": 9.8,
    "description": "A vulnerability in ESM 11.6.10 allows unauthenticated access to the internal Snowservice API and enables remote code execution through command injection, executed as the root user.",
    "published": "2024-11-29T08:15:04.437",
    "keywords": "remote,execution,unauthenticated,command"
  },
  "CVE-2024-11983": {
    "cvss": 7.2,
    "description": "Certain models of routers from Billion Electric has an OS Command Injection vulnerability, allowing remote attackers with administrator privileges to inject arbitrary system commands into a specific SSH function and execute them on the device.",
    "published": "2024-11-29T08:15:04.733",
    "keywords": "remote,command"
  },
  "CVE-2024-47094": {
    "cvss": "-",
    "description": "Insertion of Sensitive Information into Log File in Checkmk GmbH's Checkmk versions <2.3.0p22, <2.2.0p37, <2.1.0p50 (EOL) causes remote site secrets to be written to web log files accessible to local site users.",
    "published": "2024-11-29T10:15:10.657",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-11992": {
    "cvss": 9.1,
    "description": "Absolute path traversal vulnerability in Quick.CMS, version 6.7, the exploitation of which could allow remote users to bypass the intended restrictions and download any file if it has the appropriate permissions outside of documentroot configured on the server via the aDirFiles%5B0%5D parameter in the admin.php page. This vulnerability allows an attacker to delete files stored on the server due to a lack of proper verification of user-supplied input.",
    "published": "2024-11-29T13:15:05.210",
    "keywords": "remote,bypass"
  },
  "CVE-2024-52777": {
    "cvss": 9.8,
    "description": "DCME-320 <=7.4.12.90, DCME-520 <=9.25.5.11, DCME-320-L, <=9.3.5.26, and DCME-720 <=9.1.5.11 are vulnerable to Remote Code Execution via /function/system/basic/license_update.php.",
    "published": "2024-11-29T16:15:10.577",
    "keywords": "remote,execution"
  },
  "CVE-2024-52778": {
    "cvss": 9.8,
    "description": "DCME-320 <=7.4.12.90, DCME-520 <=9.25.5.11, DCME-320-L <=9.3.5.26, and DCME-720 <=9.1.5.11 are vulnerable to Remote Code Execution via /function/audit/newstatistics/mon_stat_hist.php.",
    "published": "2024-11-29T16:15:10.700",
    "keywords": "remote,execution"
  },
  "CVE-2024-52779": {
    "cvss": 9.8,
    "description": "DCME-320 <=7.4.12.90, DCME-520 <=9.25.5.11, DCME-320-L <=9.3.5.26, and DCME-720 <=9.1.5.11 are vulnerable to Remote Code Execution via /function/audit/newstatistics/mon_stat_top10.php.",
    "published": "2024-11-29T16:15:10.810",
    "keywords": "remote,execution"
  },
  "CVE-2024-52780": {
    "cvss": 9.8,
    "description": "DCME-320 <=7.4.12.90, DCME-520 <=9.25.5.11, DCME-320-L <=9.3.5.26, and DCME-720 <=9.1.5.11 are vulnerable to Remote Code Execution via /function/system/basic/mgmt_edit.php.",
    "published": "2024-11-29T16:15:10.933",
    "keywords": "remote,execution"
  },
  "CVE-2024-52781": {
    "cvss": 9.8,
    "description": "DCME-320 <=7.4.12.90, DCME-520 <=9.25.5.11, DCME-320-L <=9.3.5.26, and DCME-720 <=9.1.5.11 are vulnerable to Remote Code Execution via /function/system/tool/traceroute.php.",
    "published": "2024-11-29T16:15:11.040",
    "keywords": "remote,execution"
  },
  "CVE-2024-52782": {
    "cvss": 9.8,
    "description": "DCME-320 <=7.4.12.90, DCME-520 <=9.25.5.11, DCME-320-L <=9.3.5.26, and DCME-720 <=9.1.5.11 are vulnerable to Remote Code Execution via /function/audit/newstatistics/mon_stat_hist_new.php.",
    "published": "2024-11-29T16:15:11.163",
    "keywords": "remote,execution"
  },
  "CVE-2024-49803": {
    "cvss": 9.8,
    "description": "IBM Security Verify Access Appliance 10.0.0 through 10.0.8 could allow a remote authenticated attacker to execute arbitrary commands on the system by sending a specially crafted request.",
    "published": "2024-11-29T17:15:08.180",
    "keywords": "remote,command"
  },
  "CVE-2024-52800": {
    "cvss": "-",
    "description": "veraPDF is an open source PDF/A validation library. Executing policy checks using custom schematron files via the CLI invokes an XSL transformation that may theoretically lead to a remote code execution (RCE) vulnerability. This doesn't affect the standard validation and policy checks functionality, veraPDF's common use cases. Most veraPDF users don't insert any custom XSLT code into policy profiles, which are based on Schematron syntax rather than direct XSL transforms. For users who do, only load custom policy files from sources you trust. This issue has not yet been patched. Users are advised to be cautious of XSLT code until a patch is available.",
    "published": "2024-11-29T19:15:08.713",
    "keywords": "remote,execution"
  },
  "CVE-2024-52810": {
    "cvss": "-",
    "description": "@intlify/shared is a shared library for the intlify project. The latest version of @intlify/shared (10.0.4) is vulnerable to Prototype Pollution through the entry function(s) lib.deepCopy. An attacker can supply a payload with Object.prototype setter to introduce or modify properties within the global prototype chain, causing denial of service (DoS) as the minimum consequence. Moreover, the consequences of this vulnerability can escalate to other injection-based attacks, depending on how the library integrates within the application. For instance, if the polluted property propagates to sensitive Node.js APIs (e.g., exec, eval), it could enable an attacker to execute arbitrary commands within the application's context. This issue has been addressed in versions 9.14.2, and 10.0.5. Users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-11-29T19:15:09.163",
    "keywords": "command,sensitive"
  },
  "CVE-2024-53504": {
    "url": "https://github.com/siyuan-note/siyuan/issues/13077",
    "cvss": "-",
    "description": "A SQL injection vulnerability has been identified in Siyuan 3.1.11 via the notebook parameter in /searchHistory.",
    "published": "2024-11-29T20:15:20.763"
  },
  "CVE-2024-53505": {
    "url": "https://github.com/siyuan-note/siyuan/issues/13077",
    "cvss": "-",
    "description": "A SQL injection vulnerability has been identified in Siyuan 3.1.11 via the id parameter at /getAssetContent.",
    "published": "2024-11-29T20:15:20.853"
  },
  "CVE-2024-53506": {
    "url": "https://github.com/siyuan-note/siyuan/issues/13077",
    "cvss": "-",
    "description": "A SQL injection vulnerability has been identified in Siyuan 3.1.11 via the ids array parameter in /batchGetBlockAttrs.",
    "published": "2024-11-29T20:15:20.943"
  },
  "CVE-2024-53507": {
    "url": "https://github.com/siyuan-note/siyuan/issues/13077",
    "cvss": "-",
    "description": "A SQL injection vulnerability was discovered in Siyuan 3.1.11 in /getHistoryItems.",
    "published": "2024-11-29T20:15:21.027"
  }
}