{
  "CVE-2024-9554": {
    "cvss": 3.7,
    "description": "A vulnerability classified as problematic was found in Sovell Smart Canteen System up to 3.0.7303.30513. Affected by this vulnerability is the function Check_ET_CheckPwdz201 of the file suanfa.py of the component Password Reset Handler. The manipulation leads to authorization bypass. The attack can be launched remotely. The complexity of an attack is rather high. The exploitation appears to be difficult. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-10-06T12:15:08.117",
    "keywords": "remote,bypass"
  },
  "CVE-2024-9560": {
    "cvss": 6.3,
    "description": "A vulnerability was found in ESAFENET CDG V5. It has been rated as critical. Affected by this issue is the function delCatelogs of the file /CDGServer3/document/Catelogs;logindojojs?command=DelCatelogs. The manipulation of the argument id leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used.",
    "published": "2024-10-06T22:15:02.677",
    "keywords": "remote,command"
  },
  "CVE-2024-20094": {
    "cvss": 7.5,
    "description": "In Modem, there is a possible system crash due to a missing bounds check. This could lead to remote denial of service with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: MOLY00843282; Issue ID: MSV-1535.",
    "published": "2024-10-07T03:15:02.823",
    "keywords": "remote,execution"
  },
  "CVE-2024-20100": {
    "cvss": 9.8,
    "description": "In wlan driver, there is a possible out of bounds write due to improper input validation. This could lead to remote code execution with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: ALPS08998449; Issue ID: MSV-1603.",
    "published": "2024-10-07T03:15:03.273",
    "keywords": "remote,execution"
  },
  "CVE-2024-20101": {
    "cvss": 9.8,
    "description": "In wlan driver, there is a possible out of bounds write due to improper input validation. This could lead to remote code execution with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: ALPS08998901; Issue ID: MSV-1602.",
    "published": "2024-10-07T03:15:03.350",
    "keywords": "remote,execution"
  },
  "CVE-2024-20102": {
    "cvss": "-",
    "description": "In wlan driver, there is a possible out of bounds read due to improper input validation. This could lead to remote information disclosure with System execution privileges needed. User interaction is not needed for exploitation. Patch ID: ALPS08998892; Issue ID: MSV-1601.",
    "published": "2024-10-07T03:15:03.427",
    "keywords": "remote,execution"
  },
  "CVE-2024-20103": {
    "cvss": 9.8,
    "description": "In wlan firmware, there is a possible out of bounds write due to improper input validation. This could lead to remote code execution with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: ALPS09001358; Issue ID: MSV-1599.",
    "published": "2024-10-07T03:15:03.500",
    "keywords": "remote,execution"
  },
  "CVE-2024-46041": {
    "cvss": 8.8,
    "description": "IoT Haat Smart Plug IH-IN-16A-S v5.16.1 is vulnerable to Authentication Bypass by Capture-replay.",
    "published": "2024-10-07T16:15:05.477",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-31227": {
    "url": "https://github.com/redis/redis/commit/b351d5a3210e61cc3b22ba38a723d6da8f3c298a",
    "cvss": 4.4,
    "description": "Redis is an open source, in-memory database that persists on disk. An authenticated with sufficient privileges may create a malformed ACL selector which, when accessed, triggers a server panic and subsequent denial of service. The problem exists in Redis 7 prior to versions 7.2.6 and 7.4.1. Users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-10-07T20:15:05.050"
  },
  "CVE-2024-31228": {
    "url": "https://github.com/redis/redis/commit/9317bf64659b33166a943ec03d5d9b954e86afb0",
    "cvss": 5.5,
    "description": "Redis is an open source, in-memory database that persists on disk. Authenticated users can trigger a denial-of-service by using specially crafted, long string match patterns on supported commands such as `KEYS`, `SCAN`, `PSUBSCRIBE`, `FUNCTION LIST`, `COMMAND LIST` and ACL definitions. Matching of extremely long patterns may result in unbounded recursion, leading to stack overflow and process crash. This problem has been fixed in Redis versions 6.2.16, 7.2.6, and 7.4.1. Users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-10-07T20:15:05.277"
  },
  "CVE-2024-31449": {
    "cvss": 7.0,
    "description": "Redis is an open source, in-memory database that persists on disk. An authenticated user may use a specially crafted Lua script to trigger a stack buffer overflow in the bit library, which may potentially lead to remote code execution. The problem exists in all versions of Redis with Lua scripting. This problem has been fixed in Redis versions 6.2.16, 7.2.6, and 7.4.1. Users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-10-07T20:15:05.507",
    "keywords": "remote,execution"
  },
  "CVE-2024-45293": {
    "cvss": 7.5,
    "description": "PHPSpreadsheet is a pure PHP library for reading and writing spreadsheet files. The security scanner responsible for preventing XXE attacks in the XLSX reader can be bypassed by slightly modifying the XML structure, utilizing white-spaces. On servers that allow users to upload their own Excel (XLSX) sheets, Server files and sensitive information can be disclosed by providing a crafted sheet. The security scan function in src/PhpSpreadsheet/Reader/Security/XmlScanner.php contains a flawed XML encoding check to retrieve the input file's XML encoding in the toUtf8 function. The function searches for the XML encoding through a defined regex which looks for `encoding=\"*\"` and/or `encoding='*'`, if not found, it defaults to the UTF-8 encoding which bypasses the conversion logic. This logic can be used to pass a UTF-7 encoded XXE payload, by utilizing a whitespace before or after the = in the attribute definition. Sensitive information disclosure through the XXE on sites that allow users to upload their own excel spreadsheets, and parse them using PHPSpreadsheet's Excel parser. This issue has been addressed in release versions 1.29.1, 2.1.1, and 2.3.0. All users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-10-07T20:15:06.100",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-45290": {
    "cvss": 7.7,
    "description": "PHPSpreadsheet is a pure PHP library for reading and writing spreadsheet files. It's possible for an attacker to construct an XLSX file which links media from external URLs. When opening the XLSX file, PhpSpreadsheet retrieves the image size and type by reading the file contents, if the provided path is a URL. By using specially crafted `php://filter` URLs an attacker can leak the contents of any file or URL. Note that this vulnerability is different from GHSA-w9xv-qf98-ccq4, and resides in a different component. An attacker can access any file on the server, or leak information form arbitrary URLs, potentially exposing sensitive information such as AWS IAM credentials. This issue has been addressed in release versions 1.29.2, 2.1.1, and 2.3.0. All users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-10-07T21:15:17.397",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-45291": {
    "cvss": 6.3,
    "description": "PHPSpreadsheet is a pure PHP library for reading and writing spreadsheet files. It's possible for an attacker to construct an XLSX file that links images from arbitrary paths. When embedding images has been enabled in HTML writer with `$writer->setEmbedImages(true);` those files will be included in the output as `data:` URLs, regardless of the file's type. Also URLs can be used for embedding, resulting in a Server-Side Request Forgery vulnerability. When embedding images has been enabled, an attacker can read arbitrary files on the server and perform arbitrary HTTP GET requests. Note that any PHP protocol wrappers can be used, meaning that if for example the `expect://` wrapper is enabled, also remote code execution is possible. This issue has been addressed in release versions 1.29.2, 2.1.1, and 2.3.0. All users are advised to upgrade. there are no known workarounds for this vulnerability.",
    "published": "2024-10-07T21:15:17.633",
    "keywords": "remote,execution"
  },
  "CVE-2024-45919": {
    "cvss": 6.5,
    "description": "A security flaw has been discovered in Solvait version 24.4.2 that allows an attacker to elevate their privileges. By manipulating the Request ID and Action Type parameters in /AssignToMe/SetAction, an attacker can bypass approval workflows leading to unauthorized access to sensitive information or approval of fraudulent requests.",
    "published": "2024-10-07T21:15:18.083",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-8926": {
    "cvss": 8.1,
    "description": "In PHP versions 8.1.* before 8.1.30, 8.2.* before 8.2.24, 8.3.* before 8.3.12, when using a certain non-standard configurations of Windows codepages, the fixes for  CVE-2024-4577 https://github.com/advisories/GHSA-vxpp-6299-mxw3  may still be bypassed and the same command injection related to Windows \"Best Fit\" codepage behavior can be achieved. This may allow a malicious user to pass options to PHP binary being run, and thus reveal the source code of scripts, run arbitrary PHP code on the server, etc.",
    "published": "2024-10-08T04:15:10.637",
    "keywords": "command,bypass"
  },
  "CVE-2024-21533": {
    "cvss": 6.5,
    "description": "All versions of the package ggit are vulnerable to Arbitrary Argument Injection via the clone() API, which allows specifying the remote URL to clone and the file on disk to clone to. The library does not sanitize for user input or validate a given URL scheme, nor does it properly pass command-line flags to the git binary using the double-dash POSIX characters (--) to communicate the end of options.",
    "published": "2024-10-08T05:15:14.180",
    "keywords": "remote,command"
  },
  "CVE-2024-46887": {
    "cvss": 5.3,
    "description": "The web server of affected devices do not properly authenticate user request to the '/ClientArea/RuntimeInfoData.mwsl' endpoint. This could allow an unauthenticated remote attacker to gain knowledge about current actual and configured maximum cycle times as well as about configured maximum communication load.",
    "published": "2024-10-08T09:15:16.447",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-47553": {
    "cvss": 9.9,
    "description": "A vulnerability has been identified in Siemens SINEC Security Monitor (All versions < V4.9.0). The affected application does not properly validate user input to the ```ssmctl-client``` command.\r\nThis could allow an authenticated, lowly privileged remote attacker to execute arbitrary code with root privileges on the underlying OS.",
    "published": "2024-10-08T09:15:17.847",
    "keywords": "remote,command"
  },
  "CVE-2024-47563": {
    "cvss": 5.3,
    "description": "A vulnerability has been identified in Siemens SINEC Security Monitor (All versions < V4.9.0). The affected application does not properly validate a file path that is supplied to an endpoint intended to create CSR files.\r\nThis could allow an unauthenticated remote attacker to create files in writable directories outside the intended location and thus compromise integrity of files in those writable directories.",
    "published": "2024-10-08T09:15:18.403",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-8943": {
    "cvss": 9.8,
    "description": "The LatePoint plugin for WordPress is vulnerable to authentication bypass in versions up to, and including,  5.0.12. This is due to insufficient verification on the user being supplied during the booking customer step. This makes it possible for unauthenticated attackers to log in as any existing user on the site, such as an administrator, if they have access to the user id. Note that logging in as a WordPress user is only possible if the \"Use WordPress users as customers\" setting is enabled, which is disabled by default. The vulnerability is partially patched in version 5.0.12 and fully patched in version 5.0.13.",
    "published": "2024-10-08T09:15:19.343",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-33506": {
    "cvss": 3.3,
    "description": "An exposure of sensitive information to an unauthorized actor vulnerability [CWE-200] in FortiManager 7.4.2 and below, 7.2.5 and below, 7.0.12 and below allows a remote authenticated attacker assigned to an Administrative Domain (ADOM) to access device summary of unauthorized ADOMs via crafted HTTP requests.",
    "published": "2024-10-08T15:15:14.717",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-44349": {
    "cvss": 9.8,
    "description": "A SQL injection vulnerability in login portal in AnteeoWMS before v4.7.34 allows unauthenticated attackers to execute arbitrary SQL commands via the username parameter and disclosure of some data in the underlying DB.",
    "published": "2024-10-08T17:15:54.027",
    "keywords": "unauthenticated,command"
  },
  "CVE-2024-47007": {
    "cvss": 7.5,
    "description": "A NULL pointer dereference in WLAvalancheService.exe of Ivanti Avalanche before version 6.4.5 allows a remote unauthenticated attacker to cause a denial of service.",
    "published": "2024-10-08T17:15:54.210",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-47008": {
    "cvss": 7.5,
    "description": "Server-side request forgery in Ivanti Avalanche before version 6.4.5 allows a remote unauthenticated attacker to leak sensitive information.",
    "published": "2024-10-08T17:15:54.463",
    "keywords": "remote,unauthenticated,sensitive,leak"
  },
  "CVE-2024-47009": {
    "cvss": 7.3,
    "description": "Path Traversal in Ivanti Avalanche before version 6.4.5 allows a remote unauthenticated attacker to bypass authentication.",
    "published": "2024-10-08T17:15:54.777",
    "keywords": "remote,unauthenticated,authentication,bypass"
  },
  "CVE-2024-47010": {
    "cvss": 7.3,
    "description": "Path Traversal in Ivanti Avalanche before version 6.4.5 allows a remote unauthenticated attacker to bypass authentication.",
    "published": "2024-10-08T17:15:55.240",
    "keywords": "remote,unauthenticated,authentication,bypass"
  },
  "CVE-2024-47011": {
    "cvss": 7.5,
    "description": "Path Traversal in Ivanti Avalanche before version 6.4.5 allows a remote unauthenticated attacker to leak sensitive information",
    "published": "2024-10-08T17:15:55.533",
    "keywords": "remote,unauthenticated,sensitive,leak"
  },
  "CVE-2024-9380": {
    "cvss": 7.2,
    "description": "An OS command injection vulnerability in the admin web console of Ivanti CSA before version 5.0.2 allows a remote authenticated attacker with admin privileges to obtain remote code execution.",
    "published": "2024-10-08T17:15:56.970",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-9381": {
    "cvss": 7.2,
    "description": "Path traversal in Ivanti CSA before version 5.0.2 allows a remote authenticated attacker with admin privileges to bypass restrictions.",
    "published": "2024-10-08T17:15:57.183",
    "keywords": "remote,bypass"
  },
  "CVE-2024-30092": {
    "cvss": 8.0,
    "description": "Windows Hyper-V Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:05.513",
    "keywords": "remote,execution"
  },
  "CVE-2024-38029": {
    "cvss": 7.5,
    "description": "Microsoft OpenSSH for Windows Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:06.730",
    "keywords": "remote,execution"
  },
  "CVE-2024-38212": {
    "cvss": 8.8,
    "description": "Windows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:07.940",
    "keywords": "remote,execution"
  },
  "CVE-2024-38229": {
    "cvss": 8.1,
    "description": ".NET and Visual Studio Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:08.153",
    "keywords": "remote,execution"
  },
  "CVE-2024-38261": {
    "cvss": 7.8,
    "description": "Windows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:08.367",
    "keywords": "remote,execution"
  },
  "CVE-2024-38262": {
    "cvss": 7.5,
    "description": "Windows Remote Desktop Licensing Service Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:08.593",
    "keywords": "remote,execution"
  },
  "CVE-2024-38265": {
    "cvss": 8.8,
    "description": "Windows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:08.797",
    "keywords": "remote,execution"
  },
  "CVE-2024-43453": {
    "cvss": 8.8,
    "description": "Windows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:09.070",
    "keywords": "remote,execution"
  },
  "CVE-2024-43468": {
    "cvss": 9.8,
    "description": "Microsoft Configuration Manager Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:09.537",
    "keywords": "remote,execution"
  },
  "CVE-2024-43480": {
    "cvss": 6.6,
    "description": "Azure Service Fabric for Linux Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:09.833",
    "keywords": "remote,execution"
  },
  "CVE-2024-43488": {
    "cvss": 8.8,
    "description": "Missing authentication for critical function in Visual Studio Code extension for Arduino allows an unauthenticated attacker to perform remote code execution through network attack vector.",
    "published": "2024-10-08T18:15:11.030",
    "keywords": "remote,execution,unauthenticated,authentication"
  },
  "CVE-2024-43497": {
    "cvss": 8.4,
    "description": "DeepSpeed Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:11.293",
    "keywords": "remote,execution"
  },
  "CVE-2024-43504": {
    "cvss": 7.8,
    "description": "Microsoft Excel Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:12.240",
    "keywords": "remote,execution"
  },
  "CVE-2024-43505": {
    "cvss": 7.8,
    "description": "Microsoft Office Visio Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:12.433",
    "keywords": "remote,execution"
  },
  "CVE-2024-43517": {
    "cvss": 8.8,
    "description": "Microsoft ActiveX Data Objects Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:14.540",
    "keywords": "remote,execution"
  },
  "CVE-2024-43518": {
    "cvss": 8.8,
    "description": "Windows Telephony Server Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:14.770",
    "keywords": "remote,execution"
  },
  "CVE-2024-43519": {
    "cvss": 8.8,
    "description": "Microsoft WDAC OLE DB provider for SQL Server Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:14.977",
    "keywords": "remote,execution"
  },
  "CVE-2024-43523": {
    "cvss": 6.8,
    "description": "Windows Mobile Broadband Driver Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:15.800",
    "keywords": "remote,execution"
  },
  "CVE-2024-43524": {
    "cvss": 6.8,
    "description": "Windows Mobile Broadband Driver Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:16.000",
    "keywords": "remote,execution"
  },
  "CVE-2024-43525": {
    "cvss": 6.8,
    "description": "Windows Mobile Broadband Driver Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:16.220",
    "keywords": "remote,execution"
  },
  "CVE-2024-43526": {
    "cvss": 6.8,
    "description": "Windows Mobile Broadband Driver Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:16.420",
    "keywords": "remote,execution"
  },
  "CVE-2024-43533": {
    "cvss": 8.8,
    "description": "Remote Desktop Client Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:17.437",
    "keywords": "remote,execution"
  },
  "CVE-2024-43536": {
    "cvss": 6.8,
    "description": "Windows Mobile Broadband Driver Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:18.030",
    "keywords": "remote,execution"
  },
  "CVE-2024-43543": {
    "cvss": 6.8,
    "description": "Windows Mobile Broadband Driver Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:19.270",
    "keywords": "remote,execution"
  },
  "CVE-2024-43549": {
    "cvss": 8.8,
    "description": "Windows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:20.377",
    "keywords": "remote,execution"
  },
  "CVE-2024-43552": {
    "cvss": 7.3,
    "description": "Windows Shell Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:20.987",
    "keywords": "remote,execution"
  },
  "CVE-2024-43564": {
    "cvss": 8.8,
    "description": "Windows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:23.613",
    "keywords": "remote,execution"
  },
  "CVE-2024-43572": {
    "cvss": 7.8,
    "description": "Microsoft Management Console Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:24.593",
    "keywords": "remote,execution"
  },
  "CVE-2024-43574": {
    "cvss": 8.3,
    "description": "Microsoft Speech Application Programming Interface (SAPI) Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:25.030",
    "keywords": "remote,execution"
  },
  "CVE-2024-43576": {
    "cvss": 7.8,
    "description": "Microsoft Office Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:25.450",
    "keywords": "remote,execution"
  },
  "CVE-2024-43581": {
    "cvss": 7.1,
    "description": "Microsoft OpenSSH for Windows Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:25.647",
    "keywords": "remote,execution"
  },
  "CVE-2024-43582": {
    "cvss": 8.1,
    "description": "Remote Desktop Protocol Server Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:25.850",
    "keywords": "remote,execution"
  },
  "CVE-2024-43589": {
    "cvss": 8.8,
    "description": "Windows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:26.700",
    "keywords": "remote,execution"
  },
  "CVE-2024-43592": {
    "cvss": 8.8,
    "description": "Windows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:27.327",
    "keywords": "remote,execution"
  },
  "CVE-2024-43593": {
    "cvss": 8.8,
    "description": "Windows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:27.553",
    "keywords": "remote,execution"
  },
  "CVE-2024-43599": {
    "cvss": 8.8,
    "description": "Remote Desktop Client Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:27.753",
    "keywords": "remote,execution"
  },
  "CVE-2024-43601": {
    "cvss": 7.1,
    "description": "Visual Studio Code for Linux Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:27.953",
    "keywords": "remote,execution"
  },
  "CVE-2024-43607": {
    "cvss": 8.8,
    "description": "Windows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:28.597",
    "keywords": "remote,execution"
  },
  "CVE-2024-43608": {
    "cvss": 8.8,
    "description": "Windows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:28.813",
    "keywords": "remote,execution"
  },
  "CVE-2024-43611": {
    "cvss": 8.8,
    "description": "Windows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:29.240",
    "keywords": "remote,execution"
  },
  "CVE-2024-43615": {
    "cvss": 7.1,
    "description": "Microsoft OpenSSH for Windows Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:29.813",
    "keywords": "remote,execution"
  },
  "CVE-2024-43616": {
    "cvss": 7.8,
    "description": "Microsoft Office Remote Code Execution Vulnerability",
    "published": "2024-10-08T18:15:30.020",
    "keywords": "remote,execution"
  }
}