{
  "CVE-2025-22366": {
    "cvss": "-",
    "description": "The authenticated firmware update capability of the firmware for Mennekes Smart / Premium Chargingpoints can be abused for command execution because OS command are improperly neutralized when certain fields are passed to the underlying OS.",
    "published": "2025-03-11T14:15:24.313",
    "keywords": "execution,command"
  },
  "CVE-2025-22367": {
    "cvss": "-",
    "description": "The authenticated time setting capability of the firmware for Mennekes Smart / Premium Chargingpoints can be abused for command execution because OS command are improperly neutralized when certain fields are passed to the underlying OS.",
    "published": "2025-03-11T14:15:24.480",
    "keywords": "execution,command"
  },
  "CVE-2025-22368": {
    "cvss": "-",
    "description": "The authenticated SCU firmware command of the firmware for Mennekes Smart / Premium Chargingpoints can be abused for command execution because OS commands are improperly neutralized when certain fields are passed to the underlying OS.",
    "published": "2025-03-11T14:15:24.627",
    "keywords": "execution,command"
  },
  "CVE-2025-27601": {
    "url": "https://github.com/umbraco/umbraco-cms/commit/ebb6a580dc1da2c772a99838dc7b4660bf77eb9c",
    "cvss": 4.3,
    "description": "Umbraco is a free and open source .NET content management system. An improper API access control issue has been identified Umbraco's API management package prior to versions 15.2.3 and 14.3.3, allowing low-privilege, authenticated users to create and update data type information that should be restricted to users with access to the settings section. The issue is patched in versions 15.2.3 and 14.3.3. No known workarounds are available.",
    "published": "2025-03-11T16:15:17.943"
  },
  "CVE-2025-24035": {
    "cvss": 8.1,
    "description": "Sensitive data storage in improperly locked memory in Windows Remote Desktop Services allows an unauthorized attacker to execute code over a network.",
    "published": "2025-03-11T17:16:25.373",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-24045": {
    "cvss": 8.1,
    "description": "Sensitive data storage in improperly locked memory in Windows Remote Desktop Services allows an unauthorized attacker to execute code over a network.",
    "published": "2025-03-11T17:16:26.290",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-24431": {
    "cvss": 5.5,
    "description": "Acrobat Reader versions 24.001.30225, 20.005.30748, 25.001.20428 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2025-03-11T18:15:30.277",
    "keywords": "sensitive,bypass"
  },
  "CVE-2025-24448": {
    "cvss": 5.5,
    "description": "Illustrator versions 29.2.1, 28.7.4 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2025-03-11T18:15:31.543",
    "keywords": "sensitive,bypass"
  },
  "CVE-2025-24449": {
    "cvss": 5.5,
    "description": "Illustrator versions 29.2.1, 28.7.4 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2025-03-11T18:15:31.700",
    "keywords": "sensitive,bypass"
  },
  "CVE-2025-27163": {
    "cvss": 5.5,
    "description": "Acrobat Reader versions 24.001.30225, 20.005.30748, 25.001.20428 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2025-03-11T18:15:34.293",
    "keywords": "sensitive,bypass"
  },
  "CVE-2025-27164": {
    "cvss": 5.5,
    "description": "Acrobat Reader versions 24.001.30225, 20.005.30748, 25.001.20428 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2025-03-11T18:15:34.437",
    "keywords": "sensitive,bypass"
  },
  "CVE-2025-0900": {
    "cvss": 3.3,
    "description": "PDF-XChange Editor PDF File Parsing Out-Of-Bounds Read Information Disclosure Vulnerability. This vulnerability allows remote attackers to disclose sensitive information on affected installations of PDF-XChange Editor. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of PDF files. The issue results from the lack of proper validation of user-supplied data, which can result in a read past the end of an allocated object. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-25368.",
    "published": "2025-03-11T21:15:41.887",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-27180": {
    "cvss": 5.5,
    "description": "Substance3D - Modeler versions 1.15.0 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2025-03-11T21:15:42.463",
    "keywords": "sensitive,bypass"
  },
  "CVE-2025-2012": {
    "cvss": 7.8,
    "description": "Ashlar-Vellum Cobalt VS File Parsing Out-Of-Bounds Read Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Ashlar-Vellum Cobalt. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of VS files. The issue results from the lack of proper validation of user-supplied data, which can result in a read past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-25185.",
    "published": "2025-03-11T21:15:52.333",
    "keywords": "remote,execution"
  },
  "CVE-2025-2013": {
    "cvss": 7.8,
    "description": "Ashlar-Vellum Cobalt CO File Parsing Use-After-Free Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Ashlar-Vellum Cobalt. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of CO files. The issue results from the lack of validating the existence of an object prior to performing operations on the object. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-25186.",
    "published": "2025-03-11T21:15:52.473",
    "keywords": "remote,execution"
  },
  "CVE-2025-2014": {
    "cvss": 7.8,
    "description": "Ashlar-Vellum Cobalt VS File Parsing Use of Uninitialized Variable Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Ashlar-Vellum Cobalt. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of VS files. The issue results from the lack of proper initialization of memory prior to accessing it. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-25235.",
    "published": "2025-03-11T21:15:52.613",
    "keywords": "remote,execution"
  },
  "CVE-2025-2015": {
    "cvss": 7.8,
    "description": "Ashlar-Vellum Cobalt VS File Parsing Type Confusion Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Ashlar-Vellum Cobalt. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of VS files. The issue results from the lack of proper validation of user-supplied data, which can result in a type confusion condition. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-25236.",
    "published": "2025-03-11T21:15:52.763",
    "keywords": "remote,execution"
  },
  "CVE-2025-2016": {
    "cvss": 7.8,
    "description": "Ashlar-Vellum Cobalt VC6 File Parsing Type Confusion Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Ashlar-Vellum Cobalt. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of VC6 files. The issue results from the lack of proper validation of user-supplied data, which can result in a type confusion condition. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-25238.",
    "published": "2025-03-11T21:15:52.903",
    "keywords": "remote,execution"
  },
  "CVE-2025-2017": {
    "cvss": 7.8,
    "description": "Ashlar-Vellum Cobalt CO File Parsing Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Ashlar-Vellum Cobalt. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of CO files. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-25240.",
    "published": "2025-03-11T21:15:53.050",
    "keywords": "remote,execution"
  },
  "CVE-2025-2018": {
    "cvss": 7.8,
    "description": "Ashlar-Vellum Cobalt VS File Parsing Type Confusion Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Ashlar-Vellum Cobalt. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of VS files. The issue results from the lack of proper validation of user-supplied data, which can result in a type confusion condition. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-25245.",
    "published": "2025-03-11T21:15:53.197",
    "keywords": "remote,execution"
  },
  "CVE-2025-2019": {
    "cvss": 7.8,
    "description": "Ashlar-Vellum Cobalt VC6 File Parsing Heap-based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Ashlar-Vellum Cobalt. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of VC6 files. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a heap-based buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-25252.",
    "published": "2025-03-11T21:15:53.337",
    "keywords": "remote,execution"
  },
  "CVE-2025-2020": {
    "cvss": 7.8,
    "description": "Ashlar-Vellum Cobalt VC6 File Parsing Out-Of-Bounds Write Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Ashlar-Vellum Cobalt. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of VC6 files. The issue results from the lack of proper validation of user-supplied data, which can result in a write past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-25254.",
    "published": "2025-03-11T21:15:53.477",
    "keywords": "remote,execution"
  },
  "CVE-2025-2021": {
    "cvss": 7.8,
    "description": "Ashlar-Vellum Cobalt XE File Parsing Integer Overflow Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Ashlar-Vellum Cobalt. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of XE files. The issue results from the lack of proper validation of user-supplied data, which can result in an integer overflow before writing to memory. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-25264.",
    "published": "2025-03-11T21:15:53.613",
    "keywords": "remote,execution"
  },
  "CVE-2025-2022": {
    "cvss": 7.8,
    "description": "Ashlar-Vellum Cobalt VS File Parsing Type Confusion Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Ashlar-Vellum Cobalt. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of VS files. The issue results from the lack of proper validation of user-supplied data, which can result in a type confusion condition. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-25276.",
    "published": "2025-03-11T21:15:53.750",
    "keywords": "remote,execution"
  },
  "CVE-2025-2023": {
    "cvss": 7.8,
    "description": "Ashlar-Vellum Cobalt LI File Parsing Integer Overflow Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Ashlar-Vellum Cobalt. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of LI files. The issue results from the lack of proper validation of user-supplied data, which can result in an integer overflow before allocating a buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-25348.",
    "published": "2025-03-11T21:15:53.890",
    "keywords": "remote,execution"
  },
  "CVE-2025-1707": {
    "cvss": 8.8,
    "description": "The Review Schema plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 2.2.4 via post meta. This makes it possible for authenticated attackers, with contributor-level and above permissions, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where php file type can be uploaded and included.",
    "published": "2025-03-11T22:15:12.583",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2025-2233": {
    "cvss": 8.8,
    "description": "Samsung SmartThings Improper Verification of Cryptographic Signature Authentication Bypass Vulnerability. This vulnerability allows network-adjacent attackers to bypass authentication on affected installations of Samsung SmartThings. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the Hub Local API service, which listens on TCP port 8766 by default. The issue results from the lack of proper verification of a cryptographic signature. An attacker can leverage this vulnerability to bypass authentication on the system. Was ZDI-CAN-25615.",
    "published": "2025-03-11T23:15:38.610",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-0813": {
    "cvss": 6.8,
    "description": "CWE-287: Improper Authentication vulnerability exists that could cause an Authentication Bypass when an\nunauthorized user without permission rights has physical access to the EPAS-UI computer and is able to\nreboot the workstation and interrupt the normal boot process.",
    "published": "2025-03-12T16:15:20.183",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-20115": {
    "cvss": 8.6,
    "description": "A vulnerability in confederation implementation for the Border Gateway Protocol (BGP)&nbsp;in Cisco IOS XR Software could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition.\r\n\r\nThis vulnerability is due to a memory corruption that occurs when a BGP update is created with an AS_CONFED_SEQUENCE attribute that has 255 autonomous system numbers (AS numbers). An attacker could exploit this vulnerability by sending a crafted BGP update message, or the network could be designed in such a manner that the AS_CONFED_SEQUENCE attribute grows to 255 AS numbers or more. A successful exploit could allow the attacker to cause memory corruption, which may cause the BGP process to restart, resulting in a DoS condition. To exploit this vulnerability, an attacker must control a BGP confederation speaker within the same autonomous system as the victim, or the network must be designed in such a manner that the AS_CONFED_SEQUENCE attribute grows to 255 AS numbers or more.",
    "published": "2025-03-12T16:15:21.090",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-20142": {
    "cvss": 8.6,
    "description": "A vulnerability in the IPv4 access control list (ACL) feature and quality of service (QoS) policy feature of Cisco IOS XR Software for Cisco ASR 9000 Series Aggregation Services Routers, ASR 9902 Compact High-Performance Routers, and ASR 9903 Compact High-Performance Routers could allow an unauthenticated, remote attacker to cause a line card to reset, resulting in a denial of service (DoS) condition.\r\n\r\nThis vulnerability is due to the incorrect handling of malformed IPv4 packets that are received on line cards where the interface has either an IPv4 ACL or QoS policy applied. An attacker could exploit this vulnerability by sending crafted IPv4 packets through an affected device. A successful exploit could allow the attacker to cause network processor errors, resulting in a reset or shutdown of the network process. Traffic over that line card would be lost while the line card reloads.\r\nNote: This vulnerability has predominantly been observed in Layer 2 VPN (L2VPN) environments where an IPv4 ACL or QoS policy has been applied to the bridge virtual interface. Layer 3 configurations where the interface has either an IPv4 ACL or QoS policy applied are also affected, though the vulnerability has not been observed.",
    "published": "2025-03-12T16:15:21.573",
    "keywords": "remote,unauthenticated,vpn"
  },
  "CVE-2025-20144": {
    "cvss": 4.0,
    "description": "A vulnerability in the hybrid access control list (ACL) processing of IPv4 packets in Cisco IOS XR Software could allow an unauthenticated, remote attacker to bypass a configured ACL.\r\n\r\nThis vulnerability is due to incorrect handling of packets when a specific configuration of the hybrid ACL exists. An attacker could exploit this vulnerability by attempting to send traffic through an affected device. A successful exploit could allow the attacker to bypass a configured ACL on the affected device.\r\nFor more information, see the  section of this advisory.\r\nCisco has released software updates that address this vulnerability. There are workarounds that address this vulnerability.",
    "published": "2025-03-12T16:15:21.890",
    "keywords": "remote,unauthenticated,bypass"
  },
  "CVE-2025-20145": {
    "cvss": 5.8,
    "description": "A vulnerability in the access control list (ACL) processing in the egress direction of Cisco IOS XR Software could allow an unauthenticated, remote attacker to bypass a configured ACL.\r\n\r\nThis vulnerability exists because certain packets are handled incorrectly when they are received on an ingress interface on one line card and destined out of an egress interface on another line card where the egress ACL is configured. An attacker could exploit this vulnerability by attempting to send traffic through an affected device. A successful exploit could allow the attacker to bypass an egress ACL on the affected device.\r\nFor more information about this vulnerability, see the  section of this advisory.\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.",
    "published": "2025-03-12T16:15:22.040",
    "keywords": "remote,unauthenticated,bypass"
  },
  "CVE-2025-20146": {
    "cvss": 8.6,
    "description": "A vulnerability in the Layer 3 multicast feature of Cisco IOS XR Software for Cisco ASR 9000 Series Aggregation Services Routers, ASR 9902 Compact High-Performance Routers, and ASR 9903 Compact High-Performance Routers could allow an unauthenticated, remote attacker to cause a line card to reset, resulting in a denial of service (DoS) condition.\r\n\r\nThis vulnerability is due to the incorrect handling of malformed IPv4 multicast packets that are received on line cards where the interface has either an IPv4 access control list (ACL) or a QoS policy applied. An attacker could exploit this vulnerability by sending crafted IPv4 multicast packets through an affected device. A successful exploit could allow the attacker to cause line card exceptions or a hard reset. Traffic over that line card would be lost while the line card reloads.",
    "published": "2025-03-12T16:15:22.197",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-20209": {
    "cvss": 7.5,
    "description": "A vulnerability in the Internet Key Exchange version 2 (IKEv2) function of Cisco IOS XR Software could allow an unauthenticated, remote attacker to prevent an affected device from processing any control plane UDP packets.&nbsp;\r\n\r\nThis vulnerability is due to improper handling of malformed IKEv2 packets. An attacker could exploit this vulnerability by sending malformed IKEv2 packets to an affected device. A successful exploit could allow the attacker to prevent the affected device from processing any control plane UDP packets, resulting in a denial of service (DoS) condition.\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.",
    "published": "2025-03-12T16:15:22.507",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-25565": {
    "cvss": "-",
    "description": "SoftEther VPN 5.02.5187 is vulnerable to Buffer Overflow in the Command.c file via the PtMakeCert and PtMakeCert2048 functions.",
    "published": "2025-03-12T16:15:22.660",
    "keywords": "command,vpn"
  },
  "CVE-2025-25566": {
    "cvss": 5.6,
    "description": "Memory Leak vulnerability in SoftEtherVPN 5.02.5187 allows an attacker to cause a denial of service via the UnixMemoryAlloc function.",
    "published": "2025-03-12T16:15:22.750",
    "keywords": "vpn,leak"
  },
  "CVE-2025-25568": {
    "cvss": "-",
    "description": "SoftEtherVPN 5.02.5187 is vulnerable to Use after Free in the Command.c file via the CheckNetworkAcceptThread function.",
    "published": "2025-03-12T16:15:22.930",
    "keywords": "command,vpn"
  },
  "CVE-2025-25774": {
    "url": "https://github.com/open5gs/open5gs/commit/2e68706f1eea029d5172ccad946e78b352c031d0",
    "cvss": 6.5,
    "description": "An issue was discovered in Open5GS v2.7.2. When a UE switches between two gNBs and sends a handover request at a specific time, it may cause an exception in the AMF's internal state machine, leading to an AMF crash and resulting in a Denial of Service (DoS).",
    "published": "2025-03-12T17:15:49.997"
  },
  "CVE-2025-0118": {
    "cvss": "-",
    "description": "A vulnerability in the Palo Alto Networks GlobalProtect app on Windows allows a remote attacker to run ActiveX controls within the context of an authenticated Windows user. This enables the attacker to run commands as if they are a legitimate authenticated user. However, to exploit this vulnerability, the authenticated user must navigate to a malicious page during the GlobalProtect SAML login process on a Windows device.\n\nThis issue does not apply to the GlobalProtect app on other (non-Windows) platforms.",
    "published": "2025-03-12T19:15:38.040",
    "keywords": "remote,command"
  },
  "CVE-2025-25975": {
    "url": "https://github.com/jonschlinkert/parse-git-config/issues/14",
    "cvss": "-",
    "description": "An issue in parse-git-config v.3.0.0 allows an attacker to obtain sensitive information via the expandKeys function",
    "published": "2025-03-12T19:15:40.147"
  },
  "CVE-2025-27407": {
    "cvss": 9.0,
    "description": "graphql-ruby is a Ruby implementation of GraphQL. Starting in version 1.11.5 and prior to versions 1.11.8, 1.12.25, 1.13.24, 2.0.32, 2.1.14, 2.2.17, and 2.3.21, loading a malicious schema definition in `GraphQL::Schema.from_introspection` (or `GraphQL::Schema::Loader.load`) can result in remote code execution. Any system which loads a schema by JSON from an untrusted source is vulnerable, including those that use GraphQL::Client to load external schemas via GraphQL introspection. Versions 1.11.8, 1.12.25, 1.13.24, 2.0.32, 2.1.14, 2.2.17, and 2.3.21 contain a patch for the issue.",
    "published": "2025-03-12T19:15:40.597",
    "keywords": "remote,execution"
  },
  "CVE-2025-25291": {
    "cvss": "-",
    "description": "ruby-saml provides security assertion markup language (SAML) single sign-on (SSO) for Ruby. An authentication bypass vulnerability was found in ruby-saml prior to versions 1.12.4 and 1.18.0 due to a parser differential. ReXML and Nokogiri parse XML differently; the parsers can generate entirely different document structures from the same XML input. That allows an attacker to be able to execute a Signature Wrapping attack. This issue may lead to authentication bypass. Versions 1.12.4 and 1.18.0 fix the issue.",
    "published": "2025-03-12T21:15:42.000",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-25292": {
    "cvss": "-",
    "description": "ruby-saml provides security assertion markup language (SAML) single sign-on (SSO) for Ruby. An authentication bypass vulnerability was found in ruby-saml prior to versions 1.12.4 and 1.18.0 due to a parser differential. ReXML and Nokogiri parse XML differently, the parsers can generate entirely different document structures from the same XML input. That allows an attacker to be able to execute a Signature Wrapping attack. This issue may lead to authentication bypass. Versions 1.12.4 and 1.18.0 contain a patch for the issue.",
    "published": "2025-03-12T21:15:42.177",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-25293": {
    "cvss": "-",
    "description": "ruby-saml provides security assertion markup language (SAML) single sign-on (SSO) for Ruby. Prior to versions 1.12.4 and 1.18.0, ruby-saml is susceptible to remote Denial of Service (DoS) with compressed SAML responses. ruby-saml uses zlib to decompress SAML responses in case they're compressed. It is possible to bypass the message size check with a compressed assertion since the message size is checked before inflation and not after. This issue may lead to remote Denial of Service (DoS). Versions 1.12.4 and 1.18.0 fix the issue.",
    "published": "2025-03-12T21:15:42.363",
    "keywords": "remote,bypass"
  },
  "CVE-2025-2106": {
    "cvss": 7.5,
    "description": "The ArielBrailovsky-ViralAd plugin for WordPress is vulnerable to SQL Injection via the 'text' and 'id' parameters of the limpia() function in all versions up to, and including, 1.0.8 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database. This only appears to be exploitable on very old versions of WordPress.",
    "published": "2025-03-13T02:15:13.097",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-2107": {
    "cvss": 7.5,
    "description": "The ArielBrailovsky-ViralAd plugin for WordPress is vulnerable to SQL Injection via the 'id' parameter of the printResultAndDie() function in all versions up to, and including, 1.0.8 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database. This only appears to be exploitable on very old versions of WordPress.",
    "published": "2025-03-13T02:15:13.250",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-1119": {
    "cvss": 7.3,
    "description": "The Appointment Booking Calendar — Simply Schedule Appointments Booking Plugin plugin for WordPress is vulnerable to arbitrary shortcode execution in all versions up to, and including, 1.6.8.5. This is due to the software allowing users to execute an action that does not properly validate a value before running do_shortcode. This makes it possible for unauthenticated attackers to execute arbitrary shortcodes.",
    "published": "2025-03-13T07:15:36.517",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2025-21104": {
    "cvss": 4.3,
    "description": "Dell NetWorker, 19.11.0.3 and below versions, contain(s) an Open Redirect Vulnerability in NMC. An unauthenticated attacker with remoter access could potentially exploit this vulnerability, leading to a targeted application user being redirected to arbitrary web URLs. The vulnerability could be leveraged by attackers to conduct phishing attacks that cause users to divulge sensitive information.",
    "published": "2025-03-13T12:15:12.510",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2025-29994": {
    "cvss": "-",
    "description": "This vulnerability exists in the CAP back office application due to improper authentication check at the API endpoint. An unauthenticated remote attacker with a valid login ID could exploit this vulnerability by manipulating API input parameters through API request URL/payload leading to unauthorized access to other user accounts.",
    "published": "2025-03-13T12:15:13.660",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2025-29996": {
    "cvss": "-",
    "description": "This vulnerability exists in the CAP back office application due to improper implementation of OTP verification mechanism in its API based login. A remote attacker with valid credentials could exploit this vulnerability by manipulating API request URL/payload. Successful exploitation of this vulnerability could allow the attacker to bypass Two-Factor Authentication (2FA) for other user accounts.",
    "published": "2025-03-13T12:15:13.980",
    "keywords": "remote,authentication,bypass"
  },
  "CVE-2025-1635": {
    "cvss": "-",
    "description": "Exposure of sensitive information in hub data source export feature in Devolutions Remote Desktop Manager 2024.3.29 and earlier on Windows allows a user exporting a hub data source to include his authenticated session in the export due to faulty business logic.",
    "published": "2025-03-13T13:15:46.820",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-1636": {
    "cvss": "-",
    "description": "Exposure of sensitive information in My Personal Credentials password history component in Devolutions Remote Desktop Manager 2024.3.29 and earlier on Windows allows an authenticated user to inadvertently leak the My Personal Credentials in a shared vault via the clear history feature due to faulty business logic.",
    "published": "2025-03-13T13:15:46.970",
    "keywords": "remote,sensitive,leak"
  },
  "CVE-2025-2277": {
    "cvss": "-",
    "description": "Exposure of password in web-based SSH authentication component in Devolutions Server 2024.3.13 and earlier allows a user to unadvertently leak his SSH password due to missing password masking.",
    "published": "2025-03-13T13:15:58.320",
    "keywords": "authentication,leak"
  },
  "CVE-2025-1767": {
    "url": "https://github.com/kubernetes/kubernetes/pull/130786",
    "cvss": 6.5,
    "description": "This CVE only affects Kubernetes clusters that utilize the in-tree gitRepo volume to clone git repositories from other pods within the same node. Since the in-tree gitRepo volume feature has been deprecated and will not receive security updates upstream, any cluster still using this feature remains vulnerable.",
    "published": "2025-03-13T17:15:36.437"
  },
  "CVE-2025-2080": {
    "cvss": "-",
    "description": "Optigo Networks Visual BACnet Capture Tool and Optigo Visual Networks Capture Tool version 3.1.2rc11 contain an exposed web management service that could allow an attacker to bypass authentication measures and gain controls over utilities within the products.",
    "published": "2025-03-13T17:15:38.253",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-2263": {
    "cvss": 9.8,
    "description": "During login to the web server in \"Sante PACS Server.exe\", OpenSSL function EVP_DecryptUpdate is called to decrypt the username and password. A fixed 0x80-byte stack-based buffer is passed to the function as the output buffer. A stack-based buffer overflow exists if a long encrypted username or password is supplied by an unauthenticated remote attacker.",
    "published": "2025-03-13T17:15:38.617",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-2264": {
    "cvss": 7.5,
    "description": "A Path Traversal Information Disclosure vulnerability exists in \"Sante PACS Server.exe\". An unauthenticated remote attacker can exploit it to download arbitrary files on the disk drive where the application is installed.",
    "published": "2025-03-13T17:15:38.787",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-27496": {
    "cvss": 3.3,
    "description": "Snowflake, a platform for using artificial intelligence in the context of cloud computing, has a vulnerability in the Snowflake JDBC driver (\"Driver\") in versions 3.0.13 through 3.23.0 of the driver. When the logging level was set to DEBUG, the Driver would log locally the client-side encryption master key of the target stage during the execution of GET/PUT commands. This key by itself does not grant access to any sensitive data without additional access authorizations,  and is not logged server-side by Snowflake. Snowflake fixed the issue in version 3.23.1.",
    "published": "2025-03-13T19:15:52.050",
    "keywords": "execution,command,sensitive"
  },
  "CVE-2025-2230": {
    "cvss": 7.7,
    "description": "A flaw exists in the Windows login flow where an AuthContext token can \nbe exploited for replay attacks and authentication bypass.",
    "published": "2025-03-13T19:15:52.750",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-2056": {
    "cvss": 7.5,
    "description": "The WP Ghost (Hide My WP Ghost) – Security & Firewall plugin for WordPress is vulnerable to Path Traversal in all versions up to, and including, 5.4.01 via the showFile function. This makes it possible for unauthenticated attackers to read the contents of specific file types on the server, which can contain sensitive information.",
    "published": "2025-03-14T05:15:42.523",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2025-2221": {
    "cvss": 7.5,
    "description": "The WPCOM Member plugin for WordPress is vulnerable to time-based SQL Injection via the ‘user_phone’ parameter in all versions up to, and including, 1.7.6 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2025-03-14T07:15:38.477",
    "keywords": "unauthenticated,sensitive"
  }
}