{
  "CVE-2024-4286": {
    "url": "https://github.com/mintplex-labs/anything-llm/commit/1b35bcbeab10b77e6dbd263cceecf1b965a40789",
    "cvss": 4.9,
    "description": "Mintplex-Labs' anything-llm application is vulnerable to improper neutralization of special elements used in an expression language statement, identified in the commit id `57984fa85c31988b2eff429adfc654c46e0c342a`. The vulnerability arises from the application's handling of user modifications by managers or admins, allowing for the modification of all existing attributes of the `user` database entity without proper checks or sanitization. This flaw can be exploited to delete user threads, denying users access to their previously submitted data, or to inject fake threads and/or chat history for social engineering attacks.",
    "published": "2024-05-26T23:15:21.600"
  },
  "CVE-2024-5399": {
    "cvss": 7.2,
    "description": "Openfind Mail2000 does not properly filter parameters of specific API. Remote attackers with administrative privileges can exploit this vulnerability to execute arbitrary system commands on the remote server.",
    "published": "2024-05-27T04:15:09.300",
    "keywords": "remote,command"
  },
  "CVE-2024-3933": {
    "url": "https://github.com/eclipse/omr/pull/7275",
    "cvss": 5.3,
    "description": "In Eclipse OpenJ9 release versions prior to 0.44.0 and after 0.13.0, when running with JVM option -Xgc:concurrentScavenge, the sequence generated for System.arrayCopy on the IBM Z platform with hardware and software support for guarded storage [1], could allow access to a buffer with an incorrect length value when executing an arraycopy sequence while the Concurrent Scavenge Garbage Collection cycle is active and the source and destination memory regions for arraycopy overlap. This allows read and write to addresses beyond the end of the array range.",
    "published": "2024-05-27T06:15:09.367"
  },
  "CVE-2024-5400": {
    "cvss": 8.8,
    "description": "Openfind Mail2000 does not properly filter parameters of specific CGI. Remote attackers with regular privileges can exploit this vulnerability to execute arbitrary system commands on the remote server.",
    "published": "2024-05-27T06:15:10.620",
    "keywords": "remote,command"
  },
  "CVE-2024-5403": {
    "cvss": 7.2,
    "description": "ASKEY 5G NR Small Cell fails to properly filter user input for certain functionality, allowing remote attackers with administrator privilege to execute arbitrary system commands on the remote server.",
    "published": "2024-05-27T07:15:09.530",
    "keywords": "remote,command"
  },
  "CVE-2024-5035": {
    "cvss": "-",
    "description": "The affected device expose a network service called \"rftest\" that is vulnerable to unauthenticated command injection on ports TCP/8888, TCP/8889, and TCP/8890. By successfully exploiting this flaw, remote unauthenticated attacker can gain arbitrary command execution on the device with elevated privileges.This issue affects Archer C4500X: through 1_1.1.6.",
    "published": "2024-05-27T08:15:09.490",
    "keywords": "remote,execution,unauthenticated,command"
  },
  "CVE-2024-35236": {
    "cvss": 4.8,
    "description": "Audiobookshelf is a self-hosted audiobook and podcast server. Prior to version 2.10.0, opening an ebook with malicious scripts inside leads to code execution inside the browsing context. Attacking a user with high privileges (upload, creation of libraries) can lead to remote code execution (RCE) in the worst case. This was tested on version 2.9.0 on Windows, but an arbitrary file write is powerful enough as is and should easily lead to RCE on Linux, too. Version 2.10.0 contains a patch for the vulnerability.",
    "published": "2024-05-27T17:15:09.990",
    "keywords": "remote,execution"
  },
  "CVE-2024-29415": {
    "url": "https://github.com/indutny/node-ip/pull/143",
    "cvss": "-",
    "description": "The ip package through 2.0.1 for Node.js might allow SSRF because some IP addresses (such as 127.1, 01200034567, 012.1.2.3, 000:0:0000::01, and ::fFFf:127.0.0.1) are improperly categorized as globally routable via isPublic. NOTE: this issue exists because of an incomplete fix for CVE-2023-42282.",
    "published": "2024-05-27T20:15:08.970"
  },
  "CVE-2024-28880": {
    "cvss": "-",
    "description": "Path traversal vulnerability in MosP kintai kanri V4.6.6 and earlier allows a remote attacker who can log in to the product to obtain sensitive information of the product.",
    "published": "2024-05-28T00:15:08.407",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-29078": {
    "cvss": "-",
    "description": "Incorrect permission assignment for critical resource issue exists in MosP kintai kanri V4.6.6 and earlier, which may allow a remote unauthenticated attacker with access to the product to alter the product settings.",
    "published": "2024-05-28T00:15:08.497",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-3969": {
    "cvss": 7.8,
    "description": "XML External Entity injection vulnerability found in OpenText™ iManager 3.2.6.0200. This could lead to remote code execution by parsing untrusted XML payload\n\n",
    "published": "2024-05-28T15:15:09.953",
    "keywords": "remote,execution"
  },
  "CVE-2024-22187": {
    "cvss": 9.1,
    "description": "A write-what-where vulnerability exists in the Programming Software Connection Remote Memory Diagnostics functionality of AutomationDirect P3-550E 1.2.10.9. A specially crafted network packet can lead to an arbitrary write. An attacker can send an unauthenticated packet to trigger this vulnerability.",
    "published": "2024-05-28T16:15:12.330",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-23315": {
    "cvss": 7.5,
    "description": "A read-what-where vulnerability exists in the Programming Software Connection IMM 01A1 Memory Read functionality of AutomationDirect P3-550E 1.2.10.9. A specially crafted network packet can lead to a disclosure of sensitive information. An attacker can send an unauthenticated packet to trigger this vulnerability.",
    "published": "2024-05-28T16:15:12.663",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-30164": {
    "cvss": "-",
    "description": "Amazon AWS Client VPN has a buffer overflow that could potentially allow a local actor to execute arbitrary commands with elevated permissions. This is resolved in 3.11.1 on Windows, 3.9.1 on macOS, and 3.12.1 on Linux. NOTE: although the macOS resolution is the same as for CVE-2024-30165, this vulnerability on macOS is not the same as CVE-2024-30165.",
    "published": "2024-05-28T17:15:10.160",
    "keywords": "command,vpn"
  },
  "CVE-2024-30165": {
    "cvss": "-",
    "description": "Amazon AWS Client VPN before 3.9.1 on macOS has a buffer overflow that could potentially allow a local actor to execute arbitrary commands with elevated permissions, a different vulnerability than CVE-2024-30164.",
    "published": "2024-05-28T17:15:10.237",
    "keywords": "command,vpn"
  },
  "CVE-2024-34852": {
    "cvss": "-",
    "description": "F-logic DataCube3 v1.0 is affected by command injection due to improper string filtering at the command execution point in the ./admin/transceiver_schedule.php file. An unauthenticated remote attacker can exploit this vulnerability by sending a file name containing command injection. Successful exploitation of this vulnerability may allow the attacker to execute system commands.",
    "published": "2024-05-28T17:15:10.303",
    "keywords": "remote,execution,unauthenticated,command"
  },
  "CVE-2024-24919": {
    "cvss": 7.5,
    "description": "Potentially allowing an attacker to read certain information on Check Point Security Gateways once connected to the internet and enabled with remote Access VPN or Mobile Access Software Blades. A Security fix that mitigates this vulnerability is available.",
    "published": "2024-05-28T19:15:10.060",
    "keywords": "remote,vpn"
  },
  "CVE-2024-33450": {
    "cvss": "-",
    "description": "SQL Injection in Finereport v.8.0 allows a remote attacker to obtain sensitive information",
    "published": "2024-05-28T19:15:10.530",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-36109": {
    "url": "https://github.com/sagemathinc/cocalc/commit/419862a9c9879c",
    "cvss": 7.6,
    "description": "CoCalc is web-based software that enables collaboration in research, teaching, and scientific publishing. In affected versions the markdown parser allows `<script>` tags to be included which execute when published. This issue has been addressed in commit `419862a9c9879c`. Users are advised to upgrade. There are no known workarounds for this vulnerability.",
    "published": "2024-05-28T19:15:10.910"
  },
  "CVE-2024-5433": {
    "cvss": "-",
    "description": "The Campbell Scientific CSI Web Server supports a command that will return the most recent file that matches a given expression. A specially crafted expression can lead to a path traversal vulnerability. This command combined with a specially crafted expression allows anonymous, unauthenticated access (allowed by default) by an attacker to files and directories outside of the webserver root directory they should be restricted to.",
    "published": "2024-05-28T19:15:11.500",
    "keywords": "unauthenticated,command"
  },
  "CVE-2024-5434": {
    "cvss": "-",
    "description": "The Campbell Scientific CSI Web Server stores web authentication credentials in a file with a specific file name. Passwords within that file are stored in a weakly encoded format. There is no known way to remotely access the file unless it has been manually renamed. However, if an attacker were to gain access to the file, passwords could be decoded and reused to gain access.",
    "published": "2024-05-28T19:15:11.623",
    "keywords": "remote,authentication"
  },
  "CVE-2024-35548": {
    "url": "https://github.com/baomidou/mybatis-plus/issues/6167",
    "cvss": "-",
    "description": "A SQL injection vulnerability in Mybatis plus versions below 3.5.6 allows remote attackers to obtain database information via a Boolean blind injection. NOTE: the vendor's position is that this can only occur in a misconfigured application; the documentation discusses how to develop applications that avoid SQL injection.",
    "published": "2024-05-28T21:16:31.680"
  },
  "CVE-2024-5150": {
    "cvss": 9.8,
    "description": "The Login with phone number plugin for WordPress is vulnerable to authentication bypass in versions up to, and including, 1.7.26. This is due to the 'activation_code' default value is empty, and the not empty check is missing in the 'lwp_ajax_register' function. This makes it possible for unauthenticated attackers to log in as any existing user on the site, such as an administrator, if they have access to the user email. The vulnerability is patched in version 1.7.26, but there is an issue in the patch that causes the entire function to not work, and this issue is fixed in version 1.7.27.",
    "published": "2024-05-29T02:16:32.303",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-5204": {
    "cvss": 8.8,
    "description": "The Swiss Toolkit For WP plugin for WordPress is vulnerable to authentication bypass in versions up to, and including, 1.0.7. This is due to the plugin storing custom data in post metadata without an underscore prefix. This makes it possible for authenticated attackers with contributor-level and above permissions to log in as any existing user on the site, such as an administrator.",
    "published": "2024-05-29T02:16:32.570",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-3412": {
    "cvss": 9.1,
    "description": "The WP STAGING WordPress Backup Plugin – Migration Backup Restore plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the wpstg_processing AJAX action in all versions up to, and including, 3.4.3. This makes it possible for authenticated attackers, with administrator-level access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-05-29T09:15:09.103",
    "keywords": "remote,execution"
  }
}