{
  "CVE-2024-1064": {
    "cvss": 7.5,
    "description": "A host header injection vulnerability in the HTTP handler component of Crafty Controller allows a remote, unauthenticated attacker to trigger a Denial of Service (DoS) condition via a modified host header",
    "published": "2024-02-03T09:15:11.250",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20003": {
    "cvss": "-",
    "description": "In Modem NL1, there is a possible system crash due to an improper input validation. This could lead to remote denial of service, if NW sent invalid NR RRC Connection Setup message, with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: MOLY01191612; Issue ID: MOLY01191612 (MSV-981).",
    "published": "2024-02-05T06:15:47.130",
    "keywords": "remote,execution"
  },
  "CVE-2024-20004": {
    "cvss": "-",
    "description": "In Modem NL1, there is a possible system crash due to an improper input validation. This could lead to remote denial of service, if NW sent invalid NR RRC Connection Setup message, with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: MOLY01191612; Issue ID: MOLY01195812 (MSV-985).",
    "published": "2024-02-05T06:15:47.190",
    "keywords": "remote,execution"
  },
  "CVE-2024-20007": {
    "cvss": "-",
    "description": "In mp3 decoder, there is a possible out of bounds write due to a race condition. This could lead to remote escalation of privilege with no additional execution privileges needed. User interaction is needed for exploitation. Patch ID: ALPS08441369; Issue ID: ALPS08441369.",
    "published": "2024-02-05T06:15:47.283",
    "keywords": "remote,execution"
  },
  "CVE-2024-20009": {
    "cvss": "-",
    "description": "In alac decoder, there is a possible out of bounds write due to an incorrect error handling. This could lead to remote escalation of privilege with no additional execution privileges needed. User interaction is needed for exploitation. Patch ID: ALPS08441150; Issue ID: ALPS08441150.",
    "published": "2024-02-05T06:15:47.330",
    "keywords": "remote,execution"
  },
  "CVE-2024-20011": {
    "cvss": "-",
    "description": "In alac decoder, there is a possible information disclosure due to an incorrect bounds check. This could lead to remote code execution with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: ALPS08441146; Issue ID: ALPS08441146.",
    "published": "2024-02-05T06:15:47.447",
    "keywords": "remote,execution"
  },
  "CVE-2024-20015": {
    "cvss": "-",
    "description": "In telephony, there is a possible escalation of privilege due to a permissions bypass. This could lead to local escalation of privilege with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: ALPS08441419; Issue ID: ALPS08441419.",
    "published": "2024-02-05T06:15:47.580",
    "keywords": "execution,bypass"
  },
  "CVE-2024-23054": {
    "cvss": "-",
    "description": "An issue in Plone Docker Official Image 5.2.13 (5221) open-source software that could allow for remote code execution due to a package listed in ++plone++static/components not existing in the public package index (npm).",
    "published": "2024-02-05T16:15:55.437",
    "keywords": "remote,execution"
  },
  "CVE-2024-0324": {
    "cvss": 8.2,
    "description": "The User Profile Builder – Beautiful User Registration Forms, User Profiles & User Role Editor plugin for WordPress is vulnerable to unauthorized modification of data due to a missing capability check on the 'wppb_two_factor_authentication_settings_update' function in all versions up to, and including, 3.10.8. This makes it possible for unauthenticated attackers to enable or disable the 2FA functionality present in the Premium version of the plugin for arbitrary user roles.",
    "published": "2024-02-05T22:15:59.980",
    "keywords": "unauthenticated,authentication"
  },
  "CVE-2024-0699": {
    "cvss": 6.6,
    "description": "The AI Engine: Chatbots, Generators, Assistants, GPT 4 and more! plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the 'add_image_from_url' function in all versions up to, and including, 2.1.4. This makes it possible for authenticated attackers, with Editor access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-02-05T22:16:04.210",
    "keywords": "remote,execution"
  },
  "CVE-2024-0701": {
    "cvss": 5.3,
    "description": "The UserPro plugin for WordPress is vulnerable to Security Feature Bypass in all versions up to, and including, 5.1.6. This is due to the use of client-side restrictions to enforce the 'Disabled registration' Membership feature within the plugin's General settings. This makes it possible for unauthenticated attackers to register an account even when account registration has been disabled by an administrator.",
    "published": "2024-02-05T22:16:04.380",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2024-0709": {
    "cvss": 9.8,
    "description": "The Cryptocurrency Widgets – Price Ticker & Coins List plugin for WordPress is vulnerable to SQL Injection via the 'coinslist' parameter in versions 2.0 to 2.6.5 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-02-05T22:16:04.553",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-0761": {
    "cvss": 8.1,
    "description": "The File Manager plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 7.2.1 due to insufficient randomness in the backup filenames, which use a timestamp plus 4 random digits. This makes it possible for unauthenticated attackers, to extract sensitive data including site backups in configurations where the .htaccess file in the directory does not block access.",
    "published": "2024-02-05T22:16:04.733",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-0969": {
    "cvss": 5.3,
    "description": "The ARMember plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 1.0.21 via the REST API. This makes it possible for unauthenticated attackers to bypass the plugin's \"Default Restriction\" feature and view restricted post content.",
    "published": "2024-02-05T22:16:06.767",
    "keywords": "unauthenticated,sensitive,bypass"
  },
  "CVE-2024-1075": {
    "cvss": 3.7,
    "description": "The Minimal Coming Soon – Coming Soon Page plugin for WordPress is vulnerable to maintenance mode bypass and information disclosure in all versions up to, and including, 2.37. This is due to the plugin improperly validating the request path. This makes it possible for unauthenticated attackers to bypass maintenance mode and view pages that should be hidden.",
    "published": "2024-02-05T22:16:07.283",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2024-1208": {
    "cvss": 5.3,
    "description": "The LearnDash LMS plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 4.10.2 via API. This makes it possible for unauthenticated attackers to obtain access to quiz questions.",
    "published": "2024-02-05T22:16:07.977",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-1209": {
    "cvss": 5.3,
    "description": "The LearnDash LMS plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 4.10.1 via direct file access due to insufficient protection of uploaded assignments. This makes it possible for unauthenticated attackers to obtain those uploads.",
    "published": "2024-02-05T22:16:08.143",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-1210": {
    "cvss": 5.3,
    "description": "The LearnDash LMS plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 4.10.1 via API. This makes it possible for unauthenticated attackers to obtain access to quizzes.",
    "published": "2024-02-05T22:16:08.310",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-23049": {
    "url": "https://github.com/88250/symphony/issues/82",
    "cvss": "-",
    "description": "An issue in symphony v.3.6.3 and before allows a remote attacker to execute arbitrary code via the log4j component.",
    "published": "2024-02-05T23:15:08.463"
  },
  "CVE-2024-24112": {
    "url": "https://github.com/exrick/xmall/issues/78",
    "cvss": "-",
    "description": "xmall v1.1 was discovered to contain a SQL injection vulnerability via the orderDir parameter.",
    "published": "2024-02-06T01:15:09.700"
  },
  "CVE-2024-24808": {
    "url": "https://github.com/pyload/pyload/commit/fe94451dcc2be90b3889e2fd9d07b483c8a6dccd",
    "cvss": 4.7,
    "description": "pyLoad is an open-source Download Manager written in pure Python. There is an open redirect vulnerability due to incorrect validation of input values when redirecting users after login. pyLoad is validating URLs via the `get_redirect_url` function when redirecting users at login. This vulnerability has been patched with commit fe94451.",
    "published": "2024-02-06T04:15:08.260"
  },
  "CVE-2024-23304": {
    "cvss": "-",
    "description": "Cybozu KUNAI for Android 3.0.20 to 3.0.21 allows a remote unauthenticated attacker to cause a denial-of-service (DoS) condition by performing certain operations.",
    "published": "2024-02-06T05:15:10.630",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-22433": {
    "cvss": 8.8,
    "description": "\nDell Data Protection Search 19.2.0 and above contain an exposed password opportunity in plain text when using LdapSettings.get_ldap_info in DP Search. A remote unauthorized unauthenticated attacker could potentially exploit this vulnerability leading to a loss of Confidentiality, Integrity, Protection, and remote takeover of the system. This is a high-severity vulnerability as it allows an attacker to take complete control of DP Search to affect downstream protected devices.\n\n",
    "published": "2024-02-06T07:15:11.337",
    "keywords": "remote,unauthenticated"
  }
}