{
  "CVE-2024-9522": {
    "cvss": 8.8,
    "description": "The WP Users Masquerade plugin for WordPress is vulnerable to authentication bypass in versions up to, and including, 2.0.0. This is due to incorrect authentication and capability checking in the 'ajax_masq_login' function. This makes it possible for authenticated attackers, with subscriber-level permissions and above, to log in as any existing user on the site, such as an administrator.",
    "published": "2024-10-10T02:15:06.013",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-9581": {
    "cvss": 7.3,
    "description": "The Shortcodes AnyWhere plugin for WordPress is vulnerable to arbitrary shortcode execution in all versions up to, and including, 1.0.1. This is due to the software allowing users to execute an action that does not properly validate a value before running do_shortcode. This makes it possible for unauthenticated attackers to execute arbitrary shortcodes.",
    "published": "2024-10-10T02:15:06.227",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-9156": {
    "cvss": 5.9,
    "description": "The TI WooCommerce Wishlist WordPress plugin through 2.8.2 is vulnerable to SQL Injection due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-10-10T06:15:11.290",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-6747": {
    "cvss": 5.3,
    "description": "Information leakage in mknotifyd in Checkmk before 2.3.0p18, 2.2.0p36, 2.1.0p49 and in 2.0.0p39 (EOL) allows attacker to get potentially sensitive data",
    "published": "2024-10-10T08:15:03.630",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-45148": {
    "cvss": 8.8,
    "description": "Adobe Commerce versions 2.4.7-p2, 2.4.6-p7, 2.4.5-p9, 2.4.4-p10 and earlier are affected by an Improper Authentication vulnerability that could result in a security feature bypass. A low-privileged attacker could leverage this vulnerability to gain unauthorized access without proper credentials. Exploitation of this issue does not require user interaction.",
    "published": "2024-10-10T10:15:07.963",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-9793": {
    "cvss": 6.3,
    "description": "A vulnerability classified as critical was found in Tenda AC1206 up to 15.03.06.23. This vulnerability affects the function ate_iwpriv_set/ate_ifconfig_set of the file /goform/ate. The manipulation leads to command injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-10-10T16:15:09.080",
    "keywords": "remote,command"
  },
  "CVE-2024-47084": {
    "cvss": "-",
    "description": "Gradio is an open-source Python package designed for quick prototyping. This vulnerability is related to **CORS origin validation**, where the Gradio server fails to validate the request origin when a cookie is present. This allows an attacker’s website to make unauthorized requests to a local Gradio server. Potentially, attackers can upload files, steal authentication tokens, and access user data if the victim visits a malicious website while logged into Gradio. This impacts users who have deployed Gradio locally and use basic authentication. Users are advised to upgrade to `gradio>4.44` to address this issue. As a workaround, users can manually enforce stricter CORS origin validation by modifying the `CustomCORSMiddleware` class in their local Gradio server code. Specifically, they can bypass the condition that skips CORS validation for requests containing cookies to prevent potential exploitation.",
    "published": "2024-10-10T22:15:10.263",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-47166": {
    "cvss": "-",
    "description": "Gradio is an open-source Python package designed for quick prototyping. This vulnerability involves a **one-level read path traversal** in the `/custom_component` endpoint. Attackers can exploit this flaw to access and leak source code from custom Gradio components by manipulating the file path in the request. Although the traversal is limited to a single directory level, it could expose proprietary or sensitive code that developers intended to keep private. This impacts users who have developed custom Gradio components and are hosting them on publicly accessible servers. Users are advised to upgrade to `gradio>=4.44` to address this issue. As a workaround, developers can sanitize the file paths and ensure that components are not stored in publicly accessible directories.",
    "published": "2024-10-10T22:15:10.833",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-9487": {
    "cvss": "-",
    "description": "An improper verification of cryptographic signature vulnerability was identified in GitHub Enterprise Server that allowed SAML SSO authentication to be bypassed resulting in unauthorized provisioning of users and access to the instance. Exploitation required the encrypted assertions feature to be enabled, and the attacker would require direct network access as well as a signed SAML response or metadata document. This vulnerability affected all versions of GitHub Enterprise Server prior to 3.15 and was fixed in versions 3.11.16, 3.12.10, 3.13.5, and 3.14.2. This vulnerability was reported via the GitHub Bug Bounty program.",
    "published": "2024-10-10T22:15:11.357",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-47868": {
    "cvss": "-",
    "description": "Gradio is an open-source Python package designed for quick prototyping. This is a **data validation vulnerability** affecting several Gradio components, which allows arbitrary file leaks through the post-processing step. Attackers can exploit these components by crafting requests that bypass expected input constraints. This issue could lead to sensitive files being exposed to unauthorized users, especially when combined with other vulnerabilities, such as issue TOB-GRADIO-15. The components most at risk are those that return or handle file data. Vulnerable Components: 1. **String to FileData:** DownloadButton, Audio, ImageEditor, Video, Model3D, File, UploadButton. 2. **Complex data to FileData:** Chatbot, MultimodalTextbox. 3. **Direct file read in preprocess:** Code. 4. **Dictionary converted to FileData:** ParamViewer, Dataset. Exploit Scenarios: 1. A developer creates a Dropdown list that passes values to a DownloadButton. An attacker bypasses the allowed inputs, sends an arbitrary file path (like `/etc/passwd`), and downloads sensitive files. 2. An attacker crafts a malicious payload in a ParamViewer component, leaking sensitive files from a server through the arbitrary file leak. This issue has been resolved in `gradio>5.0`. Upgrading to the latest version will mitigate this vulnerability. There are no known workarounds for this vulnerability.",
    "published": "2024-10-10T23:15:02.797",
    "keywords": "sensitive,bypass,leak"
  },
  "CVE-2024-47870": {
    "cvss": "-",
    "description": "Gradio is an open-source Python package designed for quick prototyping. This vulnerability involves a **race condition** in the `update_root_in_config` function, allowing an attacker to modify the `root` URL used by the Gradio frontend to communicate with the backend. By exploiting this flaw, an attacker can redirect user traffic to a malicious server. This could lead to the interception of sensitive data such as authentication credentials or uploaded files. This impacts all users who connect to a Gradio server, especially those exposed to the internet, where malicious actors could exploit this race condition. Users are advised to upgrade to `gradio>=5` to address this issue. There are no known workarounds for this issue.",
    "published": "2024-10-10T23:15:03.070",
    "keywords": "authentication,sensitive"
  },
  "CVE-2024-9822": {
    "cvss": 9.8,
    "description": "The Pedalo Connector plugin for WordPress is vulnerable to authentication bypass in versions up to, and including, 2.0.5. This is due to insufficient restriction on the 'login_admin_user' function. This makes it possible for unauthenticated attackers to log to the first user, who is usually the administrator, or if it does not exist, then to the first administrator.",
    "published": "2024-10-11T03:15:10.967",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-21534": {
    "cvss": 9.8,
    "description": "Versions of the package jsonpath-plus before 10.0.0 are vulnerable to Remote Code Execution (RCE) due to improper input sanitization. An attacker can execute aribitrary code on the system by exploiting the unsafe default usage of vm in Node.\r\r**Note:**\r\rThe unsafe behavior is still available after applying the fix but it is not turned on by default.",
    "published": "2024-10-11T13:15:15.667",
    "keywords": "remote,execution"
  },
  "CVE-2024-45317": {
    "cvss": "-",
    "description": "A Server-Side Request Forgery (SSRF) vulnerability in SMA1000 appliance firmware versions 12.4.3-02676 and earlier allows a remote, unauthenticated attacker to cause the SMA1000 server-side application to make requests to an unintended IP address.",
    "published": "2024-10-11T13:15:16.103",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-48987": {
    "cvss": 6.6,
    "description": "Snipe-IT before 7.0.10 allows remote code execution (associated with cookie serialization) when an attacker knows the APP_KEY. This is exacerbated by .env files, available from the product's repository, that have default APP_KEY values.",
    "published": "2024-10-11T13:15:16.197",
    "keywords": "remote,execution"
  },
  "CVE-2024-9611": {
    "cvss": 6.1,
    "description": "The Increase upload file size & Maximum Execution Time limit plugin for WordPress is vulnerable to Reflected Cross-Site Scripting due to the use of add_query_arg without appropriate escaping on the URL in all versions up to, and including, 2.0. This makes it possible for unauthenticated attackers to inject arbitrary web scripts in pages that execute if they can successfully trick a user into performing an action such as clicking on a link.",
    "published": "2024-10-11T13:15:20.487",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-9707": {
    "cvss": 9.8,
    "description": "The Hunk Companion plugin for WordPress is vulnerable to unauthorized plugin installation/activation due to a missing capability check on the /wp-json/hc/v1/themehunk-import REST API endpoint in all versions up to, and including, 1.8.4. This makes it possible for unauthenticated attackers to install and activate arbitrary plugins which can be leveraged to achieve remote code execution if another vulnerable plugin is installed and activated.",
    "published": "2024-10-11T13:15:21.233",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-25622": {
    "url": "https://github.com/h2o/h2o/commit/123f5e2b65dcdba8f7ef659a00d24bd1249141be",
    "cvss": 3.1,
    "description": "h2o is an HTTP server with support for HTTP/1.x, HTTP/2 and HTTP/3. The configuration directives provided by the headers handler allows users to modify the response headers being sent by h2o. The configuration file of h2o has scopes, and the inner scopes (e.g., path level) are expected to inherit the configuration defined in outer scopes (e.g., global level). However, if a header directive is used in the inner scope, all the definition in outer scopes are ignored. This can lead to headers not being modified as expected. Depending on the headers being added or removed unexpectedly, this behavior could lead to unexpected client behavior. This vulnerability is fixed in commit 123f5e2b65dcdba8f7ef659a00d24bd1249141be.",
    "published": "2024-10-11T15:15:03.947"
  },
  "CVE-2024-45396": {
    "url": "https://github.com/h2o/quicly/commit/2a95896104901589c495bc41460262e64ffcad5c",
    "cvss": 7.5,
    "description": "Quicly is an IETF QUIC protocol implementation. Quicly up to commtit d720707 is susceptible to a denial-of-service attack. A remote attacker can exploit these bugs to trigger an assertion failure that crashes process using quicly. The vulnerability is addressed with commit 2a95896104901589c495bc41460262e64ffcad5c.",
    "published": "2024-10-11T15:15:04.457"
  },
  "CVE-2024-45397": {
    "url": "https://github.com/h2o/h2o/commit/15ed15a2efb83a77bb4baaa5a119e639c2f6898a",
    "cvss": 5.9,
    "description": "h2o is an HTTP server with support for HTTP/1.x, HTTP/2 and HTTP/3. When an HTTP request using TLS/1.3 early data on top of TCP Fast Open or QUIC 0-RTT packets is received and the IP-address-based access control is used, the access control does not detect and prohibit HTTP requests conveyed by packets with a spoofed source address. This behavior allows attackers on the network to execute HTTP requests from addresses that are otherwise rejected by the address-based access control. The vulnerability has been addressed in commit 15ed15a. Users may disable the use of TCP FastOpen and QUIC to mitigate the issue.",
    "published": "2024-10-11T15:15:04.690"
  },
  "CVE-2024-45402": {
    "url": "https://github.com/h2o/picotls/commit/9b88159ce763d680e4a13b6e8f3171ae923a535d",
    "cvss": 8.6,
    "description": "Picotls is a TLS protocol library that allows users select different crypto backends based on their use case. When parsing a spoofed TLS handshake message, picotls (specifically, bindings within picotls that call the crypto libraries) may attempt to free the same memory twice. This double free occurs during the disposal of multiple objects without any intervening calls to malloc Typically, this triggers the malloc implementation to detect the error and abort the process. However, depending on the internals of malloc and the crypto backend being used, the flaw could potentially lead to a use-after-free scenario, which might allow for arbitrary code execution. The vulnerability is addressed with commit 9b88159ce763d680e4a13b6e8f3171ae923a535d.",
    "published": "2024-10-11T15:15:04.903"
  },
  "CVE-2024-45403": {
    "url": "https://github.com/h2o/h2o/commit/1ed32b23f999acf0c5029f09c8525f93eb1d354c",
    "cvss": 3.7,
    "description": "h2o is an HTTP server with support for HTTP/1.x, HTTP/2 and HTTP/3. When h2o is configured as a reverse proxy and HTTP/3 requests are cancelled by the client, h2o might crash due to an assertion failure. The crash can be exploited by an attacker to mount a Denial-of-Service attack. By default, the h2o standalone server automatically restarts, minimizing the impact. However, HTTP requests that were served concurrently will still be disrupted. The vulnerability has been addressed in commit 1ed32b2. Users may disable the use of HTTP/3 to mitigate the issue.",
    "published": "2024-10-11T15:15:05.123"
  },
  "CVE-2024-47074": {
    "url": "https://github.com/dataease/dataease/commit/86eafc4d77f0bbc0eaa7fc58e5076a085257f259",
    "cvss": "-",
    "description": "DataEase is an open source data visualization analysis tool. In Dataease, the PostgreSQL data source in the data source function can customize the JDBC connection parameters and the PG server target to be connected. In backend/src/main/java/io/dataease/provider/datasource/JdbcProvider.java, PgConfiguration class don't filter any parameters, directly concat user input. So, if the attacker adds some parameters in JDBC url, and connect to evil PG server, the attacker can trigger the PG jdbc deserialization vulnerability, and eventually the attacker can execute through the deserialization vulnerability system commands and obtain server privileges. The vulnerability has been fixed in v1.18.25.",
    "published": "2024-10-11T15:15:05.353"
  },
  "CVE-2024-39527": {
    "cvss": 5.5,
    "description": "An Exposure of Sensitive Information to an Unauthorized Actor vulnerability in the command-line interface (CLI) of Juniper Networks Junos OS on SRX Series devices allows a local, low-privileged user with access to the Junos CLI to view the contents of protected files on the file system.\n\nThrough the execution of crafted CLI commands, a user with limited permissions (e.g., a low privilege login class user) can access protected files that should not be accessible to the user. These files may contain sensitive information that can be used to cause further impact to the system.\n\nThis issue affects Junos OS on SRX Series: \n\n\n\n  *  All versions before 21.4R3-S8, \n  *  22.2 before 22.2R3-S5, \n  *  22.3 before 22.3R3-S4, \n  *  22.4 before 22.4R3-S4, \n  *  23.2 before 23.2R2-S2, \n  *  23.4 before 23.4R2.",
    "published": "2024-10-11T16:15:06.707",
    "keywords": "execution,command,sensitive"
  },
  "CVE-2024-39534": {
    "cvss": 5.4,
    "description": "An Incorrect Comparison vulnerability in the local address verification API of Juniper Networks Junos OS Evolved allows an unauthenticated network-adjacent attacker to create sessions or send traffic to the device using the network and broadcast address of the subnet assigned to an interface. This is unintended and unexpected behavior and can allow an attacker to bypass certain compensating controls, such as stateless firewall filters.\n\nThis issue affects Junos OS Evolved: \n\n\n\n  *  All versions before 21.4R3-S8-EVO, \n  *  22.2-EVO before 22.2R3-S4-EVO, \n  *  22.3-EVO before 22.3R3-S4-EVO, \n  *  22.4-EVO before 22.4R3-S3-EVO, \n  *  23.2-EVO before 23.2R2-S1-EVO, \n  *  23.4-EVO before 23.4R1-S2-EVO, 23.4R2-EVO.",
    "published": "2024-10-11T16:15:06.970",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2024-39544": {
    "cvss": 5.0,
    "description": "An Incorrect Default Permissions vulnerability in the command line interface (CLI) of Juniper Networks Junos OS Evolved allows a low privileged local attacker to view NETCONF traceoptions files, representing an exposure of sensitive information.\n\n\n\nOn all Junos OS Evolved platforms, when NETCONF traceoptions are configured, NETCONF traceoptions files get created with an incorrect group permission, which allows \n\na low-privileged user can access sensitive information compromising the confidentiality of the system.\n\n\n\nJunos OS Evolved: \n\n\n\n\n  *  All versions before 20.4R3-S9-EVO, \n  *  21.2-EVO before 21.2R3-S7-EVO, \n  *  21.4-EVO before 21.4R3-S5-EVO, \n  *  22.1-EVO before 22.1R3-S5-EVO, \n  *  22.2-EVO before 22.2R3-S3-EVO, \n  *  22.3-EVO before 22.3R3-EVO, 22.3R3-S2-EVO, \n  *  22.4-EVO before 22.4R3-EVO, \n  *  23.2-EVO before 23.2R1-S2-EVO, 23.2R2-EVO.",
    "published": "2024-10-11T16:15:07.240",
    "keywords": "command,sensitive"
  },
  "CVE-2024-39563": {
    "cvss": 7.3,
    "description": "A Command Injection vulnerability in Juniper Networks Junos Space allows an unauthenticated, network-based attacker sending a specially crafted request to execute arbitrary shell commands on the Junos Space Appliance, leading to remote command execution by the web application, gaining complete control of the device.\n\nA specific script in the Junos Space web application allows attacker-controlled input from a GET request without sufficient input sanitization. A specially crafted request can exploit this vulnerability to execute arbitrary shell commands on the Junos Space Appliance.\n\nThis issue affects Junos Space 24.1R1. Previous versions of Junos Space are unaffected by this vulnerability.",
    "published": "2024-10-11T16:15:07.740",
    "keywords": "remote,execution,unauthenticated,command"
  },
  "CVE-2024-42640": {
    "cvss": "-",
    "description": "angular-base64-upload prior to v0.1.21 is vulnerable to unauthenticated remote code execution via demo/server.php. Exploiting this vulnerability allows an attacker to upload arbitrary content to the server, which can subsequently be accessed through demo/uploads. This leads to the execution of previously uploaded content and enables the attacker to achieve code execution on the server. NOTE: This vulnerability only affects products that are no longer supported by the maintainer.",
    "published": "2024-10-11T16:15:08.040",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-47489": {
    "cvss": 5.8,
    "description": "An Improper Handling of Exceptional Conditions vulnerability in the Packet Forwarding Engine (pfe) of the Juniper Networks Junos OS Evolved on ACX Series devices allows an unauthenticated, network based attacker sending specific transit protocol traffic to cause a partial Denial of Service (DoS) to downstream devices.\n\nReceipt of specific transit protocol packets is incorrectly processed by the Routing Engine (RE), filling up the DDoS protection queue which is shared between routing protocols. This influx of transit protocol packets causes DDoS protection violations, resulting in protocol flaps which can affect connectivity to networking devices.\n\nThis issue affects both IPv4 and IPv6. This issue does not require any specific routing protocol to be configured or enabled.\n\nThe following commands can be used to monitor the DDoS protection queue:\n\n       labuser@re0> show evo-pfemand host pkt-stats\n\n    labuser@re0> show host-path ddos all-policers\n\nThis issue affects Junos OS Evolved: \n\n\n\n  *  All versions before 21.4R3-S8-EVO, \n  *  from 22.2 before 22.2R3-S4-EVO, \n  *  from 22.3 before 22.3R3-S4-EVO, \n  *  from 22.4 before 22.4R3-S3-EVO, \n  *  from 23.2 before 23.2R2-EVO, \n  *  from 23.4 before 23.4R1-S1-EVO, 23.4R2-EVO, \n  *  from 24.2 before 24.2R2-EVO.",
    "published": "2024-10-11T16:15:08.533",
    "keywords": "unauthenticated,command"
  },
  "CVE-2024-47493": {
    "cvss": 6.5,
    "description": "A Missing Release of Memory after Effective Lifetime vulnerability in the Packet Forwarding Engine (PFE) of the Juniper Networks Junos OS on the SRX5K, SRX4600 and MX Series platforms with Trio-based FPCs allows an unauthenticated, adjacent attacker to cause a Denial of Service (DoS).\n\nIn case of channelized Modular Interface Cards (MICs), every physical interface flap operation will leak heap memory. Over a period of time, continuous physical interface flap operations causes local FPC  to eventually run out of memory and crash.  \n\nBelow CLI command can be used to check the memory usage over a period of time:\n\n  user@host> show chassis fpc\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                Temp  CPU Utilization (%)   CPU Utilization (%)  Memory   \nUtilization (%)\n  Slot State      (C)  Total  Interrupt      1min   5min  \n15min DRAM (MB) Heap     Buffer\n\n  0 \nOnline       43     41         \n2                           2048       49         14\n\n  1 \nOnline       43     41         \n2                          \n2048       49         14\n\n  2 \nOnline       43     41         \n2                          \n2048       49         14\n\n\n\n\n\n\n\n\n\nThis issue affects Junos OS on SRX5K, SRX4600 and MX Series: \n\n\n\n\n  *  All versions before 21.2R3-S7, \n  *  from 21.4 before 21.4R3-S6, \n  *  from 22.1 before 22.1R3-S5, \n  *  from 22.2 before 22.2R3-S3, \n  *  from 22.3 before 22.3R3-S2, \n  *  from 22.4 before 22.4R3, \n  *  from 23.2 before 23.2R2, \n  *  from 23.4 before 23.4R2.",
    "published": "2024-10-11T16:15:09.320",
    "keywords": "unauthenticated,command,leak"
  },
  "CVE-2024-47496": {
    "cvss": 5.5,
    "description": "A NULL Pointer Dereference vulnerability in the Packet Forwarding Engine (pfe) of Juniper Networks Junos OS allows a local, low-privileged attacker to cause a Denial-of-Service (DoS).\n\nWhen a specific command is executed, the pfe crashes. This will cause traffic forwarding to be interrupted until the system self-recovers. Repeated execution will create a sustained DoS condition.\n\n This issue only affects MX Series devices with Line cards MPC1-MPC9.\nThis issue affects:\nJunos OS on MX Series: \n\n\n  *  All versions before 21.4R3-S9, \n  *  from 22.2 before 22.2R3-S5, \n  *  from 22.3 before 22.3R3-S4, \n  *  from 22.4 before 22.4R3-S2, \n  *  from 23.2 before 23.2R2-S1, \n  *  from 23.4 before 23.4R2.",
    "published": "2024-10-11T16:15:10.080",
    "keywords": "execution,command"
  },
  "CVE-2024-47497": {
    "cvss": 7.5,
    "description": "An Uncontrolled Resource Consumption vulnerability in the http daemon (httpd) of Juniper Networks Junos OS on SRX Series, QFX Series, MX Series and EX Series allows an unauthenticated, network-based attacker to cause Denial-of-Service (DoS).\n\nAn attacker can send specific HTTPS connection requests to the device, triggering the creation of processes that are not properly terminated. Over time, this leads to resource exhaustion, ultimately causing the device to crash and restart.\n\nThe following command can be used to monitor the resource usage:\nuser@host> show system processes extensive | match mgd | count\n\nThis issue affects Junos OS on SRX Series and EX Series:\nAll versions before 21.4R3-S7,\nfrom 22.2 before 22.2R3-S4,\nfrom 22.3 before 22.3R3-S3,\nfrom 22.4 before 22.4R3-S2,\nfrom 23.2 before 23.2R2-S1,\nfrom 23.4 before 23.4R1-S2, 23.4R2.",
    "published": "2024-10-11T16:15:10.340",
    "keywords": "unauthenticated,command"
  },
  "CVE-2024-47501": {
    "cvss": 5.5,
    "description": "A NULL Pointer Dereference vulnerability in the \n\npacket forwarding engine (pfe) of Juniper Networks Junos OS on MX304, MX with MPC10/11/LC9600, and EX9200 with EX9200-15C allows a locally authenticated attacker with low privileges to cause a Denial of Service (DoS).\n\nIn a VPLS or Junos Fusion scenario, the execution of specific show commands will cause all FPCs hosting VPLS sessions or connecting to satellites to crash and restart.\n\nThis issue affects Junos on MX304, MX with MPC10/11/LC9600 and EX9200 with EX9200-15C: \n\n\n\n  *  All version before 21.2R3-S1,\n  *  21.3 versions before 21.3R3, \n  *  21.4 versions before 21.4R2.",
    "published": "2024-10-11T16:15:11.167",
    "keywords": "execution,command"
  },
  "CVE-2024-47505": {
    "cvss": 6.5,
    "description": "An Allocation of Resources Without Limits or Throttling vulnerability in the PFE management daemon (evo-pfemand) of Juniper Networks Junos OS Evolved allows an authenticated, network-based attacker to cause an FPC crash leading to a Denial of Service (DoS).When specific SNMP GET operations or specific low-priviledged CLI commands are executed, a GUID resource leak will occur, eventually leading to exhaustion and resulting in FPCs to hang. Affected FPCs need to be manually restarted to recover.\n\nGUID exhaustion will trigger a syslog message like one of the following:\n\nevo-pfemand[<pid>]: get_next_guid: Ran out of Guid Space ...\nevo-aftmand-zx[<pid>]: get_next_guid: Ran out of Guid Space ...\nThe leak can be monitored by running the following command and taking note of the values in the rightmost column labeled Guids:\n\n\n\n\n\nuser@host> show platform application-info allocations app evo-pfemand/evo-pfemand\n\n\n\nIn case one or more of these values are constantly increasing the leak is happening.\n\nThis issue affects Junos OS Evolved:\n\n\n\n  *  All versions before 21.4R3-S7-EVO,\n  *  22.1 versions before 22.1R3-S6-EVO,\n  *  22.2 versions before 22.2R3-EVO, \n\n  *  22.3 versions before 22.3R3-EVO,\n  *  22.4 versions before 22.4R2-EVO.\n\n\n\nPlease note that this issue is similar to, but different from CVE-2024-47508 and CVE-2024-47509.",
    "published": "2024-10-11T16:15:12.210",
    "keywords": "command,leak"
  },
  "CVE-2024-47508": {
    "cvss": 6.5,
    "description": "An Allocation of Resources Without Limits or Throttling vulnerability in the PFE management daemon (evo-pfemand) of Juniper Networks Junos OS Evolved allows an authenticated, network-based attacker to cause an FPC crash leading to a Denial of Service (DoS).When specific SNMP GET operations or specific low-priviledged CLI commands are executed, a GUID resource leak will occur, eventually leading to exhaustion and resulting in FPCs to hang. Affected FPCs need to be manually restarted to recover.\n\nGUID exhaustion will trigger a syslog message like one of the following:\n\nevo-pfemand[<pid>]: get_next_guid: Ran out of Guid Space ...\nevo-aftmand-zx[<pid>]: get_next_guid: Ran out of Guid Space ...\nThe leak can be monitored by running the following command and taking note of the values in the rightmost column labeled Guids:\n\n\n\n\n\nuser@host> show platform application-info allocations app evo-pfemand/evo-pfemand\n\n\n\nIn case one or more of these values are constantly increasing the leak is happening.\n\nThis issue affects Junos OS Evolved:\n\n\n\n  *  All versions before 21.2R3-S8-EVO,\n  *  21.3 versions before 21.3R3-EVO;\n  *  21.4 versions before 22.1R2-EVO,\n\n  *  22.1 versions before 22.1R1-S1-EVO, 22.1R2-EVO.\n\n\n\n\n\nPlease note that this issue is similar to, but different from CVE-2024-47505 and CVE-2024-47509.",
    "published": "2024-10-11T16:15:12.957",
    "keywords": "command,leak"
  },
  "CVE-2024-47509": {
    "cvss": 6.5,
    "description": "An Allocation of Resources Without Limits or Throttling vulnerability in the PFE management daemon (evo-pfemand) of Juniper Networks Junos OS Evolved allows an authenticated, network-based attacker to cause an FPC crash leading to a Denial of Service (DoS).When specific SNMP GET operations or specific low-priviledged CLI commands are executed, a GUID resource leak will occur, eventually leading to exhaustion and resulting in FPCs to hang. Affected FPCs need to be manually restarted to recover.\n\nGUID exhaustion will trigger a syslog message like one of the following:\n\nevo-pfemand[<pid>]: get_next_guid: Ran out of Guid Space ...\nevo-aftmand-zx[<pid>]: get_next_guid: Ran out of Guid Space ...\nThe leak can be monitored by running the following command and taking note of the values in the rightmost column labeled Guids:\n\n\n\n\n\nuser@host> show platform application-info allocations app evo-pfemand/evo-pfemand\n\n\n\nIn case one or more of these values are constantly increasing the leak is happening.\n\nThis issue affects Junos OS Evolved:\n\n\n\n  *  All versions before 21.4R2-EVO,\n  *  22.1 versions before 22.1R2-EVO.\n\n\n\n\n\nPlease note that this issue is similar to, but different from CVE-2024-47505 and CVE-2024-47508.",
    "published": "2024-10-11T16:15:13.187",
    "keywords": "command,leak"
  },
  "CVE-2024-6985": {
    "url": "https://github.com/parisneo/lollms/commit/28ee567a9a120967215ff19b96ab7515ce469620",
    "cvss": 4.4,
    "description": "A path traversal vulnerability exists in the api open_personality_folder endpoint of parisneo/lollms-webui. This vulnerability allows an attacker to read any folder in the personality_folder on the victim's computer, even though sanitize_path is set. The issue arises due to improper sanitization of the personality_folder parameter, which can be exploited to traverse directories and access arbitrary files.",
    "published": "2024-10-11T16:15:14.657"
  },
  "CVE-2024-44807": {
    "cvss": "-",
    "description": "A directory listing issue in the baserCMS plugin in D-ZERO CO., LTD. BurgerEditor and BurgerEditor Limited Edition before 2.25.1 allows remote attackers to obtain sensitive information by exposing a list of the uploaded files.",
    "published": "2024-10-11T18:15:08.133",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-48768": {
    "cvss": "-",
    "description": "An issue in almaodo GmbH appinventor.ai_google.almando_control 2.3.1 allows a remote attacker to obtain sensitive information via the firmware update process",
    "published": "2024-10-11T20:15:05.253",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-48770": {
    "cvss": "-",
    "description": "An issue in Plug n Play Camera com.wisdomcity.zwave 1.1.0 allows a remote attacker to obtain sensitive information via the firmware update process.",
    "published": "2024-10-11T20:15:05.450",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-48771": {
    "cvss": "-",
    "description": "An issue in almando GmbH Almando Play APP (com.almando.play) 1.8.2 allows a remote attacker to obtain sensitive information via the firmware update process",
    "published": "2024-10-11T20:15:05.537",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-48773": {
    "cvss": "-",
    "description": "An issue in WoFit v.7.2.3 allows a remote attacker to obtain sensitive information via the firmware update process",
    "published": "2024-10-11T20:15:05.637",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-48775": {
    "cvss": "-",
    "description": "An issue in Plug n Play Camera com.ezset.delaney 1.2.0 allows a remote attacker to obtain sensitive information via the firmware update process.",
    "published": "2024-10-11T20:15:05.810",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-48776": {
    "cvss": "-",
    "description": "An issue in Shelly com.home.shelly 1.0.4 allows a remote attacker to obtain sensitive information via the firmware update process",
    "published": "2024-10-11T20:15:05.903",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-48777": {
    "cvss": "-",
    "description": "LEDVANCE com.ledvance.smartplus.eu 2.1.10 allows a remote attacker to obtain sensitive information via the firmware update process.",
    "published": "2024-10-11T20:15:05.997",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-48778": {
    "cvss": "-",
    "description": "An issue in GIANT MANUFACTURING CO., LTD RideLink (tw.giant.ridelink) 2.0.7 allows a remote attacker to obtain sensitive information via the firmware update process.",
    "published": "2024-10-11T20:15:06.090",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-48784": {
    "cvss": "-",
    "description": "An Incorrect Access Control issue in SAMPMAX com.sampmax.homemax 2.1.2.7 allows a remote attacker to obtain sensitive information via the firmware update process.",
    "published": "2024-10-11T20:15:06.180",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-48786": {
    "cvss": "-",
    "description": "An issue in SWITCHBOT INC SwitchBot (com.theswitchbot.switchbot) 5.0.4 allows a remote attacker to obtain sensitive information via the firmware update process.",
    "published": "2024-10-11T20:15:06.277",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-48787": {
    "cvss": "-",
    "description": "An issue in Revic Optics Revic Ops (us.revic.revicops) 1.12.5 allows a remote attacker to obtain sensitive information via the firmware update process.",
    "published": "2024-10-11T20:15:06.407",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-46468": {
    "url": "https://github.com/jpressprojects/jpress/issues/190",
    "cvss": "-",
    "description": "A Server-Side Request Forgery (SSRF) vulnerability exists in the jpress <= v5.1.1, which can be exploited by an attacker to obtain sensitive information, resulting in an information disclosure.",
    "published": "2024-10-11T21:15:07.040"
  },
  "CVE-2024-48772": {
    "cvss": "-",
    "description": "An issue in C-CHIP (com.cchip.cchipamaota) v.1.2.8 allows a remote attacker to obtain sensitive information via the firmware update process.",
    "published": "2024-10-11T21:15:07.127",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-48788": {
    "cvss": "-",
    "description": "An issue in YESCAM (com.yescom.YesCam.zwave) 1.0.2 allows a remote attacker to obtain sensitive information via the firmware update process.",
    "published": "2024-10-11T21:15:07.220",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-35517": {
    "cvss": 8.4,
    "description": "Netgear XR1000 v1.0.0.64 is vulnerable to command injection in usb_remote_smb_conf.cgi via the share_name parameter.",
    "published": "2024-10-11T22:15:03.930",
    "keywords": "remote,command"
  }
}