{
  "CVE-2024-0616": {
    "cvss": 5.3,
    "description": "The Passster – Password Protect Pages and Content plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 4.2.6.2 via API. This makes it possible for unauthenticated attackers to obtain post titles, slugs, IDs, content and other metadata including passwords of password-protected posts and pages.",
    "published": "2024-02-29T01:43:23.320",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-0620": {
    "cvss": 5.3,
    "description": "The PPWP – Password Protect Pages plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 1.8.9 via API. This makes it possible for unauthenticated attackers to obtain post titles, IDs, slugs as well as other information including for password-protected posts.",
    "published": "2024-02-29T01:43:23.493",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-0978": {
    "cvss": 5.3,
    "description": "The My Private Site plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 3.0.14 via the REST API. This makes it possible for unauthenticated attackers to bypass the plugin's site privacy feature and view restricted page and post content.",
    "published": "2024-02-29T01:43:33.917",
    "keywords": "unauthenticated,sensitive,bypass"
  },
  "CVE-2024-1294": {
    "cvss": 5.3,
    "description": "The Sunshine Photo Cart: Free Client Galleries for Photographers plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 3.0.24 via the 'invoice'. This makes it possible for unauthenticated attackers to extract sensitive data including customer email and physical addresses.",
    "published": "2024-02-29T01:43:47.133",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-1472": {
    "cvss": 5.3,
    "description": "The WP Maintenance plugin for WordPress is vulnerable to Information Exposure in all versions up to, and including, 6.1.6 via the REST API. This makes it possible for unauthenticated attackers to bypass the plugin's maintenance mode obtain post and page content via REST API.",
    "published": "2024-02-29T01:43:51.553",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2024-1475": {
    "cvss": 5.3,
    "description": "The Coming Soon Maintenance Mode plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 1.0.5 via the REST API. This makes it possible for unauthenticated attackers to obtain post and page content thus bypassing the protection provided by the plugin.",
    "published": "2024-02-29T01:43:51.730",
    "keywords": "unauthenticated,sensitive,bypass"
  },
  "CVE-2024-1722": {
    "cvss": 3.7,
    "description": "A flaw was found in Keycloak. In certain conditions, this issue may allow a remote unauthenticated attacker to block other accounts from logging in.",
    "published": "2024-02-29T01:43:54.010",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20267": {
    "cvss": 8.6,
    "description": "A vulnerability with the handling of MPLS traffic for Cisco NX-OS Software could allow an unauthenticated, remote attacker to cause the netstack process to unexpectedly restart, which could cause the device to stop processing network traffic or to reload. \r\n\r This vulnerability is due to lack of proper error checking when processing an ingress MPLS frame. An attacker could exploit this vulnerability by sending a crafted IPv6 packet that is encapsulated within an MPLS frame to an MPLS-enabled interface of the targeted device. A successful exploit could allow the attacker to cause a denial of service (DoS) condition.\r\n\r Note: The IPv6 packet can be generated multiple hops away from the targeted device and then encapsulated within MPLS. The DoS condition may occur when the NX-OS device processes the packet.",
    "published": "2024-02-29T01:43:58.370",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20291": {
    "cvss": 5.8,
    "description": "A vulnerability in the access control list (ACL) programming for port channel subinterfaces of Cisco Nexus 3000 and 9000 Series Switches in standalone NX-OS mode could allow an unauthenticated, remote attacker to send traffic that should be blocked through an affected device.\r\n\r This vulnerability is due to incorrect hardware programming that occurs when configuration changes are made to port channel member ports. An attacker could exploit this vulnerability by attempting to send traffic through an affected device. A successful exploit could allow the attacker to access network resources that should be protected by an ACL that was applied on port channel subinterfaces.",
    "published": "2024-02-29T01:43:59.000",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20294": {
    "cvss": 6.6,
    "description": "A vulnerability in the Link Layer Discovery Protocol (LLDP) feature of Cisco FXOS Software and Cisco NX-OS Software could allow an unauthenticated, adjacent attacker to cause a denial of service (DoS) condition on an affected device.\r\n\r This vulnerability is due to improper handling of specific fields in an LLDP frame. An attacker could exploit this vulnerability by sending a crafted LLDP packet to an interface of an affected device and having an authenticated user retrieve LLDP statistics from the affected device through CLI show commands or Simple Network Management Protocol (SNMP) requests. A successful exploit could allow the attacker to cause the LLDP service to crash and stop running on the affected device. In certain situations, the LLDP crash may result in a reload of the affected device.\r\n\r Note: LLDP is a Layer 2 link protocol. To exploit this vulnerability, an attacker would need to be directly connected to an interface of an affected device, either physically or logically (for example, through a Layer 2 Tunnel configured to transport the LLDP protocol).",
    "published": "2024-02-29T01:43:59.207",
    "keywords": "unauthenticated,command"
  },
  "CVE-2024-20321": {
    "cvss": 8.6,
    "description": "A vulnerability in the External Border Gateway Protocol (eBGP) implementation of Cisco NX-OS Software could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition on an affected device.\r\n\r This vulnerability exists because eBGP traffic is mapped to a shared hardware rate-limiter queue. An attacker could exploit this vulnerability by sending large amounts of network traffic with certain characteristics through an affected device. A successful exploit could allow the attacker to cause eBGP neighbor sessions to be dropped, leading to a DoS condition in the network.",
    "published": "2024-02-29T01:43:59.410",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20344": {
    "cvss": 5.3,
    "description": "A vulnerability in system resource management in Cisco UCS 6400 and 6500 Series Fabric Interconnects that are in Intersight Managed Mode (IMM) could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition on the Device Console UI of an affected device.\r\n\r This vulnerability is due to insufficient rate-limiting of TCP connections to an affected device. An attacker could exploit this vulnerability by sending a high number of TCP packets to the Device Console UI. A successful exploit could allow an attacker to cause the Device Console UI process to crash, resulting in a DoS condition. A manual reload of the fabric interconnect is needed to restore complete functionality.",
    "published": "2024-02-29T01:43:59.613",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-23052": {
    "url": "https://github.com/wukongopensource/wukongcrm-9.0-java/issues/28",
    "cvss": "-",
    "description": "An issue in WuKongOpenSource WukongCRM v.72crm_9.0.1_20191202 allows a remote attacker to execute arbitrary code via the parseObject() function in the fastjson component.",
    "published": "2024-02-29T01:44:07.820"
  },
  "CVE-2024-23328": {
    "cvss": 9.1,
    "description": "Dataease is an open source data visualization analysis tool. A deserialization vulnerability exists in the DataEase datasource, which can be exploited to execute arbitrary code. The location of the vulnerability code is `core/core-backend/src/main/java/io/dataease/datasource/type/Mysql.java.` The blacklist of mysql jdbc attacks can be bypassed and attackers can further exploit it for deserialized execution or reading arbitrary files. This vulnerability is patched in 1.18.15 and 2.3.0.",
    "published": "2024-02-29T01:44:08.483",
    "keywords": "execution,bypass"
  },
  "CVE-2024-23807": {
    "url": "https://github.com/apache/xerces-c/pull/54",
    "cvss": "-",
    "description": "The Apache Xerces C++ XML parser on versions 3.0.0 before 3.2.5 contains a use-after-free error triggered during the scanning of external DTDs.\n\nUsers are recommended to upgrade to version 3.2.5 which fixes the issue, or mitigate the issue by disabling DTD processing. This can be accomplished via the DOM using a standard parser feature, or via SAX using the XERCES_DISABLE_DTD environment variable.\n\nThis issue has been disclosed before as CVE-2018-1311, but unfortunately that advisory incorrectly stated the issue would be fixed in version 3.2.3 or 3.2.4.\n\n",
    "published": "2024-02-29T01:44:10.340"
  },
  "CVE-2024-24146": {
    "url": "https://github.com/libming/libming/issues/307",
    "cvss": "-",
    "description": "A memory leak issue discovered in parseSWF_DEFINEBUTTON in libming v0.4.8 allows attackers to cause s denial of service via a crafted SWF file.",
    "published": "2024-02-29T01:44:11.657"
  },
  "CVE-2024-24147": {
    "url": "https://github.com/libming/libming/issues/311",
    "cvss": "-",
    "description": "A memory leak issue discovered in parseSWF_FILLSTYLEARRAY in libming v0.4.8 allows attackers to cause s denial of service via a crafted SWF file.",
    "published": "2024-02-29T01:44:11.693"
  },
  "CVE-2024-24149": {
    "url": "https://github.com/libming/libming/issues/310",
    "cvss": "-",
    "description": "A memory leak issue discovered in parseSWF_GLYPHENTRY in libming v0.4.8 allows attackers to cause a denial of service via a crafted SWF file.",
    "published": "2024-02-29T01:44:11.737"
  },
  "CVE-2024-24150": {
    "url": "https://github.com/libming/libming/issues/309",
    "cvss": "-",
    "description": "A memory leak issue discovered in parseSWF_TEXTRECORD in libming v0.4.8 allows attackers to cause a denial of service via a crafted SWF file.",
    "published": "2024-02-29T01:44:11.777"
  },
  "CVE-2024-24155": {
    "url": "https://github.com/axiomatic-systems/bento4/issues/919",
    "cvss": "-",
    "description": "Bento4 v1.5.1-628 contains a Memory leak on AP4_Movie::AP4_Movie, parsing tracks and added into m_Tracks list, but mp42aac cannot correctly delete when we got an no audio track found error. This vulnerability allows attackers to cause a Denial of Service (DoS) via a crafted mp4 file.",
    "published": "2024-02-29T01:44:11.810"
  },
  "CVE-2024-25065": {
    "cvss": "-",
    "description": "\nPossible path traversal in Apache OFBiz allowing authentication bypass.\nUsers are recommended to upgrade to version 18.12.12, that fixes the issue.\n\n",
    "published": "2024-02-29T01:44:14.480",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-25713": {
    "cvss": "-",
    "description": "yyjson through 0.8.0 has a double free, leading to remote code execution in some cases, because the pool_free function lacks loop checks. (pool_free is part of the pool series allocator, along with pool_malloc and pool_realloc.)",
    "published": "2024-02-29T01:44:16.333",
    "keywords": "remote,execution"
  },
  "CVE-2024-25830": {
    "cvss": "-",
    "description": "F-logic DataCube3 v1.0 is vulnerable to Incorrect Access Control due to an improper directory access restriction. An unauthenticated, remote attacker can exploit this, by sending a URI that contains the path of the configuration file. A successful exploit could allow the attacker to extract the root and admin password.",
    "published": "2024-02-29T01:44:16.533",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-27516": {
    "url": "https://github.com/livehelperchat/livehelperchat/issues/2054",
    "cvss": "-",
    "description": "livehelperchat 4.28v is vulnerable to Server-Side Template Injection (SSTI).",
    "published": "2024-02-29T01:44:20.137"
  },
  "CVE-2024-27517": {
    "url": "https://github.com/webasyst/webasyst-framework/issues/377",
    "cvss": "-",
    "description": "Webasyst 2.9.9 has a Cross-Site Scripting (XSS) vulnerability, Attackers can create blogs containing malicious code after gaining blog permissions.",
    "published": "2024-02-29T01:44:20.180"
  },
  "CVE-2024-1468": {
    "cvss": 8.8,
    "description": "The Avada | Website Builder For WordPress & WooCommerce theme for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the ajax_import_options() function in all versions up to, and including, 7.11.4. This makes it possible for authenticated attackers, with contributor-level access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-02-29T04:15:06.020",
    "keywords": "remote,execution"
  },
  "CVE-2024-1981": {
    "cvss": 9.8,
    "description": "The Migration, Backup, Staging – WPvivid plugin for WordPress is vulnerable to SQL Injection via the 'table_prefix' parameter in version 0.9.68 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-02-29T07:15:06.930",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-0864": {
    "cvss": "-",
    "description": "Enabling Simple Ajax Uploader plugin included in Laragon open-source software allows for a remote code execution (RCE) attack via an improper input validation in a file_upload.php file which serves as an example.\nBy default, Laragon is not vulnerable until a user decides to use the aforementioned plugin. \n",
    "published": "2024-02-29T13:15:07.260",
    "keywords": "remote,execution"
  },
  "CVE-2024-24246": {
    "url": "https://github.com/qpdf/qpdf/issues/1123",
    "cvss": "-",
    "description": "Heap Buffer Overflow vulnerability in qpdf 11.9.0 allows attackers to crash the application via the std::__shared_count() function at /bits/shared_ptr_base.h.",
    "published": "2024-02-29T20:15:41.407"
  },
  "CVE-2024-27655": {
    "cvss": "-",
    "description": "D-Link DIR-823G A1V1.0.2B05 was discovered to contain a buffer overflow via the SOAPACTION parameter. This vulnerability allows attackers to cause a Denial of Service (DoS) via a crafted input, and possibly remote code execution.",
    "published": "2024-02-29T20:15:41.500",
    "keywords": "remote,execution"
  },
  "CVE-2024-27656": {
    "cvss": "-",
    "description": "D-Link DIR-823G A1V1.0.2B05 was discovered to contain a buffer overflow via the Cookie parameter. This vulnerability allows attackers to cause a Denial of Service (DoS) via a crafted input, and possibly remote code execution.",
    "published": "2024-02-29T20:15:41.547",
    "keywords": "remote,execution"
  },
  "CVE-2024-27657": {
    "cvss": "-",
    "description": "D-Link DIR-823G A1V1.0.2B05 was discovered to contain a buffer overflow via the User-Agent parameter. This vulnerability allows attackers to cause a Denial of Service (DoS) via a crafted input, and possibly remote code execution.",
    "published": "2024-02-29T20:15:41.597",
    "keywords": "remote,execution"
  },
  "CVE-2024-22891": {
    "cvss": "-",
    "description": "Nteract v.0.28.0 was discovered to contain a remote code execution (RCE) vulnerability via the Markdown link.",
    "published": "2024-03-01T06:15:48.280",
    "keywords": "remote,execution"
  },
  "CVE-2024-25293": {
    "cvss": "-",
    "description": "mjml-app versions 3.0.4 and 3.1.0-beta were discovered to contain a remote code execution (RCE) via the href attribute.",
    "published": "2024-03-01T06:15:48.347",
    "keywords": "remote,execution"
  },
  "CVE-2024-0692": {
    "cvss": 8.8,
    "description": "The SolarWinds Security Event Manager was susceptible to Remote Code Execution Vulnerability. This vulnerability allows an unauthenticated user to abuse SolarWinds’ service, resulting in remote code execution.",
    "published": "2024-03-01T09:15:09.600",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-22457": {
    "cvss": 7.1,
    "description": "Dell Secure Connect Gateway 5.20 contains an improper authentication vulnerability during the SRS to SCG update path. A remote low privileged attacker could potentially exploit this vulnerability, leading to impersonation of the server through presenting a fake self-signed certificate and communicating with the remote server.",
    "published": "2024-03-01T11:15:07.127",
    "keywords": "remote,authentication"
  },
  "CVE-2024-27497": {
    "cvss": "-",
    "description": "Linksys E2000 Ver.1.0.06 build 1 is vulnerable to authentication bypass via the position.js file.",
    "published": "2024-03-01T15:15:08.580",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-1624": {
    "cvss": 9.4,
    "description": "An OS Command Injection vulnerability affecting documentation server on 3DEXPERIENCE from Release 3DEXPERIENCE R2022x through Release 3DEXPERIENCE R2024x, SIMULIA Abaqus from Release 2022 through Release 2024, SIMULIA Isight from Release 2022 through Release 2024 and CATIA Composer from Release R2023 through Release R2024. A specially crafted HTTP request can lead to arbitrary command execution.",
    "published": "2024-03-01T16:15:45.723",
    "keywords": "execution,command"
  },
  "CVE-2024-2076": {
    "cvss": 5.3,
    "description": "A vulnerability was found in CodeAstro House Rental Management System 1.0. It has been rated as problematic. Affected by this issue is some unknown functionality of the file booking.php/owner.php/tenant.php. The manipulation leads to missing authentication. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-255392.",
    "published": "2024-03-01T19:15:07.247",
    "keywords": "remote,authentication"
  },
  "CVE-2024-21767": {
    "cvss": 9.4,
    "description": "\nA remote attacker may be able to bypass access control of Commend WS203VICM by creating a malicious request.\n\n\n\n",
    "published": "2024-03-01T21:15:07.973",
    "keywords": "remote,bypass"
  },
  "CVE-2024-22182": {
    "cvss": 8.6,
    "description": "A remote, unauthenticated attacker may be able to send crafted messages \nto the web server of the Commend WS203VICM causing the system to \nrestart, interrupting service.\n\n",
    "published": "2024-03-01T21:15:08.167",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-0795": {
    "url": "https://github.com/mintplex-labs/anything-llm/commit/9a237db3d1f66cdbcf5079599258f5fb251c5564",
    "cvss": 7.2,
    "description": "If an attacked was given access to an instance with the admin or manager role there is no backend authentication that would prevent the attacked from creating a new user with an `admin` role and then be able to use this new account to have elevated privileges on the instance",
    "published": "2024-03-02T22:15:49.813"
  },
  "CVE-2024-0968": {
    "url": "https://github.com/langchain-ai/chat-langchain/commit/e13db53cba2a48e4e26d103fd51598856f6bdd33",
    "cvss": 4.6,
    "description": "Cross-site Scripting (XSS) - DOM in GitHub repository langchain-ai/chat-langchain prior to 0.0.0.",
    "published": "2024-03-02T22:15:50.123"
  },
  "CVE-2024-25865": {
    "url": "https://github.com/anzhiyu-c/hexo-theme-anzhiyu/issues/200",
    "cvss": "-",
    "description": "Cross Site Scripting (XSS) vulnerability in hexo-theme-anzhiyu v1.6.12, allows remote attackers to execute arbitrary code via the algolia search function.",
    "published": "2024-03-02T22:15:50.293"
  }
}