{
  "CVE-2024-5711": {
    "url": "https://github.com/stitionai/devika/commit/6acce21fb08c3d1123ef05df6a33912bf0ee77c2",
    "cvss": 8.1,
    "description": "Cross-site Scripting (XSS) - Stored in GitHub repository stitionai/devika prior to -.",
    "published": "2024-07-08T00:15:01.940"
  },
  "CVE-2024-24974": {
    "cvss": "-",
    "description": "The interactive service in OpenVPN 2.6.9 and earlier allows the OpenVPN service pipe to be accessed remotely, which allows a remote attacker to interact with the privileged OpenVPN interactive service.",
    "published": "2024-07-08T11:15:10.103",
    "keywords": "remote,vpn"
  },
  "CVE-2024-6163": {
    "cvss": 5.3,
    "description": "Certain http endpoints of Checkmk in Checkmk < 2.3.0p10 < 2.2.0p31, < 2.1.0p46, <= 2.0.0p39 allows remote attacker to bypass authentication and access data",
    "published": "2024-07-08T13:15:10.593",
    "keywords": "remote,authentication,bypass"
  },
  "CVE-2024-39742": {
    "cvss": 8.1,
    "description": "IBM MQ Operator 3.2.2 and IBM MQ Operator 2.0.24 could allow a user to bypass authentication under certain configurations due to a partial string comparison vulnerability.  IBM X-Force ID:  297169.",
    "published": "2024-07-08T14:15:02.550",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-39202": {
    "cvss": "-",
    "description": "D-Link DIR-823X firmware - 240126 was discovered to contain a remote command execution (RCE) vulnerability via the dhcpd_startip parameter at /goform/set_lan_settings.",
    "published": "2024-07-08T16:15:08.490",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-6409": {
    "cvss": 7.0,
    "description": "A signal handler race condition vulnerability was found in OpenSSH's server (sshd) in Red Hat Enterprise Linux 9, where a client does not authenticate within LoginGraceTime seconds (120 by default, 600 in old OpenSSH versions), then sshd's SIGALRM handler is called asynchronously. However, this signal handler calls various functions that are not async-signal-safe, for example, syslog(). This issue leaves it vulnerable to a signal handler race condition on the cleanup_exit() function, which introduces the same vulnerability as CVE-2024-6387 in the unprivileged child of the SSHD server. As a consequence of a successful attack, in the worst case scenario, the attacker may be able to perform a remote code execution (RCE) within unprivileged user running the sshd server. This vulnerability affects only the sshd server shipped with Red Hat Enterprise Linux 9, while upstream versions of sshd are not impact by this flaw.",
    "published": "2024-07-08T18:15:09.487",
    "keywords": "remote,execution"
  },
  "CVE-2024-5549": {
    "url": "https://github.com/stitionai/devika/commit/6acce21fb08c3d1123ef05df6a33912bf0ee77c2",
    "cvss": 8.1,
    "description": "Origin Validation Error in GitHub repository stitionai/devika prior to -.",
    "published": "2024-07-09T00:15:02.050"
  },
  "CVE-2024-4944": {
    "cvss": 7.8,
    "description": "A local privilege escalation vlnerability in the WatchGuard Mobile VPN with SSL client on Windows enables a local user to execute arbitrary commands with elevated privileged.\n",
    "published": "2024-07-09T03:15:02.270",
    "keywords": "command,vpn"
  },
  "CVE-2024-6365": {
    "cvss": 9.8,
    "description": "The Product Table by WBW plugin for WordPress is vulnerable to Remote Code Execution in all versions up to, and including, 2.0.1 via the 'saveCustomTitle' function. This is due to missing authorization and lack of sanitization of appended data in the languages/customTitle.php file. This makes it possible for unauthenticated attackers to execute code on the server.",
    "published": "2024-07-09T04:15:15.333",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-37180": {
    "cvss": 4.1,
    "description": "Under certain conditions SAP NetWeaver\nApplication Server for ABAP and ABAP Platform allows an attacker to access\nremote-enabled function module with no further authorization which would\notherwise be restricted, the function can be used to read non-sensitive\ninformation with low impact on confidentiality of the application.",
    "published": "2024-07-09T05:15:12.033",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-6171": {
    "cvss": 5.3,
    "description": "The Unlimited Elements For Elementor (Free Widgets, Addons, Templates) plugin for WordPress is vulnerable to IP Address Spoofing in all versions up to, and including, 1.5.112 due to insufficient IP address validation and/or use of user-supplied HTTP headers as a primary method for IP retrieval. This makes it possible for unauthenticated attackers  to bypass antispam functionality in the Form Builder widgets.",
    "published": "2024-07-09T05:15:14.140",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2024-5441": {
    "cvss": 8.8,
    "description": "The Modern Events Calendar plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the set_featured_image function in all versions up to, and including, 7.11.0. This makes it possible for authenticated attackers, with subscriber access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible. The plugin allows administrators (via its settings) to extend the ability to submit events to unauthenticated users, which would allow unauthenticated attackers to exploit this vulnerability.",
    "published": "2024-07-09T06:15:02.710",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-28747": {
    "cvss": 9.8,
    "description": "An unauthenticated remote attacker can use the hard-coded credentials to access the SmartSPS devices with high privileges.\n",
    "published": "2024-07-09T07:15:03.563",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-28748": {
    "cvss": 7.2,
    "description": "A remote attacker with high privileges may use a reading file function to inject OS commands.\n",
    "published": "2024-07-09T07:15:03.827",
    "keywords": "remote,command"
  },
  "CVE-2024-28749": {
    "cvss": 7.2,
    "description": "A remote attacker with high privileges may use a writing file function to inject OS commands.\n",
    "published": "2024-07-09T07:15:04.067",
    "keywords": "remote,command"
  },
  "CVE-2024-28750": {
    "cvss": 7.2,
    "description": "A remote attacker with high privileges may use a deleting file function to inject OS commands.\n",
    "published": "2024-07-09T07:15:04.323",
    "keywords": "remote,command"
  },
  "CVE-2024-6123": {
    "cvss": 7.2,
    "description": "The Bit Form plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the 'iconUpload' function in all versions up to, and including, 2.12.2. This makes it possible for authenticated attackers, with administrator-level and above permissions, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-07-09T08:15:10.983",
    "keywords": "remote,execution"
  },
  "CVE-2024-6161": {
    "cvss": 8.8,
    "description": "The Default Thumbnail Plus plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the 'get_cache_image' function in all versions up to, and including, 1.0.2.3. This makes it possible for authenticated attackers, with contributor-level and above permissions, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-07-09T08:15:11.160",
    "keywords": "remote,execution"
  },
  "CVE-2024-6309": {
    "cvss": 8.8,
    "description": "The Attachment File Icons (AF Icons) plugin for WordPress is vulnerable to Cross-Site Request Forgery to Arbitrary File Upload in versions up to, and including, 1.3. This is due to missing nonce validation in the 'afi_overview' function and missing file type validation in the 'upload_icons' function. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected site's server which may make remote code execution possible via a forged request granted they can trick a site administrator into performing an action such as clicking on a link.",
    "published": "2024-07-09T08:15:11.550",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-6310": {
    "cvss": 8.8,
    "description": "The Advanced AJAX Page Loader plugin for WordPress is vulnerable to Cross-Site Request Forgery to Arbitrary File Upload in versions up to, and including, 2.7.7. This is due to missing nonce validation in the 'admin_init_AAPL' function and missing file type validation in the 'AAPL_options_validate' function. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected site's server which may make remote code execution possible via a forged request granted they can trick a site administrator into performing an action such as clicking on a link.",
    "published": "2024-07-09T08:15:11.733",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-6313": {
    "cvss": 9.8,
    "description": "The Gutenberg Forms plugin for WordPress is vulnerable to arbitrary file uploads due to the users can specify the allowed file types in the 'upload' function in versions up to, and including, 2.2.9. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-07-09T08:15:11.907",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-6314": {
    "cvss": 9.8,
    "description": "The IQ Testimonials plugin for WordPress is vulnerable to arbitrary file uploads due to insufficient file type validation in the 'process_image_upload' function in versions up to, and including, 2.2.7. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected site's server which may make remote code execution possible. This can only be exploited if the 'gd' php extension is not loaded on the server.",
    "published": "2024-07-09T08:15:12.090",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-6316": {
    "cvss": 8.8,
    "description": "The Generate PDF using Contact Form 7 plugin for WordPress is vulnerable to Cross-Site Request Forgery to Arbitrary File Upload in versions up to, and including, 4.0.6. This is due to missing nonce validation and missing file type validation in the 'wp_cf7_pdf_dashboard_html_page' function. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected site's server which may make remote code execution possible via a forged request granted they can trick a site administrator into performing an action such as clicking on a link.",
    "published": "2024-07-09T08:15:12.270",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-6317": {
    "cvss": 8.8,
    "description": "The Generate PDF using Contact Form 7 plugin for WordPress is vulnerable to Cross-Site Request Forgery to Arbitrary File Upload in versions up to, and including, 4.0.6. This is due to missing nonce validation and the plugin not properly validating a file or its path prior to deleting it in the 'wp_cf7_pdf_dashboard_html_page' function. This makes it possible for unauthenticated attackers to delete arbitrary files, including the wp-config.php file, which can make site takeover and remote code execution possible via a forged request granted they can trick a site administrator into performing an action such as clicking on a link.",
    "published": "2024-07-09T08:15:12.470",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-6320": {
    "cvss": 8.8,
    "description": "The ScrollTo Top plugin for WordPress is vulnerable to Cross-Site Request Forgery to Arbitrary File Upload in versions up to, and including, 1.2.2. This is due to missing nonce validation and missing file type validation in the 'options_page' function. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected site's server which may make remote code execution possible via a forged request granted they can trick a site administrator into performing an action such as clicking on a link.",
    "published": "2024-07-09T08:15:12.643",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-6321": {
    "cvss": 8.8,
    "description": "The ScrollTo Bottom plugin for WordPress is vulnerable to Cross-Site Request Forgery to Arbitrary File Upload in versions up to, and including, 1.1.1. This is due to missing nonce validation and missing file type validation in the 'options_page' function. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected site's server which may make remote code execution possible via a forged request granted they can trick a site administrator into performing an action such as clicking on a link.",
    "published": "2024-07-09T08:15:12.843",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-5456": {
    "cvss": 8.8,
    "description": "The Panda Video plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 1.4.0 via the 'selected_button' parameter. This makes it possible for authenticated attackers, with Contributor-level access and above, to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-07-09T09:15:06.310",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-37430": {
    "cvss": 5.3,
    "description": "Authentication Bypass by Spoofing vulnerability in Patreon Patreon WordPress allows Functionality Misuse.This issue affects Patreon WordPress: from n/a through 1.9.0.",
    "published": "2024-07-09T11:15:14.263",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-5633": {
    "cvss": "-",
    "description": "Longse model LBH30FE200W cameras, as well as products based on this device, provide an unrestricted access for an attacker located in the same local network to an undocumented binary service CoolView on one of the ports. \nAn attacker with a knowledge of the available commands is able to perform read/write operations on the device's memory, which might result in e.g. bypassing telnet login and obtaining full access to the device.",
    "published": "2024-07-09T11:15:16.157",
    "keywords": "command,bypass"
  },
  "CVE-2024-30321": {
    "cvss": 5.9,
    "description": "A vulnerability has been identified in SIMATIC PCS 7 V9.1 (All versions), SIMATIC WinCC Runtime Professional V18 (All versions), SIMATIC WinCC Runtime Professional V19 (All versions < V19 Update 2), SIMATIC WinCC V7.4 (All versions < V7.4 SP1 Update 23), SIMATIC WinCC V7.5 (All versions < V7.5 SP2 Update 17), SIMATIC WinCC V8.0 (All versions < V8.0 Update 5). The affected products do not properly handle certain requests to their web application, which may lead to the leak of privileged information.\r\nThis could allow an unauthenticated remote attacker to retrieve information such as users and passwords.",
    "published": "2024-07-09T12:15:11.707",
    "keywords": "remote,unauthenticated,leak"
  },
  "CVE-2024-39567": {
    "cvss": 7.8,
    "description": "A vulnerability has been identified in SINEMA Remote Connect Client (All versions < V3.2 HF1). The system service of affected applications is vulnerable to command injection due to missing server side input sanitation when loading VPN configurations. This could allow an authenticated local attacker to execute arbitrary code with system privileges.",
    "published": "2024-07-09T12:15:16.053",
    "keywords": "remote,command,vpn"
  },
  "CVE-2024-39568": {
    "cvss": 7.8,
    "description": "A vulnerability has been identified in SINEMA Remote Connect Client (All versions < V3.2 HF1). The system service of affected applications is vulnerable to command injection due to missing server side input sanitation when loading proxy configurations. This could allow an authenticated local attacker to execute arbitrary code with system privileges.",
    "published": "2024-07-09T12:15:16.263",
    "keywords": "remote,command"
  },
  "CVE-2024-39569": {
    "cvss": 6.6,
    "description": "A vulnerability has been identified in SINEMA Remote Connect Client (All versions < V3.2 HF1). The system service of affected applications is vulnerable to command injection due to missing server side input sanitation when loading VPN configurations. This could allow an administrative remote attacker running a corresponding SINEMA Remote Connect Server to execute arbitrary code with system privileges on the client system.",
    "published": "2024-07-09T12:15:16.490",
    "keywords": "remote,command,vpn"
  },
  "CVE-2024-39570": {
    "cvss": 8.8,
    "description": "A vulnerability has been identified in SINEMA Remote Connect Server (All versions < V3.2 HF1). Affected applications are vulnerable to command injection due to missing server side input sanitation when loading VxLAN configurations. This could allow an authenticated attacker to execute arbitrary code with root privileges.",
    "published": "2024-07-09T12:15:16.723",
    "keywords": "remote,command"
  },
  "CVE-2024-39571": {
    "cvss": 8.8,
    "description": "A vulnerability has been identified in SINEMA Remote Connect Server (All versions < V3.2 HF1). Affected applications are vulnerable to command injection due to missing server side input sanitation when loading SNMP configurations. This could allow an attacker with the right to modify the SNMP configuration to execute arbitrary code with root privileges.",
    "published": "2024-07-09T12:15:16.953",
    "keywords": "remote,command"
  },
  "CVE-2024-39865": {
    "cvss": 8.8,
    "description": "A vulnerability has been identified in SINEMA Remote Connect Server (All versions < V3.2 SP1). The affected application allows users to upload encrypted backup files. As part of this backup, files can be restored without correctly checking the path of the restored file. This could allow an attacker with access to the backup encryption key to upload malicious files, that could potentially lead to remote code execution.",
    "published": "2024-07-09T12:15:17.443",
    "keywords": "remote,execution"
  },
  "CVE-2024-39867": {
    "cvss": 7.6,
    "description": "A vulnerability has been identified in SINEMA Remote Connect Server (All versions < V3.2 SP1). Affected devices do not properly validate the authentication when performing certain actions in the web interface allowing an unauthenticated attacker to access and edit device configuration information of devices for which they have no privileges.",
    "published": "2024-07-09T12:15:17.917",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2024-39868": {
    "cvss": 7.6,
    "description": "A vulnerability has been identified in SINEMA Remote Connect Server (All versions < V3.2 SP1). Affected devices do not properly validate the authentication when performing certain actions in the web interface allowing an unauthenticated attacker to access and edit VxLAN configuration information of networks for which they have no privileges.",
    "published": "2024-07-09T12:15:18.157",
    "keywords": "remote,unauthenticated,authentication"
  },
  "CVE-2024-39876": {
    "cvss": 4.0,
    "description": "A vulnerability has been identified in SINEMA Remote Connect Server (All versions < V3.2 SP1). Affected applications do not properly handle log rotation. This could allow an unauthenticated remote attacker to cause a denial of service condition through resource exhaustion on the device.",
    "published": "2024-07-09T12:15:20.047",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-38363": {
    "cvss": 8.5,
    "description": "Airbyte is a data integration platform for ELT pipelines. Airbyte connection builder docker image is vulnerable to RCE via SSTI which allows an authenticated remote attacker to execute arbitrary code on the server as the web server user. The connection builder is used to create and test new connectors. Sensitive information, such as credentials, could be exposed if a user tested a new connector on a compromised instance. The connection builder does not have access to any data processes. This vulnerability is fixed in 0.62.2.",
    "published": "2024-07-09T15:15:11.043",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-26015": {
    "cvss": 3.4,
    "description": "An incorrect parsing of numbers with different radices vulnerability [CWE-1389] in FortiProxy version 7.4.3 and below, version 7.2.10 and below, version 7.0.17 and below and FortiOS version 7.4.3 and below, version 7.2.8 and below, version 7.0.15 and below IP address validation feature may permit an unauthenticated attacker to bypass the IP blocklist via crafted requests.",
    "published": "2024-07-09T16:15:04.810",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2024-27783": {
    "cvss": 7.6,
    "description": "Multiple cross-site request forgery (CSRF) vulnerabilities [CWE-352]  in FortiAIOps version 2.0.0 may allow an unauthenticated remote attacker to perform arbitrary actions on behalf of an authenticated user via tricking the victim to execute malicious GET requests.",
    "published": "2024-07-09T16:15:05.240",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-27784": {
    "cvss": 8.8,
    "description": "Multiple Exposure of sensitive information to an unauthorized actor vulnerabilities [CWE-200] in FortiAIOps version 2.0.0 may allow an authenticated, remote attacker to retrieve sensitive information from the API endpoint or log files.",
    "published": "2024-07-09T16:15:05.470",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-27785": {
    "cvss": 5.4,
    "description": "An improper neutralization of formula elements in a CSV File vulnerability [CWE-1236] in FortiAIOps version 2.0.0 may allow a remote authenticated attacker to execute arbitrary commands on a client's workstation via poisoned CSV reports.",
    "published": "2024-07-09T16:15:05.687",
    "keywords": "remote,command"
  },
  "CVE-2024-33509": {
    "cvss": 4.8,
    "description": "An improper certificate validation vulnerability [CWE-295] in FortiWeb 7.2.0 through 7.2.1, 7.0 all versions, 6.4 all versions and 6.3 all versions may allow a remote and unauthenticated attacker in a Man-in-the-Middle position to decipher and/or tamper with the communication channel between the device and different endpoints used to fetch data for Web Application Firewall (WAF).",
    "published": "2024-07-09T16:15:05.950",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20701": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:10.737",
    "keywords": "remote,execution"
  },
  "CVE-2024-21303": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:11.117",
    "keywords": "remote,execution"
  },
  "CVE-2024-21308": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:11.337",
    "keywords": "remote,execution"
  },
  "CVE-2024-21317": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:11.573",
    "keywords": "remote,execution"
  },
  "CVE-2024-21331": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:11.800",
    "keywords": "remote,execution"
  },
  "CVE-2024-21332": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:12.033",
    "keywords": "remote,execution"
  },
  "CVE-2024-21333": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:12.260",
    "keywords": "remote,execution"
  },
  "CVE-2024-21335": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:12.487",
    "keywords": "remote,execution"
  },
  "CVE-2024-21373": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:12.857",
    "keywords": "remote,execution"
  },
  "CVE-2024-21398": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:13.103",
    "keywords": "remote,execution"
  },
  "CVE-2024-21414": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:13.327",
    "keywords": "remote,execution"
  },
  "CVE-2024-21415": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:13.550",
    "keywords": "remote,execution"
  },
  "CVE-2024-21425": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:13.770",
    "keywords": "remote,execution"
  },
  "CVE-2024-21428": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:13.973",
    "keywords": "remote,execution"
  },
  "CVE-2024-21449": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:14.177",
    "keywords": "remote,execution"
  },
  "CVE-2024-28928": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:15.447",
    "keywords": "remote,execution"
  },
  "CVE-2024-30013": {
    "cvss": 8.8,
    "description": "Windows MultiPoint Services Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:15.660",
    "keywords": "remote,execution"
  },
  "CVE-2024-35256": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:17.623",
    "keywords": "remote,execution"
  },
  "CVE-2024-35264": {
    "cvss": 8.1,
    "description": ".NET and Visual Studio Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:18.213",
    "keywords": "remote,execution"
  },
  "CVE-2024-35271": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:19.023",
    "keywords": "remote,execution"
  },
  "CVE-2024-35272": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:19.217",
    "keywords": "remote,execution"
  },
  "CVE-2024-37318": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:19.520",
    "keywords": "remote,execution"
  },
  "CVE-2024-37319": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:19.757",
    "keywords": "remote,execution"
  },
  "CVE-2024-37320": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:19.973",
    "keywords": "remote,execution"
  },
  "CVE-2024-37321": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:20.180",
    "keywords": "remote,execution"
  },
  "CVE-2024-37322": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:20.390",
    "keywords": "remote,execution"
  },
  "CVE-2024-37323": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:20.603",
    "keywords": "remote,execution"
  },
  "CVE-2024-37324": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:20.797",
    "keywords": "remote,execution"
  },
  "CVE-2024-37326": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:20.997",
    "keywords": "remote,execution"
  },
  "CVE-2024-37327": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:21.190",
    "keywords": "remote,execution"
  },
  "CVE-2024-37328": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:21.387",
    "keywords": "remote,execution"
  },
  "CVE-2024-37329": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:21.660",
    "keywords": "remote,execution"
  },
  "CVE-2024-37330": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:21.910",
    "keywords": "remote,execution"
  },
  "CVE-2024-37331": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:22.113",
    "keywords": "remote,execution"
  },
  "CVE-2024-37332": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:22.313",
    "keywords": "remote,execution"
  },
  "CVE-2024-37333": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:22.523",
    "keywords": "remote,execution"
  },
  "CVE-2024-37334": {
    "cvss": 8.8,
    "description": "Microsoft OLE DB Driver for SQL Server Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:22.730",
    "keywords": "remote,execution"
  },
  "CVE-2024-37336": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:22.927",
    "keywords": "remote,execution"
  },
  "CVE-2024-38019": {
    "cvss": 7.2,
    "description": "Microsoft Windows Performance Data Helper Library Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:27.750",
    "keywords": "remote,execution"
  },
  "CVE-2024-38021": {
    "cvss": 8.8,
    "description": "Microsoft Office Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:28.323",
    "keywords": "remote,execution"
  },
  "CVE-2024-38023": {
    "cvss": 7.2,
    "description": "Microsoft SharePoint Server Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:28.760",
    "keywords": "remote,execution"
  },
  "CVE-2024-38024": {
    "cvss": 7.2,
    "description": "Microsoft SharePoint Server Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:28.967",
    "keywords": "remote,execution"
  },
  "CVE-2024-38025": {
    "cvss": 7.2,
    "description": "Microsoft Windows Performance Data Helper Library Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:29.177",
    "keywords": "remote,execution"
  },
  "CVE-2024-38028": {
    "cvss": 7.2,
    "description": "Microsoft Windows Performance Data Helper Library Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:29.627",
    "keywords": "remote,execution"
  },
  "CVE-2024-38032": {
    "cvss": 7.1,
    "description": "Microsoft Xbox Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:30.613",
    "keywords": "remote,execution"
  },
  "CVE-2024-38044": {
    "cvss": 7.2,
    "description": "DHCP Server Service Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:32.490",
    "keywords": "remote,execution"
  },
  "CVE-2024-38049": {
    "cvss": 6.6,
    "description": "Windows Distributed Transaction Coordinator Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:33.547",
    "keywords": "remote,execution"
  },
  "CVE-2024-38051": {
    "cvss": 7.8,
    "description": "Windows Graphics Component Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:34.253",
    "keywords": "remote,execution"
  },
  "CVE-2024-38053": {
    "cvss": 8.8,
    "description": "Windows Layer-2 Bridge Network Driver Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:34.963",
    "keywords": "remote,execution"
  },
  "CVE-2024-38060": {
    "cvss": 8.8,
    "description": "Windows Imaging Component Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:37.440",
    "keywords": "remote,execution"
  },
  "CVE-2024-38074": {
    "cvss": 9.8,
    "description": "Windows Remote Desktop Licensing Service Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:41.733",
    "keywords": "remote,execution"
  },
  "CVE-2024-38076": {
    "cvss": 9.8,
    "description": "Windows Remote Desktop Licensing Service Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:42.090",
    "keywords": "remote,execution"
  },
  "CVE-2024-38077": {
    "cvss": 9.8,
    "description": "Windows Remote Desktop Licensing Service Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:42.430",
    "keywords": "remote,execution"
  },
  "CVE-2024-38078": {
    "cvss": 7.5,
    "description": "Xbox Wireless Adapter Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:42.770",
    "keywords": "remote,execution"
  },
  "CVE-2024-38086": {
    "cvss": 6.4,
    "description": "Azure Kinect SDK Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:44.373",
    "keywords": "remote,execution"
  },
  "CVE-2024-38087": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:44.673",
    "keywords": "remote,execution"
  },
  "CVE-2024-38088": {
    "cvss": 8.8,
    "description": "SQL Server Native Client OLE DB Provider Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:44.933",
    "keywords": "remote,execution"
  },
  "CVE-2024-38094": {
    "cvss": 7.2,
    "description": "Microsoft SharePoint Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:46.090",
    "keywords": "remote,execution"
  },
  "CVE-2024-38104": {
    "cvss": 8.8,
    "description": "Windows Fax Service Remote Code Execution Vulnerability",
    "published": "2024-07-09T17:15:47.410",
    "keywords": "remote,execution"
  },
  "CVE-2024-6237": {
    "url": "https://github.com/389ds/389-ds-base/issues/5989",
    "cvss": 5.3,
    "description": "A flaw was found in the 389 Directory Server. This flaw allows an unauthenticated user to cause a systematic server crash while sending a specific extended search request, leading to a denial of service.",
    "published": "2024-07-09T17:15:48.960"
  }
}