{
  "CVE-2024-23789": {
    "cvss": "-",
    "description": "Energy Management Controller with Cloud Services JH-RVB1 /JH-RV11 Ver.B0.1.9.1 and earlier allows a network-adjacent unauthenticated attacker to execute an arbitrary OS command on the affected product.",
    "published": "2024-02-14T11:15:08.200",
    "keywords": "unauthenticated,command"
  },
  "CVE-2024-25214": {
    "cvss": 9.8,
    "description": "An issue in Employee Managment System v1.0 allows attackers to bypass authentication via injecting a crafted payload into the E-mail and Password parameters at /alogin.html.",
    "published": "2024-02-14T15:15:09.167",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-22093": {
    "cvss": 8.7,
    "description": "When running in appliance mode, an authenticated remote command injection vulnerability exists in an undisclosed iControl REST endpoint on multi-bladed systems. A successful exploit can allow the attacker to cross a security boundary.  Note: Software versions which have reached End of Technical Support (EoTS) are not evaluated",
    "published": "2024-02-14T17:15:12.607",
    "keywords": "remote,command"
  },
  "CVE-2024-24966": {
    "cvss": 6.2,
    "description": "\nWhen LDAP remote authentication is configured on F5OS, a remote user without an assigned role will be incorrectly authorized.  Note: Software versions which have reached End of Technical Support (EoTS) are not evaluated.",
    "published": "2024-02-14T17:15:15.213",
    "keywords": "remote,authentication"
  },
  "CVE-2024-25301": {
    "cvss": "-",
    "description": "Redaxo v5.15.1 was discovered to contain a remote code execution (RCE) vulnerability via the component /pages/templates.php.",
    "published": "2024-02-14T19:15:10.277",
    "keywords": "remote,execution"
  },
  "CVE-2024-25165": {
    "url": "https://github.com/matthiaskramm/swftools/issues/217",
    "cvss": "-",
    "description": "A global-buffer-overflow vulnerability was found in SWFTools v0.9.2, in the function LineText at lib/swf5compiler.flex.",
    "published": "2024-02-14T20:15:46.057"
  },
  "CVE-2024-1367": {
    "cvss": 7.2,
    "description": "\nA command injection vulnerability exists where an authenticated, remote attacker with administrator privileges on the Security Center application could modify Logging parameters, which could lead to the execution of arbitrary code on the Security Center host. \n\n",
    "published": "2024-02-14T22:15:47.753",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-1523": {
    "cvss": 8.8,
    "description": "EC-WEB FS-EZViewer(Web)'s query functionality lacks proper restrictions of user input, allowing remote attackers authenticated as regular user to inject SQL commands for reading, modifying, and deleting database records, as well as executing system commands. Attackers may even leverage the dbo privilege in the database for privilege escalation, elevating their privileges to administrator.",
    "published": "2024-02-15T02:15:49.960",
    "keywords": "remote,command"
  },
  "CVE-2024-26260": {
    "cvss": 9.8,
    "description": "The functionality for synchronization in HGiga OAKlouds' certain moudules has an OS Command Injection vulnerability, allowing remote attackers to inject system commands within specific request parameters. This enables the execution of arbitrary code on the remote server without permission.",
    "published": "2024-02-15T03:15:34.833",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-26262": {
    "cvss": 8.8,
    "description": "EBM Technologies Uniweb/SoliPACS WebServer's query functionality lacks proper restrictions of user input, allowing remote attackers authenticated as regular user to inject SQL commands for reading, modifying, and deleting database records, as well as executing system commands. Attackers may even leverage the dbo privilege in the database for privilege escalation, elevating their privileges to administrator .",
    "published": "2024-02-15T03:15:35.313",
    "keywords": "remote,command"
  },
  "CVE-2024-26264": {
    "cvss": 9.8,
    "description": "EBM Technologies RISWEB's specific query function parameter does not properly restrict user input, and this feature page is accessible without login. This allows remote attackers to inject SQL commands without authentication, enabling them to read, modify, and delete database records.",
    "published": "2024-02-15T03:15:35.840",
    "keywords": "remote,authentication,command"
  },
  "CVE-2024-0708": {
    "cvss": 5.3,
    "description": "The Landing Page Cat – Coming Soon Page, Maintenance Page & Squeeze Pages plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 1.7.2. This makes it possible for unauthenticated attackers to access landing pages that may not be public.",
    "published": "2024-02-15T07:15:10.757",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-20722": {
    "cvss": 5.5,
    "description": "Substance3D - Painter versions 9.1.1 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-02-15T11:15:10.750",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-20724": {
    "cvss": 5.5,
    "description": "Substance3D - Painter versions 9.1.1 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-02-15T11:15:11.797",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-20725": {
    "cvss": 5.5,
    "description": "Substance3D - Painter versions 9.1.1 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-02-15T11:15:12.237",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-20734": {
    "cvss": 5.5,
    "description": "Acrobat Reader versions 20.005.30539, 23.008.20470 and earlier are affected by a Use After Free vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-02-15T13:15:47.897",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-20735": {
    "cvss": 5.5,
    "description": "Acrobat Reader versions 20.005.30539, 23.008.20470 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-02-15T13:15:48.100",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-20736": {
    "cvss": 5.5,
    "description": "Acrobat Reader versions 20.005.30539, 23.008.20470 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-02-15T13:15:48.280",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-20738": {
    "cvss": 9.8,
    "description": "Adobe Framemaker versions 2022.1 and earlier are affected by an Improper Authentication vulnerability that could result in a Security feature bypass. An attacker could leverage this vulnerability to bypass authentication mechanisms and gain unauthorized access. Exploitation of this issue does not require user interaction.",
    "published": "2024-02-15T13:15:48.473",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-20747": {
    "cvss": 5.5,
    "description": "Acrobat Reader versions 20.005.30539, 23.008.20470 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-02-15T13:15:48.860",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-20748": {
    "cvss": 5.5,
    "description": "Acrobat Reader versions 20.005.30539, 23.008.20470 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-02-15T13:15:49.050",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-20749": {
    "cvss": 5.5,
    "description": "Acrobat Reader versions 20.005.30539, 23.008.20470 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-02-15T13:15:49.237",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-20720": {
    "cvss": 9.1,
    "description": "Adobe Commerce versions 2.4.6-p3, 2.4.5-p5, 2.4.4-p6 and earlier are affected by an Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection') vulnerability that could lead in arbitrary code execution by an attacker. Exploitation of this issue does not require user interaction.",
    "published": "2024-02-15T14:15:46.283",
    "keywords": "execution,command"
  },
  "CVE-2024-23476": {
    "cvss": 9.6,
    "description": "The SolarWinds Access Rights Manager (ARM) was found to be susceptible to a Directory Traversal Remote Code Execution Vulnerability. If exploited, this vulnerability allows an unauthenticated user to achieve the Remote Code Execution.\n",
    "published": "2024-02-15T21:15:09.353",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-23477": {
    "cvss": 7.9,
    "description": "The SolarWinds Access Rights Manager (ARM) was found to be susceptible to a Directory Traversal Remote Code Execution Vulnerability. If exploited, this vulnerability allows an unauthenticated user to achieve a Remote Code Execution.\n",
    "published": "2024-02-15T21:15:09.603",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-23478": {
    "cvss": 8.0,
    "description": "SolarWinds Access Rights Manager (ARM) was found to be susceptible to a Remote Code Execution Vulnerability. If exploited, this vulnerability allows an authenticated user to abuse a SolarWinds service, resulting in remote code execution.\n",
    "published": "2024-02-15T21:15:09.867",
    "keywords": "remote,execution"
  },
  "CVE-2024-23479": {
    "cvss": 9.6,
    "description": "SolarWinds Access Rights Manager (ARM) was found to be susceptible to a Directory Traversal Remote Code Execution Vulnerability. If exploited, this vulnerability allows an unauthenticated user to achieve a Remote Code Execution.\n",
    "published": "2024-02-15T21:15:10.213",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-23674": {
    "cvss": "-",
    "description": "The Online-Ausweis-Funktion eID scheme in the German National Identity card through 2024-02-15 allows authentication bypass by spoofing. A man-in-the-middle attacker can assume a victim's identify for access to government, medical, and financial resources, and can also extract personal data from the card, aka the \"sPACE (Spoofing Password Authenticated Connection Establishment)\" issue. This occurs because of a combination of factors, such as insecure PIN entry (for basic readers) and eid:// deeplinking. The victim must be using a modified eID kernel, which may occur if the victim is tricked into installing a fake version of an official app. NOTE: the BSI position is \"ensuring a secure operational environment at the client side is an obligation of the ID card owner.\"",
    "published": "2024-02-15T23:15:08.827",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-0031": {
    "cvss": "-",
    "description": "In attp_build_read_by_type_value_cmd of att_protocol.cc , there is a possible out of bounds write due to improper input validation. This could lead to remote code execution with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-02-16T02:15:50.763",
    "keywords": "remote,execution"
  },
  "CVE-2024-0034": {
    "cvss": "-",
    "description": "In BackgroundLaunchProcessController, there is a possible way to launch arbitrary activity from the background due to BAL Bypass. This could lead to local escalation of privilege with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-02-16T02:15:50.933",
    "keywords": "execution,bypass"
  },
  "CVE-2024-0036": {
    "cvss": "-",
    "description": "In startNextMatchingActivity of ActivityTaskManagerService.java, there is a possible way to bypass the restrictions on starting activities from the background due to a logic error in the code. This could lead to local escalation of privilege with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-02-16T02:15:51.047",
    "keywords": "execution,bypass"
  },
  "CVE-2024-0040": {
    "cvss": "-",
    "description": "In setParameter of MtpPacket.cpp, there is a possible out of bounds read due to a heap buffer overflow. This could lead to remote information disclosure with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-02-16T02:15:51.203",
    "keywords": "remote,execution"
  },
  "CVE-2024-25415": {
    "cvss": "-",
    "description": "A remote code execution (RCE) vulnerability in /admin/define_language.php of CE Phoenix v1.0.8.20 allows attackers to execute arbitrary PHP code via injecting a crafted payload into the file english.php.",
    "published": "2024-02-16T02:15:51.443",
    "keywords": "remote,execution"
  },
  "CVE-2024-24377": {
    "cvss": "-",
    "description": "An issue in idocv v.14.1.3_20231228 allows a remote attacker to execute arbitrary code and obtain sensitive information via a crafted script.",
    "published": "2024-02-16T09:15:08.603",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-22425": {
    "cvss": 6.5,
    "description": "\nDell RecoverPoint for Virtual Machines 5.3.x contains a brute force/dictionary attack vulnerability. An unauthenticated remote attacker could potentially exploit this vulnerability, leading to launch a brute force attack or a dictionary attack against the RecoverPoint login form. This allows attackers to brute-force the password of valid users in an automated manner.\n\n",
    "published": "2024-02-16T12:15:07.757",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-22426": {
    "cvss": 7.2,
    "description": "\nDell RecoverPoint for Virtual Machines 5.3.x contains an OS Command injection vulnerability. An unauthenticated remote\nattacker could potentially exploit this vulnerability, leading to execute arbitrary operating system commands, which will get executed in the context of the root user, resulting in a complete system compromise.\n\n",
    "published": "2024-02-16T12:15:08.537",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-0017": {
    "cvss": "-",
    "description": "In shouldUseNoOpLocation of CameraActivity.java, there is a possible confused deputy due to a permissions bypass. This could lead to local information disclosure with no additional execution privileges needed. User interaction is needed for exploitation.",
    "published": "2024-02-16T20:15:47.513",
    "keywords": "execution,bypass"
  },
  "CVE-2024-21492": {
    "url": "https://github.com/greenpau/caddy-security/issues/272",
    "cvss": 4.8,
    "description": "All versions of the package github.com/greenpau/caddy-security are vulnerable to Insufficient Session Expiration due to improper user session invalidation upon clicking the \"Sign Out\" button. User sessions remain valid even after requests are sent to /logout and /oauth2/google/logout. Attackers who gain access to an active but supposedly logged-out session can perform unauthorized actions on behalf of the user.",
    "published": "2024-02-17T05:15:08.223"
  },
  "CVE-2024-21493": {
    "url": "https://github.com/greenpau/caddy-security/issues/263",
    "cvss": 5.3,
    "description": "All versions of the package github.com/greenpau/caddy-security are vulnerable to Improper Validation of Array Index when parsing a Caddyfile. Multiple parsing functions in the affected library do not validate whether their input values are nil before attempting to access elements, which can lead to a panic (index out of range). Panics during the parsing of a configuration file may introduce ambiguity and vulnerabilities, hindering the correct interpretation and configuration of the web server.",
    "published": "2024-02-17T05:15:08.747"
  },
  "CVE-2024-21494": {
    "cvss": 5.4,
    "description": "All versions of the package github.com/greenpau/caddy-security are vulnerable to Authentication Bypass by Spoofing via the X-Forwarded-For header due to improper input sanitization. An attacker can spoof an IP address used in the user identity module (/whoami API endpoint). This could lead to unauthorized access if the system trusts this spoofed IP address.",
    "published": "2024-02-17T05:15:09.077",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-21496": {
    "url": "https://github.com/greenpau/caddy-security/issues/267",
    "cvss": 6.1,
    "description": "All versions of the package github.com/greenpau/caddy-security are vulnerable to Cross-site Scripting (XSS) via the Referer header, due to improper input sanitization. Although the Referer header is sanitized by escaping some characters that can allow XSS (e.g., [&], [<], [>], [\"], [']), it does not account for the attack based on the JavaScript URL scheme (e.g., javascript:alert(document.domain)// payload). Exploiting this vulnerability may not be trivial, but it could lead to the execution of malicious scripts in the context of the target user’s browser, compromising user sessions.",
    "published": "2024-02-17T05:15:09.603"
  },
  "CVE-2024-21497": {
    "url": "https://github.com/greenpau/caddy-security/issues/268",
    "cvss": 5.4,
    "description": "All versions of the package github.com/greenpau/caddy-security are vulnerable to Open Redirect via the redirect_url parameter. An attacker could perform a phishing attack and trick users into visiting a malicious website by crafting a convincing URL with this parameter. To exploit this vulnerability, the user must take an action, such as clicking on a portal button or using the browser’s back button, to trigger the redirection.",
    "published": "2024-02-17T05:15:09.863"
  },
  "CVE-2024-21498": {
    "url": "https://github.com/greenpau/caddy-security/issues/269",
    "cvss": 5.3,
    "description": "All versions of the package github.com/greenpau/caddy-security are vulnerable to Server-side Request Forgery (SSRF) via X-Forwarded-Host header manipulation. An attacker can expose sensitive information, interact with internal services, or exploit other vulnerabilities within the network by exploiting this vulnerability.",
    "published": "2024-02-17T05:15:10.087"
  },
  "CVE-2024-21499": {
    "url": "https://github.com/greenpau/caddy-security/issues/270",
    "cvss": 4.3,
    "description": "All versions of the package github.com/greenpau/caddy-security are vulnerable to HTTP Header Injection via the X-Forwarded-Proto header due to redirecting to the injected protocol.Exploiting this vulnerability could lead to bypass of security mechanisms or confusion in handling TLS.",
    "published": "2024-02-17T05:15:10.400"
  },
  "CVE-2024-21500": {
    "cvss": 4.8,
    "description": "All versions of the package github.com/greenpau/caddy-security are vulnerable to Improper Restriction of Excessive Authentication Attempts via the two-factor authentication (2FA). Although the application blocks the user after several failed attempts to provide 2FA codes, attackers can bypass this blocking mechanism by automating the application’s full multistep 2FA process.",
    "published": "2024-02-17T05:15:10.697",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-25297": {
    "cvss": "-",
    "description": "Cross Site Scripting (XSS) vulnerability in Bludit CMS version 3.15, allows remote attackers to execute arbitrary code and obtain sensitive information via edit-content.php.",
    "published": "2024-02-17T06:15:53.653",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-0610": {
    "cvss": 9.8,
    "description": "The Piraeus Bank WooCommerce Payment Gateway plugin for WordPress is vulnerable to time-based blind SQL Injection via the 'MerchantReference' parameter in all versions up to, and including, 1.6.5.1 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-02-17T08:15:07.680",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-1512": {
    "cvss": 9.8,
    "description": "The MasterStudy LMS WordPress Plugin – for Online Courses and Education plugin for WordPress is vulnerable to union based SQL Injection via the 'user' parameter of the /lms/stm-lms/order/items REST route in all versions up to, and including, 3.2.5 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-02-17T08:15:08.093",
    "keywords": "unauthenticated,sensitive"
  }
}