{
  "CVE-2024-36389": {
    "cvss": 9.8,
    "description": "MileSight DeviceHub - \n\n\n\n\n\nCWE-330 Use of Insufficiently Random Values may allow Authentication Bypass",
    "published": "2024-06-02T14:15:08.933",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-36391": {
    "cvss": 9.1,
    "description": "MileSight DeviceHub - CWE-320: Key Management Errors may allow Authentication Bypass and Man-In-The-Middle Traffic",
    "published": "2024-06-02T14:15:09.413",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-20066": {
    "cvss": "-",
    "description": "In modem, there is a possible out of bounds write due to an incorrect bounds check. This could lead to remote denial of service with no additional execution privileges needed. User interaction is no needed for exploitation. Patch ID: MOLY01267281; Issue ID: MSV-1477.",
    "published": "2024-06-03T02:15:08.630",
    "keywords": "remote,execution"
  },
  "CVE-2024-20067": {
    "cvss": "-",
    "description": "In modem, there is a possible out of bounds write due to improper input invalidation. This could lead to remote denial of service with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: MOLY01267285; Issue ID: MSV-1462.",
    "published": "2024-06-03T02:15:08.770",
    "keywords": "remote,execution"
  },
  "CVE-2024-20068": {
    "cvss": "-",
    "description": "In modem, there is a possible system crash due to improper input validation. This could lead to remote denial of service with no additional execution privileges needed. User interaction is no needed for exploitation. Patch ID: MOLY01270721; Issue ID: MSV-1479.",
    "published": "2024-06-03T02:15:08.873",
    "keywords": "remote,execution"
  },
  "CVE-2024-20069": {
    "cvss": "-",
    "description": "In modem, there is a possible selection of less-secure algorithm during the VoWiFi IKE due to a missing DH downgrade check. This could lead to remote information disclosure with no additional execution privileges needed. User interaction is needed for exploitation. Patch ID: MOLY01286330; Issue ID: MSV-1430.",
    "published": "2024-06-03T02:15:08.977",
    "keywords": "remote,execution"
  },
  "CVE-2024-20070": {
    "cvss": "-",
    "description": "In modem, there is a possible information disclosure due to using risky cryptographic algorithm during connection establishment negotiation. This could lead to remote information disclosure, when weak encryption algorithm is used, with no additional execution privileges needed. User interaction is not needed for exploitation. Patch ID: MOLY00942482; Issue ID: MSV-1469.",
    "published": "2024-06-03T02:15:09.093",
    "keywords": "remote,execution"
  },
  "CVE-2024-36042": {
    "cvss": "-",
    "description": "Silverpeas before 6.3.5 allows authentication bypass by omitting the Password field to AuthenticationServlet, often providing an unauthenticated user with superadmin access.",
    "published": "2024-06-03T06:15:09.293",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-5311": {
    "cvss": 9.8,
    "description": "DigiWin EasyFlow .NET lacks validation for certain input parameters. An unauthenticated remote attacker can inject arbitrary SQL commands to read, modify, and delete database records.",
    "published": "2024-06-03T07:15:10.163",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-23107": {
    "cvss": 5.5,
    "description": "An exposure of sensitive information to an unauthorized actor vulnerability [CWE-200] in FortiWeb version 7.4.0, version 7.2.4 and below, version 7.0.8 and below, 6.3 all versions may allow an authenticated attacker to read password hashes of other administrators via CLI commands.",
    "published": "2024-06-03T08:15:08.837",
    "keywords": "command,sensitive"
  },
  "CVE-2024-5404": {
    "cvss": 9.8,
    "description": "An unauthenticated remote attacker can change the admin password in a moneo appliance due to weak password recovery mechanism.\n",
    "published": "2024-06-03T09:15:10.193",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-3829": {
    "url": "https://github.com/qdrant/qdrant/commit/ee7a31ec3459a6a4219200234615c1817ab82260",
    "cvss": 9.8,
    "description": "qdrant/qdrant version 1.9.0-dev is vulnerable to arbitrary file read and write during the snapshot recovery process. Attackers can exploit this vulnerability by manipulating snapshot files to include symlinks, leading to arbitrary file read by adding a symlink that points to a desired file on the filesystem and arbitrary file write by including a symlink and a payload file in the snapshot's directory structure. This vulnerability allows for the reading and writing of arbitrary files on the server, which could potentially lead to a full takeover of the system. The issue is fixed in version v1.9.0.",
    "published": "2024-06-03T10:15:14.267"
  },
  "CVE-2024-36674": {
    "url": "https://github.com/lylme/lylme_spage/issues/91",
    "cvss": "-",
    "description": "LyLme_spage v1.9.5 is vulnerable to Cross Site Scripting (XSS) via admin/link.php.",
    "published": "2024-06-03T16:15:08.897"
  },
  "CVE-2024-4332": {
    "cvss": "-",
    "description": "An authentication bypass vulnerability has been identified in the REST and SOAP API components of Tripwire Enterprise (TE) 9.1.0 when TE is configured to use LDAP/Active Directory SAML authentication and its optional \"Auto-synchronize LDAP Users, Roles, and Groups\" feature is enabled. This vulnerability allows unauthenticated attackers to bypass authentication if a valid username is known. Exploitation of this vulnerability could allow remote attackers to gain privileged access to the APIs and lead to unauthorized information disclosure or modification.",
    "published": "2024-06-03T18:15:09.060",
    "keywords": "remote,unauthenticated,authentication,bypass"
  },
  "CVE-2024-31684": {
    "cvss": "-",
    "description": "Incorrect access control in the fingerprint authentication mechanism of Bitdefender Mobile Security v4.11.3-gms allows attackers to bypass fingerprint authentication due to the use of a deprecated API.",
    "published": "2024-06-03T19:15:09.260",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-31682": {
    "cvss": "-",
    "description": "Incorrect access control in the fingerprint authentication mechanism of Phone Cleaner: Boost & Clean v2.2.0 allows attackers to bypass fingerprint authentication due to the use of a deprecated API.",
    "published": "2024-06-03T20:15:09.010",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-34987": {
    "cvss": "-",
    "description": "A SQL Injection vulnerability exists in the `ofrs/admin/index.php` script of PHPGurukul Online Fire Reporting System 1.2. The vulnerability allows attackers to bypass authentication and gain unauthorized access by injecting SQL commands into the username input field during the login process.",
    "published": "2024-06-03T20:15:09.273",
    "keywords": "authentication,command,bypass"
  },
  "CVE-2024-29972": {
    "cvss": 9.8,
    "description": "** UNSUPPORTED WHEN ASSIGNED **\nThe command injection vulnerability in the CGI program \"remote_help-cgi\" in Zyxel NAS326 firmware versions before V5.21(AAZF.17)C0 and NAS542 firmware versions before V5.21(ABAG.14)C0 could allow an unauthenticated attacker to execute some operating system (OS) commands by sending a crafted HTTP POST request.",
    "published": "2024-06-04T02:15:47.960",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-29973": {
    "cvss": 9.8,
    "description": "** UNSUPPORTED WHEN ASSIGNED **\nThe command injection vulnerability in the “setCookie” parameter in Zyxel NAS326 firmware versions before V5.21(AAZF.17)C0 and NAS542 firmware versions before V5.21(ABAG.14)C0 could allow an unauthenticated attacker to execute some operating system (OS) commands by sending a crafted HTTP POST request.",
    "published": "2024-06-04T02:15:48.290",
    "keywords": "unauthenticated,command"
  },
  "CVE-2024-29974": {
    "cvss": 9.8,
    "description": "** UNSUPPORTED WHEN ASSIGNED **\nThe remote code execution vulnerability in the CGI program “file_upload-cgi” in Zyxel NAS326 firmware versions before V5.21(AAZF.17)C0 and NAS542 firmware versions before V5.21(ABAG.14)C0 could allow an unauthenticated attacker to execute arbitrary code by uploading a crafted configuration file to a vulnerable device.",
    "published": "2024-06-04T02:15:48.517",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-4552": {
    "cvss": 9.8,
    "description": "The Social Login Lite For WooCommerce plugin for WordPress is vulnerable to authentication bypass in versions up to, and including, 1.6.0. This is due to insufficient verification on the user being supplied during the social login through the plugin. This makes it possible for unauthenticated attackers to log in as any existing user on the site, such as an administrator, if they have access to the email.",
    "published": "2024-06-04T02:15:49.417",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-1718": {
    "cvss": 5.3,
    "description": "The Claudio Sanches – Checkout Cielo for WooCommerce plugin for WordPress is vulnerable to unauthorized modification of data due to insufficient payment validation in the update_order_status() function in all versions up to, and including, 1.1.0. This makes it possible for unauthenticated attackers to update the status of orders to paid bypassing payment.",
    "published": "2024-06-04T06:15:09.180",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2024-2382": {
    "cvss": 5.3,
    "description": "The Authorize.net Payment Gateway For WooCommerce plugin for WordPress is vulnerable to payment bypass in all versions up to, and including, 8.0. This is due to the plugin not properly verifying the authenticity of the request that updates a orders payment status. This makes it possible for unauthenticated attackers to update order payment statuses to paid bypassing any payment.",
    "published": "2024-06-04T06:15:09.677",
    "keywords": "unauthenticated,bypass"
  },
  "CVE-2024-4253": {
    "cvss": 7.5,
    "description": "A command injection vulnerability exists in the gradio-app/gradio repository, specifically within the 'test-functional.yml' workflow. The vulnerability arises due to improper neutralization of special elements used in a command, allowing for unauthorized modification of the base repository or secrets exfiltration. The issue affects versions up to and including '@gradio/video@0.6.12'. The flaw is present in the workflow's handling of GitHub context information, where it echoes the full name of the head repository, the head branch, and the workflow reference without adequate sanitization. This could potentially lead to the exfiltration of sensitive secrets such as 'GITHUB_TOKEN', 'COMMENT_TOKEN', and 'CHROMATIC_PROJECT_TOKEN'.",
    "published": "2024-06-04T08:15:10.863",
    "keywords": "command,sensitive"
  },
  "CVE-2024-5000": {
    "cvss": 7.5,
    "description": "An unauthenticated remote attacker can use a malicious OPC UA client to send a crafted request to affected CODESYS products which can cause a DoS due to incorrect calculation of buffer size.\n\n",
    "published": "2024-06-04T09:15:09.830",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-37061": {
    "cvss": 8.8,
    "description": "Remote Code Execution can occur in versions of the MLflow platform running version 1.11.0 or newer, enabling a maliciously crafted MLproject to execute arbitrary code on an end user’s system when run.",
    "published": "2024-06-04T12:15:12.703",
    "keywords": "remote,execution"
  },
  "CVE-2024-4254": {
    "cvss": 7.1,
    "description": "The 'deploy-website.yml' workflow in the gradio-app/gradio repository, specifically in the 'main' branch, is vulnerable to secrets exfiltration due to improper authorization. The vulnerability arises from the workflow's explicit checkout and execution of code from a fork, which is unsafe as it allows the running of untrusted code in an environment with access to push to the base repository and access secrets. This flaw could lead to the exfiltration of sensitive secrets such as GITHUB_TOKEN, HF_TOKEN, VERCEL_ORG_ID, VERCEL_PROJECT_ID, COMMENT_TOKEN, AWSACCESSKEYID, AWSSECRETKEY, and VERCEL_TOKEN. The vulnerability is present in the workflow file located at https://github.com/gradio-app/gradio/blob/72f4ca88ab569aae47941b3fb0609e57f2e13a27/.github/workflows/deploy-website.yml.",
    "published": "2024-06-04T12:15:13.710",
    "keywords": "execution,sensitive"
  },
  "CVE-2024-36800": {
    "cvss": "-",
    "description": "A SQL injection vulnerability in SEMCMS v.4.8, allows a remote attacker to obtain sensitive information via the ID parameter in Download.php.",
    "published": "2024-06-04T13:15:52.740",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-36801": {
    "cvss": "-",
    "description": "A SQL injection vulnerability in SEMCMS v.4.8, allows a remote attacker to obtain sensitive information via the lgid parameter in Download.php.",
    "published": "2024-06-04T13:15:52.857",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-36675": {
    "url": "https://github.com/lylme/lylme_spage/issues/92",
    "cvss": "-",
    "description": "LyLme_spage v1.9.5 is vulnerable to Server-Side Request Forgery (SSRF) via the get_head function.",
    "published": "2024-06-04T22:15:10.740"
  }
}