{
  "CVE-2024-42657": {
    "cvss": 7.5,
    "description": "An issue in wishnet Nepstech Wifi Router NTPL-XPON1GFEVN v1.0 allows a remote attacker to obtain sensitive information via the lack of encryption during login process",
    "published": "2024-08-19T17:15:07.967",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-42658": {
    "cvss": 9.8,
    "description": "An issue in wishnet Nepstech Wifi Router NTPL-XPON1GFEVN v1.0 allows a remote attacker to obtain sensitive information via the cookie's parameter",
    "published": "2024-08-19T17:15:08.027",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-7592": {
    "url": "https://github.com/python/cpython/pull/123075",
    "cvss": 7.5,
    "description": "There is a LOW severity vulnerability affecting CPython, specifically the\n'http.cookies' standard library module.\n\n\nWhen parsing cookies that contained backslashes for quoted characters in\nthe cookie value, the parser would use an algorithm with quadratic\ncomplexity, resulting in excess CPU resources being used while parsing the\nvalue.",
    "published": "2024-08-19T19:15:08.180"
  },
  "CVE-2024-42812": {
    "cvss": "-",
    "description": "In D-Link DIR-860L v2.03, there is a buffer overflow vulnerability due to the lack of length verification for the SID field in gena.cgi. Attackers who successfully exploit this vulnerability can cause the remote target device to crash or execute arbitrary commands.",
    "published": "2024-08-19T20:15:07.070",
    "keywords": "remote,command"
  },
  "CVE-2024-42813": {
    "cvss": 9.8,
    "description": "In TRENDnet TEW-752DRU FW1.03B01, there is a buffer overflow vulnerability due to the lack of length verification for the service field in gena.cgi. Attackers who successfully exploit this vulnerability can cause the remote target device to crash or execute arbitrary commands.",
    "published": "2024-08-19T20:15:07.147",
    "keywords": "remote,command"
  },
  "CVE-2024-42815": {
    "cvss": 9.8,
    "description": "In the TP-Link RE365 V1_180213, there is a buffer overflow vulnerability due to the lack of length verification for the USER_AGENT field in /usr/bin/httpd. Attackers who successfully exploit this vulnerability can cause the remote target device to crash or execute arbitrary commands.",
    "published": "2024-08-19T20:15:07.193",
    "keywords": "remote,command"
  },
  "CVE-2024-5932": {
    "cvss": 10.0,
    "description": "The GiveWP – Donation Plugin and Fundraising Platform plugin for WordPress is vulnerable to PHP Object Injection in all versions up to, and including, 3.14.1 via deserialization of untrusted input from the 'give_title' parameter. This makes it possible for unauthenticated attackers to inject a PHP Object. The additional presence of a POP chain allows attackers to execute code remotely, and to delete arbitrary files.",
    "published": "2024-08-20T02:15:04.240",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-7777": {
    "cvss": 9.0,
    "description": "The Contact Form by Bit Form: Multi Step Form, Calculation Contact Form, Payment Contact Form & Custom Contact Form builder plugin for WordPress is vulnerable to arbitrary file read and deletion due to insufficient file path validation in multiple functions in versions 2.0 to 2.13.9. This makes it possible for authenticated attackers, with Administrator-level access and above, to read and delete arbitrary files on the server, which can easily lead to remote code execution when the right file is deleted (such as wp-config.php).",
    "published": "2024-08-20T04:15:10.363",
    "keywords": "remote,execution"
  },
  "CVE-2024-7782": {
    "cvss": 8.7,
    "description": "The Contact Form by Bit Form: Multi Step Form, Calculation Contact Form, Payment Contact Form & Custom Contact Form builder plugin for WordPress is vulnerable to arbitrary file deletion due to insufficient file path validation in the iconRemove function in versions 2.0 to 2.13.4. This makes it possible for authenticated attackers, with Administrator-level access and above, to delete arbitrary files on the server, which can easily lead to remote code execution when the right file is deleted (such as wp-config.php).",
    "published": "2024-08-20T04:15:11.203",
    "keywords": "remote,execution"
  },
  "CVE-2024-43688": {
    "url": "https://github.com/vixie/cron/commit/9cc8ab1087bb9ab861dd5595c41200683c9f6712",
    "cvss": "-",
    "description": "cron/entry.c in vixie cron before 9cc8ab1, as used in OpenBSD 7.4 and 7.5, allows a heap-based buffer underflow and memory corruption. NOTE: this issue was introduced during a May 2023 refactoring.",
    "published": "2024-08-20T06:15:04.983"
  },
  "CVE-2024-43202": {
    "cvss": 9.8,
    "description": "Exposure of Remote Code Execution in Apache Dolphinscheduler.\n\nThis issue affects Apache DolphinScheduler: before 3.2.2. \n\nWe recommend users to upgrade Apache DolphinScheduler to version 3.2.2, which fixes the issue.",
    "published": "2024-08-20T08:15:05.240",
    "keywords": "remote,execution"
  },
  "CVE-2024-21689": {
    "cvss": 7.6,
    "description": "This High severity RCE (Remote Code Execution) vulnerability CVE-2024-21689  was introduced in versions 9.1.0, 9.2.0, 9.3.0, 9.4.0, 9.5.0, and 9.6.0 of Bamboo Data Center and Server.\r\n\r\nThis RCE (Remote Code Execution) vulnerability, with a CVSS Score of 7.6, allows an authenticated attacker to execute arbitrary code which has high impact to confidentiality, high impact to integrity, high impact to availability, and requires user interaction.\r\n\r\nAtlassian recommends that Bamboo Data Center and Server customers upgrade to latest version, if you are unable to do so, upgrade your instance to one of the specified supported fixed versions:\r\n Bamboo Data Center and Server 9.2: Upgrade to a release greater than or equal to 9.2.17\r\n\r\n Bamboo Data Center and Server 9.6: Upgrade to a release greater than or equal to 9.6.5\r\n\r\nSee the release notes ([https://confluence.atlassian.com/bambooreleases/bamboo-release-notes-1189793869.html]). You can download the latest version of Bamboo Data Center and Server from the download center ([https://www.atlassian.com/software/bamboo/download-archives]).\r\n\r\nThis vulnerability was reported via our Bug Bounty program.",
    "published": "2024-08-20T10:15:04.103",
    "keywords": "remote,execution"
  },
  "CVE-2024-33872": {
    "cvss": 9.8,
    "description": "Keyfactor Command 10.5.x before 10.5.1 and 11.5.x before 11.5.1 allows SQL Injection which could result in code execution and escalation of privileges.",
    "published": "2024-08-20T14:15:08.750",
    "keywords": "execution,command"
  },
  "CVE-2024-39094": {
    "url": "https://github.com/friendica/friendica/issues/14220",
    "cvss": 5.4,
    "description": "Friendica 2024.03 is vulnerable to Cross Site Scripting (XSS) in settings/profile via the homepage, xmpp, and matrix parameters.",
    "published": "2024-08-20T14:15:09.330"
  },
  "CVE-2024-39690": {
    "url": "https://github.com/projectcapsule/capsule/commit/d620b0457ddec01616b8eab8512a10611611f584",
    "cvss": 8.8,
    "description": "Capsule is a multi-tenancy and policy-based framework for Kubernetes. In Capsule v0.7.0 and earlier, the tenant-owner can patch any arbitrary namespace that has not been taken over by a tenant (i.e., namespaces without the ownerReference field), thereby gaining control of that namespace.",
    "published": "2024-08-20T15:15:21.340"
  },
  "CVE-2024-42662": {
    "cvss": "-",
    "description": "An issue in apollocongif apollo v.2.2.0 allows a remote attacker to obtain sensitive information via a crafted request.",
    "published": "2024-08-20T15:15:23.090",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-43406": {
    "url": "https://github.com/lf-edge/ekuiper/commit/1a9c745649438feaac357d282959687012b65503",
    "cvss": 8.8,
    "description": "LF Edge eKuiper is a lightweight IoT data analytics and stream processing engine running on resource-constraint edge devices. A user could utilize and exploit SQL Injection to allow the execution of malicious SQL query via Get method in sqlKvStore. This vulnerability is fixed in 1.14.2.",
    "published": "2024-08-20T15:15:24.070"
  },
  "CVE-2024-42598": {
    "cvss": "-",
    "description": "SeaCMS 13.0 has a remote code execution vulnerability. The reason for this vulnerability is that although admin_editplayer.php imposes restrictions on edited files, attackers can still bypass these restrictions and write code, allowing authenticated attackers to exploit the vulnerability to execute arbitrary commands and gain system privileges.",
    "published": "2024-08-20T16:15:11.727",
    "keywords": "remote,execution,command,bypass"
  },
  "CVE-2024-42363": {
    "cvss": 8.8,
    "description": "Prior to 3385, the user-controlled role parameter enters the application in the Kubernetes::RoleVerificationsController. The role parameter flows into the RoleConfigFile initializer and then into the Kubernetes::Util.parse_file method where it is unsafely deserialized using the YAML.load_stream method. This issue may lead to Remote Code Execution (RCE). This vulnerability is fixed in 3385.",
    "published": "2024-08-20T21:15:14.543",
    "keywords": "remote,execution"
  },
  "CVE-2024-5880": {
    "cvss": 4.3,
    "description": "The Hide My Site plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 2.2 due to the plugin not restricting access to the REST API when password protection is enabled. This makes it possible for unauthenticated attackers to gain unauthorized access to the site.",
    "published": "2024-08-21T06:15:07.633",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-7651": {
    "cvss": 5.6,
    "description": "The App Builder – Create Native Android & iOS Apps On The Flight plugin for WordPress is vulnerable to limited SQL Injection via the ‘app-builder-search’ parameter in all versions up to, and including, 4.2.6 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-08-21T06:15:12.830",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-7854": {
    "cvss": 10.0,
    "description": "The Woo Inquiry plugin for WordPress is vulnerable to SQL Injection in all versions up to, and including, 0.1 due to insufficient escaping on the user supplied parameter 'dbid' and lack of sufficient preparation on the existing SQL query. This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-08-21T06:15:13.423",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-5335": {
    "cvss": 9.8,
    "description": "The Ultimate Store Kit Elementor Addons, Woocommerce Builder, EDD Builder, Elementor Store Builder, Product Grid, Product Table, Woocommerce Slider plugin is vulnerable to PHP Object Injection via deserialization of untrusted input via the _ultimate_store_kit_compare_products cookie in versions up to , and including, 1.6.4. This makes it possible for an unauthenticated attacker to inject a PHP Object.\r\n\r\nNo POP chain is present in the vulnerable plugin. If a POP chain is present via an additional plugin or theme installed on the target system, it could allow the attacker or above to delete arbitrary files, retrieve sensitive data, or execute code.",
    "published": "2024-08-21T09:15:04.563",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-6811": {
    "cvss": 7.8,
    "description": "IrfanView WSQ File Parsing Out-Of-Bounds Write Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of IrfanView. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of WSQ files. The issue results from the lack of proper validation of user-supplied data, which can result in a write past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-24192.",
    "published": "2024-08-21T16:15:08.783",
    "keywords": "remote,execution"
  },
  "CVE-2024-6812": {
    "cvss": 7.8,
    "description": "IrfanView WSQ File Parsing Out-Of-Bounds Write Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of IrfanView. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of WSQ files. The issue results from the lack of proper validation of user-supplied data, which can result in a write past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-23273.",
    "published": "2024-08-21T16:15:08.970",
    "keywords": "remote,execution"
  },
  "CVE-2024-6813": {
    "cvss": 8.8,
    "description": "NETGEAR ProSAFE Network Management System getSortString SQL Injection Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of NETGEAR ProSAFE Network Management System. Authentication is required to exploit this vulnerability.\n\nThe specific flaw exists within the getSortString method. The issue results from the lack of proper validation of a user-supplied string before using it to construct SQL queries. An attacker can leverage this vulnerability to execute code in the context of SYSTEM. Was ZDI-CAN-23207.",
    "published": "2024-08-21T16:15:09.163",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2024-6814": {
    "cvss": 8.8,
    "description": "NETGEAR ProSAFE Network Management System getFilterString SQL Injection Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of NETGEAR ProSAFE Network Management System. Authentication is required to exploit this vulnerability.\n\nThe specific flaw exists within the getFilterString method. The issue results from the lack of proper validation of a user-supplied string before using it to construct SQL queries. An attacker can leverage this vulnerability to execute code in the context of SYSTEM. Was ZDI-CAN-23399.",
    "published": "2024-08-21T16:15:09.357",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2024-7600": {
    "cvss": 7.1,
    "description": "Logsign Unified SecOps Platform Directory Traversal Arbitrary File Deletion Vulnerability. This vulnerability allows remote attackers to delete arbitrary files on affected installations of Logsign Unified SecOps Platform. Authentication is required to exploit this vulnerability.\n\nThe specific flaw exists within the HTTP API service, which listens on TCP port 443 by default. The issue results from the lack of proper validation of a user-supplied path prior to using it in file operations. An attacker can leverage this vulnerability to delete files in the context of root. Was ZDI-CAN-25025.",
    "published": "2024-08-21T16:15:09.570",
    "keywords": "remote,authentication"
  },
  "CVE-2024-7601": {
    "cvss": 7.1,
    "description": "Logsign Unified SecOps Platform Directory data_export_delete_all Traversal Arbitrary File Deletion Vulnerability. This vulnerability allows remote attackers to delete arbitrary files on affected installations of Logsign Unified SecOps Platform. Authentication is required to exploit this vulnerability.\n\nThe specific flaw exists within the HTTP API service, which listens on TCP port 443 by default. The issue results from the lack of proper validation of a user-supplied path prior to using it in file operations. An attacker can leverage this vulnerability to delete files in the context of root. Was ZDI-CAN-25026.",
    "published": "2024-08-21T16:15:09.757",
    "keywords": "remote,authentication"
  },
  "CVE-2024-7602": {
    "cvss": 6.5,
    "description": "Logsign Unified SecOps Platform Directory Traversal Information Disclosure Vulnerability. This vulnerability allows remote attackers to disclose sensitive information on affected installations of Logsign Unified SecOps Platform. Authentication is required to exploit this vulnerability.\n\nThe specific flaw exists within the HTTP API service, which listens on TCP port 443 by default. The issue results from the lack of proper validation of a user-supplied path prior to using it in file operations. An attacker can leverage this vulnerability to disclose information in the context of root. Was ZDI-CAN-25027.",
    "published": "2024-08-21T16:15:09.940",
    "keywords": "remote,authentication,sensitive"
  },
  "CVE-2024-7603": {
    "cvss": 7.1,
    "description": "Logsign Unified SecOps Platform Directory Traversal Arbitrary Directory Deletion Vulnerability. This vulnerability allows remote attackers to delete arbitrary directories on affected installations of Logsign Unified SecOps Platform. Authentication is required to exploit this vulnerability.\n\nThe specific flaw exists within the HTTP API service, which listens on TCP port 443 by default. The issue results from the lack of proper validation of a user-supplied path prior to using it in file operations. An attacker can leverage this vulnerability to delete directories in the context of root. Was ZDI-CAN-25028.",
    "published": "2024-08-21T16:15:10.123",
    "keywords": "remote,authentication"
  },
  "CVE-2024-7604": {
    "cvss": 5.1,
    "description": "Logsign Unified SecOps Platform Incorrect Authorization Authentication Bypass Vulnerability. This vulnerability allows local attackers to bypass authentication on affected installations of Logsign Unified SecOps Platform. Authentication is required to exploit this vulnerability.\n\nThe specific flaw exists within the HTTP API service, which listens on TCP port 443 by default. The issue results from the lack of proper validation of the user's license expiration date. An attacker can leverage this vulnerability to bypass authentication on the system. Was ZDI-CAN-25029.",
    "published": "2024-08-21T16:15:10.330",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-7722": {
    "cvss": 3.3,
    "description": "Foxit PDF Reader Doc Object Use-After-Free Information Disclosure Vulnerability. This vulnerability allows remote attackers to disclose sensitive information on affected installations of Foxit PDF Reader. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the handling of Doc objects. The issue results from the lack of validating the existence of an object prior to performing operations on the object. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-23702.",
    "published": "2024-08-21T16:15:10.580",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-7723": {
    "cvss": 7.8,
    "description": "Foxit PDF Reader AcroForm Use-After-Free Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Foxit PDF Reader. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the handling of AcroForms. The issue results from the lack of validating the existence of an object prior to performing operations on the object. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-23736.",
    "published": "2024-08-21T16:15:10.760",
    "keywords": "remote,execution"
  },
  "CVE-2024-7724": {
    "cvss": 7.8,
    "description": "Foxit PDF Reader AcroForm Use-After-Free Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Foxit PDF Reader. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the handling of AcroForms. The issue results from the lack of validating the existence of an object prior to performing operations on the object. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-23900.",
    "published": "2024-08-21T16:15:10.933",
    "keywords": "remote,execution"
  },
  "CVE-2024-7725": {
    "cvss": 7.8,
    "description": "Foxit PDF Reader AcroForm Use-After-Free Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Foxit PDF Reader. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the handling of AcroForms. The issue results from the lack of validating the existence of an object prior to performing operations on the object. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-23928.",
    "published": "2024-08-21T16:15:11.120",
    "keywords": "remote,execution"
  },
  "CVE-2024-7795": {
    "cvss": 8.8,
    "description": "Autel MaxiCharger AC Elite Business C50 AppAuthenExchangeRandomNum Stack-Based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of Autel MaxiCharger AC Elite Business C50 EV chargers. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the handling of the AppAuthenExchangeRandomNum BLE command. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a fixed-length stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of the device. Was ZDI-CAN-23384.",
    "published": "2024-08-21T16:15:11.380",
    "keywords": "remote,execution,authentication,command"
  },
  "CVE-2024-20375": {
    "cvss": 8.6,
    "description": "A vulnerability in the SIP call processing function of Cisco Unified Communications Manager (Unified CM) and Cisco Unified Communications Manager Session Management Edition (Unified CM SME) could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition on an affected device.\r\n\r This vulnerability is due to improper parsing of SIP messages. An attacker could exploit this vulnerability by sending a crafted SIP message to an affected Cisco Unified CM or Cisco Unified CM SME device. A successful exploit could allow the attacker to cause the device to reload, resulting in a DoS condition that interrupts the communications of reliant voice and video devices.",
    "published": "2024-08-21T17:15:07.303",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-33656": {
    "cvss": 7.8,
    "description": "The DXE module SmmComputrace contains a vulnerability that allows local attackers to leak stack or global memory. This could lead to privilege escalation, arbitrary code execution, and bypassing OS security mechanisms",
    "published": "2024-08-21T17:15:07.567",
    "keywords": "execution,bypass,leak"
  },
  "CVE-2024-5723": {
    "cvss": 8.8,
    "description": "Centreon updateServiceHost SQL Injection Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Centreon. Authentication is required to exploit this vulnerability.\n\nThe specific flaw exists within the updateServiceHost function. The issue results from the lack of proper validation of a user-supplied string before using it to construct SQL queries. An attacker can leverage this vulnerability to execute code in the context of the apache user. Was ZDI-CAN-23294.",
    "published": "2024-08-21T17:15:08.413",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2024-5725": {
    "cvss": 8.8,
    "description": "Centreon initCurveList SQL Injection Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Centreon. Authentication is required to exploit this vulnerability.\n\nThe specific flaw exists within the initCurveList function. The issue results from the lack of proper validation of a user-supplied string before using it to construct SQL queries. An attacker can leverage this vulnerability to execute code in the context of the apache user. Was ZDI-CAN-22683.",
    "published": "2024-08-21T17:15:08.607",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2024-5762": {
    "cvss": 8.1,
    "description": "Zen Cart findPluginAdminPage Local File Inclusion Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Zen Cart. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the findPluginAdminPage function. The issue results from the lack of proper validation of user-supplied data prior to passing it to a PHP include function. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the service account. Was ZDI-CAN-21408.",
    "published": "2024-08-21T17:15:08.810",
    "keywords": "remote,execution,authentication"
  },
  "CVE-2024-7448": {
    "cvss": 8.0,
    "description": "Magnet Forensics AXIOM Command Injection Remote Code Execution Vulnerability. This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of Magnet Forensics AXIOM. User interaction is required to exploit this vulnerability in that the target must acquire data from a malicious mobile device.\n\nThe specific flaw exists within the Android device image acquisition functionality. The issue results from the lack of proper validation of a user-supplied string before using it to execute a system call. An attacker can leverage this vulnerability to execute code in the context of the current user. Was ZDI-CAN-23964.",
    "published": "2024-08-21T17:15:09.860",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-42781": {
    "cvss": 9.8,
    "description": "A SQL injection vulnerability in \"/music/ajax.php?action=login\" of Kashipara Music Management System v1.0 allows remote attackers to execute arbitrary SQL commands and bypass Login via the email parameter.",
    "published": "2024-08-21T18:15:10.227",
    "keywords": "remote,command,bypass"
  },
  "CVE-2024-20488": {
    "cvss": 6.1,
    "description": "A vulnerability in the web-based management interface of Cisco Unified Communications Manager (Unified CM) and Cisco Unified Communications Manager Session Management Edition (Unified CM SME) could allow an unauthenticated, remote attacker to conduct a cross-site scripting (XSS) attack against a user of the interface.\r\n\r\nThis vulnerability exists because the web-based management interface does not properly validate user-supplied input. An attacker could exploit this vulnerability by persuading a user of the interface to click a crafted link. A successful exploit could allow the attacker to execute arbitrary script code in the context of the affected interface or access sensitive, browser-based information.",
    "published": "2024-08-21T19:15:13.163",
    "keywords": "remote,unauthenticated,sensitive"
  },
  "CVE-2024-20466": {
    "cvss": 6.5,
    "description": "A vulnerability in the web-based management interface of Cisco Identity Services Engine (ISE) could allow an authenticated, remote attacker to obtain sensitive information from an affected device.\r\n\r\nThis vulnerability is due to improper enforcement of administrative privilege levels for high-value sensitive data. An attacker with read-only Administrator privileges for the web-based management interface on an affected device could exploit this vulnerability by browsing to a page that contains sensitive data. A successful exploit could allow the attacker to collect sensitive information regarding the configuration of the system.",
    "published": "2024-08-21T20:15:08.737",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-20486": {
    "cvss": 6.5,
    "description": "A vulnerability in the web-based management interface of Cisco Identity Services Engine (ISE) could allow an unauthenticated, remote attacker to conduct a cross-site request forgery (CSRF) attack and perform arbitrary actions on an affected device.\r\n\r\nThis vulnerability is due to insufficient CSRF protections for the web-based management interface of an affected device. An attacker could exploit this vulnerability by persuading a user of the interface to follow a crafted link. A successful exploit could allow the attacker to perform arbitrary actions on the affected device with the privileges of the targeted user.",
    "published": "2024-08-21T20:15:08.933",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-6386": {
    "cvss": 9.9,
    "description": "The WPML plugin for WordPress is vulnerable to Remote Code Execution in all versions up to, and including, 4.6.12 via the Twig Server-Side Template Injection. This is due to missing input validation and sanitization on the render function. This makes it possible for authenticated attackers, with Contributor-level access and above, to execute code on the server.",
    "published": "2024-08-21T21:15:08.577",
    "keywords": "remote,execution"
  },
  "CVE-2024-7978": {
    "cvss": "-",
    "description": "Insufficient policy enforcement in Data Transfer in Google Chrome prior to 128.0.6613.84 allowed a remote attacker who convinced a user to engage in specific UI gestures to leak cross-origin data via a crafted HTML page. (Chromium security severity: Medium)",
    "published": "2024-08-21T21:15:09.697",
    "keywords": "remote,leak"
  },
  "CVE-2024-28987": {
    "cvss": 9.1,
    "description": "The SolarWinds Web Help Desk (WHD) software is affected by a hardcoded credential vulnerability, allowing remote unauthenticated user to access internal functionality and modify data.",
    "published": "2024-08-21T22:15:04.350",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-43033": {
    "url": "https://github.com/jpressprojects/jpress/issues/188",
    "cvss": "-",
    "description": "JPress through 5.1.1 on Windows has an arbitrary file upload vulnerability that could cause arbitrary code execution via ::$DATA to AttachmentController, such as a .jsp::$DATA file to io.jpress.web.commons.controller.AttachmentController#upload. NOTE: this is unrelated to the attack vector for CVE-2024-32358.",
    "published": "2024-08-22T01:15:03.540"
  },
  "CVE-2024-7384": {
    "cvss": 7.5,
    "description": "The AcyMailing – An Ultimate Newsletter Plugin and Marketing Automation Solution for WordPress plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the acym_extractArchive function in all versions up to, and including, 9.7.2. This makes it possible for authenticated attackers, with Subscriber-level access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-08-22T03:15:04.130",
    "keywords": "remote,execution"
  },
  "CVE-2024-45163": {
    "cvss": 9.1,
    "description": "The Mirai botnet through 2024-08-19 mishandles simultaneous TCP connections to the CNC (command and control) server. Unauthenticated sessions remain open, causing resource consumption. For example, an attacker can send a recognized username (such as root), or can send arbitrary data.",
    "published": "2024-08-22T04:15:20.247",
    "keywords": "unauthenticated,command"
  },
  "CVE-2024-45166": {
    "cvss": 9.8,
    "description": "An issue was discovered in UCI IDOL 2 (aka uciIDOL or IDOL2) through 2.12. Due to improper input validation, improper deserialization, and improper restriction of operations within the bounds of a memory buffer, IDOL2 is vulnerable to Denial-of-Service (DoS) attacks and possibly remote code execution. There is an access violation and EIP overwrite after five logins.",
    "published": "2024-08-22T04:15:24.467",
    "keywords": "remote,execution"
  },
  "CVE-2024-45167": {
    "cvss": "-",
    "description": "An issue was discovered in UCI IDOL 2 (aka uciIDOL or IDOL2) through 2.12. Due to improper input validation, improper deserialization, and improper restriction of operations within the bounds of a memory buffer, IDOL2 is vulnerable to Denial-of-Service (DoS) attacks and possibly remote code execution. A certain XmlMessage document causes 100% CPU consumption.",
    "published": "2024-08-22T04:15:25.710",
    "keywords": "remote,execution"
  },
  "CVE-2024-45169": {
    "cvss": 9.8,
    "description": "An issue was discovered in UCI IDOL 2 (aka uciIDOL or IDOL2) through 2.12. Due to improper input validation, improper deserialization, and improper restriction of operations within the bounds of a memory buffer, IDOL2 is vulnerable to Denial-of-Service (DoS) attacks and possibly remote code execution via the \\xB0\\x00\\x3c byte sequence.",
    "published": "2024-08-22T04:15:27.583",
    "keywords": "remote,execution"
  },
  "CVE-2024-8072": {
    "cvss": 5.3,
    "description": "Mage AI allows remote unauthenticated attackers to leak the terminal server command history of arbitrary users",
    "published": "2024-08-22T08:15:04.360",
    "keywords": "remote,unauthenticated,command,leak"
  },
  "CVE-2024-39746": {
    "cvss": 5.9,
    "description": "IBM Sterling Connect:Direct Web Services 6.0, 6.1, 6.2, and 6.3 could allow a remote attacker to obtain sensitive information, caused by the failure to properly enable HTTP Strict Transport Security. An attacker could exploit this vulnerability to obtain sensitive information using man in the middle techniques.",
    "published": "2024-08-22T11:15:13.920",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-36445": {
    "cvss": "-",
    "description": "Swissphone DiCal-RED 4009 devices allow a remote attacker to gain a root shell via TELNET without authentication.",
    "published": "2024-08-22T15:15:16.187",
    "keywords": "remote,authentication"
  },
  "CVE-2024-43787": {
    "cvss": 5.0,
    "description": "Hono is a Web application framework that provides support for any JavaScript runtime. Hono CSRF middleware can be bypassed using crafted Content-Type header. MIME types are case insensitive, but isRequestedByFormElementRe only matches lower-case. As a result, attacker can bypass csrf middleware using upper-case form-like MIME type. This vulnerability is fixed in 4.5.8.",
    "published": "2024-08-22T15:15:16.857",
    "keywords": "sensitive,bypass"
  }
}