{
  "CVE-2025-0583": {
    "cvss": 6.1,
    "description": "The a+HRD from aEnrich Technology has a Reflected Cross-site Scripting vulnerability, allowing unauthenticated remote attackers to execute arbitrary JavaScript codes in user's browser through phishing attacks.",
    "published": "2025-01-20T02:15:19.767",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-0584": {
    "cvss": 5.3,
    "description": "The a+HRD from aEnrich Technology has a Server-side Request Forgery, allowing unauthenticated remote attackers to exploit this vulnerability to probe internal network.",
    "published": "2025-01-20T03:15:09.120",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-0585": {
    "cvss": 9.8,
    "description": "The a+HRD from aEnrich Technology has a SQL Injection vulnerability, allowing unauthenticated remote attackers to inject arbitrary SQL commands to read, modify, and delete database contents.",
    "published": "2025-01-20T03:15:09.283",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2025-0586": {
    "cvss": 7.2,
    "description": "The a+HRD from aEnrich Technology has an Insecure Deserialization vulnerability, allowing remote attackers with database modification privileges and regular system privileges to perform arbitrary code execution.",
    "published": "2025-01-20T03:15:09.433",
    "keywords": "remote,execution"
  },
  "CVE-2025-0479": {
    "cvss": "-",
    "description": "This vulnerability exists in the CP Plus Router due to insecure handling of cookie flags used within its web interface. A remote attacker could exploit this vulnerability by intercepting data transmissions during an HTTP session on the vulnerable system.\n \nSuccessful exploitation of this vulnerability could allow the attacker to obtain sensitive information and compromise the targeted system.",
    "published": "2025-01-20T12:15:23.563",
    "keywords": "remote,sensitive"
  },
  "CVE-2025-23044": {
    "url": "https://github.com/pwndoc/pwndoc/commit/14acb704891245bf1703ce6296d62112e85aa995",
    "cvss": 6.8,
    "description": "PwnDoc is a penetration test report generator. There is no CSRF protection in pwndoc, allowing attackers to send requests on a logged-in user's behalf. This includes GET and POST requests due to the missing SameSite= attribute on cookies and the ability to refresh cookies. Commit 14acb704891245bf1703ce6296d62112e85aa995 patches the issue.",
    "published": "2025-01-20T16:15:28.170"
  },
  "CVE-2025-24012": {
    "url": "https://github.com/umbraco/umbraco-cms/commit/d4f8754f933895b3a329296e25ddea6f84a0aea2",
    "cvss": 4.6,
    "description": "Umbraco is a free and open source .NET content management system. Starting in version 14.0.0 and prior to versions 14.3.2 and 15.1.2, authenticated users are able to exploit a cross-site scripting vulnerability when viewing certain localized backoffice components. Versions 14.3.2 and 15.1.2 contain a patch.",
    "published": "2025-01-21T16:15:14.923"
  },
  "CVE-2025-23196": {
    "cvss": 8.8,
    "description": "A code injection vulnerability exists in the Ambari Alert Definition \nfeature, allowing authenticated users to inject and execute arbitrary \nshell commands. The vulnerability arises when defining alert scripts, \nwhere the script filename field is executed using `sh -c`. An attacker \nwith authenticated access can exploit this vulnerability to inject \nmalicious commands, leading to remote code execution on the server. The \nissue has been fixed in the latest versions of Ambari.",
    "published": "2025-01-21T22:15:12.987",
    "keywords": "remote,execution,command"
  },
  "CVE-2025-0604": {
    "cvss": 5.4,
    "description": "A flaw was found in Keycloak. When an Active Directory user resets their password, the system updates it without performing an LDAP bind to validate the new credentials against AD. This vulnerability allows users whose AD accounts are expired or disabled to regain access in Keycloak, bypassing AD restrictions. The issue enables authentication bypass and could allow unauthorized access under certain conditions.",
    "published": "2025-01-22T15:15:14.827",
    "keywords": "authentication,bypass"
  },
  "CVE-2025-22980": {
    "url": "https://github.com/slims/slims9_bulian/issues/270",
    "cvss": "-",
    "description": "A SQL Injection vulnerability exists in Senayan Library Management System SLiMS 9 Bulian 9.6.1 via the tempLoanID parameter in the loan form on /admin/modules/circulation/loan.php.",
    "published": "2025-01-22T15:15:15.130"
  },
  "CVE-2025-20128": {
    "cvss": 5.3,
    "description": "A vulnerability in the Object Linking and Embedding 2 (OLE2) decryption routine of ClamAV could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition on an affected device.\r\n\r\nThis vulnerability is due to an integer underflow in a bounds check that allows for a heap buffer overflow read. An attacker could exploit this vulnerability by submitting a crafted file containing OLE2 content to be scanned by ClamAV on an affected device. A successful exploit could allow the attacker to terminate the ClamAV scanning process, resulting in a DoS condition on the affected software.\r\nFor a description of this vulnerability, see the .\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.",
    "published": "2025-01-22T17:15:12.583",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-20165": {
    "cvss": 7.5,
    "description": "A vulnerability in the SIP processing subsystem of Cisco BroadWorks could allow an unauthenticated, remote attacker to halt the processing of incoming SIP requests, resulting in a denial of service (DoS) condition.\r\n\r\nThis vulnerability is due to improper memory handling for certain SIP requests. An attacker could exploit this vulnerability by sending a high number of SIP requests to an affected system. A successful exploit could allow the attacker to exhaust the memory that was allocated to the Cisco BroadWorks Network Servers that handle SIP traffic. If no memory is available, the Network Servers can no longer process incoming requests, resulting in a DoS condition that requires manual intervention to recover.",
    "published": "2025-01-22T17:15:13.010",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2025-24399": {
    "cvss": "-",
    "description": "Jenkins OpenId Connect Authentication Plugin 4.452.v2849b_d3945fa_ and earlier, except 4.438.440.v3f5f201de5dc, treats usernames as case-insensitive, allowing attackers on Jenkins instances configured with a case-sensitive OpenID Connect provider to log in as any user by providing a username that differs only in letter case, potentially gaining administrator access to Jenkins.",
    "published": "2025-01-22T17:15:13.853",
    "keywords": "authentication,sensitive"
  }
}