{
  "CVE-2024-8277": {
    "cvss": 9.8,
    "description": "The WooCommerce Photo Reviews Premium plugin for WordPress is vulnerable to authentication bypass in all versions up to, and including, 1.3.13.2. This is due to the plugin not properly validating what user transient is being used in the login() function and not properly verifying the user's identity. This makes it possible for unauthenticated attackers to log in as user that has dismissed an admin notice in the past 30 days, which is often an administrator. Alternatively, a user can log in as any user with any transient that has a valid user_id as the value, though it would be more difficult to exploit this successfully.",
    "published": "2024-09-11T09:15:02.680",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-45786": {
    "cvss": "-",
    "description": "This vulnerability exists in Reedos aiM-Star version 2.0.1 due to improper access controls on its certain API endpoints. An authenticated remote attacker could exploit this vulnerability by manipulating a parameter through API request URL which could lead to gain unauthorized access to sensitive information belonging to other users.",
    "published": "2024-09-11T12:15:01.943",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-45787": {
    "cvss": "-",
    "description": "This vulnerability exists in Reedos aiM-Star version 2.0.1 due to transmission of sensitive information in plain text in certain API endpoints. An authenticated remote attacker could exploit this vulnerability by manipulating a parameter through API request URL and intercepting response of the API request leading to exposure of sensitive information belonging to other users.",
    "published": "2024-09-11T12:15:02.123",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-45789": {
    "cvss": "-",
    "description": "This vulnerability exists in Reedos aiM-Star version 2.0.1 due to improper validation of the ‘mode’ parameter in the API endpoint used during the registration process. An authenticated remote attacker could exploit this vulnerability by manipulating parameter in the API request body on the vulnerable application.\n\nSuccessful exploitation of this vulnerability could allow the attacker to bypass certain constraints in the registration process leading to creation of multiple accounts.",
    "published": "2024-09-11T12:15:02.343",
    "keywords": "remote,bypass"
  },
  "CVE-2024-45790": {
    "cvss": "-",
    "description": "This vulnerability exists in Reedos aiM-Star version 2.0.1 due to missing restrictions for excessive failed authentication attempts on its API based login. A remote attacker could exploit this vulnerability by conducting a brute force attack against legitimate user passwords, which could lead to gain unauthorized access and compromise other user accounts.",
    "published": "2024-09-11T13:15:03.290",
    "keywords": "remote,authentication"
  },
  "CVE-2024-6091": {
    "cvss": 9.8,
    "description": "A vulnerability in significant-gravitas/autogpt version 0.5.1 allows an attacker to bypass the shell commands denylist settings. The issue arises when the denylist is configured to block specific commands, such as 'whoami' and '/bin/whoami'. An attacker can circumvent this restriction by executing commands with a modified path, such as '/bin/./whoami', which is not recognized by the denylist.",
    "published": "2024-09-11T13:15:03.440",
    "keywords": "command,bypass"
  },
  "CVE-2024-27114": {
    "cvss": 9.8,
    "description": "A unauthenticated Remote Code Execution (RCE) vulnerability is found in the SO Planning online planning tool. If the public view setting is enabled, a attacker can upload a PHP-file that will be available for execution for a few milliseconds before it is removed, leading to execution of code on the underlying system. The vulnerability has been remediated in version 1.52.02.",
    "published": "2024-09-11T14:15:13.040",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-27115": {
    "cvss": "-",
    "description": "A unauthenticated Remote Code Execution (RCE) vulnerability is found in the SO Planning online planning tool. With this vulnerability, an attacker can upload executable files that are moved to a publicly accessible folder before verifying any requirements. This leads to the possibility of execution of code on the underlying system when the file is triggered. The vulnerability has been remediated in version 1.52.02.",
    "published": "2024-09-11T14:15:13.147",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-41868": {
    "cvss": 5.5,
    "description": "Audition versions 24.4.1, 23.6.6 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-09-11T16:15:06.140",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-20304": {
    "cvss": 8.6,
    "description": "A vulnerability in the multicast traceroute version 2 (Mtrace2) feature of Cisco IOS XR Software could allow an unauthenticated, remote attacker to exhaust the UDP packet memory of an affected device.\r\n\r\nThis vulnerability exists because the Mtrace2 code does not properly handle packet memory. An attacker could exploit this vulnerability by sending crafted packets to an affected device. A successful exploit could allow the attacker to exhaust the incoming UDP packet memory. The affected device would not be able to process higher-level UDP-based protocols packets, possibly causing a denial of service (DoS) condition.\r\nNote: This vulnerability can be exploited using IPv4 or IPv6.",
    "published": "2024-09-11T17:15:11.853",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20381": {
    "cvss": 8.8,
    "description": "A vulnerability in the JSON-RPC API feature in ConfD that is used by the web-based management interfaces of Cisco Crosswork Network Services Orchestrator (NSO), Cisco Optical Site Manager, and Cisco RV340 Dual WAN Gigabit VPN Routers could allow an authenticated, remote attacker to modify the configuration of an affected application or device.\r\n\r\nThis vulnerability is due to improper authorization checks on the API. An attacker with privileges sufficient to access the affected application or device could exploit this vulnerability by sending malicious requests to the JSON-RPC API. A successful exploit could allow the attacker to make unauthorized modifications to the configuration of the affected application or device, including creating new user accounts or elevating their own privileges on an affected system.",
    "published": "2024-09-11T17:15:12.403",
    "keywords": "remote,vpn"
  },
  "CVE-2024-20390": {
    "cvss": 5.3,
    "description": "A vulnerability in the Dedicated XML Agent feature of Cisco IOS XR Software could allow an unauthenticated, remote attacker to cause a denial of service (DoS) on XML TCP listen port 38751.\r\n\r\nThis vulnerability is due to a lack of proper error validation of ingress XML packets. An attacker could exploit this vulnerability by sending a sustained, crafted stream of XML traffic to a targeted device. A successful exploit could allow the attacker to cause XML TCP port 38751 to become unreachable while the attack traffic persists.",
    "published": "2024-09-11T17:15:12.613",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-20483": {
    "cvss": 7.2,
    "description": "Multiple vulnerabilities in Cisco Routed PON Controller Software, which runs as a docker container on hardware that is supported by Cisco IOS XR Software, could allow an authenticated, remote attacker with Administrator-level privileges on the PON Manager or direct access to the PON Manager MongoDB instance to perform command injection attacks on the PON Controller container and execute arbitrary commands as root.\r\n\r\nThese vulnerabilities are due to insufficient validation of arguments that are passed to specific configuration commands. An attacker could exploit these vulnerabilities by including crafted input as the argument of an affected configuration command. A successful exploit could allow the attacker to execute arbitrary commands as root on the PON controller.",
    "published": "2024-09-11T17:15:13.213",
    "keywords": "remote,command"
  },
  "CVE-2024-8686": {
    "cvss": "-",
    "description": "A command injection vulnerability in Palo Alto Networks PAN-OS software enables an authenticated administrator to bypass system restrictions and run arbitrary commands as root on the firewall.",
    "published": "2024-09-11T17:15:14.033",
    "keywords": "command,bypass"
  },
  "CVE-2024-42760": {
    "cvss": 7.5,
    "description": "SQL Injection vulnerability in Ellevo v.6.2.0.38160 allows a remote attacker to obtain sensitive information via the /api/mob/instrucao/conta/destinatarios component.",
    "published": "2024-09-11T19:15:14.983",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-8693": {
    "cvss": 2.4,
    "description": "A vulnerability, which was classified as problematic, has been found in Kaon CG3000 1.01.43. Affected by this issue is some unknown functionality of the component dhcpcd Command Handler. The manipulation of the argument -h with the input <script>alert('XSS')</script> leads to cross site scripting. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-09-11T20:15:03.503",
    "keywords": "remote,command"
  },
  "CVE-2024-29847": {
    "cvss": 10.0,
    "description": "Deserialization of untrusted data in the agent portal of Ivanti EPM before 2022 SU6, or the 2024 September update allows a remote unauthenticated attacker to achieve remote code execution.",
    "published": "2024-09-12T02:15:02.077",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-32840": {
    "cvss": 9.1,
    "description": "An unspecified SQL injection in Ivanti EPM before 2022 SU6, or the 2024 September update allows a remote authenticated attacker with admin privileges to achieve remote code execution.",
    "published": "2024-09-12T02:15:02.257",
    "keywords": "remote,execution"
  },
  "CVE-2024-32842": {
    "cvss": 9.1,
    "description": "An unspecified SQL injection in Ivanti EPM before 2022 SU6, or the 2024 September update allows a remote authenticated attacker with admin privileges to achieve remote code execution.",
    "published": "2024-09-12T02:15:02.417",
    "keywords": "remote,execution"
  },
  "CVE-2024-32843": {
    "cvss": 9.1,
    "description": "An unspecified SQL injection in Ivanti EPM before 2022 SU6, or the 2024 September update allows a remote authenticated attacker with admin privileges to achieve remote code execution.",
    "published": "2024-09-12T02:15:02.567",
    "keywords": "remote,execution"
  },
  "CVE-2024-32845": {
    "cvss": 9.1,
    "description": "An unspecified SQL injection in Ivanti EPM before 2022 SU6, or the 2024 September update allows a remote authenticated attacker with admin privileges to achieve remote code execution.",
    "published": "2024-09-12T02:15:02.730",
    "keywords": "remote,execution"
  },
  "CVE-2024-32846": {
    "cvss": 9.1,
    "description": "An unspecified SQL injection in Ivanti EPM before 2022 SU6, or the 2024 September update allows a remote authenticated attacker with admin privileges to achieve remote code execution.",
    "published": "2024-09-12T02:15:02.883",
    "keywords": "remote,execution"
  },
  "CVE-2024-32848": {
    "cvss": 9.1,
    "description": "An unspecified SQL injection in Ivanti EPM before 2022 SU6, or the 2024 September update allows a remote authenticated attacker with admin privileges to achieve remote code execution.",
    "published": "2024-09-12T02:15:03.043",
    "keywords": "remote,execution"
  },
  "CVE-2024-34779": {
    "cvss": 9.1,
    "description": "An unspecified SQL injection in Ivanti EPM before 2022 SU6, or the 2024 September update allows a remote authenticated attacker with admin privileges to achieve remote code execution.",
    "published": "2024-09-12T02:15:03.207",
    "keywords": "remote,execution"
  },
  "CVE-2024-34783": {
    "cvss": 9.1,
    "description": "An unspecified SQL injection in Ivanti EPM before 2022 SU6, or the 2024 September update allows a remote authenticated attacker with admin privileges to achieve remote code execution.",
    "published": "2024-09-12T02:15:03.380",
    "keywords": "remote,execution"
  },
  "CVE-2024-34785": {
    "cvss": 9.1,
    "description": "An unspecified SQL injection in Ivanti EPM before 2022 SU6, or the 2024 September update allows a remote authenticated attacker with admin privileges to achieve remote code execution.",
    "published": "2024-09-12T02:15:03.540",
    "keywords": "remote,execution"
  },
  "CVE-2024-37397": {
    "cvss": 8.2,
    "description": "An External XML Entity (XXE) vulnerability in the provisioning web service of Ivanti EPM before 2022 SU6, or the 2024 September update allows a remote unauthenticated attacker to leak API secrets.",
    "published": "2024-09-12T02:15:03.700",
    "keywords": "remote,unauthenticated,leak"
  },
  "CVE-2024-8522": {
    "cvss": 10.0,
    "description": "The LearnPress – WordPress LMS Plugin plugin for WordPress is vulnerable to SQL Injection via the 'c_only_fields' parameter of the /wp-json/learnpress/v1/courses REST API endpoint in all versions up to, and including, 4.2.7 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-09-12T09:15:05.480",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-8529": {
    "cvss": 10.0,
    "description": "The LearnPress – WordPress LMS Plugin plugin for WordPress is vulnerable to SQL Injection via the 'c_fields' parameter of the /wp-json/lp/v1/courses/archive-course REST API endpoint in all versions up to, and including, 4.2.7 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-09-12T09:15:05.720",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-28990": {
    "cvss": 6.3,
    "description": "SolarWinds Access Rights Manager (ARM) was found to contain a hard-coded credential authentication bypass vulnerability. If exploited, this vulnerability would allow access to the RabbitMQ management console.\n\nWe thank Trend Micro Zero Day Initiative (ZDI) for its ongoing partnership in coordinating with SolarWinds on responsible disclosure of this and other potential vulnerabilities.",
    "published": "2024-09-12T14:16:06.273",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-28991": {
    "cvss": 9.0,
    "description": "SolarWinds Access Rights Manager (ARM) was found to be susceptible to a remote code execution vulnerability. If exploited, this vulnerability would allow an authenticated user to abuse the service, resulting in remote code execution.",
    "published": "2024-09-12T14:16:06.540",
    "keywords": "remote,execution"
  },
  "CVE-2024-45824": {
    "cvss": 9.8,
    "description": "CVE-2024-45824 IMPACT\n\n\n\nA remote\ncode vulnerability exists in the affected products. The vulnerability occurs\nwhen chained with Path Traversal, Command Injection, and XSS Vulnerabilities\nand allows for full unauthenticated remote code execution. The link in the\nmitigations section below contains patches to fix this issue.",
    "published": "2024-09-12T14:16:06.953",
    "keywords": "remote,execution,unauthenticated,command"
  },
  "CVE-2024-42483": {
    "url": "https://github.com/espressif/esp-now/commit/4e30db50d541b2909d278ef0db05de1a3d7190ef",
    "cvss": 6.5,
    "description": "ESP-NOW Component provides a connectionless Wi-Fi communication protocol. An replay attacks vulnerability was discovered in the implementation of the ESP-NOW because the caches is not differentiated by message types, it is a single, shared resource for all kinds of messages, whether they are broadcast or unicast, and regardless of whether they are ciphertext or plaintext. This can result an attacker to clear the cache of its legitimate entries, there by creating an opportunity to re-inject previously captured packets. This vulnerability is fixed in 2.5.2.",
    "published": "2024-09-12T15:18:22.093"
  },
  "CVE-2024-42484": {
    "url": "https://github.com/espressif/esp-now/commit/b03a1b4593713fa4bf0038a87edca01f10114a7a",
    "cvss": 6.5,
    "description": "ESP-NOW Component provides a connectionless Wi-Fi communication protocol. An Out-of-Bound (OOB) vulnerability was discovered in the implementation of the ESP-NOW group type message because there is no check for the addrs_num field of the group type message. This can result in memory corruption related attacks. Normally there are two fields in the group information that need to be checked, i.e., the addrs_num field and the addrs_list fileld. Since we only checked the addrs_list field, an attacker can send a group type message with an invalid addrs_num field, which will cause the message handled by the firmware to be much larger than the current buffer, thus causing a memory corruption issue that goes beyond the payload length.",
    "published": "2024-09-12T15:18:22.320"
  },
  "CVE-2024-45823": {
    "cvss": 8.1,
    "description": "CVE-2024-45823 IMPACT\n\n\n\nAn\nauthentication bypass vulnerability exists in the affected product. The\nvulnerability exists due to shared secrets across accounts and could allow a threat\nactor to impersonate a user if the threat actor is able to enumerate additional\ninformation required during authentication.",
    "published": "2024-09-12T15:18:22.547",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-45826": {
    "cvss": 6.8,
    "description": "CVE-2024-45826 IMPACT\nDue to improper input validation, a path traversal and remote code execution vulnerability exists when the ThinManager® processes a crafted POST request. If exploited, a user can install an executable file.",
    "published": "2024-09-12T15:18:24.287",
    "keywords": "remote,execution"
  },
  "CVE-2024-8695": {
    "cvss": 9.8,
    "description": "A remote code execution (RCE) vulnerability via crafted extension description/changelog could be abused by a malicious extension in Docker Desktop before 4.34.2.",
    "published": "2024-09-12T18:15:11.333",
    "keywords": "remote,execution"
  },
  "CVE-2024-8696": {
    "cvss": 9.8,
    "description": "A remote code execution (RCE) vulnerability via crafted extension publisher-url/additional-urls could be abused by a malicious extension in Docker Desktop before 4.34.2.",
    "published": "2024-09-12T18:15:11.490",
    "keywords": "remote,execution"
  },
  "CVE-2024-45303": {
    "url": "https://github.com/discourse/discourse-calendar/commit/81e1c8e3c4c02276fb890da7e3f684259aeb685c",
    "cvss": 6.1,
    "description": "Discourse Calendar plugin adds the ability to create a dynamic calendar in the first post of a topic to Discourse. Rendering event names can be susceptible to XSS attacks. This vulnerability only affects sites which have modified or disabled Discourse’s default Content Security Policy. The issue is patched in version 0.5 of the Discourse Calendar plugin.",
    "published": "2024-09-12T19:15:03.793"
  },
  "CVE-2024-8311": {
    "cvss": 6.5,
    "description": "An issue was discovered with pipeline execution policies in GitLab EE affecting all versions from 17.2 prior to 17.2.5, 17.3 prior to 17.3.2 which allows authenticated users to bypass variable overwrite protection via inclusion of a CI/CD template.",
    "published": "2024-09-12T19:15:04.683",
    "keywords": "execution,bypass"
  },
  "CVE-2024-7961": {
    "cvss": "-",
    "description": "A path traversal vulnerability exists in the Rockwell Automation affected product.  If exploited, the threat actor could upload arbitrary files to the server that could result in a remote code execution.",
    "published": "2024-09-12T21:15:03.357",
    "keywords": "remote,execution"
  },
  "CVE-2024-7129": {
    "cvss": 8.8,
    "description": "The Appointment Booking Calendar — Simply Schedule Appointments Booking Plugin WordPress plugin before 1.6.7.43 does not escape template syntax provided via user input, leading to Twig Template Injection which further exploited can result to remote code Execution by high privilege such as admins",
    "published": "2024-09-13T06:15:15.507",
    "keywords": "remote,execution"
  },
  "CVE-2024-41870": {
    "cvss": 5.5,
    "description": "Media Encoder versions 24.5, 23.6.8 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-09-13T07:15:03.750",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-41872": {
    "cvss": 5.5,
    "description": "Media Encoder versions 24.5, 23.6.8 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-09-13T07:15:04.440",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-41873": {
    "cvss": 5.5,
    "description": "Media Encoder versions 24.5, 23.6.8 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-09-13T07:15:04.790",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-39382": {
    "cvss": 5.5,
    "description": "After Effects versions 23.6.6, 24.5 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-09-13T09:15:05.770",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-39385": {
    "cvss": 5.5,
    "description": "Premiere Pro versions 24.5, 23.6.8 and earlier are affected by a Use After Free vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-09-13T09:15:07.470",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-45111": {
    "cvss": 5.5,
    "description": "Illustrator versions 28.6, 27.9.5 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-09-13T09:15:13.263",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-8242": {
    "cvss": 4.3,
    "description": "The MStore API – Create Native Android & iOS Apps On The Cloud plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the update_user_profile() function in all versions up to, and including, 4.15.3. This makes it possible for authenticated attackers, with subscriber-level access and above, to upload arbitrary files (not including PHP files) on the affected site's server which may make remote code execution possible. This can be paired with a registration endpoint for unauthenticated users to exploit the issue.",
    "published": "2024-09-13T15:15:16.767",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-45368": {
    "cvss": 8.8,
    "description": "The H2-DM1E PLC's authentication protocol appears to utilize either a custom encoding scheme or a challenge-response protocol. However, there's an observed anomaly in the H2-DM1E PLC's protocol execution, namely its acceptance of multiple distinct packets as valid authentication responses. This behavior deviates from standard security practices where a single, specific response or encoding pattern is expected for successful authentication.",
    "published": "2024-09-13T17:15:12.800",
    "keywords": "execution,authentication"
  },
  "CVE-2024-39924": {
    "cvss": 7.5,
    "description": "An issue was discovered in Vaultwarden (formerly Bitwarden_RS) 1.30.3. A vulnerability has been identified in the authentication and authorization process of the endpoint responsible for altering the metadata of an emergency access. It permits an attacker with granted emergency access to escalate their privileges by changing the access level and modifying the wait time. Consequently, the attacker can gain full control over the vault (when only intended to have read access) while bypassing the necessary wait period.",
    "published": "2024-09-13T18:15:03.810",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-8271": {
    "cvss": 7.3,
    "description": "The The FOX – Currency Switcher Professional for WooCommerce plugin for WordPress is vulnerable to arbitrary shortcode execution in all versions up to, and including, 1.4.2.1. This is due to the software allowing users to execute an action that does not properly validate a value before running do_shortcode in the 'woocs_get_custom_price_html' function. This makes it possible for unauthenticated attackers to execute arbitrary shortcodes.",
    "published": "2024-09-14T03:15:08.730",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-8775": {
    "cvss": 5.5,
    "description": "A flaw was found in Ansible, where sensitive information stored in Ansible Vault files can be exposed in plaintext during the execution of a playbook. This occurs when using tasks such as include_vars to load vaulted variables without setting the no_log: true parameter, resulting in sensitive data being printed in the playbook output or logs. This can lead to the unintentional disclosure of secrets like passwords or API keys, compromising security and potentially allowing unauthorized access or actions.",
    "published": "2024-09-14T03:15:08.987",
    "keywords": "execution,sensitive"
  },
  "CVE-2024-8479": {
    "cvss": 7.3,
    "description": "The The Simple Spoiler plugin for WordPress is vulnerable to arbitrary shortcode execution in versions 1.2 to 1.3. This is due to the plugin adding the filter add_filter('comment_text', 'do_shortcode'); which will run all shortcodes in comments. This makes it possible for unauthenticated attackers to execute arbitrary shortcodes.",
    "published": "2024-09-14T04:15:04.733",
    "keywords": "execution,unauthenticated"
  }
}