{
  "CVE-2024-34719": {
    "cvss": 8.4,
    "description": "In multiple locations, there is a possible permissions bypass due to a missing null check. This could lead to local escalation of privilege with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-11-13T18:15:20.267",
    "keywords": "execution,bypass"
  },
  "CVE-2024-43081": {
    "cvss": 7.8,
    "description": "In installExistingPackageAsUser of InstallPackageHelper.java, there is a possible carrier restriction bypass due to a logic error in the code. This could lead to local escalation of privilege with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-11-13T18:15:20.863",
    "keywords": "execution,bypass"
  },
  "CVE-2024-43086": {
    "cvss": 5.5,
    "description": "In validateAccountsInternal of AccountManagerService.java, there is a possible way to leak account credentials to a third party app due to a confused deputy. This could lead to local information disclosure with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-11-13T18:15:21.240",
    "keywords": "execution,leak"
  },
  "CVE-2024-43091": {
    "cvss": 8.8,
    "description": "In filterMask of SkEmbossMaskFilter.cpp, there is a possible out of bounds write due to an integer overflow. This could lead to remote code execution with no additional execution privileges needed. User interaction is not needed for exploitation.",
    "published": "2024-11-13T18:15:21.590",
    "keywords": "remote,execution"
  },
  "CVE-2024-43093": {
    "cvss": 7.8,
    "description": "In shouldHideDocument of ExternalStorageProvider.java, there is a possible bypass of a file path filter designed to prevent access to sensitive directories due to  incorrect unicode normalization. This could lead to local escalation of privilege with no additional execution privileges needed. User interaction is needed for exploitation.",
    "published": "2024-11-13T18:15:21.713",
    "keywords": "execution,sensitive,bypass"
  },
  "CVE-2024-51027": {
    "cvss": "-",
    "description": "Ruijie NBR800G gateway NBR_RGOS_11.1(6)B4P9 is vulnerable to command execution in /itbox_pi/networksafe.php via the province parameter.",
    "published": "2024-11-13T22:15:15.823",
    "keywords": "execution,command"
  },
  "CVE-2024-5082": {
    "cvss": 4.3,
    "description": "A Remote Code Execution vulnerability has been discovered in Sonatype Nexus Repository 2. \n\nThis issue affects Nexus Repository 2 OSS/Pro versions up to and including 2.15.1.",
    "published": "2024-11-14T03:15:03.533",
    "keywords": "remote,execution"
  },
  "CVE-2024-2552": {
    "cvss": "-",
    "description": "A command injection vulnerability in Palo Alto Networks PAN-OS software enables an authenticated administrator to bypass system restrictions in the management plane and delete files on the firewall.",
    "published": "2024-11-14T10:15:04.957",
    "keywords": "command,bypass"
  },
  "CVE-2024-10571": {
    "cvss": 9.8,
    "description": "The Chartify – WordPress Chart Plugin plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 2.9.5 via the 'source' parameter. This makes it possible for unauthenticated attackers to include and execute arbitrary files on the server, allowing the execution of any PHP code in those files. This can be used to bypass access controls, obtain sensitive data, or achieve code execution in cases where images and other “safe” file types can be uploaded and included.",
    "published": "2024-11-14T11:15:04.630",
    "keywords": "execution,unauthenticated,sensitive,bypass"
  },
  "CVE-2024-10979": {
    "cvss": 8.8,
    "description": "Incorrect control of environment variables in PostgreSQL PL/Perl allows an unprivileged database user to change sensitive process environment variables (e.g. PATH).  That often suffices to enable arbitrary code execution, even if the attacker lacks a database server operating system user.  Versions before PostgreSQL 17.1, 16.5, 15.9, 14.14, 13.17, and 12.21 are affected.",
    "published": "2024-11-14T13:15:04.407",
    "keywords": "execution,sensitive"
  },
  "CVE-2024-10962": {
    "cvss": 8.8,
    "description": "The Migration, Backup, Staging – WPvivid plugin for WordPress is vulnerable to PHP Object Injection in all versions up to, and including, 0.9.107 via deserialization of untrusted input in the 'replace_row_data' and 'replace_serialize_data' functions. This makes it possible for unauthenticated attackers to inject a PHP Object. No known POP chain is present in the vulnerable software. If a POP chain is present via an additional plugin or theme installed on the target system, it could allow the attacker to delete arbitrary files, retrieve sensitive data, or execute code. An administrator must create a staging site to trigger the exploit.",
    "published": "2024-11-14T14:15:17.533",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-11209": {
    "cvss": 6.3,
    "description": "A vulnerability was found in Apereo CAS 6.6. It has been classified as critical. This affects an unknown part of the file /login?service of the component 2FA. The manipulation leads to improper authentication. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-11-14T14:15:18.090",
    "keywords": "remote,authentication"
  },
  "CVE-2024-11215": {
    "cvss": 6.5,
    "description": "Absolute path traversal (incorrect restriction of a path to a restricted directory) vulnerability in the EasyPHP web server, affecting version 14.1. This vulnerability could allow remote users to bypass SecurityManager restrictions and retrieve any file stored on the server by setting only consecutive strings ‘/...%5c’.",
    "published": "2024-11-14T14:15:18.367",
    "keywords": "remote,bypass"
  },
  "CVE-2024-50843": {
    "cvss": 5.3,
    "description": "A Directory listing issue was found in PHPGurukul User Registration & Login and User Management System 3.2, which allows remote attackers attacker to access sensitive files and directories via /loginsystem/assets.",
    "published": "2024-11-14T14:15:19.050",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-52505": {
    "cvss": 5.4,
    "description": "matrix-appservice-irc is a Node.js IRC bridge for the Matrix messaging protocol. The provisioning API of the matrix-appservice-irc bridge up to version 3.0.2 contains a vulnerability which can lead to arbitrary IRC command execution as the bridge IRC bot. The vulnerability has been patched in matrix-appservice-irc version 3.0.3.",
    "published": "2024-11-14T16:15:20.220",
    "keywords": "execution,command"
  },
  "CVE-2024-49362": {
    "cvss": 7.7,
    "description": "Joplin is a free, open source note taking and to-do application. Joplin-desktop has a vulnerability that leads to remote code execution (RCE) when a user clicks on an <a> link within untrusted notes. The issue arises due to insufficient sanitization of <a> tag attributes introduced by the Mermaid. This vulnerability allows the execution of untrusted HTML content within the Electron window, which has full access to Node.js APIs, enabling arbitrary shell command execution.",
    "published": "2024-11-14T18:15:19.243",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-4343": {
    "cvss": 9.8,
    "description": "A Python command injection vulnerability exists in the `SagemakerLLM` class's `complete()` method within `./private_gpt/components/llm/custom/sagemaker.py` of the imartinez/privategpt application, versions up to and including 0.3.0. The vulnerability arises due to the use of the `eval()` function to parse a string received from a remote AWS SageMaker LLM endpoint into a dictionary. This method of parsing is unsafe as it can execute arbitrary Python code contained within the response. An attacker can exploit this vulnerability by manipulating the response from the AWS SageMaker LLM endpoint to include malicious Python code, leading to potential execution of arbitrary commands on the system hosting the application. The issue is fixed in version 0.6.0.",
    "published": "2024-11-14T18:15:19.687",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-52524": {
    "cvss": "-",
    "description": "Giskard is an evaluation and testing framework for AI systems. A Remote Code Execution (ReDoS) vulnerability was discovered in Giskard component by the GitHub Security Lab team. When processing datasets with specific text patterns with Giskard detectors, this vulnerability could trigger exponential regex evaluation times, potentially leading to denial of service. Giskard versions prior to 2.15.5 are affected.",
    "published": "2024-11-14T18:15:26.610",
    "keywords": "remote,execution"
  },
  "CVE-2024-10394": {
    "cvss": "-",
    "description": "A local user can bypass the OpenAFS PAG (Process Authentication Group)\nthrottling mechanism in Unix clients, allowing the user to create a PAG using\nan existing id number, effectively joining the PAG and letting the user steal\nthe credentials in that PAG.",
    "published": "2024-11-14T20:15:20.777",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-31695": {
    "cvss": "-",
    "description": "A misconfiguration in the fingerprint authentication mechanism of Binance: BTC, Crypto and NFTS v2.85.4, allows attackers to bypass authentication when adding a new fingerprint.",
    "published": "2024-11-14T22:15:15.953",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-40579": {
    "cvss": 5.4,
    "description": "Cross Site Scripting vulnerability in Virtuozzo Hybrid Server for WHMCS Open Source v.1.7.1 allows a remote attacker to obtain sensitive information via modification of the hostname parameter.",
    "published": "2024-11-14T22:15:16.230",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-41206": {
    "url": "https://github.com/justdan96/tsmuxer/issues/859",
    "cvss": 6.5,
    "description": "A stack-based buffer over-read in tsMuxer version nightly-2024-03-14-01-51-12 allows attackers to cause Information Disclosure via a crafted TS video file.",
    "published": "2024-11-14T23:15:05.197"
  },
  "CVE-2024-41209": {
    "url": "https://github.com/justdan96/tsmuxer/issues/841",
    "cvss": 8.8,
    "description": "A heap-based buffer overflow in tsMuxer version nightly-2024-03-14-01-51-12 allows attackers to cause Denial of Service (DoS) and Code Execution via a crafted MOV video file.",
    "published": "2024-11-14T23:15:05.277"
  },
  "CVE-2024-41217": {
    "url": "https://github.com/justdan96/tsmuxer/issues/846",
    "cvss": 6.5,
    "description": "A heap-based buffer overflow in tsMuxer version nightly-2024-05-10-02-00-45 allows attackers to cause Denial of Service (DoS) via a crafted MKV video file.",
    "published": "2024-11-14T23:15:05.370"
  },
  "CVE-2024-49776": {
    "url": "https://github.com/justdan96/tsmuxer/issues/862",
    "cvss": 6.5,
    "description": "A negative-size-param in tsMuxer version nightly-2024-04-05-01-53-02 allows attackers to cause Denial of Service (DoS) via a crafted TS video file.",
    "published": "2024-11-14T23:15:05.457"
  },
  "CVE-2024-49777": {
    "url": "https://github.com/justdan96/tsmuxer/issues/842",
    "cvss": 8.8,
    "description": "A heap-based buffer overflow in tsMuxer version nightly-2024-03-14-01-51-12 allows attackers to cause Denial of Service (DoS), Information Disclosure and Code Execution via a crafted MKV video file.",
    "published": "2024-11-14T23:15:05.547"
  },
  "CVE-2024-49778": {
    "url": "https://github.com/justdan96/tsmuxer/issues/879",
    "cvss": 8.8,
    "description": "A heap-based buffer overflow in tsMuxer version nightly-2024-05-12-02-01-18 allows attackers to cause Denial of Service (DoS) and Code Execution via a crafted MOV video file.",
    "published": "2024-11-14T23:15:05.643"
  },
  "CVE-2024-52308": {
    "cvss": 8.0,
    "description": "The GitHub CLI version 2.6.1 and earlier are vulnerable to remote code execution through a malicious codespace SSH server when using `gh codespace ssh` or `gh codespace logs` commands. This has been patched in the cli v2.62.0.\n\nDevelopers connect to remote codespaces through an SSH server running within the devcontainer, which is generally provided through the [default devcontainer image]( https://docs.github.com/en/codespaces/setting-up-your-project-for-codespaces/adding-a-dev-container-... https://docs.github.com/en/codespaces/setting-up-your-project-for-codespaces/adding-a-dev-container-configuration/introduction-to-dev-containers#using-the-default-dev-container-configuration) . GitHub CLI [retrieves SSH connection details]( https://github.com/cli/cli/blob/30066b0042d0c5928d959e288144300cb28196c9/internal/codespaces/rpc/inv... https://github.com/cli/cli/blob/30066b0042d0c5928d959e288144300cb28196c9/internal/codespaces/rpc/invoker.go#L230-L244 ), such as remote username, which is used in [executing `ssh` commands]( https://github.com/cli/cli/blob/e356c69a6f0125cfaac782c35acf77314f18908d/pkg/cmd/codespace/ssh.go#L2... https://github.com/cli/cli/blob/e356c69a6f0125cfaac782c35acf77314f18908d/pkg/cmd/codespace/ssh.go#L263 ) for `gh codespace ssh` or `gh codespace logs` commands.\n\nThis exploit occurs when a malicious third-party devcontainer contains a modified SSH server that injects `ssh` arguments within the SSH connection details. `gh codespace ssh` and `gh codespace logs` commands could execute arbitrary code on the user's workstation if the remote username contains something like `-oProxyCommand=\"echo hacked\" #`.  The `-oProxyCommand` flag causes `ssh` to execute the provided command while `#` shell comment causes any other `ssh` arguments to be ignored.\n\nIn `2.62.0`, the remote username information is being validated before being used.",
    "published": "2024-11-14T23:15:05.727",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-52613": {
    "url": "https://github.com/justdan96/tsmuxer/issues/881",
    "cvss": "-",
    "description": "A heap-based buffer under-read in tsMuxer version nightly-2024-05-12-02-01-18 allows attackers to cause Denial of Service (DoS) via a crafted MOV video file.",
    "published": "2024-11-14T23:15:05.967"
  },
  "CVE-2024-11120": {
    "cvss": 9.8,
    "description": "Certain EOL GeoVision devices have an OS Command Injection vulnerability. Unauthenticated remote attackers can exploit this vulnerability to inject and execute arbitrary system commands on the device. Moreover, this vulnerability has already been exploited by attackers, and we have received related reports.",
    "published": "2024-11-15T02:15:17.757",
    "keywords": "remote,unauthenticated,command"
  },
  "CVE-2024-10924": {
    "cvss": 9.8,
    "description": "The Really Simple Security (Free, Pro, and Pro Multisite) plugins for WordPress are vulnerable to authentication bypass in versions 9.0.0 to 9.1.1.1. This is due to improper user check error handling in the two-factor REST API actions with the 'check_login_and_get_user' function. This makes it possible for unauthenticated attackers to log in as any existing user on the site, such as an administrator, when the \"Two-Factor Authentication\" setting is enabled (disabled by default).",
    "published": "2024-11-15T04:15:03.613",
    "keywords": "unauthenticated,authentication,bypass"
  },
  "CVE-2024-10311": {
    "cvss": 7.5,
    "description": "The External Database Based Actions plugin for WordPress is vulnerable to authentication bypass in versions up to, and including, 0.1. This is due to a missing capability check in the 'edba_admin_handle' function. This makes it possible for authenticated attackers, with subscriber-level permissions and above, to update the plugin settings and log in as any existing user on the site, such as an administrator.",
    "published": "2024-11-15T10:15:03.980",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-0787": {
    "cvss": 5.3,
    "description": "phpIPAM version 1.5.1 contains a vulnerability where an attacker can bypass the IP block mechanism to brute force passwords for users by using the 'X-Forwarded-For' header. The issue lies in the 'get_user_ip()' function in 'class.Common.php' at lines 1044 and 1045, where the presence of the 'X-Forwarded-For' header is checked and used instead of 'REMOTE_ADDR'. This vulnerability allows attackers to perform brute force attacks on user accounts, including the admin account. The issue is fixed in version 1.7.0.",
    "published": "2024-11-15T11:15:09.213",
    "keywords": "remote,bypass"
  },
  "CVE-2024-10443": {
    "cvss": 9.8,
    "description": "Improper neutralization of special elements used in a command ('Command Injection') vulnerability in Task Manager component in Synology BeePhotos before 1.0.2-10026 and 1.1.0-10053 and Synology Photos before 1.6.2-0720 and 1.7.0-0795 allows remote attackers to execute arbitrary code via unspecified vectors.",
    "published": "2024-11-15T11:15:09.750",
    "keywords": "remote,command"
  },
  "CVE-2024-1240": {
    "url": "https://github.com/pyload/pyload/commit/fe94451dcc2be90b3889e2fd9d07b483c8a6dccd",
    "cvss": 4.6,
    "description": "An open redirection vulnerability exists in pyload/pyload version 0.5.0. The vulnerability is due to improper handling of the 'next' parameter in the login functionality. An attacker can exploit this vulnerability to redirect users to malicious sites, which can be used for phishing or other malicious activities. The issue is fixed in pyload-ng 0.5.0b3.dev79.",
    "published": "2024-11-15T11:15:10.773"
  },
  "CVE-2024-20373": {
    "cvss": 5.3,
    "description": "A vulnerability in the implementation of the Simple Network Management Protocol (SNMP) IPv4 access control list (ACL) feature of Cisco IOS Software and Cisco IOS XE Software could allow an unauthenticated, remote attacker to perform SNMP polling of an affected device, even if it is configured to deny SNMP traffic.&nbsp;\r\n\r\nThis vulnerability exists because Cisco IOS Software and Cisco IOS XE Software do not support extended IPv4 ACLs for SNMP, but they do allow administrators to configure extended named IPv4 ACLs that are attached to the SNMP server configuration without a warning message. This can result in no ACL being applied to the SNMP listening process. An attacker could exploit this vulnerability by performing SNMP polling of an affected device. A successful exploit could allow the attacker to perform SNMP operations that should be denied. The attacker has no control of the SNMP ACL configuration and would still need a valid SNMP version 2c (SNMPv2c) community string or SNMP version 3 (SNMPv3) user credentials.\r\nSNMP with IPv6 ACL configurations is not affected.\r\nFor more information, see the  section of this advisory.",
    "published": "2024-11-15T15:15:06.823",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-43189": {
    "cvss": 5.9,
    "description": "IBM Concert Software 1.0.0 through 1.0.1 could allow a remote attacker to obtain sensitive information, caused by the failure to properly enable HTTP Strict Transport Security. An attacker could exploit this vulnerability to obtain sensitive information using man in the middle techniques.",
    "published": "2024-11-15T15:15:07.307",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-50647": {
    "cvss": "-",
    "description": "The python_food ordering system V1.0 has an unauthorized vulnerability that leads to the leakage of sensitive user information. Attackers can access it through https://ip:port/api/myapp/index/user/info?id=1 And modify the ID value to obtain sensitive user information beyond authorization.",
    "published": "2024-11-15T16:15:36.467",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-39726": {
    "cvss": 8.2,
    "description": "IBM Engineering Lifecycle Optimization - Engineering Insights 7.0.2 and 7.0.3 is vulnerable to an XML External Entity Injection (XXE) attack when processing XML data. A remote attacker could exploit this vulnerability to expose sensitive information or consume memory resources.",
    "published": "2024-11-15T17:15:19.983",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-51037": {
    "cvss": "-",
    "description": "An issue in kodbox v.1.52.04 and before allows a remote attacker to obtain sensitive information via the captcha feature in the password reset function.",
    "published": "2024-11-15T19:15:07.803",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-49536": {
    "cvss": 5.5,
    "description": "Audition versions 23.6.9, 24.4.6 and earlier are affected by an out-of-bounds read vulnerability that could lead to disclosure of sensitive memory. An attacker could leverage this vulnerability to bypass mitigations such as ASLR. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
    "published": "2024-11-15T20:15:20.683",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-9839": {
    "cvss": 7.3,
    "description": "The The Uix Slideshow plugin for WordPress is vulnerable to arbitrary shortcode execution in all versions up to, and including, 1.6.5. This is due to the software allowing users to execute an action that does not properly validate a value before running do_shortcode. This makes it possible for unauthenticated attackers to execute arbitrary shortcodes.",
    "published": "2024-11-16T04:15:07.467",
    "keywords": "execution,unauthenticated"
  },
  "CVE-2024-9849": {
    "cvss": 8.8,
    "description": "The 3D FlipBook, PDF Viewer, PDF Embedder – Real 3D FlipBook WordPress Plugin plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the 'r3dfb_save_thumbnail_callback' function in all versions up to, and including, 4.6. This makes it possible for authenticated attackers, with Author-level access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-11-16T04:15:07.673",
    "keywords": "remote,execution"
  },
  "CVE-2024-9935": {
    "cvss": 7.5,
    "description": "The PDF Generator Addon for Elementor Page Builder plugin for WordPress is vulnerable to Path Traversal in all versions up to, and including, 1.7.5 via the rtw_pgaepb_dwnld_pdf() function. This makes it possible for unauthenticated attackers to read the contents of arbitrary files on the server, which can contain sensitive information.",
    "published": "2024-11-16T04:15:08.103",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-10728": {
    "cvss": 8.8,
    "description": "The Post Grid Gutenberg Blocks and WordPress Blog Plugin – PostX plugin for WordPress is vulnerable to unauthorized plugin installation/activation due to a missing capability check on the 'install_required_plugin_callback' function in all versions up to, and including, 4.1.16. This makes it possible for authenticated attackers, with Subscriber-level access and above, to install and activate arbitrary plugins which can be leveraged to achieve remote code execution if another vulnerable plugin is installed and activated.",
    "published": "2024-11-16T05:15:12.510",
    "keywords": "remote,execution"
  },
  "CVE-2024-8856": {
    "cvss": 9.8,
    "description": "The Backup and Staging by WP Time Capsule plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the the UploadHandler.php file and no direct file access prevention in all versions up to, and including, 1.22.21. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected site's server which may make remote code execution possible.",
    "published": "2024-11-16T05:15:13.920",
    "keywords": "remote,execution,unauthenticated"
  },
  "CVE-2024-10645": {
    "cvss": 7.5,
    "description": "The Blogger 301 Redirect plugin for WordPress is vulnerable to blind time-based SQL Injection via the ‘br’ parameter in all versions up to, and including, 2.5.3 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "published": "2024-11-16T09:15:04.037",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-11094": {
    "cvss": 5.3,
    "description": "The 404 Solution plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 2.35.17 via the export feature. This makes it possible for unauthenticated attackers to extract sensitive data such as redirects including GET parameters which may reveal sensitive information.",
    "published": "2024-11-16T10:15:04.737",
    "keywords": "unauthenticated,sensitive"
  }
}