{
  "CVE-2024-21654": {
    "url": "https://github.com/rubygems/rubygems.org/commit/0b3272ac17b45748ee0d1867c49867c7deb26565",
    "cvss": 4.8,
    "description": "Rubygems.org is the Ruby community's gem hosting service. Rubygems.org users with MFA enabled would normally be protected from account takeover in the case of email account takeover. However, a workaround on the forgotten password form allows an attacker to bypass the MFA requirement and takeover the account. This vulnerability has been patched in commit 0b3272a.",
    "published": "2024-01-12T21:15:11.287"
  },
  "CVE-2024-21639": {
    "url": "https://github.com/chromiumembedded/cef/commit/1f55d2e12f62cfdfbf9da6968fde2f928982670b",
    "cvss": 5.3,
    "description": "CEF (Chromium Embedded Framework ) is a simple framework for embedding Chromium-based browsers in other applications. `CefLayeredWindowUpdaterOSR::OnAllocatedSharedMemory` does not check the size of the shared memory, which leads to out-of-bounds read outside the sandbox. This vulnerability was patched in commit 1f55d2e.",
    "published": "2024-01-12T22:15:45.750"
  },
  "CVE-2024-21640": {
    "url": "https://github.com/chromiumembedded/cef/commit/1f55d2e12f62cfdfbf9da6968fde2f928982670b",
    "cvss": 5.4,
    "description": "Chromium Embedded Framework (CEF) is a simple framework for embedding Chromium-based browsers in other applications.`CefVideoConsumerOSR::OnFrameCaptured` does not check `pixel_format` properly, which leads to out-of-bounds read out of the sandbox. This vulnerability was patched in commit 1f55d2e.\n\n",
    "published": "2024-01-13T08:15:07.340"
  },
  "CVE-2024-22209": {
    "url": "https://github.com/openedx/edx-platform/commit/019888f3d15beaebcb7782934f6c43b0c2b3735e",
    "cvss": 6.4,
    "description": "Open edX Platform is a service-oriented platform for authoring and delivering online learning. A user with a JWT and more limited scopes could call endpoints exceeding their access. This vulnerability has been patched in commit 019888f.",
    "published": "2024-01-13T08:15:07.557"
  },
  "CVE-2024-0552": {
    "cvss": 9.8,
    "description": "Intumit inc. SmartRobot's web framwork has a remote code execution vulnerability. An unauthorized remote attacker can exploit this vulnerability to execute arbitrary commands on the remote server.",
    "published": "2024-01-15T04:15:08.260",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-0546": {
    "cvss": 5.3,
    "description": "A vulnerability, which was classified as problematic, has been found in EasyFTP 1.7.0. This issue affects some unknown processing of the component LIST Command Handler. The manipulation leads to denial of service. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-250715.",
    "published": "2024-01-15T06:15:08.623",
    "keywords": "remote,command"
  },
  "CVE-2024-0547": {
    "cvss": 5.3,
    "description": "A vulnerability has been found in Ability FTP Server 2.34 and classified as problematic. Affected by this vulnerability is an unknown functionality of the component APPE Command Handler. The manipulation leads to denial of service. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-250717 was assigned to this vulnerability.",
    "published": "2024-01-15T07:15:08.390",
    "keywords": "remote,command"
  },
  "CVE-2024-0548": {
    "cvss": 5.3,
    "description": "A vulnerability was found in FreeFloat FTP Server 1.0 and classified as problematic. Affected by this issue is some unknown functionality of the component SIZE Command Handler. The manipulation leads to denial of service. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. VDB-250718 is the identifier assigned to this vulnerability.",
    "published": "2024-01-15T07:15:09.020",
    "keywords": "remote,command"
  }
}