{
  "CVE-2024-3740": {
    "url": "https://github.com/cym1102/nginxwebui/issues/138",
    "cvss": 6.3,
    "description": "A vulnerability, which was classified as critical, has been found in cym1102 nginxWebUI up to 3.9.9. This issue affects the function exec of the file /adminPage/conf/reload. The manipulation of the argument nginxExe leads to deserialization. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-260579.",
    "published": "2024-04-13T21:15:48.353"
  },
  "CVE-2024-1655": {
    "cvss": 8.8,
    "description": "Certain ASUS WiFi routers models has an OS Command Injection vulnerability, allowing an authenticated remote attacker to execute arbitrary system commands by sending a specially crafted request.",
    "published": "2024-04-15T04:15:14.723",
    "keywords": "remote,command"
  },
  "CVE-2024-3776": {
    "cvss": 6.1,
    "description": "The parameter used in the login page of Netvision airPASS is not properly filtered for user input. An unauthenticated remote attacker can insert JavaScript code to the parameter for Reflected Cross-site scripting attacks.",
    "published": "2024-04-15T04:15:16.340",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-3777": {
    "cvss": 9.8,
    "description": "\nThe password reset feature of Ai3 QbiBot lacks proper access control, allowing unauthenticated remote attackers to reset any user's password.\n\n",
    "published": "2024-04-15T04:15:16.553",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-22438": {
    "cvss": 3.5,
    "description": "\nA potential security vulnerability has been identified in Hewlett Packard Enterprise OfficeConnect 1820 Network switches. The vulnerability could be remotely exploited to allow execution of malicious code.\n\n",
    "published": "2024-04-15T10:15:08.567",
    "keywords": "remote,execution"
  },
  "CVE-2024-28957": {
    "cvss": "-",
    "description": "Generation of predictable identifiers issue exists in Cente middleware TCP/IP Network Series. If this vulnerability is exploited, a remote unauthenticated attacker may interfere communications by predicting some packet header IDs of the device.",
    "published": "2024-04-15T11:15:08.490",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-30220": {
    "cvss": "-",
    "description": "Command injection vulnerability in MZK-MF300N all firmware versions allows a network-adjacent unauthenticated attacker to execute an arbitrary command by sending a specially crafted request to a certain port.",
    "published": "2024-04-15T11:15:08.697",
    "keywords": "unauthenticated,command"
  },
  "CVE-2024-24891": {
    "cvss": 6.0,
    "description": "Exposure of Sensitive Information to an Unauthorized Actor vulnerability in openEuler kernel on Linux allows Resource Leak Exposure. This vulnerability is associated with program files https://gitee.Com/openeuler/kernel/blob/openEuler-1.0-LTS/drivers/staging/gmjstcm/tcm.C.\n\nThis issue affects kernel: from 4.19.90-2109.1.0.0108 before 4.19.90-2403.4.0.0244.\n\n",
    "published": "2024-04-15T12:15:13.233",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-24898": {
    "cvss": 6.0,
    "description": "Exposure of Sensitive Information to an Unauthorized Actor vulnerability in openEuler kernel on Linux allows Resource Leak Exposure. This vulnerability is associated with program files https://gitee.Com/openeuler/kernel/blob/openEuler-1.0-LTS/drivers/staging/gmjstcm/tcm.C.\n\nThis issue affects kernel: from 4.19.90-2109.1.0.0108 before 4.19.90-2403.4.0.0244.\n\n",
    "published": "2024-04-15T12:15:13.440",
    "keywords": "sensitive,leak"
  },
  "CVE-2024-24485": {
    "cvss": "-",
    "description": "An issue discovered in silex technology DS-600 Firmware v.1.4.1 allows a remote attacker to obtain sensitive information via the GET EEP_DATA command.",
    "published": "2024-04-15T19:15:09.740",
    "keywords": "remote,command,sensitive"
  },
  "CVE-2024-24486": {
    "cvss": "-",
    "description": "An issue discovered in silex technology DS-600 Firmware v.1.4.1 allows a remote attacker to edit device settings via the SAVE EEP_DATA command.",
    "published": "2024-04-15T19:15:09.787",
    "keywords": "remote,command"
  },
  "CVE-2024-24487": {
    "cvss": "-",
    "description": "An issue discovered in silex technology DS-600 Firmware v.1.4.1 allows a remote attacker to cause a denial of service via crafted UDP packets using the EXEC REBOOT SYSTEM command.",
    "published": "2024-04-15T19:15:09.830",
    "keywords": "remote,command"
  },
  "CVE-2024-32035": {
    "url": "https://github.com/sixlabors/imagesharp/commit/f21d64188e59ae9464ff462056a5e29d8e618b27",
    "cvss": 5.3,
    "description": "ImageSharp is a 2D graphics API. A vulnerability discovered in the ImageSharp library, where the processing of specially crafted files can lead to excessive memory usage in image decoders. The vulnerability is triggered when ImageSharp attempts to process image files that are designed to exploit this flaw.  This flaw can be exploited to cause a denial of service (DoS) by depleting process memory, thereby affecting applications and services that rely on ImageSharp for image processing tasks. Users and administrators are advised to update to the latest version of ImageSharp that addresses this vulnerability to mitigate the risk of exploitation. The problem has been patched in v3.1.4 and v2.1.8.",
    "published": "2024-04-15T20:15:11.323"
  },
  "CVE-2024-32036": {
    "url": "https://github.com/sixlabors/imagesharp/commit/da5f09a42513489fe359578d81cec2f15ba588ba",
    "cvss": 7.1,
    "description": "ImageSharp is a 2D graphics API. A heap-use-after-free flaw was found in ImageSharp's JPEG and TGA decoders. This vulnerability is triggered when an attacker passes a specially crafted JPEG or TGA image file to ImageSharp for conversion, potentially leading to information disclosure. The problem has been patched in v3.1.4 and v2.1.8.",
    "published": "2024-04-15T20:15:11.543"
  },
  "CVE-2024-0404": {
    "url": "https://github.com/mintplex-labs/anything-llm/commit/8cd3a92c660b202655d99bee90b2864694c99946",
    "cvss": 9.1,
    "description": "A mass assignment vulnerability exists in the `/api/invite/:code` endpoint of the mintplex-labs/anything-llm repository, allowing unauthorized creation of high-privileged accounts. By intercepting and modifying the HTTP request during the account creation process via an invitation link, an attacker can add a `role` property with `admin` value, thereby gaining administrative access. This issue arises due to the lack of property allowlisting and blocklisting, enabling the attacker to exploit the system and perform actions as an administrator.",
    "published": "2024-04-16T00:15:07.387"
  },
  "CVE-2024-0549": {
    "url": "https://github.com/mintplex-labs/anything-llm/commit/026849df0224b6a8754f4103530bc015874def62",
    "cvss": 8.1,
    "description": "mintplex-labs/anything-llm is vulnerable to a relative path traversal attack, allowing unauthorized attackers with a default role account to delete files and folders within the filesystem, including critical database files such as 'anythingllm.db'. The vulnerability stems from insufficient input validation and normalization in the handling of file and folder deletion requests. Successful exploitation results in the compromise of data integrity and availability.",
    "published": "2024-04-16T00:15:07.603"
  },
  "CVE-2024-1558": {
    "cvss": 7.5,
    "description": "A path traversal vulnerability exists in the `_create_model_version()` function within `server/handlers.py` of the mlflow/mlflow repository, due to improper validation of the `source` parameter. Attackers can exploit this vulnerability by crafting a `source` parameter that bypasses the `_validate_non_local_source_contains_relative_paths(source)` function's checks, allowing for arbitrary file read access on the server. The issue arises from the handling of unquoted URL characters and the subsequent misuse of the original `source` value for model version creation, leading to the exposure of sensitive files when interacting with the `/model-versions/get-artifact` handler.",
    "published": "2024-04-16T00:15:08.533",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-1561": {
    "cvss": 7.5,
    "description": "An issue was discovered in gradio-app/gradio, where the `/component_server` endpoint improperly allows the invocation of any method on a `Component` class with attacker-controlled arguments. Specifically, by exploiting the `move_resource_to_block_cache()` method of the `Block` class, an attacker can copy any file on the filesystem to a temporary directory and subsequently retrieve it. This vulnerability enables unauthorized local file read access, posing a significant risk especially when the application is exposed to the internet via `launch(share=True)`, thereby allowing remote attackers to read files on the host machine. Furthermore, gradio apps hosted on `huggingface.co` are also affected, potentially leading to the exposure of sensitive information such as API keys and credentials stored in environment variables.",
    "published": "2024-04-16T00:15:08.887",
    "keywords": "remote,sensitive"
  },
  "CVE-2024-1646": {
    "cvss": 8.2,
    "description": "parisneo/lollms-webui is vulnerable to authentication bypass due to insufficient protection over sensitive endpoints. The application checks if the host parameter is not '0.0.0.0' to restrict access, which is inadequate when the application is bound to a specific interface, allowing unauthorized access to endpoints such as '/restart_program', '/update_software', '/check_update', '/start_recording', and '/stop_recording'. This vulnerability can lead to denial of service, unauthorized disabling or overriding of recordings, and potentially other impacts if certain features are enabled in the configuration.",
    "published": "2024-04-16T00:15:09.967",
    "keywords": "authentication,sensitive,bypass"
  },
  "CVE-2024-1739": {
    "cvss": 7.5,
    "description": "lunary-ai/lunary is vulnerable to an authentication issue due to improper validation of email addresses during the signup process. Specifically, the server fails to treat email addresses as case insensitive, allowing the creation of multiple accounts with the same email address by varying the case of the email characters. For example, accounts for 'abc@gmail.com' and 'Abc@gmail.com' can both be created, leading to potential impersonation and confusion among users.",
    "published": "2024-04-16T00:15:10.697",
    "keywords": "authentication,sensitive"
  },
  "CVE-2024-1961": {
    "cvss": 8.8,
    "description": "vertaai/modeldb is vulnerable to a path traversal attack due to improper sanitization of user-supplied file paths in its file upload functionality. Attackers can exploit this vulnerability to write arbitrary files anywhere in the file system by manipulating the 'artifact_path' parameter. This flaw can lead to Remote Code Execution (RCE) by overwriting critical files, such as the application's configuration file, especially when the application is run outside of Docker. The vulnerability is present in the NFSController.java and NFSService.java components of the application.",
    "published": "2024-04-16T00:15:10.867",
    "keywords": "remote,execution"
  },
  "CVE-2024-2260": {
    "cvss": 4.2,
    "description": "A session fixation vulnerability exists in the zenml-io/zenml application, where JWT tokens used for user authentication are not invalidated upon logout. This flaw allows an attacker to bypass authentication mechanisms by reusing a victim's JWT token.",
    "published": "2024-04-16T00:15:11.237",
    "keywords": "authentication,bypass"
  },
  "CVE-2024-2912": {
    "cvss": 9.8,
    "description": "An insecure deserialization vulnerability exists in the BentoML framework, allowing remote code execution (RCE) by sending a specially crafted POST request. By exploiting this vulnerability, attackers can execute arbitrary commands on the server hosting the BentoML application. The vulnerability is triggered when a serialized object, crafted to execute OS commands upon deserialization, is sent to any valid BentoML endpoint. This issue poses a significant security risk, enabling attackers to compromise the server and potentially gain unauthorized access or control.",
    "published": "2024-04-16T00:15:11.427",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-3028": {
    "url": "https://github.com/mintplex-labs/anything-llm/commit/7de23dbb2da932fbfb39f56d981784d3702cf5ce",
    "cvss": 7.2,
    "description": "mintplex-labs/anything-llm is vulnerable to improper input validation, allowing attackers to read and delete arbitrary files on the server. By manipulating the 'logo_filename' parameter in the 'system-preferences' API endpoint, an attacker can construct requests to read sensitive files or the application's '.env' file, and even delete files by setting the 'logo_filename' to the path of the target file and invoking the 'remove-logo' API endpoint. This vulnerability is due to the lack of proper sanitization of user-supplied input.",
    "published": "2024-04-16T00:15:11.667"
  },
  "CVE-2024-3029": {
    "url": "https://github.com/mintplex-labs/anything-llm/commit/99cfee1e7025fe9a0919a4d506ba1e1b819f6073",
    "cvss": 9.0,
    "description": "In mintplex-labs/anything-llm, an attacker can exploit improper input validation by sending a malformed JSON payload to the '/system/enable-multi-user' endpoint. This triggers an error that is caught by a catch block, which in turn deletes all users and disables the 'multi_user_mode'. The vulnerability allows an attacker to remove all existing users and potentially create a new admin user without requiring a password, leading to unauthorized access and control over the application.",
    "published": "2024-04-16T00:15:11.850"
  },
  "CVE-2024-3271": {
    "cvss": 9.8,
    "description": "A command injection vulnerability exists in the run-llama/llama_index repository, specifically within the safe_eval function. Attackers can bypass the intended security mechanism, which checks for the presence of underscores in code generated by LLM, to execute arbitrary code. This is achieved by crafting input that does not contain an underscore but still results in the execution of OS commands. The vulnerability allows for remote code execution (RCE) on the server hosting the application.",
    "published": "2024-04-16T00:15:12.017",
    "keywords": "remote,execution,command,bypass"
  },
  "CVE-2024-3571": {
    "cvss": 6.5,
    "description": "langchain-ai/langchain is vulnerable to path traversal due to improper limitation of a pathname to a restricted directory ('Path Traversal') in its LocalFileStore functionality. An attacker can leverage this vulnerability to read or write files anywhere on the filesystem, potentially leading to information disclosure or remote code execution. The issue lies in the handling of file paths in the mset and mget methods, where user-supplied input is not adequately sanitized, allowing directory traversal sequences to reach unintended directories.",
    "published": "2024-04-16T00:15:12.203",
    "keywords": "remote,execution"
  },
  "CVE-2024-3573": {
    "cvss": 9.3,
    "description": "mlflow/mlflow is vulnerable to Local File Inclusion (LFI) due to improper parsing of URIs, allowing attackers to bypass checks and read arbitrary files on the system. The issue arises from the 'is_local_uri' function's failure to properly handle URIs with empty or 'file' schemes, leading to the misclassification of URIs as non-local. Attackers can exploit this by crafting malicious model versions with specially crafted 'source' parameters, enabling the reading of sensitive files within at least two directory levels from the server's root.",
    "published": "2024-04-16T00:15:12.570",
    "keywords": "sensitive,bypass"
  },
  "CVE-2024-3574": {
    "cvss": 7.5,
    "description": "In scrapy version 2.10.1, an issue was identified where the Authorization header, containing credentials for server authentication, is leaked to a third-party site during a cross-domain redirect. This vulnerability arises from the failure to remove the Authorization header when redirecting across domains. The exposure of the Authorization header to unauthorized actors could potentially allow for account hijacking.",
    "published": "2024-04-16T00:15:12.750",
    "keywords": "authentication,leak"
  },
  "CVE-2024-3871": {
    "cvss": 7.2,
    "description": "The Delta Electronics DVW-W02W2-E2 devices expose a web administration interface to users. This interface implements two features (access control lists management, WPS pin setup) that are affected by command injections and stack overflows vulnerabilities.\nSuccessful exploitation of these flaws would allow remote authenticated attackers to gain remote command execution with elevated privileges on the affected devices.\n\nThis issue affects DVW-W02W2-E2 through version 2.5.2.\n\n",
    "published": "2024-04-16T09:15:08.630",
    "keywords": "remote,execution,command"
  },
  "CVE-2024-3872": {
    "cvss": 3.1,
    "description": "Mattermost Mobile app versions 2.13.0 and earlier use a regular expression with polynomial complexity to parse certain deeplinks, which allows an unauthenticated remote attacker to freeze or crash the app via a long maliciously crafted link.\n\n",
    "published": "2024-04-16T09:15:08.817",
    "keywords": "remote,unauthenticated"
  },
  "CVE-2024-3067": {
    "cvss": 7.2,
    "description": "The WooCommerce Google Feed Manager plugin for WordPress is vulnerable to SQL Injection via the 'id' parameter in all versions up to, and including, 2.4.2 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for authenticated attackers, with administrator-level access and above, to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database. This can also be used by unauthenticated attackers to inject malicious web scripts.",
    "published": "2024-04-16T13:15:11.230",
    "keywords": "unauthenticated,sensitive"
  },
  "CVE-2024-3880": {
    "cvss": 6.3,
    "description": "A vulnerability has been found in Tenda W30E 1.0.1.25(633) and classified as critical. This vulnerability affects the function formWriteFacMac of the file /goform/WriteFacMac. The manipulation of the argument mac leads to os command injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. VDB-260914 is the identifier assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "published": "2024-04-16T19:15:08.357",
    "keywords": "remote,command"
  },
  "CVE-2024-30378": {
    "cvss": 5.5,
    "description": "A Use After Free vulnerability in command processing of Juniper Networks Junos OS on MX Series allows a local, authenticated attacker to cause the broadband edge service manager daemon (bbe-smgd) to crash upon execution of specific CLI commands, creating a Denial of Service (DoS) condition.  The process crashes and restarts automatically.\n\nWhen specific CLI commands are executed, the bbe-smgd daemon attempts to write into an area of memory (mgd socket) that was already closed, causing the process to crash.  This process manages and controls the configuration of broadband subscriber sessions and services.  While the process is unavailable, additional subscribers will not be able to connect to the device, causing a temporary Denial of Service condition.\n\nThis issue only occurs if Graceful Routing Engine Switchover (GRES) and Subscriber Management are enabled.\nThis issue affects Junos OS:\n\n\n  *  All versions before 20.4R3-S5, \n  *  from 21.1 before 21.1R3-S4, \n  *  from 21.2 before 21.2R3-S3, \n  *  from 21.3 before 21.3R3-S5, \n  *  from 21.4 before 21.4R3-S5, \n  *  from 22.1 before 22.1R3, \n  *  from 22.2 before 22.2R3, \n  *  from 22.3 before 22.3R2;\n\n\n\n\n\n\n\n\n\n",
    "published": "2024-04-16T20:15:09.680",
    "keywords": "execution,command"
  }
}